Repository: debian-calibre/calibre
Catalog: translations-git/changelog/*.po
Languages: cs, es, ru, uk

source: Windows: Fix calibre portable launcher not working correctly from root folder in calibre 5.5
es: Windows: Se corrige el fallo por el que el lanzador de calibre portátil no funcionaba correctamente desde la carpeta raíz en calibre 5.5
ru: Windows: исправлена ​​ошибка, из-за которой портативный лаунчер calibre не работал правильно из корневой папки в calibre 5.5.
uk: Windows: виправлено належну роботу портативного засобу запуску calibre для кореневого каталогу у calibre 5.5

source: macOS: Fix rendering of space after punctuation incorrect in Big Sur
es: macOS: Se corrige la presentación incorrecta de espacio tras puntuación en Big Sur
ru: macOS: исправлена отрисовка пробела после пунктуации в Big Sur.
uk: macOS: виправлено обробку пробілів після пунктуації у Big Sur

source: DOCX Input: When converting images placed using the obsolete VML markup default them to being inline rather than block images
es: Entrada DOCX: Al convertir imágenes que usan el marcado obsoleto VML, se colocan de manera predeterminada en línea en lugar de como bloque
ru: Ввод DOCX: при преобразовании изображений, размещённых с использованием устаревшей разметки VML, они по умолчанию становятся встроенными, а не блочными изображениями.
uk: Вхідні дані у DOCX: реалізовано типове перетворення зображень, які розташовано за допомогою застарілої розмітки VML, на вбудовані зображення, а не на блокові зображення

source: Metadata edit dialog: Fix keyboard shortcuts for bold/italic/underline not working when more than one comments editor widget is present on a single tab
es: Diálogo de modificación de metadatos: Se corrige el fallo por el que los atajos para negrita, cursiva y subrayado no funcionaban cuando hay más de un elemento de modificación de comentarios en una pestaña
ru: Диалог редактирования метаданных: исправление сочетаний клавиш для выделения жирным шрифтом/курсивом/подчеркиванием, не работавшие, когда на одной вкладке присутствовало более одного виджета редактора комментариев.
uk: Вікно редагування метаданих: відновлено працездатність клавіатурних скорочень для перетворення шрифту фрагментів тексту на напівжирний, курсив та підкреслений, якщо віджет редактора коментарів працює на декількох вкладках одночасно

source: When using calibre://show-book URLs and the book is not found, clear any Virtual library or search restriction and then show the book
es: Al usar URL calibre://show-book, si el libro no se encuentra, se desactiva la biblioteca virtual y restricción de búsqueda y después se muestra el libro
ru: Если вы используете calibre://show-book URL и книга не найдена, снимаются все ограничения виртуальной библиотеки или поиска, а затем показывается книга
uk: Реалізовано очищення усіх віртуальних бібліотек або обмежень пошуку з наступним показом книги, якщо використано адресу calibre://show-book і книгу не знайдено

source: macOS: Fix calibre:// URLs not working from other documents
es: macOS: Se corrige el fallo por el que los URL calibre:// no funcionaban desde otros documentos
ru: macOS: исправлена неработоспособность URL-адресов calibre:// из других документов.
uk: macOS: виправлено працездатність адрес calibre:// з інших документів

source: Fix calibre:// URL search action not changing library if needed
es: Se corrige el fallo por el que la acción de búsqueda de URL calibre:// no cambiaba de biblioteca si es necesario
ru: Исправление calibre://URL поиск не менял библиотеку при необходимости
uk: Відновлено можливість зміни бібліотеки, якщо це потрібно, при використанні дії з пошуку з адресою calibre://

source: annotation_count() template function displaying value for deleted annotations
es: Se corrige el fallo por el que la función de plantilla annotation_count() devolvía valores para anotaciones eliminadas
ru: Шаблонная функция annotation_count() показывает значения для удалённых заметок.
uk: Реалізовано шаблонну функцію annotation_count(), яка показує значення для вилучених анотацій

source: Edit book: Fix syntax highlighting not recognizing ends-with selector
es: Modificar libro: Se corrige el fallo por el que el resaltado de sintaxis no reconocía el selector «termina en»
ru: Редактор книг: исправлена подсветка синтаксиса, не распознававшая селекторы ends-with.
uk: Редагування книг: відновлено розпізнавання засобу вибору «завершується на» у підсвічуванні синтаксису

source: 13 Nov, 2020
cs: 13. listopadu 2020
ru: 13 ноября 2020
uk: 13 листопада 2020 року

source: Support the calibre:// URL scheme
cs: Podpora schéma URL calibre://
es: Compatibilidad con el esquema de URL calibre://
ru: Поддержка схемы URL-адресов calibre://.
uk: Реалізовано підтримку схеми адрес calibre://

source: Clicking on calibre:// URLs can be used to have calibre perform various actions. For details, see: <a href="%(h0)s">%(h0)s</a>
cs: Kliknutí na URL calibre:// lze použít k tomu, aby Calibre provedlo různé akce. Podrobnosti viz: <a href="%(h0)s">%(h0)s</a>
es: Al pulsar en un URL calibre:// puede hacerse que calibre realice distintas acciones. Para más detalles ver: <a href="%(h0)s">%(h0)s</a>
ru: Нажатие на URL-адреса calibre:// можно использовать для выполнения различных действий в calibre. Подробнее см.: <a href="%(h0)s">%(h0)s</a>
uk: Для виконання різноманітних дій у calibre можна скористатися клацанням на адресах calibre://. Докладніше про це тут: <a href="%(h0)s">%(h0)s</a>

source: Viewer: Show calibre:// URL for current book in the Goto-&gt;Location panel
cs: Prohlížeč: Zobrazení URL calibre:// pro aktuální knihu v panelu Přejít na->,Umístění
es: Visor: Se muestra el URL calibre:// para el libro actual en el panel Ir a &gt; Ubicación
ru: Просмотрщик: показывать calibre://URL-адрес текущей книги в панели «Перейти-> Местоположение».
uk: Засіб перегляду: реалізовано показ адрес calibre:// для поточної книги на панелі «Перейти-&gt;Місце»

source: Edit book: Add an action to the right click menu for tabs to close tabs to the right of the current tab.
cs: Upravit knihu: Přidání akce do nabídky zobrazené po kliknutí pravým tlačítkem myši pro karty k zavření karty vpravo od aktuální karty.
es: Modificar libro: Se añade una acción al menú contextual de las pestañas para cerrar pestañas a la derecha de la actual.
ru: Редактор книг: добавлено действие в контекстное меню вкладок, чтобы закрыть вкладки справа от текущей вкладки.
uk: Редагування книг: у контекстне меню, яке викликається клацанням правою кнопкою миші, додано пункт для закриття вкладок праворуч від поточної вкладки.

source: Add ability to copy tag, publisher and author in Book details panel by right-clicking
es: Se añade la posibilidad de copiar etiquetas, editorial y autor en el panel de detalles del libro mediante pulsación del botón decho
ru: Добавлена возможность копирования тега, издательства и автора по щелчку правой кнопкой в панели описания книги.
uk: Додано можливість копіювання мітки, запису видавця та автора на панелі подробиць щодо книги за допомогою контекстного меню

source: Annotations browser: Add a context menu for common actions.
es: Explorador de anotaciones: Se añade un menú contextual para acciones comunes.
ru: Браузер аннотаций: добавлено контекстное меню для основных действий.
uk: Навігація анотаціями: додано контекстне меню для типових дій.

source: Annotations browser: Show a dot for highlights with notes.
es: Explorador de anotaciones: Se muestra un punto para resaltados con notas.
ru: Браузер аннотаций: выделения с заметками отмечаются точкой.
uk: Навігатор анотаціями: реалізовано показ крапки для підсвічувань із нотатками.

source: Edit book: Saved searches panel: Allow copying the current saved search to the regular search panel by clicking the Export button.
es: Modificar libro: Panel de búsquedas guardadas: Se permite copiar la búsqueda guardada actual al panel de búsqueda normal pulsando en el botón Exportar.
ru: Редактор книг: Панель сохраненных поисков: разрешено копирование текущего сохранённого поиска в обычную панель поиска, щелчком по кнопке «Экспорт».
uk: Редагування книги: панель збережених пошуків: уможливлено копіювання поточного збереженого пошуку на панель звичайного пошуку натисканням кнопки «Експортувати».

source: Windows: Fix command line arguments not working for the portable.exe launchers
es: Windows: Se corrige el fallo por el que los argumentos de línea de órdenes no funcionaban con los lanzadores portable.exe
ru: Windows: исправлены неработающие аргументы командной строки для программ запуска portable.exe.
uk: Windows: усунено непрацездатність аргументів командного рядка для засобів запуску portable.exe

source: Viewer: back and forward buttons on the mouse now trigger the back and forward actions
es: Visor: Los botones atrás y adelante del ratón ahora activan las funciones atrás y adelante
ru: Просмотрщик: кнопки «назад» и «вперёд» на мыши теперь запускают действия «назад» и «вперёд».
uk: Засіб перегляду: реалізовано переходи назад і вперед у відповідь на клацання кнопками «Назад» і «Вперед» на миші

source: Option to mark all books with annotations/bookmarks
es: Opción para marcar todos los libros con anotaciones o marcadores
ru: Возможность отметить все книги с заметками/закладками.
uk: Додано можливість позначення усіх книг із анотаціями та закладками

source: Various minor improvements to how keyboard focus is handled in the Tag browser
es: Varias mejoras menores en el manejo del foco de teclado en el explorador de etiquetas
ru: Различные незначительные улучшения обработки фокуса клавиатуры в Браузере тегов.
uk: Різноманітні незначні удосконалення обробки переходу фокуса клавіатури на панелі навігатора мітками

source: Edit book: Fix regression in calibre 5 that caused an error when managing user dictionaries.
es: Modificar libro: Se corrige una regresión en calibre 5 que causaba un error al gestionar diccionarios de usuario.
ru: Редактор книг: исправлена регрессия в calibre 5, вызывавшая ошибку при управлении пользовательскими словарями.
uk: Редагування книг: виправлено регресію у calibre 5, яка спричиняла помилку під час керування словниками користувача.

source: Viewer: Fix previous/next buttons iterating over removed bookmarks
es: Visor: Se corrige el fallo por el que los botones anterior y siguiente consideraban los marcadores eliminados
ru: Просмотрщик: исправлена ​​ошибка, из-за которой кнопки «Назад/Далее» итерировали по удалённым закладкам
uk: Засіб перегляду: усунено перехід між вилученими закладками при натисканні кнопок «Назад/Далі»

source: Welcome wizard: Fix changing the language causing a empty folder to be created.
es: Asistente de bienvenida: Se corrige el fallo por el que al cambiar de idioma se creaba una carpeta vacía.
ru: Мастер начальной настройки: смена языка приводила к созданию пустой папки.
uk: Майстер початкового запуску: виправлено помилку, яку було пов'язано із тим, що при зміні мови програма створювала порожню теку.

source: Viewer: Fix regression causing custom shortcuts with Shift key pressed not working
es: Visor: Se corrige una regresión que hacía que no funcionaran los atajos personalizados con la tecla mayúsculas
ru: Просмотрщик: исправлена регрессия, приводившая к неработоспособности пользовательских сочетаний клавиш с нажатой кнопкой Shift.
uk: Засіб перегляду: усунено непрацездатність нетипових скорочень із використанням клавіші Shift

source: Viewer: In dark mode when showing images with transparency in the popup use a light background color as most images are designed with a light background color in mind.
es: Visor: En el modo oscuro, al mostrar imágenes con transparencia en modo emergente, se usa un fondo claro, ya que la mayoría de las imágenes están pensadas para un fondo claro.
ru: Просмотрщик: в тёмном режиме при отображении во всплывающем окне изображений с прозрачностью использовался светлый цвет фона, так как большинство изображений созданы с учётом светлого цвета фона.
uk: Засіб перегляду: реалізовано використання світлого кольору тла у темному режимі при показі зображень із прозорістю, оскільки більшість зображень створюється із припущенням про світлий колір тла.

source: Fix a regression in the previous release that broke conversion of DJVU files
es: Se corrige una regresión en la versión anterior que estropeaba la conversión de archivos DJVU
ru: Исправлена регрессия в предыдущем выпуске, нарушавшая конвертацию файлов DJVU.
uk: Усунено регресію попереднього випуску, яка заважала перетворенню файлів DJVU

source: Metadata edit: "Set to Undefined" button missing on integer columns.
es: Modificar metadatos: El botón Establecer como indefinido faltaba en las columnas de enteros.
ru: Редактирование метаданных: в целочисленных столбцах отсутствовала кнопка «Сделать неопределённым».
uk: Редагування метаданих: додано кнопку «Встановити невизначене значення» для цілочисельних стовпчиків.

source: Entry remains underlined in Tag browser after clearing filter
es: La entrada permanece subrayada en el explorador de etiquetas después de limpiar el filtro
ru: Запись в Браузере тегов оставалась подчёркнутой после удаления фильтра.
uk: Усунено помилку, пов'язану із тим, що запис на панелі навігації мітками лишався підкресленим після усування фільтрів

source: XML Catalogs: Fix languages field missing
es: Catálogos XML: Se corrige el campo de idiomas ausente
ru: XML-каталоги: исправлено отсутствие поля «Языки».
uk: Каталоги XML: додано поле мов

source: Fix a regression that broke loading of third party plugins that are encoded in an encoding other than UTF-8
es: Se corrige una regresión que estropeó la carga de complementos de terceros que usan una codificación distinta a UTF-8
ru: Исправлена регрессия, нарушившая загрузку сторонних плагинов в кодировке., отличной от UTF-8
uk: Виправлено регресію, яка заважала завантаженню сторонніх додатків із кодуванням, відмінним від кодування UTF-8

source: macOS: Fix viewer not responding to cmd+c to copy text by default
es: macOS: Se corrige el fallo por el que el visor no respondía a Cmd+C para copiar texto de manera predeterminada
ru: macOS: исправлено неработающее по умолчанию копирование текста по cmd+c.
uk: macOS: виправлено помилку, яка призводила до того, що, типово, засіб перегляду не відповідав на натискання Cmd+C для копіювання тексту

source: Windows: Fix sending email on computers with non-ASCII computer names
es: Windows: Se corrige el envío de correos electrónicos en equipos con nombre que contiene caracteres no ASCII
ru: Windows: исправлена отправка электронной почты на компьютерах с не-ASCII именами.
uk: Windows: виправлено надсилання електронної пошти на комп'ютерах із назвами, які містять символи поза ASCII

source: 30 Oct, 2020
cs: 30. října 2020
ru: 30 октября 2020
uk: 30 жовтня 2020 року

source: Windows: Allow adding of books to calibre from folders whose path length is larger than 260 characters
cs: Windows: Umožnění přidání knih do Calibre ze složek, jejichž délka cesty je delší než 260 znaků
es: Windows: Se permite añadir libros a calibre de carpetas con longitud de ruta mayor de 260 caracteres
ru: Windows: разрешено добавление книг в calibre из папок, длина пути которых превышает 260 символов.
uk: Windows: уможливлено додавання до calibre з каталогів, довжина шляху у яких перевищує 260 символів

source: Tag browser: Add an option in Preferences-&gt;Look &amp; feel-&gt;Tag browser to allow the tag browser to get keyboard focus
cs: Prohlížeč štítků: Přidání volby do Předvolby->Vzhled a chování->Prohlížeč štítků pro umožnění získání zaměření klávesnice pro prohlížeč štítků
es: Explorador de etiquetas: Se añade una opción en Preferencias &gt; Apariencia &gt; Explorador de etiquetas para permitir que el explorador de etiquetas reciba el foco de teclado
ru: Браузер тегов: добавлен параметр в Настройки-> Внешний вид-> Браузер тегов, чтобы разрешить браузеру тегов получать фокус клавиатуры.
uk: Навігатор мітками: додано пункт у «Налаштування-&gt;Вигляд і поведінка-&gt;Навігатор мітками» для уможливлення передавання фокуса клавіатури до навігатора мітками

source: Tag browser: Allow editing the set of permissible values and colors for a custom column with fixed values, by right clicking on it.
cs: Prohlížeč štítků: Umožnění úpravy sady povolených hodnot a barev pro vlastní sloupce s pevnými hodnotami kliknutím pravým tlačítkem myši na něj
es: Explorador de etiquetas: Se permite modificar el conjunto de valores y colores permitidos para una columna con valores fijos, pulsando con el botón derecho sobre ella.
ru: Браузер тегов: разрешено редактировать набор допустимых значений и цветов для настраиваемого столбца с фиксированными значениями, щелчком правой кнопки мыши
uk: Навігатор мітками: уможливлено редагування набору допустимих значень і кольорів для нетипового стовпчика із фіксованими значеннями за допомогою клацання правою кнопкою миші на відповідному пункті.

source: Edit metadata dialog: Make most custom metadata controls use only a single line.
cs: Dialogové okno úpravy metadat: Úprava, aby většina vlastních ovládacích prvků metadat používala pouze jeden řádek.
es: Cuadro de modificación de metadatos: Se hace que la mayoría de los controles de metadatos personalizados usen una sola línea.
ru: Диалог редактирования метаданных: большинство настраиваемых элементов управления метаданными теперь используют только одну строку.
uk: Вікно редагування метаданих: реалізовано використання у більшості засобів керування нетиповими метаданими лише одного рядка.

source: Elide the names of custom columns that are longer than a fixed width, instead of using multiple lines. Configurable via Preferences-&gt;Tweaks-&gt;Edit metadata custom column label length
cs: Namísto použití více řádků vynechat názvy vlastních sloupců, které jsou delší než pevná šířka. Konfigurovatelné prostřednictvím Předvolby->Vylepšení->Upravit délku šířku a bod výpustky vlastního sloupce metadat
es: Se recortan los nombres de columnas personalizadas que tienen más de cierta anchura, en lugar de usar varias líneas. Se puede configurar en Preferencias &gt; Ajustes &gt; Longitud de etiqueta para columnas personalizadas en modificar metadatos
ru: Обрезка имён настраиваемых столбцов, длина которых превышает фиксированную ширину, вместо использования нескольких строк. Настраивается через «Настройки» -> «Твики» -> «Редактировать метаданные» - длина метки пользовательского столбца.
uk: Реалізовано обрізання назв нетипових стовпчиків, довжина яких перевищує фіксоване значення, замість використання декількох рядків. Налаштувати можна за допомогою пункту «Налаштування-&gt;Коригування-&gt;Редагувати довжину мітки стовпчика нетипових метаданих»

source: Edit book: Remove unused CSS: Add an option to merge CSS rules that have identical properties
cs: Upravit knihu: Odebrání nepoužívaných CSS: Přidání volby pro sloučení pravidel CSS, které mají totožné vlastnosti
es: Modificar libro: Eliminar CSS sin usar: Se añade una opción para combinar reglas CSS que tienen propiedades idénticas
ru: Редактор книг: удалить неиспользуемый CSS: добавлена возможность объединения правил CSS с идентичными свойствами
uk: Редагування книг: вилучення невикористаних CSS: додано пункт для об'єднання правил CSS, які мають однакові властивості

source: Book details window: Double clicking on the cover now shows it in the default system image viewer.
cs: Okno podrobností o knize: Poklepání na obálku ji nyní zobrazí ve výchozím prohlížeči obrázků systému.
es: Ventana de detalles del libro: Una doble pulsación sobre la portada ahora la muestra en el visor de imágenes predeterminado del sistema.
ru: Окно описания книги: двойной щелчок по обложке теперь открывает её в умолчальном просмотрщике изображений.
uk: Вікно параметрів книги: у новій версії подвійне клацання на обкладинці призводить до її показу у вікні типового засобу перегляду зображень у системі.

source: News download: Allow passing username/password in feed URLs.
cs: Stahování zpráv: Umožnění předání uživatelského jména a hesla v URL informačních kanálů.
es: Descarga de noticias: Se permite pasar nombre de usuario y contraseña en los URL de canal.
ru: Загрузка новостей: разрешена передача имени пользователя / пароля в URL лент.
uk: Отримання новин: уможливлено передавання у адресах подач імені користувача і пароля.

source: Open with: Allow renaming Open with applications.
cs: Otevřít v programu: Umožnění přejmenování aplikací Otevřít v programu.
es: Abrir con: Se permite cambiar el nombre de las aplicaciones con las que abrir.
ru: Открыть с помощью: разрешено переименование приложений в списке «Открыть с помощью».
uk: Відкриття за допомогою сторонніх програм: уможливлено перейменування програм для відкриття.

source: Viewer: Fix jumping to search result not always working in flow mode.
cs: Prohlížeč: Oprava, kdy přeskočení na výsledek hledání nefungovalo vždy v plovoucím režimu.
es: Visor: Se corrige el fallo por el que el salto a los resultados de búsqueda no siempre funcionaba en modo continuo.
ru: Просмотрщик: исправлена ошибка перехода к результату поиска в потоковом режиме.
uk: Засіб перегляду: виправлено помилку, яка призводила до того, що перехід до результатів пошуку не завжди працював у режимі неперервного перегляду.

source: Get Books: Update Google and Gutenberg plugins for website changes
cs: Získat knihy: Aktualizace modulů Google a Gutenberg pro změny stránek
es: Obtener libros: Actualizados los complementos de Google y Gutenberg por cambios en los sitios web
ru: Приобрести книги: обновлены плагины Google и Gutenberg из-за изменений на сайтах.
uk: Отримання книг: оновлено додатки Google і Gutenberg відповідно до змін на сайтах

source: Viewer: Fix keyboard shortcuts using Ctrl+Alt+letter key not working on Windows.
cs: Prohlížeč: Oprava nefunkčnosti klávesových zkratek na Windows používajících Ctrl+Alt+písmeno.
es: Visor: Se corrige el fallo por el que los atajos que usan Ctrl+Alt+letra no funcionaban en Windows.
ru: Просмотрщик: исправлены не работающие в Windows сочетания клавиш Ctrl+Alt+буква.
uk: Засіб перегляду: відновлено працездатність клавіатурних скорочень Ctrl+Alt+літера у Windows.

source: Viewer: Fix keyboard shortcuts to shrink/grow selection not working.
cs: Prohlížeč: Oprava nefunkčnosti klávesových zkratek pro zmenšení nebo zvětšení výběru.
es: Visor: Se corrige el fallo por el que los atajos de teclado para aumentar o reducir la selección no funcionaban.
ru: Просмотрщик: исправление неработавших сочетаний клавиш для уменьшения/увеличения выделения.
uk: Засіб перегляду: виправлено помилку, яка призводила до непрацездатності клавіатурних скорочень для зменшення і збільшення області позначення.

source: Viewer: Fix keyboard shortcut to toggle highlights panel not working when the highlights panel is itself focused.
cs: Prohlížeč: Oprava nefunkčnosti klávesové zkratky pro přepnutí panelu zvýraznění, když je zaměřen samotný panel zvýraznění.
es: Visor: Se corrige el fallo por el que el atajo de teclado para conmutar el panel de resaltados no funcionaba cuando el propio panel de resaltados tiene el foco.
ru: Просмотрщик: исправлена ​​ошибка, из-за которой сочетание клавиш для переключения панели выделения не работает, когда сама панель выделения сфокусирована.
uk: Засіб перегляду: відновлено працездатність клавіатурного скорочення для вмикання і вимикання панелі підсвічування, якщо фокус перебуває на самій панелі підсвічування.

source: Viewer: handle editing of missing highlights more gracefully
cs: Prohlížeč: Elegantnější zacházení s chybějícími zvýrazněními
es: Visor: Se gestiona mejor la modificación de resaltados inexistentes
ru: Просмотрщик: более изящно обрабатывается управление редактированием отсутствующих выделений
uk: Засіб перегляду: реалізовано досконалішу обробку редагування пропущених підсвічувань
