Repository: debian-calibre/calibre
Catalog: translations-git/changelog/*.po
Languages: cs, es, ru, uk

source: Google books metadata download: Fix paragraphs not being recognized
cs: Stahování metadat knih Google: Oprava nerozpoznávání odstavců
es: Descarga de metadatos de Google books: Se corrige el fallo por el que no se recocían los párrafos
ru: Загрузка метаданных книг Google: исправление нераспознаваемых абзацев
uk: Отримання метаданих книг Google: виправлено розпізнавання абзаців

source: Content server: Fix light background for comments editor in dark mode
cs: Server s obsahem: Oprava světlého pozadí editoru komentářů v tmavém režimu
es: Servidor de contenidos: Se corrige el fondo claro para el editor de comentarios en modo oscuro
ru: Контент-сервер: исправлен светлый фон для редактора комментариев в тёмном режиме.
uk: Сервер даних: виправлено світле тло у редакторі коментарів при застосуванні темного режиму

source: Content server: Fix margin and body background color mismatch when reading books with a non-white/black color scheme
cs: Server s obsahem: Oprava nesouladu barev pozadí okrajů a těla při čtení knih s jiným než bílým nebo černým barevným schématem
es: Servidor de contenidos: Se corrige la disparidad de los colores de fondo del margen y el cuerpo de texto al leer libros con esquema de colores distinto de blanco y negro
ru: Контент-сервер: исправление несоответствия цвета полей и фона при чтении книг с цветовой схемой, отличной от белой/чёрной.
uk: Сервер даних: виправлено невідповідність кольору тла поля і вмісту при читанні книг із не білою або чорною схемою кольорів

source: Content server: Fix long tapping in the notes edit area incorrectly changing the highlight extent
cs: Server s obsahem: Oprava dlouhého klepnutí v oblasti úprav poznámek, které nesprávně mění rozsah zvýraznění
es: Servidor de contenidos: Se corrige el fallo por el que un toque prolongado en la zona de modificación de anotaciones cambiaba la extensión del resaltado de manera incorrecta
ru: Контент-сервер: исправлено долгое нажатие в области редактирования заметок, из-за которого неправильно менялся экстент выделения.
uk: Сервер даних: виправлено помилку, пов'язану із тим, що довге натискання в області редагування нотаток неправильним чином змінювало розширення підсвічування

source: Google search engine: Fix for different URL encoding used by Google servers in Portugal
cs: Vyhledávač Google: Oprava pro odlišné kódování URL používané servery Google v Portugalsku
es: Motor de búsqueda de Google: Corrección para la distinta codificación de URL usada por los servidores de Google en Portugal
ru: Поисковая система Google: исправление для другой кодировки URL, используемой серверами Google в Португалии.
uk: Рушій пошуку Google: виправлено інше кодування адрес, яке використовують сервери Google у Португалії

source: Check library: Fix vacuum not running on FTS db
cs: Kontrola knihovny: Oprava stavu, kdy vacuum není spuštěno na databázi FTV
es: Comprobar biblioteca: Se corrige el fallo por el que «vacuum» no se ejecutaba sobre la base de datos de búsqueda de texto completo
ru: Проверка библиотеки: исправление, неработающей операции vacuum на FTS db
uk: Перевірка бібліотеки: виправлено запуск очищення бази даних повнотекстового пошуку

source: 29 Jul, 2022
cs: 29. července 2022
ru: 29 июля 2022 г.
uk: 29 липня 2022 року

source: Full text search: Ignore soft hyphens when extracting searchable text from books. Note that you will have to re-index your library to take advantage of this.
cs: Fulltextové vyhledávání: Ignorování měkkých pomlček při extrahování vyhledatelného textu z knih. Pamatujte, že pro využití tohoto budete muset svou knihovnu znovu indexovat.
es: Búsqueda de texto completo: Se ignoran los guiones discrecionales al extraer el texto de los libros. Tenga en cuenta que debe reindexar la biblioteca para aprovechar esto.
ru: Полнотекстовый поиск: игнорирование мягких дефисов при извлечении доступного для поиска текста из книг. Вам придется переиндексировать библиотеку.
uk: Повнотекстовий пошук: реалізовано ігнорування м'яких перенесень при видобуванні з книг тексту для пошуку. Зауважте, що для використання нової можливості вам доведеться повторно індексувати бібліотеку.

source: Content server: Have the Read button open PDF files in the browsers builtin PDF viewer rather than the calibre viewer since the calibre viewer is not well suited to PDF
cs: Server s obsahem: Tlačítko Číst otevírá soubory PDF ve vestavěném prohlížeči PDF v prohlížečích namísto v prohlížeči Calibre, protože prohlížeč Calibre není pro PDF příliš vhodný
es: Servidor de contenidos: El botón Leer abre los archivos PDF en el visor PDF incorporado del navegador, en lugar del visor de calibre, pues éste no es adecuado para archivos PDF.
ru: Контент-сервер: кнопка «Чтение» открывает PDF-файлы во встроенном в браузер просмотрщике PDF, а не в просмотрщике calibre, поскольку просмотрщик calibre не очень подходит для PDF.
uk: Сервер даних: реалізовано відкриття файлів PDF кнопкою «Читати» у вбудованому засобі для перегляду PDF, а не у засобі перегляду calibre, оскільки засіб перегляду calibre не дуже пасує для перегляду PDF.

source: Kobo driver: Add support for new firmware
cs: Ovladač Kobo: Přidána podpora pro nový firmware
es: Controlador Kobo: Añadida compatibilidad con el nuevo «firmware»
ru: Драйвер Kobo: добавлена поддержка новой прошивки
uk: Драйвер Kobo: додано підтримку нової мікропрограми

source: Create icon theme dialog: Add a checkbox to install the newly created theme into calibre
es: Diálogo de creación de tema de iconos: Se añade una casilla para instalar el nuevo tema creado en calibre
ru: Диалоговое окно «Создать тему значков»: добавлен чекбокс, чтобы установить свежесозданную тему в calibre.
uk: Вікно створення теми піктограм: додано пункт для встановлення новоствореної теми у calibre

source: Allow re-indexing a book for FTS by right clicking the Book details panel
es: Se permite reindexar un libro para búsqueda de texto completo pulsando con el botón derecho en el panel de detalles del libro
ru: Разрешена повторная индексация книги для FTS, щелчком правой кнопкой мыши по панели сведений о книге.
uk: Уможливлено повторне індексування книги для повнотекстового пошуку за допомогою пункту контекстного меню панелі подробиць щодо книги

source: Content server: Workaround for Chrome bug causing multiple sign in prompts when connecting to the server after restarting Chrome
es: Servidor de contenidos: Solución alternativa para el fallo de Chrome que hace que se muestren múltiples solicitudes de registro al conectar con el servidor tras reiniciar Chrome
ru: Контент-сервер: обходной путь для ошибки Chrome, вызывающей несколько запросов на вход при подключении к серверу после перезапуска Chrome
uk: Сервер даних: реалізовано запобігання прояву вади у Chrome, яка спричиняла повторні запити щодо входу до сервера при з'єднанні зі сервером після перезапуску Chrome

source: Fix a regression in 6.0 that broke rendering of first page of EPUB as cover when the EPUB has no actual cover
es: Se corrige una regresión en 6.0 que estropeaba la generación de la portada de un EPUB a partir de la primera página cuando el EPUB no tiene portada real
ru: Исправлена ​​регрессия в версии 6.0, из-за которой первая страница EPUB не отображалась как обложка, когда у EPUB не было фактической обложки.
uk: Виправлено регресію у версії 6.0, яка заважала обробці зображення першої сторіки у EPUB як обкладинки, якщо у EPUB не було визначено обкладинки

source: Content server: Fix a regression in 6.0 that caused incorrect rendering of comments metadata in the book details panel in dark mode
es: Servidor de contenidos: Se corrige una regresión en 6.0 que hacía que los metadatos de comentarios se mostraran de manera incorrecta en el panel de detalles del libro en modo oscuro
ru: Контент-сервер: исправление регрессии в версии 6.0, которая приводила к неправильному отображению метаданных комментариев на панели сведений о книге в тёмном режиме.
uk: Сервер даних: виправлено регресію у версії 6.0, яка спричиняла помилкову обробку метаданих коментарів на панелі подробиць у темному режимі

source: FB2 Input: Fix a regression in 6.0 that broke conversion of FB2 on macOS
es: Entrada FB2: Se corrige una regresión en 6.0 que estropeaba la conversión de FB2 en macOS
ru: Ввод FB2: исправление регрессии в 6.0, которая нарушала преобразование FB2 в macOS.
uk: Вхідні дані FB2: виправлено регресію у версії 6.0, яка заважала перетворенню FB2 у macOS

source: Metadata download from Google: Switch to making the queries via a Google web search as this finds some books that searching via the API does not
es: Descarga de metadatos de Google: Se hacen las búsquedas usando la web de Google, ya que esto encuentra más libros que la búsqueda a través de la API
ru: Загрузка метаданных из Google: переключение на выполнение запросов через веб-поиск Google, при этом будут найдены книги, поиск которых через API невозможен.
uk: Отримання метаданих з Google: здійснено перехід до запитів до інтернет-пошуку Google, оскільки його використання дає ширші результати, ніж пошук за допомогою програмного інтерфейсу

source: Book details panel: Fix clicking on items from an enumerated column containing ampersands not searching correctly
es: Panel de detalles del libro: Se corrige el fallo por el que la pulsación sobre elementos de columnas enumeradas que contienen el carácter et («&») no realizaba búsquedas correctamente
ru: Панель сведений о книге: исправление неправильного поиска при нажатии на элементы из пронумерованного столбца, содержащего амперсанды.
uk: Панель подробиць щодо книги: виправлено помилку, пов'язану із неправильним пошуком при клацанні на пунктах нумерованого стовпчика, у якому містяться записи із амперсандом

source: Image editor: Do not allow initial mouse drag to create selection rect outside the image bounds
es: Editor de imágenes: No se permite que un arrastre de ratón inicial cree un rectángulo de selección fuera de los límites de la imagen
ru: Редактор изображений: не разрешать начальное перетаскивание мышью для создания прямоугольника выделения за пределами изображения.
uk: Редактор зображень: усунено можливість створення початковим перетягуванням вказівника миші прямокутника за межами зображення

source: E-book viewer: Fix clicking on ToC entries moving keyboard focus to the ToC search box when the ToC window is floating
es: Visor de libros electrónicos: Se corrige el fallo por el que al pulsar en las entradas del índice el foco de teclado cambiaba al cuadro de búsqueda del índice cuando el índice se muestra como ventana flotante
ru: Просмотрщик электронных книг: исправлена ​​ошибка, из-за которой нажатие на записи ToC перемещало фокус клавиатуры на поле поиска ToC, когда окно ToC было плавающим.
uk: Засіб для перегляду книг: виправлено помилку, пов'язану із тим, що клацання на записах таблиці змісту призводило до пересування фокусу клавіатури до поля пошуку таблиці змісту, якщо вікно таблиці змісту є рухомим

source: Fix a regression in 6.0 that caused the default cover to be rendered small in some contexts
es: Se corrige una regresión en 6.0 que hacía que la portada predeterminada se generara demasiado pequeña en algunos contextos
ru: Исправлена ​​регрессия в 6.0, из-за которой обложка по умолчанию отображалась маленькой в ​​некоторых контекстах.
uk: Виправлено регресію у версії 6.0, яка призводила до того, що початкове зображення обкладинки було показано малим у певних контекстах

source: Various bug fixes related to the new dark/light icon theme switching. Make the icons more consistent even when using the system theme. Use calibre specific file type icons when using the non native file dialogs. Allow creating dark/light override icons manually in the configuration folder.
es: Varias correcciones de fallos relacionadas con el nuevo cambio de temas de iconos claro y oscuro. Se hacen los iconos más acordes incluso cuando se usa el tema del sistema. Se usan los iconos de tipo de archivo de calibre en los diálogos de archivo no nativos. Se permite la creación manual de iconos prioritarios claro u oscuro en la carpeta de configuración.
ru: Разные исправления ошибок, связанные с новым переключением темы тёмных/светлых значков. Значки более согласованы даже при использовании системной темы. Значки конкретных типов файлов calibre при использовании неродных диалоговых окон файлов. Разрешено создание тёмных/светлых значков переопределения вручную в папке конфигурации.
uk: Різноманітні виправлення вад, які пов'язано із новими можливостями перемикання між темною і світлою темами. Використано специфічні для calibre типи файлів піктограм при використанні вбудованих діалогових вікон для роботи з файлами. Уможливлено створення пріоритетних темних або світлих піктограм вручну у теці налаштувань.

source: Disable the color theme setting when using system style
es: Se desactiva la configuración de tema de color al usar el estilo del sistema
ru: Отключена настройка цветовой темы при использовании системного стиля
uk: Реалізовано вимикання встановленої теми кольорів при використанні стилю системи

source: When using a fixed color palette and the system colors are of different type enforce the color palette
es: Cuando se usa un esquema de colores fijo y los colores del sistema son de distinto tipo, se fuerza el uso del esquema de colores
ru: При использовании фиксированной цветовой палитры и системных цветов другого типа принудительно применять цветовую палитру.
uk: При використанні фіксованої палітри кольорів та іншого типу кольорів системи реалізовано примусове використання палітри кольорів

source: Ignore Qt generated application palette changes when using a fixed palette
es: Se ignoran los cambios de esquema generados por la aplicación Qt al usar un esquema fijo
ru: Игнорировать сгенерированные Qt изменения палитры приложения при использовании фиксированной палитры
uk: Реалізовано ігнорування змін у палітрі програми, створених Qt, при використанні фіксованої палітри

source: In the icon theme chooser dialog show light and dark themes only in the light and dark tabs
es: En el diálogo de selección de tema de iconos se muestran los temas claros y oscuros sólo en las pestañas correspondientes
ru: В диалоговом окне выбора темы значка показывать светлые и тёмные темы только на светлых и тёмных вкладках.
uk: Реалізовано показ світлих і темних тем у вікні вибору теми піктограм лише у відповідних вкладках

source: Welcome wizard: Fix device names not being translated correctly leading to the same name being repeated for some devices
es: Asistente de bienvenida: Se corrige el fallo por el que los nombres de dispositivo no se traducían correctamente, haciendo que un mismo nombre se repitiera para algunos dispositivos
ru: Мастер приветствия: исправление неправильного перевода имен устройств, что приводило к повторению одного и того же имени для некоторых устройств.
uk: Майстер початкового налаштовування: виправлено невідповідний переклад назв пристроїв, який призводив до повторення назв для деяких пристроїв

source: Read aloud: Fix spurious error message on Linux about voices not being installed
es: Lectura en alto: Se corrige un mensaje de error espurio sobre voces no instaladas en Linux
ru: Чтение вслух: исправлено ложное сообщение об ошибке в Linux о том, что голоса не установлены
uk: Читання уголос: виправлено зайве повідомлення у Linux щодо того, що не встановлено голосові файли

source: Linux binaries: Bundle brotli and graphite2 as well as Qt links against them
es: Binarios de Linux: Se incluyen brotli y graphite2, ya que Qt enlaza con ellos
ru: Бинарные файлы Linux: сбандлены brotli и graphite2, а также ссылки Qt на них
uk: Бінарні пакунки для Linux: додано запаковані версії brotli і graphite2, оскільки Qt компонується із ними

source: FTS dialog: When keyboard navigation changes the current item ensure it stays visible
es: Diálogo de búsqueda de texto completo: Cuando se cambia el elemento actual mediante teclado, se asegura de que permanece visible
ru: Диалоговое окно FTS: когда навигация с помощью клавиатуры изменяет текущий элемент - проверка его видимости.
uk: Вікно повнотекстового пошуку: коли навігація за допомогою клавіатури змінює поточний запис, реалізовано забезпечення його видимості

source: Binary builds: Fix Qt TLS backends not included
es: Versiones binarias: Se corrige el fallo por el que el motor TLS de Qt no estaba incluido
ru: Двоичные сборки: исправление не включенных бэкэндов Qt TLS
uk: Бінарні збірки: включено модулі TLS Qt

source: Fix Qt WebEngine creating cache folders outside of the calibre cache directory
es: Se corrige el fallo por el que Qt WebEngine creaba carpetas de caché fuera del directorio de caché de calibre
ru: Исправление Qt WebEngine, создающего папки кеша за пределами каталога кеша caulibre.
uk: Виправлено помилку, пов'язану із тим, що Qt WebEngine створювала теки кешу поза каталогом кешу calibre

source: Version 6.2.1 fixes a regression in 6.2.0 that caused the Read button in the Content server to only work for PDF books
es: La versión 6.2.1 corrige una regresión en 6.2.0 que hacía que el botón Leer en el servidor de contenidos sólo funcionara para libros PDF
ru: Версия 6.2.1 исправляет регрессию в 6.2.0, из-за которой кнопка «Чтение» в контент-сервере работала только для книг в формате PDF.
uk: У версії 6.2.1 виправлено регресію версії 6.2.0, яка призводила до того, що кнопка «Читати» у сервері даних працювала лише для книг PDF

source: 16 Jul, 2022
cs: 16. července 2022
ru: 16 июля 2022
uk: 16 липня 2022 року

source: Full text search: Add a button to re-index a book, useful if the book's contents have been changed outside calibre
es: Búsqueda de texto completo: Se añade un botón para reindexar un libro, que es útil si el contenido del libro ha cambiado fuera de calibre
ru: Полнотекстовый поиск: добавлена кнопка для переиндексации книги, полезно, если содержимое книги было изменено вне calibre.
uk: Повнотекстовий пошук: додано кнопку повторного індексування книги. Корисно, якщо до вмісту книги було внесено зміни поза calibre.

source: Search queries now support quoting using "docstrings" for easier escaping
es: Las consultas de búsqueda permiten ahora usar *docstrings* para facilitar el uso de caracteres especiales
ru: Поисковые запросы теперь поддерживают цитирование с использованием "docstrings" для упрощения экранирования.
uk: Реалізовано підтримку екранування за допомогою «docstrings» у запитах щодо пошуку

source: Linux installer: Check for libEGL as the QtGui module in Qt 6 links against it and many Linux servers don't have it installed
es: Instalador de Linux: Se comprueba la presencia de libEGL, pues el módulo QtGui de Qt 6 lo enlaza y muchos servidores Linux no lo tienen instalado
ru: Установщик Linux: проверка наличия libEGL, поскольку модуль QtGui в Qt 6 ссылается на него, и на многих серверах Linux он не установлен.
uk: Встановлювач у Linux: реалізовано пошук libEGL, оскільки модуль QtGui у Qt 6 компонується із цією бібліотекою, а на багатьох серверах Linux бібліотеку не встановлено

source: macOS: Blacklist older versions of the DeDRM plugin as they caused crashes and failures to add books.
es: macOS: Se vetan versiones antiguas del complemento DeDRM, pues provocan cierres y fallos al añadir libros.
ru: macOS: внесены в чёрный список старые версии плагина DeDRM, так как они вызывали сбои и сбои при добавлении книг.
uk: macOS: застарілі версії додатка DeDRM додано до «чорного» списку, оскільки вони спричиняють аварійне завершення роботи і не дають додавати книги.

source: Fix a regression in 6.0 that caused crashes in the Manage authors dialog
es: Se corrige una regresión en 6.0 que provocaba cierres en el diálogo de administración de autores
ru: Исправлена ​​регрессия в версии 6.0, вызывавшая сбои в диалоговом окне «Управление авторами».
uk: Усунено регресію у версії 6.0, яка спричиняла аварійне завершення роботи при користуванні вікном керування записами авторів

source: Fix a regression in 6.0 that broke touch screen interaction
es: Se corrige una regresión en 6.0 que estropeaba la interacción con pantallas táctiles
ru: Исправлена ​​регрессия в версии 6.0, из-за которой нарушалось взаимодействие с сенсорным экраном.
uk: Усунено регресію у версії 6.0, яка спричиняла проблеми із сенсорними екранами

source: Fix a regression in 6.0 that caused a few checkboxes to stop working
es: Se corrige una regresión en 6.0 que hacía que algunas casillas de verificación no funcionasen
ru: Исправлена ​​регрессия в версии 6.0, из-за которой несколько флажков переставали работать.
uk: Усунено регресію у версії 6.0, яка спричиняла проблеми у роботі пунктів із позначками

source: Linux: Fix a regression in 6.0 that broke handling of mouse clicks on some Wayland systems with a touchpad
es: Linux: Se corrige una regresión en 6.0 que estropeaba la gestión de pulsaciones de ratón en algunos sistemas Wayland con panel táctil
ru: Linux: исправление регрессии в 6.0, которая нарушала обработку щелчков мышью на некоторых системах Wayland с сенсорной панелью.
uk: Linux: усунено регресію у версії 6.0, яка спричиняла помилки в обробці клацань кнопкою миші у деяких системах Wayland із сенсорною панеллю

source: ToC Editor: Fix a regression in 6.0 that broke styling/images in the preview panel
es: Editor de índice: Se corrige una regresión en 6.0 que estropeaba estilos e imágenes en el panel de vista previa
ru: Редактор ToC: исправлена регрессия в 6.0, которая нарушала стили/изображения на панели предварительного просмотра.
uk: Редактор таблиці змісту: усунено регресію у версії 6.0, яка спричиняла неправильну обробку стилів на зображень на панелі попереднього перегляду

source: Windows: Fix window titlebars not dark in dark mode
es: Windows: Se corrige el fallo por el que las barras de título de ventanas no eran oscuras en modo oscuro
ru: Windows: исправлена ​​ошибка, из-за которой заголовки окон не были тёмными в тёмном режиме.
uk: Windows: виправлено помилку, пов'язану із тим, що смужки заголовків вікон не були темними у темному режимі

source: Full text search: Show a warning when indexing/searching a library on an FAT drive
es: Búsqueda de texto completo: Se muestra una advertencia al indexar o buscar una biblioteca en una unidad FAT
ru: Полнотекстовый поиск: показывать предупреждение при индексировании/поиске библиотеки на диске FAT.
uk: Повнотекстовий пошук: реалізовано показ попередження, якщо індексування і пошук відбувається у бібліотеці на розділі із файловою системою FAT

source: News download: Do not add aborted/failed article titles to the comments metadata
es: Descarga de noticias: No se añaden títulos de artículos cancelados o fallidos a los comentarios en los metadatos
ru: Загрузка новостей: не добавлять прерванные/неудачные заголовки статей в метаданные комментариев.
uk: Отримання новин: усунено додавання перерваних або невдало отриманих заголовків статей до коментарів у метаданих

source: Full text search: Fix books edited with the Edit book tool not being automatically re-indexed
es: Búsqueda de texto completo: Se corrige el fallo por que los libros modificados con la herramienta de modificación de libros no se reindexaban automáticamente
ru: Полнотекстовый поиск: исправлена ​​ошибка, из-за которой книги, отредактированные с помощью инструмента «Редактор книг», не переиндексировались автоматически.
uk: Повнотекстовий пошук: реалізовано повторне автоматичне індексування книг, які було змінено у редакторі книг програми

source: HTML Input: Fix handling of deeply nested files on Windows
es: Entrada HTML: Se corrige la gestión de archivos muy anidados en Windows
ru: Ввод HTML: исправление обработки глубоко вложенных файлов в Windows.
uk: Вхідні дані в HTML: виправлено обробку глибоко вкладених файлів у Windows
