Repository: debian-calibre/calibre
Catalog: translations-git/changelog/*.po
Languages: cs, es, ru, uk

source: PDB Input: Fix a regression in calibre 5 that broke processing some plucker format PDB files
cs: Vstup PDB: Oprava regrese v Calibre 5, která poškodila zpracování některých souborů PDB ve formátu plucker
es: Entrada PDB: Se corrige una regresión en calibre 5 que estropeaba el procesado de algunos archivos en formato PDB de plucker
ru: Ввод PDB: исправлена ​​регрессия в 5-м calibre, нарушавшая обработку некоторых файлов PDB в формате сборщика.
uk: Вхідні дані PDB: виправлено регресію у calibre 5, яка заважала обробці деяких файлів PDB у форматі plucker.

source: Edit book: Fix sorting in spell check dialog on language broken for books that have unknown languages
cs: Úprava knihy: Oprava řazení v dialogovém okně kontroly pravopisu v případě knih s neznámými jazyky
es: Modificar libro: Se corrige el fallo por el que la ordenación en el diálogo de comprobación ortográfica para libros que tienen idiomas desconocidos
ru: Редактор книг: исправление сортировки в диалоговом окне проверки орфографии при нарушении языка для книг с неизвестными языками.
uk: Редагування книг: усунено помилку, пов'язану із упорядковуванням у вікні перевірки правопису для книг, мова яких є невідомою програмі.

source: Annotations browser: Fix a typo that broke sorting for highlights
cs: Prohlížeč anotací: Oprava překlepu, který poškodil řazení zvýrazněných položek
es: Explorador de anotaciones: Se corrige una errata que estropeaba la ordenación de resaltados
ru: Браузер аннотаций: исправлена опечатка, нарушавшая сортировку по выделениям
uk: Навігатор анотаціями: виправлено друкарську помилку, яка заважала правильному упорядковуванню підсвічувань.

source: Annotations browser: When showing a highlight preserve paragraph boundaries for multi-paragraph highlights
cs: Prohlížeč anotací: Při zobrazení zvýraznění zachovat hranice odstavců pro zvýraznění více odstavců
es: Explorador de anotaciones: Al mostrar un resaltado se mantienen los saltos de párrafo en resaltados multipárrafo
ru: Браузер аннотаций: при отображении выделения сохранять границы абзаца для мультиабзацных выделений
uk: Навігатор анотаціями: при показі підсвічувань реалізовано зберігання меж абзаців для підсвічувань, які позначають декілька абзаців.

source: Viewer highlights panel: Fix the "Edit notes" link not saving the changes
cs: Panel zvýraznění prohlížeče: Oprava odkazu "Upravit poznámky", který neukládal změny
es: Panel de resaltados del visor: Se corrige el fallo por el que el enlace «Modificar notas» no guardaba los cambios
ru: Панель просмотра выделений: исправление ссылки 'Изменить заметки', не сохранявшей изменения.
uk: Панель підсвічування засобу перегляду: виправлено помилку, пов'язану із тим, що посилання «Змінити нотатки» не зберігало внесені зміни.

source: E-book viewer: When using a right click/shift-click to adjust the selection, move the section boundary that is closer to the click point
cs: Prohlížeč e-knih: Při použití kliknutí pravým tlačítkem myši nebo kliknutí se shiftem k úpravě výběru posunout hranici oddílu, která je blíže k bodu kliknutí
es: Visor de libros electrónicos: Al usar el botón derecho o la pulsación con Mayús para ajustar la selección, se mueve el borde de selección más cercano al cursor
ru: Просмотрщик электронных книг: при использовании щелчка правой кнопкой мыши / щелчка при нажатой клавише Shift для настройки выделения перемещать границу раздела, находящуюся ближе к точке щелчка.
uk: Засіб перегляду книг: при використанні клацання правою кнопкою миші або клацання разом із натисканням Shift для коригування позначеної області, реалізовано пересування межі розділу, яка є ближчою до точки клацання.

source: 21 May, 2021
cs: 21. května 2021
ru: 21 мая 2021
uk: 21 травня 2021 року

source: Content server viewer: Improved search functionality
cs: Prohlížeč serveru s obsahem: Vylepšená funkce vyhledávání
es: Visor del servidor de contenidos: Mejora en la función de búsqueda
ru: Просмотрщик контент-сервера: улучшенная функция поиска
uk: Засіб перегляду сервера даних: удосконалено можливості пошуку

source: Searching can now be done for whole words and regular expressions. And all search results are listed at once with some context for easy navigation.
cs: Nyní lze vyhledávat celá slova a regulární výrazy. A všechny výsledky hledání jsou uvedeny najednou s určitým kontextem pro snadnou navigaci.
es: Ahora se pueden realizar búsquedas por palabras completas y expresiones regulares. Se muestran todos los resultados de una vez con algo de contexto para ubicarlos con facilidad.
ru: Теперь поиск может выполняться по целым словам и регулярным выражениям. И все результаты поиска перечисляются сразу с некоторым контекстом для облегчения навигации.
uk: У новій версії пошук можна виконувати за цілими словами або формальними виразами. Усі результати пошуку програма показує одразу із контекстом для спрощення навігації.

source: E-book viewer: Allow making the image popup full screen
cs: Prohlížeč e-knih: Umožnění zobrazení obrázku přes celou obrazovku
es: Visor de libros electrónicos: Se permite poner a pantalla completa las imágenes emergentes
ru: Просмотрщик электронных книг: разрешено отображение всплывающего изображения на весь экран
uk: Засіб перегляду книг: уможливлено повноекранний режим для контекстної панелі зображення.

source: E-book viewer: Allow expanding/collapsing all items in the Table of Contents at a particular level by right clicking on one item of that level and choosing the option to expand/collapse
cs: Prohlížeč e-knih: Umožnění rozbalení nebo sbalení všech položek v obsahu na určité úrovni kliknutím pravým tlačítkem myši na jednu položku této úrovně a výběrem možnosti rozbalit nebo sbalit
es: Visor de libros electrónicos: Se permite expandir o contraer todos los elementos del índice en un nivel determinado pulsando con el botón derecho sobre un elemento de ese nivel y escogiendo la opción para expandir o contraer
ru: Просмотрщик электронных книг: разрешено разворачивание/сворачивание всех элементов определённого уровня в Оглавлении щелчком правой кнопкой мыши по одному элементу этого уровня и выбором разворачивания/сворачивания
uk: Засіб перегляду книг: уможливлено розгортання та згортання усіх пунктів у таблиці змісту на певному рівні: достатньо клацнути правою кнопкою миші на пункті відповідного рівня і вибрати у меню пункт розгортання або згортання.

source: E-book viewer: Add shortcuts shift+home and shift+end to extend current selection to start/end of line
cs: Prohlížeč e-knih: Přidání klávesových zkratek shift+home a shift+end pro rozšíření aktuálního výběru na začátek nebo konec řádku
es: Visor de libros electrónicos: Se añaden los atajos Mayús+Inicio y Mayús+Fin para extender la selección actual hasta el inicio o final de la línea
ru: Просмотрщик электронных книг: добавлено сочетания клавиш shift + home и shift + end, чтобы расширить текущий выбор до начала / конца строки
uk: Засіб перегляду книг: додано клавіатурні скорочення Shift+Home та Shift+End для розширення поточного позначеного фрагмента до початку або кінця рядка.

source: Book details: When creating rules to convert identifiers to URLs allow using {id_unquoted} to avoid quoting the identifier value
cs: Podrobnosti o knize: Při vytváření pravidel pro převod identifikátorů na adresy URL povolit použití {id_unquoted}, aby se zabránilo uvozování hodnoty identifikátoru
es: Detalles del libro: Al crear reglas para convertir los identificadores a URL, se permite usar {id_unquoted} para no entrecomillar el valor de identificador
ru: Сведения о книге: при создании правил преобразования идентификаторов в URL-адреса разрешено использование {id_unquoted}, чтобы не указывать значение идентификатора в кавычках.
uk: Подробиці щодо книги: при створенні правил для перетворення ідентифікаторів на адреси уможливлено використання {id_unquoted} для запобігання взяттю значення ідентифікатора у лапки.

source: Review downloaded metadata: Allow double clicking on a cover to see it at a larger size
cs: Kontrola stažených metadat: Umožnění poklepání na obálku pro její zobrazení ve větší velikosti
es: Revisar metadatos descargados: Se permite doble pulsación sobre la portada para verla a mayor tamaño
ru: Просмотр загруженных метаданных: разрешён двойной щелчок обложки для просмотра её в большем размере.
uk: Перегляд отриманих метаданих: уможливлено подвійне клацання на обкладинці для перегляду її збільшеної версії.

source: Annotations browser: Add a Refresh button
cs: Prohlížeč anotací: Přidání tlačítka Obnovit
es: Explorador de anotaciones: Se añade un botón para actualizar
ru: Браузер аннотаций: добавлена кнопка 'Обновить'
uk: Навігація анотаціями: додано кнопку оновлення даних.

source: Edit book: Fix ctrl-clicking on a class name jumping to the wrong CSS rule if the stylesheet contains top level comments
cs: Úprava knihy: Oprava, kdy kliknutí s ctrl na název třídy skočí na špatné pravidlo CSS, pokud šablona stylů obsahuje komentáře nejvyšší úrovně
es: Modificar libro: Se corrige el fallo por el que al pulsar con Ctrl sobre un nombre de clase se saltaba a una regla CSS incorrecta si la hoja de estilos contiene comentarios en el nivel superior
ru: Редактор книг: Исправлена ​​ошибка, из-за которой при нажатии клавиши Ctrl на имени класса происходил переход к неправильному правилу CSS, если таблица стилей содержала комментарии верхнего уровня
uk: Редагування книг: виправлено перехід до помилкового правила CSS у відповідь на клацання із одночасним утриманням натиснутою клавіші Ctrl, якщо таблиця стилів містить коментарі на верхньому рівні.

source: Fix search and replace on identifiers not working if the replaced value has colons
cs: Oprava nefunkčnosti vyhledávání a nahrazování v identifikátorech, pokud nahrazovaná hodnota obsahuje dvojtečky
es: Se corrige el fallo por el que la busqueda y sustitución en identificadores no funcionaba si el valor de sustitución contiene dos puntos
ru: Исправлен поиск и замена идентификаторов не работавший если в заменяемом значении были двоеточия
uk: Виправлено помилку, пов'язану із непрацездатністю засобу пошуку із заміною, якщо у замінюваному значенні містилися двокрапки.

source: Annotations browser: Sort the entries in order of position in book
cs: Prohlížeč anotací: Řadit položky podle pořadí pozice v knize
es: Explorador de anotaciones: Se ordenan las entradas por su posición en el libro
ru: Браузер аннотаций: сортировка записей в порядке их расположения в книге.
uk: Навігація анотаціями: реалізовано упорядковування записів за позицією у книзі

source: ToC editor: Dark mode: Fix colors in location selection panel not dark
cs: Editor obsahu: Tmavý režim: Oprava barev v panelu výběru umístění, které nejsou tmavé
es: Editor de índice: Modo oscuro: Se corrigen los colores no oscuros en el panel de selección de ubicación
ru: Редактор ToC: тёмный режим: исправлены цвета на панели выбора местоположения, не были тёмными
uk: Редактор змісту: темний режим: виправлено кольори на панелі вибору місця.

source: E-book viewer: Fix right or shift-clicking to extend selection not shrinking selection when the click is inside the selection
cs: Prohlížeč e-knih: Oprava, kdy kliknutí pravým tlačítkem myši nebo kliknutí pravým tlačítkem se shiftem pro rozšíření výběru nezmenšuje výběr, když je kliknutí uvnitř výběru
es: Visor de libros electrónicos: Se corrige el fallo por el que la pulsación con el botón derecho o con Mayús para extender la selección no contraía la selección cuando la pulsación se realiza dentro de la selección
ru: Просмотрщик электронных книг: исправлен щелчок с Shift или правой кнопкой мыши для расширения выделения, не уменьшая его при щелчке внутри выделения
uk: Засіб перегляду книг: виправлено помилку, пов'язану із тим, що клацання правою кнопкою миші або клацання лівою кнопкою, якщо натиснуто Shift, не зменшувало область позначення, якщо клацання відбувалося всередині цієї області.

source: Avoid spurious errors on multiple simultaneous calibre launches
cs: Zabránění falešným chybám při více souběžných spuštěních Calibre
es: Se evitan errores espurios al ejecutar varias copias simultáneas de calibre
ru: Избегание ложных ошибок при одновременных запусках нескольких экземпляров calibre
uk: Усунено хибні повідомлення про помилки щодо запуску декількох екземплярів calibre.

source: E-book viewer: Ignore mouse scroll events that would turn pages when editing notes
cs: Prohlížeč e-knih: Ignorování událostí posouvání myší, které by při úpravě poznámek otáčely stránky
es: Visor de libros electrónicos: Se ignoran los eventos de desplazamiento de ratón que ocasionarían un cambio de página mientras se modifican las notas
ru: Просмотрщик электронных книг: игнорирование событий прокрутки мыши, могущих переворачивать страницы при редактировании заметок
uk: Засіб перегляду книг: реалізовано ігнорування повідомлень про гортання вмісту за допомогою миші, які призводили до гортання сторінок при редагуванні нотаток.

source: E-book viewer: Fix sorting bookmarks by title not working
cs: Prohlížeč e-knih: Oprava nefunkčního řazení záložek podle názvu
es: Visor de libros electrónicos: Se corrige la ordenación de marcadores por título
ru: Просмотрщик электронных книг: исправлена ​​ошибка, из-за которой сортировка закладок по названию не работала
uk: Засіб перегляду книг: виправлено упорядковування закладок за назвами.

source: Windows WPD driver: Fix an error reading the filesystem on some MTP based devices
cs: Ovladač WPD systému Windows: Oprava chyby při čtení souborového systému na některých zařízeních založených na MTP
es: Controlador Windows WPD: Se corrige un error al leer el sistema de archivos en algunos dispositivos basados en MTP
ru: Драйвер Windows WPD: исправление ошибки чтения файловой системы на некоторых устройствах на базе MTP
uk: Драйвер WPD у Windows: усунено помилку читання файлової системи на деяких пристроях на основі MTP.

source: 30 Apr, 2021
cs: 30. dubna 2021
es: 30 abr 2021
ru: 30 апреля 2021
uk: 30 квітня 2021 року

source: E-book viewer: Image popup: Allow dragging with the mouse to pan the image
cs: Prohlížeč e-knih: Automaticky otevírané obrázky: Umožnění posouvání obrázku přetažením myší
es: Visor de libros electrónicos: Ventana de imagen emergente: Se permite arrastrar con el ratón para desplazar la imagen
ru: Просмотрщик электронных книг: всплывающее окно с изображением: разрешено перетаскивание мышью для панорамирования изображения
uk: Засіб читання книг: контекстна панель зображення: уможливлено перетягування за допомогою миші для панорамування зображення

source: Sort button: Allow selecting which columns are in the popup sort menu
cs: Tlačítko řazení: Umožnění výběru, které sloupce jsou v automaticky otevírané nabídce řazení
es: Botón de ordenar: Se permite seleccionar qué columnas aparecen en el menú emergente de ordenación
ru: Кнопка сортировки: позволяет выбрать столбцы во всплывающем меню сортировки.
uk: Кнопка упорядковування: уможливлено вибір стовпчиків, які буде показано у контекстному меню упорядковування

source: E-book viewer: When suggesting a default bookmark title, use the name of the current chapter
cs: Prohlížeč e-knih: Při navrhování výchozího názvu záložky použít název aktuální kapitoly
es: Visor de libros electrónicos: Al sugerir un título de marcador predeterminado, se usa el nombre del capítulo actual
ru: Просмотрщик электронных книг: в предложении названия закладки по умолчанию используется название текущей главы.
uk: Засіб читання книг: при формуванні пропозиції щодо заголовка закладки реалізовано використання назви поточної глави

source: E-book viewer: When searching the Table of Contents allow holding the Shift key to search backwards
cs: Prohlížeč e-knih: Při vyhledávání v obsahu umožnit podržením klávesy Shift vyhledávat zpětně
es: Visor de libros electrónicos: Al buscar en el índice se permite mantener pulsada la tecla Mayús para buscar hacia atrás
ru: Просмотрщик электронных книг: при поиске в оглавлении разрешено удерживание клавиши Shift для поиска в обратном направлении.
uk: Засіб перегляду книг: при пошуку у таблиці змісту уможливлено утримання клавіші Shift для інвертування напрямку пошуку

source: E-book viewer: Add a shortcut Ctrl+0 to restore default font size
cs: Prohlížeč e-knih: Přidání klávesové zkratky Ctrl+0 pro obnovení výchozí velikosti písma
es: Visor de libros electrónicos: Se añade el atajo Ctrl+0 para restablecer el tamaño de texto predeterminado
ru: Просмотрщик: добавлено сочетание клавиш Ctrl+0 для восстановления умолчального размера шрифта
uk: Засіб перегляду книг: додано скорочення Ctrl+0 для відновлення типового розміру шрифту

source: Windows MTP driver: Rewrite parts of the driver in the hope of fixing some rare and hard to reproduce crashes
cs: Ovladač MTP systému Windows: Přepsání částí ovladače v naději, že se podaří opravit některé vzácné a těžko reprodukovatelné pády
es: Controlador MTP de Windows: Se han reescrito partes del código con la esperanza de corregir algunos cierres infrecuentes y difíciles de reproducir
ru: Драйвер Windows MTP: переписаны части драйвера в надежде исправить некоторые редкие и трудно воспроизводимые сбои.
uk: Драйвер MTP для Windows: переписано частини драйвера у сподіванні виправлення деяких рідкісних і важких у відтворенні аварійних завершень роботи

source: Windows MTP driver: Set modified and created times when putting files/folders on device. Also read modified time correctly.
cs: Ovladač MTP systému Windows: Nastavení časů změn a vytvoření při vkládání souborů nebo složek do zařízení. Také správně načítání času změny.
es: Controlador MTP de Windows: Se establecen las fechas de modificación y creación al mandar archivos o carpetas al dispositivo. También se leen las fechas de modificación correctamente.
ru: Драйвер Windows MTP: Установка времени изменения и создания при размещении файлов/папок на устройстве. Также правильно читается время изменения.
uk: Драйвер MTP для Windows: реалізовано встановлення часу внесення змін і створення при записуванні файлів і тек на пристрій. Також реалізовано правильне читання часу внесення змін.

source: Windows: E-book viewer: Fix switching away from viewer while in full screen and switching back causing some corruption until the page is scrolled
cs: Windows: Prohlížeč e-knih: Oprava přepínání z prohlížeče, když je zobrazený na celou obrazovku, a přepínání zpět, které způsobovalo určité poškození, dokud nebyla stránka posunuta
es: Windows: Visor de libros electrónicos: Se corrige el fallo por el que al quitar el foco del visor y volver a él mientras está en pantalla completa ocasionaba alguna corrupción hasta que se desplaza la página
ru: Windows: просмотрщик электронных книг: исправлено отключение просмотрщика в полноэкранном режиме и обратное переключение, приводящее к некоторому повреждению при прокрутке страницы.
uk: Windows: засіб читання книг: виправлено помилку, пов'язану із тим, що перемикання з засобу перегляду у повноекранному режимі до звичайного режиму і назад призводило до певного пошкодження зображення до виконання гортання

source: Fix a regression in the previous release that caused errors when editing empty date values
cs: Oprava chyby v předchozí verzi, která způsobovala chyby při úpravě prázdných hodnot data
es: Se corrige una regresión en la versión anterior que causaba errores al modificar valores de fecha vacíos
ru: Исправлена регрессия в предыдущем выпуске, вызывавшая ошибки при редактировании пустых значений даты
uk: Усунено регресію попереднього випуску, пов'язану із помилками при редагуванні порожніх значень дат

source: Get books: Update Gutenberg plugin for website changes
cs: Získat knihy: Aktualizace modulu Gutenberg pro změny stránek
es: Obtener libros: Actualizado el complemento de Gutenberg para los cambios en la web
ru: Приобрести книги: обновлен плагин Gutenberg из-за изменений на сайтах.
uk: Отримання книг: оновлену версію додатка Gutenberg узгоджено зі змінами на сайті

source: E-book viewer: The quick highlight button should replace the style of an existing highlight, when one is selected
cs: Prohlížeč e-knih: Tlačítko rychlého zvýraznění by mělo nahradit styl existujícího zvýraznění, pokud je nějaké vybráno
es: Visor de libros electrónicos: El botón de resaltado rápido debería sustituir el estilo de un resaltado existente cuando se selecciona uno
ru: Просмотрщик электронных книг: кнопка быстрого выделения должна заменять стиль существующего выделения, если он выбран
uk: Засіб перегляду книг: кнопка швидкого підсвічування має замінювати стиль наявного підсвічування, якщо таке позначено

source: Elide long items in the middle when showing the completion popup for tags, to make it easier to use with hierarchical tags
cs: Vymazání dlouhých položek uprostřed při zobrazení automaticky otevíraného okna pro doplnění značek, aby se usnadnilo použití s hierarchickými značkami
es: Se omiten elementos largos en el medio al mostrar el menú emergente de compleción para simplificar su uso con etiquetas jerárquicas
ru: Убраны длинные элементы в середине при отображении всплывающего окна завершения для тегов, чтобы упростить использование с иерархическими тегами
uk: Реалізовано уникнення довгих записів посередині при показі контекстної панелі підказки для теґів з метою спрощення користування ієрархічними теґами

source: E-book viewer: Read aloud: Fix soft hyphens causing read aloud words to be broken up
cs: Prohlížeč e-knih: Číst nahlas: Oprava měkkých spojovníků způsobujících rozpad slov při hlasitém čtení
es: Visor de libros electrónicos: Lectura en alto: Se corrige el fallo por el que los guiones discrecionales hacían que las palabras se dividieran
ru: Просмотрщик электронных книг: Чтение вслух: исправлено озвучивание слов, прерывающееся на мягких переносах
uk: Засіб перегляду книг: читання уголос: виправлено помилку, пов'язану із тим, що використання символів м'якого перенесення призводило до розриву слів

source: E-book viewer: Right clicking when text is selected should extend the selection instead of doing nothing
cs: Prohlížeč e-knih: Kliknutí pravým tlačítkem myši, když je vybrán text, by mělo rozšířit výběr, místo toho aby nedělalo nic
es: Visor de libros electrónicos: Al pulsar el botón derecho con texto seleccionado se debe extender la selección en lugar de no hacer nada
ru: Просмотрщик электронных книг: щелчок правой кнопкой мыши при выделении текста должен расширять выделение, а не ничего не делать.
uk: Засіб читання книг: клацання правою кнопкою миші на позначеному тексті має розширювати позначення, а не ігноруватися

source: Fix settings in the ToC Editor tool being forgotten when calibre is closed
cs: Oprava zapomenutí nastavení v nástroji Editor obsahu při zavření Calibre
es: Se corrige el fallo por el que la configuración de la herramienta de edición de índice se olvida al cerrar calibre
ru: Исправлены настройки в инструменте редактора ToC, которые забываются при закрытии calibre
uk: Виправлено помилку, пов'язану із тим, що значення параметрів роботи засобу редагування змісту відкидалися, якщо користувач закривав вікно calibre

source: DOCX Output: Fix conversion failing if the input document has missing images
cs: Výstup DOCX: Oprava selhání převodu, pokud ve vstupním dokumentu chybí obrázky
es: Salida DOCX: Se corrige el fallo de la conversión cuando al documento de entrada le faltan imágenes
ru: Вывод DOCX: Исправлен сбой конвертации, если во входном документе отсутствуют изображения
uk: Виведення до DOCX: усунено аварійне завершення роботи засобу перетворення, якщо у вхідному документі не вистачало якихось зображень
