Repository: debian-calibre/calibre
Catalog: translations-git/changelog/*.po
Languages: cs, es, ru, uk

source: Kindle driver: Support the new Kindle PaperWhite 2021
cs: Ovladač Kindle: Podpora nového Kindle PaperWhite 2021
es: Controlador Kindle: Compatibilidad con el nuevo Kindle PaperWhite 2021
ru: Драйвер Kindle: поддержка нового Kindle PaperWhite 2021
uk: Драйвер Kindle: реалізовано підтримку нової Kindle PaperWhite 2021

source: Add an option under Preferences-&gt;Behavior to have calibre recognize numbers when sorting (this was previously under Preferences-&gt;Tweaks)
cs: Přidání volby do Předvolby-&gt;Chování, aby Calibre rozpoznávalo čísla při řazení (dříve to bylo v Předvolby-&gt;Vylepšení)
es: Se añade una opción en Preferencias &gt; Comportamiento para hacer que calibre reconozca números al ordenar (esta opción estaba antes en Preferencias &gt; Ajustes)
ru: Добавлен параметр в разделе «Настройки-&gt;Поведение», чтобы calibre распознавал числа при сортировке (ранее это было в разделе «Настройки-&gt;Твики»).
uk: На сторінку «Налаштування-&gt;Поведінка» додано пункт, який уможливлює для calibre розпізнавання чисел під час упорядковування (раніше цей пункт перебував на сторінці «Налаштування-&gt;Коригування»)

source: E-book viewer: Add a button to directly open the viewer help section in the calibre user manual to the viewer controls
cs: Prohlížeč e-knih: Přidání tlačítka do ovládacích prvků prohlížeče pro přímé otevření nápovědy prohlížeče v uživatelské příručce Calibre
es: Visor de libros electrónicos: Se añade un botón en los controles del visor para abrir directamente la sección de ayuda del visor en el manual de usuario de calibre
ru: Просмотрщик электронных книг: добавлена кнопка для прямого открытия раздела справки просмотрщика по его элементам управления в руководстве пользователя calibre.
uk: Засіб перегляду книг: до засобів керування переглядачем додано кнопку для безпосереднього відкриття розділу довідки щодо переглядача у підручнику користувача calibre

source: E-book viewer: Prevent the display from sleeping when using auto-scroll or read aloud modes (Implemented only on Windows and macOS)
cs: Prohlížeč e-knih: Zabránění uspání displeje při použití režimu automatického posouvání nebo hlasitého čtení (implementováno pouze ve Windows a macOS)
es: Visor de libros electrónicos: Se evita que la pantalla entre en suspensión al usar los modos de desplazamiento automático o de lectura en alto (disponible sólo en Windows y macOS)
ru: Просмотрщик электронных книг: Предотвращение перехода дисплея в спящий режим при использовании режимов автоматической прокрутки или чтения вслух (реализовано только в Windows и macOS)
uk: Засіб перегляду книг: реалізовано запобігання вимиканню дисплея у режимах автоматичного гортання та читання уголос (реалізовано лише у Windows та macOS)

source: Edit book: Set semantics tool: Add support for EPUB 3 landmarks
cs: Upravit knihu: Nástroj pro nastavení sémantiky: Přidání podpory pro orientační body EPUB 3
es: Modificar libro: Herramienta de establecer concepto: Se añade compatibilidad para los hitos de EPUB 3
ru: Редактор книг: инструмент «Установить семантику»: добавлена поддержка ориентиров (landmarks) EPUB 3
uk: Редагування книги: інструмент встановлення семантики: додано підтримку позначок місць EPUB 3

source: Add an entry to the Connect/share menu to open the content server in a local browser when it is running
cs: Přidání položky do nabídky Připojit nebo sdílet pro otevření serveru s obsahem v místním prohlížeči, když je spuštěn
es: Se añade una entrada al menú de Conectar y compartir para abrir el servidor de contenidos en un navegador local cuando está ejecutándose
ru: Добавлена запись в меню Подключить/поделиться, чтобы открыть контент-сервер в локальном браузере, когда он запущен.
uk: До меню з'єднання/оприлюднення додано пункт для відкриття сервера даних у локальному браузері, коли його запущено

source: Content server: Fix some OPDS feeds failing with non-ASCII content
cs: Server s obsahem: Oprava selhání některých kanálů OPDS s obsahem jiným než ASCII
es: Servidor de contenidos: Se corrige el fallo de algunos canales OPDS con contenido no ASCII
ru: Контент-сервер: исправлены некоторые каналы OPDS, которые не работают с содержимым, отличным от ASCII.
uk: Сервер даних: виправлено помилки в обробці деяких подач OPDS із текстовими даними, відмінними від ASCII

source: Tag browser: Fix incorrect first letter partitioning when enabling numeric collation of items that start with a number
cs: Prohlížeč štítků: Oprava nesprávného rozdělení podle prvního písmene při zapnutí číselného přiřazování položek, které začínají číslem
es: Explorador de etiquetas: Se corrige la partición incorrecta de la primera letra al activar el orden numérico con elementos que empiezan por un número
ru: Браузер Тегов: исправление неправильного разделения по первой букве при включении числового сопоставления элементов, начинающихся с числа.
uk: Навігатор мітками: виправлено помилкове відокремлення першої літери при вмиканні числового злиття пунктів, які починаються з числа

source: 5.31.1 fixes a bug in an HTML serialization library calibre uses that broke a few things, such as the comments editor tool in the metadata dialog
cs: 5.31.1 opravuje chybu v knihovně pro serializaci HTML používanou Calibre, která poškodila několika věcí, například nástroj editoru komentářů v dialogovém okně metadat
es: 5.311 corrige un fallo en una biblioteca de serialización de HTML que usa calibre y que estropeaba algunas funciones, como la herramienta de modificación de comentarios en el diálogo de metadatos
ru: 5.31.1 исправляет ошибку в calibre библиотеке сериализации HTML, которая ломала редактор комментариев в диалоговом окне метаданных.
uk: У 5.31.1 виправлено ваду у бібліотеці перетворення коду HTML у послідовну форму, яку використовує calibre. Ця вада заважала нормальній роботі деяких інструментів, зокрема редактора коментарів у діалоговому вікні метаданих.

source: 22 Oct, 2021
cs: 22. října 2021
ru: 22 октября, 2021
uk: 22 жовтня 2021 року

source: Add support for the new Kobo Sage and Libra 2 e-book reader devices
cs: Přidání podpory pro nové čtečky e-knih Kobo Sage a Libra 2
es: Se añade compatibilidad con los nuevos lectores de libros electrónicos Kobo Sage y Libra 2
ru: Добавлена поддержка новых читалок электронных книг Kobo Sage и Libra 2
uk: Додано підтримку нових пристроїв для читання електронних книг — Kobo Sage і Libra 2

source: E-book viewer: Read aloud: Allow right clicking to play/pause reading
cs: Prohlížeč e-knih: Číst nahlas: Umožnění přehrávání nebo pozastavení čtení kliknutím pravým tlačítkem myši
es: Visor de libros electrónicos: Lectura en alto: Se permite pulsar con el botón derecho para detener o iniciar la lectura
ru: Просмотрщик электронных книг: Читать вслух: Разрешён щелчок правой кнопкой мыши для воспроизведения/приостановки чтения
uk: Засіб перегляду: читання уголос: уможливлено запуск і призупинення читання за допомогою клацання правою кнопкою миші

source: Sending books by e-mail: Preserve non-English characters in attached filenames
cs: Odesílání knih e-mailem: Zachování neanglických znaků v názvech přiložených souborů
es: Enviar libros por correo electrónico: Se mantienen los caracteres no ingleses en los nombres de archivo adjuntos
ru: Отправка книг по электронной почте: в именах вложенных файлов разрешено сохранять неанглийские символы.
uk: Надсилання книг електронною поштою: реалізовано збереження нелатинських символів у назвах долучених файлів

source: Tag browser: Allow searching for sub-categories by right clicking on them
cs: Prohlížeč štítků: Umožnění vyhledávání podkategorií kliknutím pravým tlačítkem myši na ně
es: Explorador de etiquetas: Se permite buscar subcategorías pulsando con el botón derecho sobre ellas
ru: Браузер тегов: разрешён поиск подкатегорий, при щелчке на них правой кнопкой мыши
uk: Навігатор мітками: уможливлено пошук підкатегорій клацанням правою кнопкою на них

source: E-book viewer: Fix cover and full screen images not centered in paged mode when more than one page is displayed per screen
cs: Prohlížeč e-knih: Oprava obrázků obálky a na celou obrazovku, které nejsou v režimu stránek zarovnány uprostřed, když je na obrazovce zobrazena více než jedna stránka
es: Visor de libros electrónicos: Se corrige el fallo por el que las imágenes a pantalla completa no se centraban en modo paginado cuando se muestra más de una página por pantalla
ru: Просмотрщик электронных книг: исправлено положение обложки и полноэкранных изображений, не центрирующихся в постраничном режиме, при отображении на экране более одной страницы
uk: Засіб перегляду: виправлено помилку, пов'язану із тим, що зображення обкладинок та повноекранні зображення не центрувалися у режимі поділу на сторінки, якщо на екрані було показано декілька сторінок одночасно

source: ToC Editor: Ignore in succession clicks on the OK and Cancel buttons to avoid accidentally closing the window when finishing creating a new entry
cs: Editor obsahu: Ignorování následných kliknutí na tlačítka OK a Zrušit, aby nedošlo k náhodnému zavření okna po dokončení vytváření nového záznamu
es: Editor de índice: Se ignoran pulsaciones sucesivas en los botones «Aceptar» y «Cancelar» para evitar el cierre accidental de la ventana al terminar de crear una entrada
ru: Редактор ToC: последовательно игнорировать нажатия кнопок OK и Отмена, чтобы случайно не закрыть окно при завершении создания новой записи.
uk: Редактор змісту: реалізовано ігнорування повторних натискань кнопок «Гаразд» і «Скасувати» з метою уникнення випадкового закриття вікна при завершенні створення нового запису

source: Comments editor: Fix the formatting buttons not showing the current state correctly and fix some keyboard shortcuts not working when more than one comments editor is present in a single window
cs: Editor komentářů: Oprava formátovacích tlačítek, která nezobrazují správně aktuální stav, a oprava některých klávesových zkratek, které nefungují, když je v jednom okně více editorů komentářů
es: Editor de comentarios: Se corrigen los fallos por los que los botones de formato no mostraban el estado actual correctamente y algunos atajos de teclado no funcionaban cuando hay más de un editor de comentarios en una sola ventana
ru: Редактор комментариев: исправлены кнопки форматирования, неверно отображавшие текущее состояние, исправлены сочетания клавиш, не работавшие при наличии в одном окне более одного редактора комментариев.
uk: Редактор коментарів: виправлено помилку, пов'язану із тим, що кнопки форматування не показували належним чином поточний стан. Виправлено деякі клавіатурні скорочення, які не працювали, якщо у одному вікні було відкрито декілька панелей редагування коментарів.

source: Tag browser: Fix renaming of User categories in Virtual libraries
cs: Prohlížeč štítků: Oprava přejmenování Uživatelských kategorií ve Virtuálních knihovnách
es: Explorador de etiquetas: Se corrige el cambio de nombre de categorías de usuario en bibliotecas virtuales
ru: Браузер Тегов: исправлено переименование категорий пользователей в виртуальных библиотеках.
uk: Навігатор мітками: виправлено перейменування категорій користувача на віртуальні бібліотеки.

source: Make removing large numbers of custom column icons easier
cs: Usnadnění odebírání velkého počtu ikon vlastních sloupců
es: Se facilita la eliminación de un gran número de iconos de columna personalizados
ru: Упрощено удаление большого количества значков пользовательских столбцов
uk: Спрощено вилучення великої кількості нетипових піктограм стовпчиків.

source: 08 Oct, 2021
cs: 8. října 2021
es: 8 oct 2021
ru: 08 октября, 2021
uk: 8 жовтня 2021 року

source: Allow drag and drop of books onto formats in the Tag browser to convert them to that format
cs: Umožnění přetahování knih na formáty v Prohlížeči štítků pro jejich převod do daného formátu
es: Se permite arrastrar y soltar libros sobre los formatos del explorador de etiquetas para convertirlos a ese formato
ru: Разрешено перетаскивание книг в форматы в Браузере Тегов для преобразования их в этот формат
uk: Реалізовано можливість перетягування зі скиданням пунктів книг на пункти форматів на панелі навігації мітками з метою перетворення книг у відповідний формат

source: Allow creating sorts based on multiple columns (Add the Sort action to the toolbar via Preferences-&gt;Toolbars &amp; menus)
cs: Umožnění vytvářet řazení na základě více sloupců (Přidejte akci Seřadit na panel nástrojů prostřednictvím Předvolby-&gt;Panely nástrojů a nabídky)
es: Se permite ordenar según varias columnas. (Añada la acción Ordenar a la barra de herramientas en Preferencias &gt; Barras de herramientas y menús)
ru: Разрешено создание сортировок на основе нескольких столбцов (добавьте действие Сортировка на панель инструментов через Настройки-> Панели инструментов и меню)
uk: Уможливлено створення упорядкувань на основі вмісту декількох стовпчиків (можна додати пункт «Додати упорядковування» на панель інструментів за допомогою пункту меню «Налаштування -&gt; Панелі інструментів і меню»)

source: Edit book: When changing a paragraph to a heading if the cursor is adjacent to a paragraph tag but not inside any tags other than body, use the adjacent tag
cs: Upravit knihu: Při změně odstavce na nadpis, pokud kurzor sousedí se značkou odstavce, ale není uvnitř jiné značky než body, použít sousední značku
es: Modificar libro: Al cambiar un párrafo a encabezado, si el cursor está junto a una etiqueta de párrafo pero no dentro de una etiqueta distinta de &lt;body&gt;, se usa la etiqueta adyacente
ru: Редактор книг: при изменении абзаца на заголовок, если курсор находится рядом с тегом абзаца, но не внутри каких-либо тегов, кроме тела, использовать смежный тег
uk: Редагування книг: реалізовано використання сусіднього теґу при зміні форматування абзацу на заголовок, якщо курсор перебуває поряд із теґом абзацу, але поза іншими теґами, відмінними від body.

source: Auto adding: Run relevant plugins before reading metadata from the book. Matches behavior of manual adding
cs: Automatické přidávání: Spuštění příslušných modulů před načtením metadat z knihy. Odpovídá chování při ručním přidávání
es: Adición automática: Se ejecutan los complementos relevantes antes de leer los metadatos del libro. Esto obedece al comportamiento de la adición manual
ru: Автодобавление: запустить соответствующие плагины перед чтением метаданных из книги. Как при ручном добавлении
uk: Автододавання: реалізовано запуск відповідних додатків до читання метаданих з книги. Відповідає поведінці при додаванні вручну.

source: Content server: Fix category collapse by partition not working
cs: Server s obsahem: Oprava nefunkčního sbalení kategorie podle oddílu
es: Servidor de contenidos: Se corrige la contracción de categorías por partición
ru: Контент-сервер: исправление обрушения категории из-за того, что раздел не работает
uk: Сервер даних: відновлено працездатність згортання категорій за розділами.

source: Prevent Tab from causing focus to leave the Tag browser
cs: Zabránit tomu, aby klávesa Tab způsobila opuštění zaměření Prohlížeče štítků
es: Se evita que la tabulación ocasione que el foco abandone el explorador de etiquetas
ru: Предотвратить установку фокуса клавишей Tab при покидании Браузера тегов
uk: Усунено втрату фокусування на панелі навігації мітками унаслідок натискання клавіші Tab.

source: Edit book: See what changed: Fix non-BMP unicode characters causing highlighting of changed words to be slightly misplaced
cs: Upravit knihu: Podívejte se, co se změnilo: Oprava znaků unicode, které nejsou BMP, což způsobovalo, že zvýraznění změněných slov bylo mírně chybně umístěno
es: Modificar libro: Ver qué ha cambiado: Se corrige el fallo por el que los caracteres unicode fuera de PBM hacían que los resaltados de palabras modificadas se descolocaran
ru: Редактор книг: посмотреть, что изменилось: исправить символы Unicode, отличные от BMP, из-за чего выделение измененных слов было немного неуместным
uk: Редагування книг: перегляд змін: усунено незначну втрату позиції підсвічування внаслідок наявності відмінних від BMP символів unicode.

source: PDF Output: Fix a regression that broke conversion of comics that contain 1-bit images
cs: Výstup PDF: Oprava regrese, která poškodila převod komiksů obsahujících jednobitové obrázky
es: Salida PDF: Se corrige una regresión que estropeaba la conversión de cómics que contienen imágenes de 1 bit
ru: Вывод PDF: исправлена ​​регрессия, которая нарушала преобразование комиксов, содержащих 1-битные изображения.
uk: Виведення до PDF: усунено регресію, яка заважала перетворенню коміксів, які містять 1-бітові зображення.

source: Edit book: Fix pressing Ctrl+Tab inserting a tab at the start of a line instead of switching tabs
cs: Upravit knihu: Oprava stisknutí Ctrl+Tab, které vložilo tabulátor na začátek řádku namísto přepínání tabulátorů
es: Modificar libro: Se corrige el fallo por el que al pulsar Ctrl+Tab se insertaba una tabulación al principio de la línea en lugar de cambiar de pestaña
ru: Редактор книг: Исправлено нажатие Ctrl+Tab, вставляющее вкладку в начале строки вместо переключения вкладок
uk: Редагування книг: виправлено помилку, пов'язану із тим, що натискання Ctrl+Tab призводило до вставляння табуляції на початку рядка, замість перемикання вкладок.

source: Fix a regression in the previous release that caused identifiers set by some plugins to not be saved in the database
cs: Oprava regrese v předchozím vydání, která způsobila, že se identifikátory nastavené některými moduly neukládaly do databáze
es: Se corrige una regresión en la versión anterior que hacía que los identificadores establecidos por algunos complementos no se guardaran en la base de datos
ru: Исправлен регресс в предыдущем выпуске, из-за которого идентификаторы, установленные некоторыми плагинами, не сохранялись в базе данных.
uk: Усунено регресію попереднього випуску, пов'язану із тим, що ідентифікатори, встановлені деякими додатками, не зберігалися у базі даних.

source: Template language: Fix nesting composite columns sometimes failing
cs: Jazyk šablony: Oprava vnořování složených sloupců, které někdy selhávalo
es: Lenguaje de plantillas: Se corrige el fallo por el que las columnas compuestas anidadas fallaban a veces
ru: Язык шаблонов: исправлены ошибки при вложении составных столбцов
uk: Мова шаблонів: виправлено помилку під час вкладання складених стовпчиків.

source: 24 Sep, 2021
cs: 24. srpna 2021
ru: 24 сен, 2021
uk: 24 вересня 2021 року

source: Edit metadata dialog: Customize cover generation: Allow saving and loading cover generation settings as "themes"
cs: Dialogové okno Upravit metadata: Přizpůsobení generování obálky: Umožnění ukládání a načítání nastavení generování obálek jako „motivů
es: Diálogo de modificación de metadatos: Personalizar generación de portadas: Se permite guardar y cargar configuraciones de generación de portadas como «temas»
ru: Диалоговое окно Редактировать метаданные: Настроить создание обложек: разрешено сохранение и загрузка настроек создания обложек как «тем».
uk: Вікно редагування метаданих: налаштовування створення зображень обкладинок: уможливлено збереження та завантаження параметрів створення зображень обкладинок як «тем»

source: E-book viewer: Allow pressing the 0-9 keys to apply a quick highlight style
cs: Prohlížeč e-knih: Umožnění stisknutím kláves 0-9 použít styl rychlého zvýraznění
es: Visor de libros electrónicos: Se permite pulsar las teclas 0-9 para aplicar un estilo de resaltado rápido
ru: Просмотрщик электронных книг: нажатие клавиш 0–9 для применения стиля быстрого выделения
uk: Засіб перегляду книг: уможливлено натискання клавіш 0-9 для пришвидшення застосування стилю підсвічування

source: Book details panel: While clicking tags/authors/etc. holding down the Ctrl+Shift modifier keys now add the tag to the current search with "AND" instead of "OR" when using only Ctrl
cs: Panel Podrobnosti o knize: Při klikání na štítky, autory apod. se nyní při podržení modifikačních kláves Ctrl+Shift přidává štítek k aktuálnímu vyhledávání pomocí „AND“ namísto „OR“ při použití pouze klávesy Ctrl
es: Panel de detalles del libro: Al pulsar etiquetas, autores, etc., si se mantienen pulsadas las teclas Ctrl+Mayús se añade el elemento a la búsqueda actual con «Y» en lugar de «O» al pulsar sólo Ctrl
ru: Панель сведений о книге: нажатие на теги/авторов/и т. д. при удерживании клавиш-модификаторов Ctrl+Shift теперь добавляет тег в текущий поиск с помощью «И» вместо «ИЛИ» при использовании только Ctrl
uk: Панель подробиць щодо книги: у новій версії під час клацання на мітках, записах авторів тощо із утриманням натиснутою комбінації клавіш Ctrl+Shift мітка до поточного пошуку додається із використанням логічного «ТА» замість «АБО» при використанні лише Ctrl

source: Add an option to the preferences drop down menu to restart calibre without third party plugins
cs: Přidání volby do rozevírací nabídky předvoleb pro restartování Calibre bez modulů třetích stran
es: Se añade una opción al menú desplegable de preferencias para reiniciar calibre sin complementos de terceros
ru: Добавлен параметр в раскрывающееся меню настроек, чтобы перезапустить calibre без сторонних плагинов.
uk: До спадного меню налаштувань додано пункт перезапуску calibre без сторонніх додатків

source: Edit book: When renaming classes in style sheets only recognize class names preceded by a period
cs: Upravit knihu: Při přejmenovávání tříd v šablonách stylů rozpoznávat pouze názvy tříd, kterým předchází tečka
es: Modificar libro: Al cambiar el nombre de clases en hojas de estilo se reconocen sólo nombres de clase precedidos por un punto
ru: Редактор книг: при переименовании классов в таблицах стилей распознаются только имена классов, которым предшествует точка.
uk: Редагування книги: при перейменуванні класів у таблицях стилів реалізовано розпізнавання лише назв класів, які починаються з крапки

source: E-book viewer: Fix lookup in Google partially hidden due to change in Google results page markup
cs: Prohlížeč e-knih: Oprava částečně skrytého vyhledávání ve službě Google kvůli změně značení stránky s výsledky Google
es: Visor de libros electrónicos: Se corrige el fallo por el que la búsqueda en Google quedaba parcialmente oculta debido a cambios en el código de la página de resultados de Google
ru: Просмотрщик электронных книг: исправлена ​​ошибка, из-за которой поиск в Google частично скрыт из-за изменения разметки страницы результатов Google.
uk: Перегляд електронних книг: виправлено помилку, пов'язану із тим, що результати пошуку Google було частково приховано через зміну у розмітці сторінки результатів Google

source: Conversion dialog: Search replace expression builder: Fix incorrect search result highlighting when non-BMP unicode characters are present in the text
cs: Dialogové okno převodu: Nástroj pro sestavení výrazu pro hledání a nahrazení: Oprava nesprávného zvýraznění výsledku hledání, pokud jsou v textu přítomny jiné znaky než BMP unicode.
es: Diálogo de conversión: Creador de expresión de búsqueda: Se corrige el resaltado incorrecto de los resultados de búsqueda cuando hay caracteres unicode fuera del PBM en el texto
ru: Диалоговое окно конвертации: построитель выражений замены в поиске: исправлено некорректное выделение результатов поиска, когда в тексте присутствуют символы Unicode, отличные от BMP
uk: Діалогове вікно перетворення: засіб побудови виразу пошуку-заміни: виправлено помилкове підсвічування результатів пошуку, якщо у тексті є символи Unicode поза BMP (багатомовною площиною)
