Repository: debian-calibre/calibre
Catalog: translations-git/changelog/*.po
Languages: cs, es, ru, uk

source: Bulk metadata search and replace: Fix some regular expression causing errors with the new regex engine
cs: Hromadné hledání a nahrazování metadat: Oprava, kdy některé regulární výrazy způsobovaly chyby s novým modulem regulárních výrazů
es: Buscar y sustituir metadatos en masa: Se corrige el fallo por el que algunas expresiones regulares generaban un error con el nuevo motor de expresiones regulares
ru: Массовый поиск и замена метаданных: с помощью нового механизма регулярных выражений исправлены некоторые регулярные выражения, вызывавшие ошибки.
uk: Пакетний пошук із заміною у метаданих: виправлено формальний вираз, який спричиняв помилки при використанні із новим рушієм обробки формальних виразів

source: Fix a regression that broke application of plugboards when sending by e-mail
cs: Oprava regrese, která poškodila aplikaci zásuvných modulů při odesílání e-mailu
es: Se corrige una regresión que estropeó la aplicación de paneles de conexiones al enviar correos electrónicos
ru: Исправлена регрессия, из-за которой нарушалось применение плагинов при отправке по электронной почте
uk: Виправлено регресію, яка заважала застосуванню обробників при надсиланні даних електронною поштою

source: ODT Input: Fix a regression that broke conversion of ODT files with footnotes.
cs: Vstup ODT: Oprava regrese, která poškodila převod souborů ODT s poznámkami pod čarou.
es: Entrada ODT: Se corrige una regresión que estropeó la conversión de archivos ODT con notas a pie de página.
ru: Ввод ODT: исправлена регрессия, сломавшая преобразование ODT-файлов со сносками.
uk: Вхідні дані в ODT: виправлено регресію, яка заважала перетворенню файлів ODT із підрядковими примітками.

source: Viewer: Fix mouse wheel not working while selection bar is visible
cs: Prohlížeč: Oprava, kdy kolečko myši nefungovalo, když byl panel výběru viditelný
es: Visor: Se corrige el fallo por el que la rueda del ratón no funcionaba cuando la barra de selección está visible
ru: Просмотрщик: исправлено поведение колёсика мыши: не работало при отображении панели выбора
uk: Засіб перегляду: відновлено працездатність коліщатка миші, якщо відкрито панель вибору

source: Viewer: Fix selection popup bar not always close to mouse when ending select-to-drag
cs: Prohlížeč: Oprava, kdy se automaticky otevíraný panel výběru vždy nezavíral na myš při ukončení výběru k přetažení
es: Visor: Se corrige el fallo por el que la barra emergente no siempre aparece cerca del cursor al finalizar una selección por arrastre
ru: Просмотрщик: исправлена ​​ошибка, из-за которой всплывающая панель выделения не всегда приближалась к мыши при завершении перетаскивания выделения
uk: Засіб перегляду: виправлено помилку, пов'язану із тим, що контекстна панель вибору не завжди закривалася у відповідь на пересування вказівника миші при завершенні дії із позначення для перетягування

source: Fix calibre-server not exiting on Ctrl+C on Windows
cs: Oprava neukončování serveru Calibre na Ctrl+C ve Windows
es: Se corrige el fallo por el que calibre-server no se cerraba con Ctrl+C en Windows
ru: Исправлен не работающий по Ctrl+C выход из calibre-server в Windows.
uk: Виправлено помилку, пов'язану із тим, що сервер calibre не завершував роботу у відповідь на натискання Ctrl+C у Windows

source: Content server OPDS feeds: Fix error if the metadata for a book contains particular Unicode characters.
cs: Informační kanály OPDS Serveru s obsahem: Oprava chyby, pokud metadata pro knihu obsahují určité znaky Unicode.
es: Canales OPDS del servidor de contenidos: Se corrige un error si los metadatos de un libro contienen algunos caracteres Unicode concretos.
ru: OPDS каналы контент-сервера: исправлена ошибка, если метаданные книги содержат определённые символы Unicode.
uk: Подачі OPDS сервера даних: виправлено помилку, пов'язану із обробкою метаданих книги, які містять певні символи Unicode.

source: Edit book: Reports tool: Fix a regression that broke sorting.
cs: Úprava knihy: Oprava regrese, která poškodila řazení.
es: Modificar libro: Herramienta de informes: Se corrige una regresión que estropeó la ordenación.
ru: Редактор книг: инструмент отчетов: исправлен регресс, который нарушил сортировку.
uk: Редагування книг: інструмент звітів: виправлено регресію, яка заважала правильному сортуванню.

source: HTMLZ Output: Fix an error when converting a document that has SVG images
cs: Výstup HTMLZ: Oprava chyby při převodu dokumentu, který má obrázky SVG
es: Salida HTMLZ: Se corrige un error al convertir un documento que contiene imágenes SVG
ru: Вывод HTMLZ: исправлена ошибка во время преобразования документа с SVG-изображениями.
uk: Виведення даних до HTMLZ: виправлено помилку при перетворенні документів, які містять зображення SVG

source: 02 Oct, 2020
cs: 2. října 2020
es: 2 oct 2020
ru: 02 октября 2020
uk: 2 жовтня 2020 року

source: Enhancement: allow using templates in search expressions
cs: Vylepšení: Umožnění používání šablon ve vyhledávacích výrazech
es: Mejora: Se permite usar plantillas en las expresiones de búsqueda
ru: Улучшение: разрешено использование шаблонов в поисковых выражениях.
uk: Удосконалення: уможливлено використання шаблонів у виразах для пошуку

source: Viewer lookup panel: Add a checkbox to disable automatic update of lookup when the selected text changes.
cs: Panel vyhledávání prohlížeče: Přidání zaškrtávacího políčka pro zakázání automatické aktualizace vyhledávání, když se vybraný text mění.
es: Panel de búsqueda del visor: Se añade una casilla para desactivar la actualización automática cuando la selección de texto cambia.
ru: Панель поиска в просмотрщике: добавлен флажок, чтобы отключить автоматическое обновление поиска при изменении выделенного текста.
uk: Панель пошуку засобу перегляду: додано пункт для вимикання автоматичного оновлення результатів пошуку при зміні позначеного фрагмента тексту.

source: Viewer: Allow skipping the confirmation when using the remove highlight button in the popup bar.
cs: Prohlížeč: Umožnění přeskočení potvrzení v automaticky otevíraném panelu, při použití tlačítka odebrání zvýraznění.
es: Visor: Se permite evitar la confirmación al usar el botón de eliminar resaltado en la barra emergente.
ru: Просмотрщик: разрешён пропуск подтверждения при использовании кнопки удаления выделения на всплывающей панели.
uk: Засіб перегляду: уможливлено пропускання підтвердження при використанні кнопки вилучення підсвічування на контекстній панелі.

source: ToC Editor: Fix bulk rename of entries not working
cs: Editor obsahu: Oprava nefunkčnosti hromadného přejmenování položek
es: Editor de índice: Se corrige el fallo por el que el cambio de nombre en masa no funcionaba
ru: Редактор оглавления: исправлено неработающее массовое переименование записей.
uk: Редактор змісту: виправлено пакетне перейменовування записів.

source: Linux: Fix right clicking on system tray icon not working
cs: Linux: Oprava nefunkčnosti kliknutí pravým tlačítkem mši na ikonu hlavního panelu systému
es: Linux: Se corrige el fallo por el que el botón derecho sobre el icono de la bandeja del sistema no funcionaba
ru: Linux: исправлен неработавший щелчок правой кнопкой по значку в системном лотке.
uk: Linux: відновлено працездатність клацання правою кнопкою миші на піктограмі у лотку системи.

source: Fix User category based searches unreliable dues to caching issues
cs: Oprava nespolehlivosti hledání založených na uživatelské kategorii kvůli problémům s ukládáním do mezipaměti
es: Se corrige el fallo por el que las búsquedas basadas en categorías de usuario no eran fiables debido a problemas de caché
ru: Исправлен ненадёжный поиск по категориям пользователей из-за проблем с кешированием
uk: Виправлено пов'язану із проблемами з кешуванням помилку при пошуку на основі категорій користувача.

source: PDF Output: Don't fail if the input document has an html file identified as the cover
cs: Výstup PDF: Neselhávat, pokud má vstupní dokument soubor html identifikovaný jako obálku
es: Salida PDF: Se evita el fallo si el documento de entrada tiene un documento html identificado como portada
ru: Вывод PDF: исправлен сбой, если во входном документе в качестве обложки указан HTML-файл.
uk: Виведення до PDF: усунено аварійне завершення обробки, якщо вхідний документ містить файл HTML, який визначено як обкладинку.

source: Catalog generation: Fix a regression that broke generating catalogs if books with no comments are present.
cs: Generování katalogu: Oprava regrese, která poškodila generování katalogů, pokud byla přítomna kniha bez komentářů.
es: Generación de catálogos: Se corrige una regresión que estropeaba la generación de catálogos si había libros sin comentarios presentes.
ru: Генерация каталогов: исправлена ​​регрессия, из-за которой не создавались каталоги при наличии книг без комментариев.
uk: Засіб створення каталогів: виправлено регресію, яка не давала програмі створювати каталоги, якщо було виявлено книги без коментарів.

source: Windows: Fix error on first run of calibre after install/upgrade
cs: Windows: Oprava chyby při prvním spuštění Calibre po instalaci nebo aktualizaci.
es: Windows: Se corrige un error al ejecutar calibre por primera vez después de instalar o actualizar
ru: Windows: исправлена ошибка при первом запуске calibre после установки / обновления.
uk: Windows: виправлено помилку під час першого запуску calibre після встановлення або оновлення.

source: Viewer: Fix copy to clipboard button in toolbar not working
cs: Prohlížeč: Oprava nefunkčnosti tlačítka v panelu nástrojů pro kopírování do schránky
es: Visor: Se corrige el fallo por el que el botón de copiar al portapapeles en la barra de herramientas no funcionaba
ru: Просмотрщик: исправлена ​​ошибка, из-за которой кнопка копирования в буфер обмена на панели инструментов не работала
uk: Засіб перегляду: відновлено працездатність кнопки копіювання до буфера обміну на панелі інструментів.

source: Viewer: Fix copy to clipboard not copying text as HTML to clipboard in addition to plain text
cs: Prohlížeč: Oprava, kdy kopírování do schránky nekopírovalo text do schránky jako HTML navíc k prostému textu
es: Visor: Se corrige el fallo por el que la función de copiar al portapapeles no copiaba el texto como HTML además de como texto sencillo
ru: Просмотрщик: исправлено копирование в буфер обмена, не копирующее текст как HTML в буфер обмена в дополнение к обычному тексту
uk: Засіб перегляду: виправлено помилку, пов'язану із тим, що дія з копіювання до буфера обміну даними не копіювала текст як HTML.

source: macOS: Fix some drop down menus such as in the ToC editor and cover generation in the Edit metadata dialog not working
cs: macOS: Oprava nefunkčnosti některých rozevíracích nabídek, například v editoru obsahu a generování obálky v dialogovém okně Upravit metadata
es: macOS: Se corrige el fallo por el que no funcionaban algunos menús desplegables, como en el editor de índice o la generación de portadas en el diálogo de modificación de metadatos
ru: macOS: исправлены некоторые неработающие выпадающие меню, например, в редакторе оглавления, и создание обложек в диалоговом окне редактирования метаданных.
uk: macOS: відновлено працездатність спадних меню, зокрема спадних меню редактора змісту та засобу створення обкладинок, у діалоговому вікні редагування метаданих.

source: 25 Sep, 2020
cs: 25. září 2020
ru: 25 сентября 2020
uk: 25 вересня 2020 року

source: For details on the major changes in calibre between 4.0 and 5.0, see <a href="%(h0)s">%(h0)s</a>
cs: Po podrobnosti o hlavních změnách v Calibre mezi 4.0 a 5.0 navštivte<a href="%(h0)s">%(h0)s</a>
es: Para ver detalles sobre los principales cambios entre calibre 4.0 y 5.0, ver <a href="%(h0)s">%(h0)s</a>
ru: Подробнее об основных изменениях между calibre 4.0 и 5.0 здесь: <a href="%(h0)s">%(h0)s</a>
uk: Докладний опис основних змін у calibre між версіями 4.0 і 5.0 наведено тут: <a href="%(h0)s">%(h0)s</a>

source: E-book viewer: Add support for highlighting
cs: Prohlížeč e-knih: Přidána podpora pro zvýraznění
es: Visor de libros electrónicos: Se añade posibilidad de resaltar texto
ru: Просмотрщик электронных книг: добавлена поддержка выделений
uk: Засіб перегляду книг: додано підтримку підсвічування

source: E-book viewer: Add support for right-to-left and vertical text
cs: Prohlížeč e-knih: Přidána podpora pro pravolevý text a svislý text
es: Visor de libros electrónicos: Se añade compatibilidad para texto de derecha a izquierda y en vertical
ru: Просмотрщик электронных книг: добавлена поддержка написанного справа налево и вертикального текста
uk: Засіб перегляду книг: додано підтримку запису тексту справа ліворуч та вертикального запису

source: Switch calibre to Python 3. This means that some no longer maintained third party plugins will not work. See <a href="%(h0)s">%(h0)s</a>
cs: Přepnutí Calibre na Python 3: Toto znamená , že některé již neudržované moduly třetích stran nebudou fungovat. Podívejte se na <a href="%(h0)s">%(h0)s</a>
es: Cambio de calibre a Python 3. Esto significa que algunos complementos de terceros que no tienen mantenimento no funcionarán. Véase <a href="%(h0)s">%(h0)s</a>
ru: Переход calibre на Python 3. Это означает, что некоторые из оставшихся без поддержки сторонних плагинов перестанут работать. См.: <a href="%(h0)s">%(h0)s</a>
uk: calibre переписано на Python 3. Це означає, що деякі сторонні додатки, у яких немає супровідників, не працюватимуть. Див. <a href="%(h0)s">%(h0)s</a>

source: Dark mode support for the Content server and E-book viewer user interfaces
cs: Podpora tmavého režimu pro uživatelské rozhraní Serveru s obsahem a Prohlížeče e-knih
es: Posibilidad de modo oscuro para las interfaces de usuario del servidor de contenidos y del visor de libros electrónicos
ru: Поддержка тёмного режима для пользовательских интерфейсов контент-сервера и просмотрщика электронных книг.
uk: Підтримка темного режиму в інтерфейсах сервера даних та засобу перегляду електронних книг

source: Content server's in-browser viewer now supports bookmarking. Bookmarks and highlights are auto-synced across devices.
cs: Prohlížeč Serveru s obsahem v internetovém prohlížeči nyní podporuje záložky. Záložky a zvýraznění jsou automaticky synchronizovány napříč zařízeními.
es: El visor del navegador del servidor de contenidos admite marcadores. Los marcadores y los resaltados se sincronizan automáticamente entre dispositivos.
ru: Браузерный просмотрщик контент-сервера теперь поддерживает создание закладок. Закладки и выделения автоматически синхронизируются между устройствами.
uk: На панелі сервера даних для перегляду у вікні браузера передбачено підтримку закладок. Закладки і підсвічування автоматично синхронізуються між пристроями.

source: Regular expression engine used for searching the book list and reading metadata from filenames has been made more powerful.
cs: Modul regulárních výrazů použitý pro hledání v seznamu knih a čtení metadat z názvů souborů je nyní výkonnější.
es: El motor de expresiones regulares usado para buscar en la lista de libros y leer metadatos de los nombres de archivo es ahora más potente.
ru: Движок регулярных выражений, использующийся для поиска в списке книг и чтения метаданных из имён файлов, стал ещё мощнее.
uk: Рушій обробки формальних виразів для пошуку у списках книг та читання метаданих з назв файлів значно удосконалено.

source: Version 5.0.1 fixes a bug in 5.0.0 that broke connecting to devices on macOS
cs: Verze 5.0.1 opravuje chybu v 5.0.0, která poškodila připojování k zařízením na macOS
es: La versión 5.0.1 corrige un error en 5.0.0 que hacía que no funcionase la conexión a dispositivos en macOS
ru: Версия 5.0.1 исправляет ошибку в 5.0.0, сломавшую подключение к устройствам в macOS.
uk: У версії 5.0.1 виправлено ваду версії 5.0.0, яка заважала встановленню з'єднання з пристроями у macOS

source: 21 Aug, 2020
cs: 21. srpna 2020
es: 21 ago 2020
ru: 21 августа 2020
uk: 21 серпня 2020 року

source: Kobo driver: Add support for new firmware. Also add recognition of 'Kobo Plus' subscription books
cs: Ovladač Kobo: Přidána podpora pro nový firmware. Také přidáno rozpoznání knih předplatného ‚Kobo Plus‘
es: Controlador Kobo: Se añade compatibilidad para el nuevo «firmware». También se reconocen los libros de la suscripción «Kobo Plus»
ru: Драйвер Kobo: добавлена поддержка новой прошивки. Также добавлено распознавание книги из подписки «Kobo Plus»
uk: Драйвер Kobo: додано підтримку нової мікропрограми. Також додано розпізнавання передплачених книжок «Kobo Plus»

source: Edit book: Allow customizing the base background/foreground and link colors for the preview window.
cs: Úprava knihy: Umožnění přizpůsobení základního pozadí a popředí a barev odkazů pro okno náhledu.
es: Modificar libro: Se permite personalizar los colores de fondo y primer plano básicos y de enlaces para la ventana de vista previa.
ru: Редактор книг: разрешено настраивать основной фон/передний план и цвет ссылок в окне предварительного просмотра.
uk: Редагування книг: уможливлено налаштовування базових кольорів тла/тексту та посилань у вікні попереднього перегляду.

source: Quickview panel: Add actions to the context menu to search for book in library, open in E-book viewer, etc.
cs: Panel Rychlého náhledu: Přidání akcí do místní nabídky pro hledání knihy v knihovně, otevření v Prohlížeči e-knih atd.
es: Panel de vista rápida: Se añaden acciones al menú contextual para buscar un libro en la biblioteca, abrir en el visor de libros electrónicos, etc.
ru: Панель быстрого просмотра: в контекстное меню добавлены действия для поиска книги в библиотеке, открытия в читалке электронных книг и т. п.
uk: Панель швидкого перегляду: додано пункти контекстного меню для пошуку книги у бібліотеці, відкриття у засобі перегляду тощо.

source: Allow forcing calibre to remember the column width for the On device column by right clicking the header of the column
cs: Povolení vynucení, aby si Calibre zapamatovalo šířku sloupce pro sloupec V zařízení kliknutím pravým tlačítkem myši na záhlaví sloupce
es: Se permite hacer que calibre recuerde la anchura de columna para la columna «En el dispositivo», pulsando con el botón derecho sobre en encabezado de columna
ru: Разрешено принудительное запоминание calibre ширины столбца «На устройстве» с помощью щелчка правой кнопкой мыши его по заголовку
uk: Уможливлено примусове запам'ятовування calibre ширини стовпчика для стовпчика на пристрої — достатньо клацнути правою кнопкою миші на заголовку стовпчика

source: Template language: Add functions to perform math operations to convert fractional numbers to integers
cs: Jazyk šablony: Přidání funkcí pro provádění matematických operací pro převod zlomků na celá čísla
es: Lenguaje de plantillas: Se añaden funciones para operaciones que convierten números decimales en enteros
ru: Язык шаблонов: добавлены функции для выполнения математических операций по преобразования дробных чисел в целые
uk: Мова шаблонів: додано функції для виконання математичних операцій із перетворення дробових чисел на цілі

source: Content server: Fix Esc key not working in several views.
cs: Server s obsahem: Oprava nefunkčnosti klávesy Esc v několika zobrazeních.
es: Servidor de contenidos: Se corrige el fallo por el que la tecla Esc no funcionaba en varias vistas.
ru: Контент-сервер: исправлена не срабатывавшая в некоторых случаях клавиша Esc.
uk: Сервер даних: виправлено непрацездатність клавіші Esc на декількох панелях перегляду.

source: Fix unable to delete default value for custom columns of boolean type, once set
cs: Oprava nemožnosti odstranit výchozí hodnotu pro vlastní sloupce logického typu, jakmile je nastavena
es: Se corrige el fallo por el que el valor predeterminado para las columnas de tipo booleano no podía borrarse una vez establecido
ru: Исправлена невозможность удаления значения по умолчанию для пользовательских столбцов логического типа после установки
uk: Виправлено неможливість вилучення типового значення для нетипових стовпчиків булевого типу після встановлення

source: EPUB Output: When splitting don't consider files with only a single character empty
cs: Výstup EPUB: Při rozdělení nepovažovat soubory s pouze jedním znakem za prázdné
es: Salida EPUB: Al dividir, no se considera que los archivos con un solo carácter están vacíos
ru: Вывод EPUB: файлы с одним символом не считаются пустыми при разделении.
uk: Виведення до EPUB: усунено обробку файлів, які складаються з одного символу, при поділі як порожніх

source: Comments editor: Fix syntax coloring for HTML view in dark mode
cs: Editor komentářů: Oprava obarvování syntaxe pro zobrazení HTML v tmavém režimu
es: Editor de comentarios: Se corrige el coloreado de sintaxis para la vista HTML en modo oscuro
ru: Редактор комментариев: исправлена подсветка синтаксиса HTML в тёмном режиме.
uk: Редактор коментарів: виправлено синтаксичне розфарбовування для перегляду HTML у темному режимі

source: Book list: When a series column is not wide enough, elide text in the middle so that the series number is visible
cs: Seznam knih: Když není sloupec série dostatečně široký, vynechat text uprostřed, aby bylo vidět čísla v sérii
es: Lista de libro: Cuando la columna de serie no tiene anchura suficiente, se omite el texto central para que el número de serie sea visible
ru: Список книг: когда столбец «Серии» недостаточно широк, текст сокращается посередине, чтобы был виден номер в серии
uk: Список книг: якщо стовпчик циклу є недостатньо широким, реалізовано скорочення середньої частини тексту, щоб номер у циклі лишався видимим

source: {0} by {1}
cs: {0} od {1}
es: {0} por {1}
