Repository: debian-calibre/calibre
Catalog: translations-git/changelog/*.po
Languages: cs, es, ru, uk

source: Fix a regression preventing using a non-integer value for the tweak to change book details font size
es: Se corrige una regresión que impedía el uso de valores no enteros para el ajuste que cambia el tamaño de letra en los detalles del libro
ru: Исправлена регрессия, не позволяющая использовать нецелое значение для изменения размера шрифта сведений о книге.
uk: Усунено регресію, яка заважала використанню нецілих значень коригування для зміни розміру шрифту у параметрах книги

source: Fix moving library not moving the full text search index
es: Se corrige el fallo por que al mover una biblioteca no se movía el índice de búsqueda de texto completo
ru: Исправлена ​​​​ошибка, из-за которой при перемещении библиотеки не перемещался индекс полнотекстового поиска.
uk: Виправлено помилку, пов'язану із тим, що пересування бібліотеки не призводило до пересування покажчика повнотекстового пошуку

source: Fix some custom icons in the calibre config directory not overriding the theme/builtin icons
es: Se corrige el fallo por el que algunos iconos personalizados en el directorio de configuración de calibre no reemplazaban los iconos predefinidos o del tema
ru: Исправлены некоторые пользовательские значки в каталоге конфигурации calibre, не переопределяющие значки темы/встроенные.
uk: Виправлено помилку, пов'язану із тим, що деякі нетипові піктограми у каталозі налаштувань calibre не мали вищого пріоритету за піктограми теми та вбудовані піктограми

source: Linux installer: Fix glibc version check also being done when installing older versions
es: Instalador de Linux: Se corrige el fallo por el que la comprobación de la versión de glibc también se hacía al instalar versiones antiguas
ru: Установщик Linux: исправление проверки версии glibc, также выполняемой при установке более старых версий.
uk: Засіб для встановлення у Linux: виправлено перевірку версії glibc, яка виконувалася при встановленні застарілих версій

source: Windows installer: Refuse to install on Windows 8 as thanks to Qt 6 calibre 6 does not work on Windows 8
es: Instalador de Windows: Se deniega la instalación en Windows 8, ya que gracias a Qt 6 calibre 6 no funciona en Windows 8
ru: Установщик Windows: отказ от установки на Windows 8, так как благодаря Qt 6 calibre 6 не работает на Windows 8
uk: Засіб для встановлення у Windows: реалізовано відмову у встановленні у Windows 8, оскільки через Qt 6 calibre 6 не працює у Windows 8

source: Update the BigBookSearch metadata plugin for website changes
es: Se actualiza el complemento de metadatos BigBookSearch debido a cambios en la web
ru: Обновлён плагин метаданных BigBookSearch - изменения веб-сайта
uk: Оновлено додаток метаданих BigBookSearch відповідно до змін на сайті

source: 11 Jul, 2022
ru: 11 июля 2022
uk: 11 липня 2022 року

source: For details on the major changes in calibre between 6.0 and 5.0, see <a href="%(h0)s">%(h0)s</a>
es: Para ver detalles sobre los principales cambios entre calibre 6.0 y 5.0, ver <a href="%(h0)s">%(h0)s</a>
ru: Подробнее об основных изменениях calibre между 6.0 и 5.0 см. <a href="%(h0)s">%(h0)s</a>
uk: Докладний опис основних змін у calibre між версіями 6.0 і 5.0 наведено тут: <a href="%(h0)s">%(h0)s</a>

source: Full text search: You can now search the entire text of all books in your calibre library
es: Búsqueda de texto completo. Ahora puede buscar en el texto completo de todos los libros de la biblioteca de calibre
ru: Полнотекстовый поиск: теперь поиск выполняется по всему тексту всех книг в библиотеке calibre.
uk: Повнотекстовий пошук: у новій версії ви можете шукати у всьому тексті усіх книг у бібліотеці calibre

source: Support for new CPU architectures: Apple Silicon and ARM64 on Linux. Support for 32bit CPUs has been dropped because Qt 6 does not support them
es: Compatibilidad con nuevas arquitecturas de CPU: Apple Silicon y ARM64 en Linux. La compatibilidad con CPUS de 32 bits se ha eliminado porque Qt 6 carece de ella
ru: Поддержка новых архитектур ЦП: Apple Silicon и ARM64 в Linux. Поддержка 32-битных процессоров прекращена, поскольку Qt 6 их не поддерживает.
uk: Підтримка нових архітектур процесорів: Apple Silicon і ARM64 у Linux. Підтримку 32-бітових процесорів припинено, оскільки цю підтримку не передбачено у Qt 6

source: Dark mode in calibre is now controlled via a setting in Preferences-&gt;Look &amp; feel rather than an environment variable
es: El modo oscuro de calibre se controla ahora mediante una configuración en Preferencias &gt; Apariencia en lugar de una variable de entorno
ru: Тёмный режим в calibre теперь управляется с помощью настройки в меню «Настройки» -> «Внешний вид», а не с помощью переменной среды.
uk: Темним режимом у новій версії calibre можна керувати за допомогою пункту на сторінці «Налаштування-&gt;Вигляд та поведінка», а не за допомогою змінної середовища

source: Allow choosing different icon themes for light and dark mode in Preferences-&gt;Look &amp; feel
es: Se permite elegir diferentes temas de iconos para los modos claro y oscuro en Preferencias &gt; Apariencia
ru: Разрешено выбирать разные темы значков для светлого и тёмного режима в «Настройки» -> «Внешний вид».
uk: Уможливлено вибір різних тем піктограм для світлого і темного режимів за допомогою сторінки «Налаштування-&gt;Вигляд та поведінка»

source: Upgrade calibre to use Qt 6. This means that some no longer maintained third party plugins may not work, though most plugins have already been ported
es: Se actualiza calibre para usar Qt 6. Esto significa que algunos complementos de terceros sin mantenimiento pueden dejar de funcionar, aunque la mayoría de los complementos ya se han actualizado
ru: Обновите calibre для использования Qt 6. Некоторые уже не поддерживаемые сторонние плагины, могут не заработать, хотя большинство плагинов уже портированы.
uk: Оновлено calibre з метою використання бібліотек Qt 6. Це означає, що деякі сторонні додатки без супровідників не працюватимуть, хоча більшість додатків вже портовано

source: 17 Jun, 2022
cs: 17. června 2022
ru: 17 июня 2022
uk: 17 червня 2022 року

source: Amazon metadata download: Add an option to prefer the Kindle edition when multiple book types are returned by the search (Preferences-&gt;Metadata download-&gt;Configure the Amazon plugin)
cs: Stahování metadat Amazon: Přidání volby pro upřednostnění vydání pro Kindle, pokud je při vyhledávání vráceno více typů knih (Předvolby-&gt;Stahování metadat-&gt;Konfigurovat modul Amazon)
es: Descarga de metadatos de Amazon: Se añade una opción para preferir la edición Kindle cuando una búsqueda devuelve varios tipos de libros (Preferencias &gt; Descarga de metadatos &gt; Configurar el complemento de Amazon)
ru: Загрузка метаданных Amazon: добавлена возможность отдать предпочтение версии Kindle, когда поисковик возвращает несколько типов книг (Настройки-> Загрузка метаданных-> Настроить подключаемый модуль Amazon).
uk: Отримання метаданих Amazon: додано пункт для встановлення пріоритетності видання Kindle, якщо пошуком повернуто декілька типів книг (Налаштування-&gt;Отримання метаданих-&gt;Налаштувати додаток Amazon)

source: Kobo driver: Support for updated firmware
cs: Ovladač Kobo: Podpora pro aktualizovaný firmware
es: Controlador Kobo: Compatibilidad con «firmware» actualizado
ru: Драйвер Kobo: поддержка обновлённой прошивки
uk: Драйвер Kobo: реалізовано підтримку оновленої мікропрограми

source: Allow customizing how yes/no columns are displayed (Preferences-&gt;Add your own columns)
cs: Umožnění přizpůsobení způsobu zobrazení sloupců ano/ne (Předvolby-&gt;Přidat své vlastní sloupce)
es: Se permite personalizar cómo se muestran las columnas de sí o no (Preferencias &gt; Añadir columnas personalizadas)
ru: Разрешена настройка отображения столбцов да/нет (Настройки->Добавить собственные столбцы)
uk: Уможливлено налаштовування способу показу стовпчиків «так/ні» (Налаштування-&gt;Додати власні стовпчики)

source: Manage tags dialog: If tags are present in the add tags input when OK is clicked, add them automatically, without needing to click the plus button first
cs: Dialogové okno Správa štítků: Pokud jsou ve vstupu pro přidání štítků přítomny štítky, po kliknutí na tlačítko OK se přidají automaticky, aniž by bylo nutné nejprve kliknout na tlačítko plus
es: Diálogo de administración de etiquetas: Si hay etiquetas presentes en la entrada de añadir etiquetas cuando se pulsa el botón de aceptar, se añaden automáticamente, sin necesidad de pulsar antes el botón más.
ru: Диалоговое окно «Управление тегами»: если теги присутствуют во вводе «Добавить теги» при нажатии кнопки «ОК», добавлять их автоматически, без необходимости сначала нажимать кнопку «плюс».
uk: Вікно керування мітками: якщо у полі введення додавання мітки є мітки, і натиснуто кнопку «Гаразд», мітки буде додано автоматично, без потреби у натисканні кнопки з плюсом

source: Edit book: Live CSS: Fix @namespace rules causing jumping to rule definition to go to the wrong definition
cs: Upravit knihu: Živé CSS: Oprava pravidel @namespace způsobující přechod na špatnou definici při přeskočení na definici pravidla
es: Modificar libro: CSS en vivo: Se corrige el fallo por el que las reglas @namespace hacían que el salto a la definición de regla fuese a una definición incorrecta.
ru: Редактор книг: Live CSS: исправление правил @namespace, из-за которых переход к определению правила приводил к неправильному определению.
uk: Редагування книги: інтерактивні CSS: виправлено помилку, пов'язану із тим, що правила @namespace спричиняли перехід до визначення не того правила

source: Workaround for Apple bug in macOS 13 that prevents device detection
cs: Vyřešení chyby společnosti Apple v macOS 13, která brání detekci zařízení
es: Solución que esquiva el fallo de Apple en macOS 13 que evita la detección de dispositivos
ru: Обходной путь для ошибки Apple в macOS 13, которая препятствует обнаружению устройства
uk: Реалізовано обхідний код для проблеми у macOS 13, яка заважає визначенню пристрою

source: Don't use commas in filenames when sending to pbsync and kindle email addresses
cs: Nepoužívání čárek v názvech souborů při odesílání na e-mailové adresy pbsync a kindle
es: No se usan comas en nombres de archivo al enviar a las direcciones de correo electrónico pbsync y kindle
ru: Не использовать запятые в именах файлов при отправке на адреса электронной почты pbsync и kindle.
uk: Усунено використання ком у назвах файлів при надсиланні до pbsync та на адреси електронної пошти kindle

source: Edit book: When quitting while a save is in progress and the save completes while the confirmation popup is visible, don't abort the quit.
cs: Upravit knihu: Nepřerušovat ukončování při ukončování během ukládání, kdy se ukládání dokončí, zatímco je viditelné automaticky otevírané okno s potvrzením
es: Modificar libro: Al salir mientras se está guardando y el guardado se completa mientras el la ventana de confirmación está visible, no se aborta la salida.
ru: Редактор книг: при выходе во время сохранения, когда сохранение завершается, не прерывать выход пока отображается всплывающее окно подтверждения.
uk: Редагування книг: при виході з програми під час процедури збереження даних і завершенні зберігання при видимому контекстному вікні підтвердження усунено переривання процедури виходу з програми.

source: 27 May, 2022
cs: 27. května 2022
ru: 27 мая, 2022
uk: 27 травня 2022 року

source: Kobo driver: Allow using templates to generate collections
cs: Ovladač Kobo: Umožnění používání šablon pro generování kolekcí
es: Controlador Kobo: Se permite la utilización de plantillas para generar colecciones
ru: Драйвер Kobo: разрешено использование шаблонов для создания коллекций
uk: Драйвер Kobo: уможливлено використання шаблонів для створення збірок

source: Book details popup: Double clicking on the cover now uses calibre's internal image viewer. Right click on the cover to open it with another program.
cs: Automaticky otevírané okno Podrobnosti o knize: Poklepání na obálku nyní používá interní prohlížeč obrázků Calibre. Kliknutím pravým tlačítkem myši na obálku ji otevřete v jiném programu.
es: Cuadro emergente de detalles del libro. Al pulsar dos veces sobre la portada ahora se usa el visor de imágenes interno de calibre. Pulsar con el botón derecho sobre la portada para abrirla con otro programa.
ru: Всплывающее окно сведений о книге: Двойной щелчок по обложке теперь использует встроенную программу просмотра изображений calibre. Щелчок правой кнопкой мыши на обложке открывает её в другой программе.
uk: Контекстна панель подробиць щодо книги: у відповідь на подвійне клацання на обкладинці нова версія відкриває вбудований засіб перегляду зображень calibre. Клацніть правою кнопкою миші на обкладинці, щоб відкрити її за допомогою іншої програми.

source: Fix Book details blank when switching from device view to library view
cs: Oprava prázdných Podrobností o knize při přepnutí ze zobrazení zařízení na zobrazení knihovny
es: Se corrige el fallo por el que los detalles del libro aparecían en blanco al cambiar de la vista de dispositivo a la de biblioteca
ru: Исправлено: Сведения о книге были пустыми при переключении с представления устройства на представление библиотеки
uk: Виправлено помилку, яку було пов'язано зі спорожненням панелі подробиць щодо книги при перемиканні з перегляду пристрою на перегляд бібліотеки

source: TXT Input: Fix a regression in 5.39 that caused the option to remove indents also removing blank lines
cs: Vstup TXT: Oprava regrese v 5.39, která způsobovala, že volba pro odebrání odsazení odebírala i prázdné řádky
es: Entrada TXT: Se corrige una regresión en 5.39 que hacía que la opción para eliminar sangrías eliminara también líneas en blanco
ru: Ввод TXT: исправление регрессии в 5.39, из-за которой опция удаления отступов также удаляла пустые строки
uk: Вхідні дані TXT: виправлено регресію у версії 5.39, яка спричиняла вилучення порожніх рядків при використанні пункту вилучення відступів

source: E-book viewer: Fix incorrect sorting of highlights from the first internal file of a book
cs: Prohlížeč e-knih: Oprava nesprávného řazení zvýraznění z prvního interního souboru knihy
es: Visor de libros electrónicos: Se corrige el orden incorrecto de resaltados del primer archivo interno de un libro
ru: Просмотр электронных книг: исправлена ​​неправильная сортировка выделений из первого внутреннего файла книги.
uk: Засіб перегляду книг: виправлено помилкове упорядкування підсвічувань з першого вбудованого файла книги

source: 03 May, 2022
cs: 3. května 2022
es: 3 may 2022
ru: 03 мая, 2022
uk: 3 травня 2022 року

source: E-book viewer: Ignore accents when doing a search
cs: Prohlížeč e-knih: Ignorování diakritiky při vyhledávání
es: Visor de libros electrónicos: Se ignoran los acentos al realizar una búsqueda
ru: Просмотр электронных книг: игнорировать диакритические знаки при поиске
uk: Засіб перегляду книг: реалізовано ігнорування акцентів при пошуку

source: Book list searching: Ignore punctuation when searching. So that, for example, Gravitys will match Gravity's
cs: Vyhledávání v seznamu knih: Ignorování interpunkce při vyhledávání. Takže například Gravitys bude odpovídat Gravity's
es: Búsqueda en la lista de libros: Se ignora la puntuación al buscar. De modo que, por ejemplo, Gravitys coincidirá con Gravity's
ru: Поиск по списку книг: Игнорировать знаки препинания при поиске. Так что, например, Gravitys будет соответствовать Gravity's
uk: Пошук у списку книг: реалізовано ігнорування пунктуації під час пошуку. Отже, наприклад, можна шукати «Gravitys», щоб знайти «Gravity's»

source: Show the text used for marking books in the tooltip
cs: Zobrazení textu použitého pro označení knih v popisku tlačítka
es: Se muestra el texto utilizado para marcar libros en la ayuda emergente
ru: Показывать текст, используемый для маркировки книг во всплывающей подсказке
uk: Реалізовано показ тексту позначок книг на панелі підказки

source: Edit book: Reduce memory consumption by the checkpoint system when doing operations that involve parsing all book files
cs: Upravit knihu: Snížení spotřeby paměti systémem kontrolních bodů při operacích, které zahrnují analýzu všech souborů knih
es: Modificar libro: Se reduce el consumo de memoria por parte del sistema de hitos al realizar operaciones que implican analizar todos los archivos del libro
ru: Редактор книг: Уменьшено потребление памяти системой контрольных точек при выполнении операций, связанных с разбором всех файлов книг
uk: Редагування книг: зменшено споживання пам'яті створенням контрольної точки системи при виконання дій, які призводять до обробки усіх файлів книг

source: Amazon metadata download: Fix titles starting with [ being ignored
cs: Stažení metadat Amazon: Oprava ignorování názvů začínajících na [
es: Descarga de metadatos de Amazon: Se corrigen el fallo por el que se ignoraban los títulos que comienzan por [
ru: Загрузка метаданных Amazon: исправлены игнорировавшиеся заголовки, начинающиеся с [
uk: Отримання метаданих Amazon: усунено ігнорування заголовків, які починаються з [

source: Edit metadata dialog: Undo not working correctly in identifiers field
cs: Dialogové okno Upravit metadata: Nesprávná funkčnost Zpět v poli identifikátorů
es: Diálogo de modificación de metadatos: Deshacer no funciona correctamente en el campo de identificadores
ru: Диалог редактирования метаданных: отмена неверно работала в поле идентификаторов
uk: Редагування метаданих: виправлено помилкову роботу скасування у полі ідентифікаторів

source: Fix viewing LRF files not working
cs: Oprava nefunkčního zobrazení souborů LRF
es: Se corrige el fallo por el que la visualización de archivos LRF no funcionaba
ru: Исправлен неработающий просмотр файлов LRF
uk: Виправлено помилку, яку було пов'язано із неможливістю перегляду файлів LRF

source: PDF Output: Fix an error on some invalid CSS in the input document
cs: Výstup PDF: Oprava chyby u některých neplatných CSS ve vstupním dokumentu
es: Salida PDF: Se corrige un error debido a algún CSS no válido en el documento de entrada
ru: Вывод PDF: исправлена ошибка в некоторых недопустимых CSS во входном документе.
uk: Виведення до PDF: виправлено помилку для деяких некоректних CSS у вхідних документах

source: Linux binary: Workaround for Qt WebEngine not working on systems with glibc &gt; 2.33
cs: Binární systém Linux: Řešení pro nefunkční Qt WebEngine na systémech s glibc &gt; 2.33
es: Binario de Linux: Se evita el fallo por el que Qt WebEngine no funciona en sistemas con glibc &gt; 2.33
ru: Двоичный файл Linux: обходной путь для Qt WebEngine, не работающего в системах с glibc &gt; 2.33
uk: Виконуваний файл для Linux: реалізовано обхідний маневр для уможливлення роботи Qt WebEngine у системах із glibc &gt; 2.33

source: 22 Apr, 2022
cs: 22. dubna 2022
es: 22 abr 2022
ru: 22 апр, 2022
uk: 22 квітня 2022 року

source: Allow creating multiple types of temporary marks (pins) by right clicking the mark books button (which can be added to the calibre toolbar via Preferences-&gt;Toolbars &amp; menus)
cs: Umožnění vytvářet více typů dočasných značek (připnutí) kliknutím pravým tlačítkem myši na tlačítko pro označení knih (které lze přidat na panel nástrojů Calibre prostřednictvím Předvolby-&gt;Panely nástrojů a nabídky)
es: Se permite crear múltiples tipos de marcas temporales (chinchetas) pulsando con el botón derecho sobre el botón de marcar libros (que se puede añadir a la barra de herramientas de calibre en Preferencias &gt; Barras de herramientas y menús)
ru: Разрешено создание нескольких типов временных меток (булавок), щелчком правой кнопки мыши по кнопке Отметить книги (её можно добавить на панель инструментов calibre через «Настройки» -> «Панели инструментов и меню»).
uk: Уможливлено створення декількох типів тимчасових позначок (шпильок) шляхом клацання правою кнопкою миші на кнопці позначення книг (яку можна додати на панель інструментів calibre за допомогою пункту меню «Налаштування-&gt;Панелі інструментів і меню»)

source: Kobo driver: Support updated firmware
cs: Ovladač Kobo: Podpora pro aktualizovaný firmware
es: Controlador Kobo: Compatibilidad con «firmware» actualizado
ru: Драйвер Kobo: поддержка новой прошивки
uk: Драйвер Kobo: реалізовано підтримку оновленої мікропрограми

source: Show a popup message when a Kindle is connected mentioning the Amazon cover bug and how to workaround it
cs: Zobrazení automaticky otevíraného okna při připojení Kindle se zmínkou o chybě obálek u Amazonu a o tom, jak ji obejít
es: Se muestra un mensaje emergente al conectar un Kindle mencionando el problema con las portadas de Amazon y cómo evitarlo
ru: Показывать всплывающее сообщение при подключении Kindle с упоминанием ошибки обложки Amazon и способами её обхода
uk: Реалізовано показ контекстного повідомлення при з'єднанні з Kindle щодо вади, пов'язаної із обкладинками і Amazon, та способів її обійти

source: Edit book: Table of Contents tool: Allow using the title attribute on headings tags to get the text for table of contents entries
cs: Upravit knihu: Nástroj Obsah: Umožnění použití atributu title u značek nadpisů pro získání textu pro položky obsahu
es: Modificar libro: Herramienta de índice: Se permite usar el atributo «title» en las etiquetas de encabezado para especificar el texto de las entradas del índice
ru: Редактор книг: инструмент «Оглавление»: разрешено использование атрибута title в тегах заголовков для получения текста для записей оглавления
uk: Редагування книг: інструмент таблиць змісту: уможливлено використання атрибуту заголовка у теґах заголовка для отримання тексту записів таблиці змісту

source: When creating a custom column to display real (floating point) numbers allow specifying the number of decimal digits when editing values
cs: Při vytváření vlastního sloupce pro zobrazení reálných čísel (s plovoucí desetinnou čárkou) umožnění zadání počtu desetinných míst při úpravě hodnot
es: Al crear una columna personalizada para mostrar números reales (con decimales) se permite especificar el número de cifras decimales al modificar los valores
ru: При создании пользовательского столбца для отображения действительных (с плавающей запятой) чисел разрешено указывать количество десятичных знаков при редактировании значений
uk: При створення нетипового стовпчика для показу дійсних чисел (з рухомою крапкою) уможливлено визначення кількості позицій у десятковому дробі при редагування значень

source: Amazon metadata download: Add support for amazon.in country website
cs: Stažení metadat Amazon: Přidání podpory pro webové stránky země amazon.in
es: Descarga de metadatos de Amazon: Se añade compatibilidad con amazon.in
ru: Загрузка метаданных Amazon: добавление поддержки веб-сайта страны amazon.in
uk: Отримання метаданих Amazon: додано підтримку локального сайта amazon.in

source: Edit book: Fix AltGr+{ not working on some keyboard layouts
cs: Upravit knihu: Oprava nefunkčnosti AltGr+{ na některých rozloženích klávesnice
es: Modificar libro: Se corrige el fallo por el que AltGr+{ no funcionaba con algunas distribuciones de teclado
ru: Редактор книг: исправлена ​​ошибка, из-за которой AltGr+{ не работал на некоторых раскладках клавиатуры
uk: Редагування книги: виправлено працездатність AltGr+{ у деяких розкладках клавіатури

source: TXT Input: Fix rare failure to convert some large TXT files with non-ASCII text
cs: Vstup TXT: Oprava vzácného selhání při převodu některých velkých souborů TXT s textem, který není v ASCII
es: Entrada TXT: Se corrige un fallo infrecuente al convertir algunos archivos TXT grandes con carecteres no ASCII
ru: Ввод TXT: исправлена ​​редкая ошибка при преобразовании больших файлов TXT с текстом, отличным от ASCII
uk: Вхідні дані TXT: усунено рідкісну критичну помилку при перетворенні деяких великих файлів TXT із текстом у кодуванні, відмінному від ASCII
