Repository: debian-calibre/calibre
Catalog: translations-git/changelog/*.po
Languages: cs, es, ru, uk

source: MOBI Output: Fix invalid color specification as plain numbers causing conversion to fail
cs: Výstup MOBI: Oprava neplatné specifikace barev jako prostých čísel způsobující selhání převodu
es: Salida MOBI: Se corrige el fallo por el que la especificación incorrecta de colores como números sin más hacía que fallara la conversión
ru: Вывод MOBI: исправлена неверная цветовая спецификация в виде простых чисел, вызывающих сбой конвертации
uk: Виведення до MOBI: виправлено некоректну специфікацію кольорів, яка спричиняла помилки при перетворенні, якщо було використано звичайні числа

source: MOBI Output: Fix invalid text indent specification causing conversion to fail
cs: Výstup MOBI: Oprava neplatné specifikace odsazení textu způsobující selhání převodu
es: Salida MOBI: Se corrige el fallo por el que la especificación incorrecta de sangría hacía que fallara la conversión
ru: Вывод MOBI: исправлена неверная спецификация отступа текста, вызывающая сбой конвертации
uk: Виведення до MOBI: виправлено помилку, яка заважала перетворенню у випадку некоректного визначення відступу тексту

source: Linux: Drop the unmaintained dbus-python in favor of jeepney for DBUS
cs: Linux: Upuštění od neudržovaného dbus-python ve prospěch jeepney pro DBUS
es: Linux: Se abandona dbus-python, que no tiene mantenimiento, en favor de jeepney para la compatibilidad con DBUS
ru: Linux: отказ от необслуживаемого dbus-python в пользу jeepney для DBUS
uk: Linux: викинуто залежність від несупроводжуваного пакунка dbus-python на користь jeepney для DBUS

source: Edit book: Workaround for Qt bug that caused the panel sizes in the editor to not be remembered across sessions
cs: Upravit knihu: Vyřešení chyby Qt, která způsobovala, že velikosti panelů v editoru nebyly zapamatovány napříč relacemi
es: Modificar libro: Se evita el fallo de que Qt que hace que los tamaños de los paneles del editor no se recuerden entre sesiones
ru: Редактор книг: Обходной путь для ошибки Qt (размеры панелей в редакторе не запоминались между сессиями)
uk: Редагування книг: реалізовано код, який виправляє ваду у Qt, що спричиняла неможливість запам'ятовування розмірів панелей редактора між сеансами роботи у програмі

source: 25 Jun, 2021
cs: 25. června 2021
ru: 25 июня 2021
uk: 25 червня 2021 року

source: E-book viewer: Allow clicking links in popup footnotes
cs: Prohlížeč e-knih: Umožnění kliknutí na odkazy v automaticky otevíraných poznámkách pod čarou
es: Visor de libros electrónicos: Se permite pulsar en los enlaces de las notas emergentes
ru: Просмотрщик электронных книг: разрешён переход по ссылкам во всплывающих сносках
uk: Засіб перегляду книг: уможливлено натискання посилань на панелях контекстних підрядкових приміток.

source: Main book list: Scroll per pixel rather than per item by default. Can be returned to previous behavior via Preferences-&gt;Tweaks-&gt;Control behavior of book list
cs: Hlavní seznam knih: Ve výchozím nastavení posouvat po pixelech, ne po položkách. Lze vrátit na předchozí chování přostřednictvím Předvolby-&gt;Vylepšení-&gt;Určit chování seznamu knih
es: Lista de libros principal: Desplazamiento por píxeles en lugar de elementos de manera predeterminada. Puede volverse al comportamiento anterior mediante Preferencias &gt; Ajustes &gt; Controlar el comportamiento de la lista de libros
ru: Основной список книг: прокрутка по пикселям, а не по элементам по умолчанию. Может быть возвращено к предыдущему поведению через Настройки-> Твики-> Управление поведением списка книг.
uk: Основний список книг: реалізовано типове гортання за пікселями, а не за записами. Поведінку попередніх версії можна повернути за допомогою пункту налаштувань «Налаштування -&gt; Коригування -&gt; Керування поведінкою списку книг».

source: Linux: Drop support for the global menu bar
cs: Linux: Zrušení podpory globálního panelu nabídek
es: Linux: Se abandona la compatibilidad con la barra de menú global
ru: Linux: отказ от поддержки панели глобального меню
uk: Linux: викинуто підтримку загальної смужки меню.

source: E-book viewer: Fix font sizes specified in absolute units not being honored in locales where the decimal separator is not the period
cs: Prohlížeč e-knih: Oprava velikostí písma zadaných v absolutních jednotkách, které nejsou přijímány v národních prostředích, kde oddělovačem desetinných míst není tečka
es: Visor de libros electrónicos: Se corrige el fallo por el que los tamaños de letra especificados en unidades absolutas no se obedecían en configuraciones locales donde el separador decimal no es el punto
ru: Просмотрщик электронных книг: Исправлены размеры шрифта, указанные в абсолютных единицах, не соблюдавшиеся в регионах, где десятичный разделитель не является точкой
uk: Засіб перегляду книг: виправлено помилку, пов'язану із тим, що програма не враховувала значення розмірів шрифтів у абсолютних одиницях у локалях, де символом відокремлення дробової частини десяткових дробів не є крапка.

source: E-book viewer: Fix searching for short strings in text with lots of similar entries displaying incorrect matches
cs: Prohlížeč e-knih: Oprava vyhledávání krátkých řetězců v textu s mnoha podobnými položkami zobrazujícími nesprávné shody
es: Visor de libros electrónicos: Se corrige el fallo por el que la búsqueda de fragmentos cortos en textos con muchas entradas parecidas mostraba coincidencias incorrectas
ru: Просмотрщик электронных книг: Исправлен поиск коротких строк в тексте с множеством похожих записей, отображающих неправильные совпадения.
uk: Засіб перегляду книг: виправлено помилку, пов'язану із тим, що програма показувала помилкові значення для кількості відповідників при пошуку коротких рядків у тексті, який містить багато подібних фрагментів.

source: MOBI Output: Fix using percentage units for margins resulting in too large margins when using the tablet output profile
cs: Výstup MOBI: Oprava použití procentních jednotek pro okraje, které vedlo k příliš velkým okrajům při použití výstupního profilu pro tablety
es: Salida MOBI: Se corrige el fallo por el que el uso de porcentajes para márgenes creaba márgenes demasiado grandes al usar el perfil de salida de tableta
ru: Вывод MOBI: исправлено использование процентных единиц для полей, приводящее к слишком большим полям при использовании профиля вывода планшета
uk: Виведення до MOBI: виправлено помилку, пов'язану із тим, що при використанні профілю виведення до планшетів значення розмірів полів, вказані у відсотках, призводили до надто великих розмірів полів.

source: E-book viewer: Fix back button not working after jumping to a bookmark
cs: Prohlížeč e-knih: Oprava nefunkčního tlačítka zpět po přechodu na záložku
es: Visor de libros electrónicos: Se corrige el fallo por el que el botón de retroceso no funcionaba después de saltar a un marcador
ru: Просмотрщик электронных книг: Исправлена ​​ошибка, из-за которой кнопка возврата не работала после перехода к закладке
uk: Засіб перегляду книг: виправлено помилку, пов'язану із непрацездатністю кнопки «Назад» після переходу до закладки.

source: Content server: OPDS feed: Fix incorrect up URL in category group feeds
cs: Server s obsahem: kanál OPDS: Oprava nesprávné adresy URL v kanálech skupin kategorií
es: Servidor de contenidos: Canal OPDS: Se corrige el URL incorrecto en canales de grupo de categoría
ru: Контент-сервер: фид OPDS: исправлен неверный URL-адрес в фидах групп категорий
uk: Сервер даних: подача OPDS: виправлено помилкову верхню адресу у групових подачах категорій.

source: Content server: Fix a regression in the previous release that broke editing of series metadata
cs: Server s obsahem: Oprava regrese v předchozím vydání, která poškodila úpravu metadat sérií
es: Servidor de contenidos: Se corrige una regresión en la versión anterior que estropeaba la modificación de metadatos de serie
ru: Контент-сервер: Исправлен регресс в предыдущем выпуске, нарушавший редактирование метаданных серии.
uk: Сервер даних: виправлено регресію попереднього випуску, яка заважала редагуванню метаданих циклів.

source: E-book viewer: Fix scrolling backwards by screen-fulls not working with very large page margins.
cs: Prohlížeč e-knih: Oprava nefunkčnosti posouvání zpět po celých obrazovkách při velmi velkých okrajích stránek
es: Visor de libros electrónicos: Se corrige el fallo por el que el paso de páginas hacia atrás por pantallas no funcionaba con márgenes de página muy grandes.
ru: Просмотрщик электронных книг: исправлена ​​ошибка, из-за которой прокрутка назад при полном экране не работала с очень большими полями страницы.
uk: Засіб перегляду книг: виправлено гортання назад екранами, якщо поля сторінки є надто великими.

source: MOBI Input: Fix a regression in calibre 5 that broke processing of Haodoo format files
cs: Vstup MOBI: Oprava regrese v Calibre 5, která poškodila zpracování souborů ve formátu Haodoo
es: Entrada MOBI: Se corrige una regresión en calibre 5 que estropeaba el procesamiento de archivos con formato Haodoo
ru: Ввод MOBI: исправлена ​​регрессия в calibre 5, которая нарушила обработку файлов формата Haodoo.
uk: Вхідні дані MOBI: виправлено регресію у calibre 5, яка призводила до помилкової обробки файлів у форматі Haodoo.

source: Conversion: Fix the smarten punctuation option not applying to inserted jacket page
cs: Převod: Oprava volby vylepšení interpunkce, která nebyla použita na vloženou stránku přebalu
es: Conversión: Se corrige el fallo por el que la opción de mejorar puntuación no se aplicaba a la página de sobrecubierta insertada
ru: Конвертация: исправлен параметр умной пунктуации, который не применялся к вставленной странице обложки.
uk: Перетворення: виправлено помилку, пов'язану із тим, що значення параметра кмітливої пунктуації не застосовувалося до вставленої сторінки-обгортки.

source: 5.22.1 fixes a typo in the previous release that broke device detection on Linux
cs: 5.22.1 opravuje překlep v předchozím vydání, který poškodil rozpoznávání zařízení v Linuxu
es: 5.22.1 corrige un error tipográfico en la versión anterior que estropeaba la detección de dispositivos en Linux
ru: 5.22.1 исправлена опечатка в предыдущем выпуске, нарушавшая обнаружение устройств в Linux.
uk: У версії 5.22.1 виправлено друкарську помилку попереднього випуску, яка заважала виявленню пристрої у Linux.

source: 11 Jun, 2021
cs: 11. června 2021
ru: 11 июня 2021
uk: 11 червня 2021 року

source: Driver for the new Kobo Ellipsa
cs: Ovladač pro nové Kobo Ellipsa
es: Controlador para el nuevo Kobo Elipsa
ru: Драйвер для нового Kobo Ellipsa
uk: Драйвер для нової Kobo Ellipsa

source: Content server: When editing metadata for fields that take multiple values, make it easier to remove individual values by simply tapping a button
cs: Server s obsahem: Usnadnění odebírání jednotlivých hodnot jednoduchým klepnutím na tlačítko při úpravách metadat polí, která nabývají více hodnot
es: Servidor de contenidos: Al editar metadatos para campos que admiten valores múltiples, se facilita la eliminación de valores individuales pulsando un botón
ru: Контент-сервер: при редактировании метаданных для полей, принимающих несколько значений, упрощено удаление отдельных значений простым нажатием кнопки
uk: Сервер даних: спрощено вилучення окремих значень простим натисканням кнопки при редагуванні метаданих для полів, які можуть містити декілька значень.

source: Browser viewer: Make current color scheme setting propagate to all devices automatically when using user accounts
cs: Prohlížeč v prohlížeči: Při používání uživatelských účtů se aktuální nastavení barevného schématu automaticky rozšíří na všechna zařízení
es: Visor del navegador: La configuración de esquema de color se propaga automáticamente a todos los dispositivos al usar cuentas de usuario
ru: Просмотр в браузере: автоматическое распространение текущей настройки цветовой схемы на все устройства при использовании учетных записей пользователей.
uk: Панель навігації: при використанні облікових записів користувачів реалізовано поширення поточної схеми кольорів автоматично на усі пристрої.

source: E-book viewer: Image popup: Show the image resolution in the popup window's titlebar
cs: Prohlížeč e-knih: Automaticky otevírané obrázky: Zobrazení rozlišení obrázku v záhlaví automaticky otevíraného okna
es: Visor de libros electrónicos: Ventana de imagen emergente: Se muestra la resolución de la imagen en la barra de título de la ventana emergente
ru: Просмотрщик электронных книг: Всплывающее окно с изображением: отображение разрешения изображения в заголовке всплывающего окна.
uk: Засіб перегляду книг: контекстні панелі зображень — реалізовано показ роздільності зображення на смужці заголовка контекстного вікна.

source: HTML Input: Fix handling of @import rules in stylesheets nested more than one level deep
cs: Vstup HTML: Oprava zpracování pravidel @import v souborech stylů vnořených do více než jedné úrovně
es: Entrada HTML: Se corrige el funcionamiento de las reglas @import en hojas de estilo con más de un nivel de anidamiento
ru: Ввод HTML: исправлена ​​обработка правил @import в таблицах стилей, вложенных более чем на один уровень.
uk: Вхідні дані HTML: виправлено обробку правил @import у таблицях стилів, рівень вкладеності яких перевищує одиницю.

source: Fix viewer search context menu to clear searches not clearing search settings
cs: Oprava kontextové nabídky prohlížeče pro vymazání vyhledávání, která nevymazává nastavení vyhledávání
es: Se corrige el fallo por el que el menú contextual para limpiar las búsquedas no limpiaba las configuraciones de búsqueda
ru: Исправлено контекстное меню поиска в просмотрщике, чтобы очистить результаты поиска без очистки настройки поиска
uk: Виправлено роботу контекстного меню пошуку у засобі перегляду: реалізовано очищення полів пошуку, а не параметрів пошуку.

source: E-book viewer image popup: Fix full screen button in incorrect state when starting in full screen
cs: Automaticky otevírané okno prohlížeče obrázků e-knih: Oprava tlačítka na celou obrazovku v nesprávném stavu při spuštění na celou obrazovku
es: Visor de libros electrónicos: Ventana de imagen emergente: Se corrige el fallo por el que el botón de pantalla completa aparecía en un estado incorrecto cuando se inicia a pantalla completa
ru: Всплывающее окно с изображением в просмотрщике электронных книг: исправлена ​​ошибка, из-за которой кнопка полноэкранного режима находилась в неправильном состоянии при запуске в полноэкранном режиме
uk: Контекстна панель зображень у засобі перегляду книг: виправлено стан кнопки повноекранного режиму при запуску програми у повноекранному режимі.

source: 04 Jun, 2021
cs: 4. června 2021
es: 4 jun 2021
ru: 04 июня 2021
uk: 4 червня 2021 року

source: E-book viewer: Highlights: Make URLs in the notes for highlights clickable
cs: Prohlížeč e-knih: Zvýraznění: Na adresy URL v poznámkách pro zvýraznění lze kliknout
es: Visor de libros electrónicos: Resaltados: Se hacen activos los URL de las notas para los resaltados
ru: Просмотрщик электронных книг: выделения: URL-адреса в заметках для выделенных фрагментов кликабельны
uk: Засіб перегляду книг: підсвічування: адреси у нотатках для підсвічувань у новій версії можна натискати

source: Book details: Ctrl-clicking on tags now adds them to the existing search instead of replacing it
cs: Podrobnosti o knize: Kliknutí na štítky s přidržením klávesy Ctrl je nyní přidá ke stávajícímu vyhledávání, místo aby je nahradilo.
es: Detalles del libro: Al pulsar con Ctrl sobre etiquetas ahora se añaden a la búsqueda existente en lugar de sustituirla
ru: Сведения о книге: нажатие на теги при нажатой клавише Ctrl теперь добавляет их в существующий поиск, а не заменяет его.
uk: Панель параметрів книги: у новій версії клацання разом із натисканням Ctrl на мітках додає їх до наявного пошуку, а не замінює ними параметри пошуку

source: E-book viewer: Allow using the back button to return from jumping to a search result
cs: Prohlížeč e-knih: Umožnění použití tlačítka zpět k návratu z přeskočení na výsledek vyhledávání
es: Visor de libros electrónicos: Se permite usar el botón de retroceso para volver de un salto a resultado de búsqueda
ru: Просмотрщик электронных книг: позволяет использовать кнопку 'Назад' для возврата от перехода к результатам поиска.
uk: Засіб перегляду книг: уможливлено використання кнопки «Назад» для повернення після переходу до результату пошуку

source: Get books: Fix the Kobo store plugin for changes to the website
cs: Získat knihy: Oprava modulu obchodu Kobo kvůli změnám na webových stránkách
es: Obtener libros: Se actualiza el complemento de librería Kobo por cambios en el sitio web
ru: Получить книги: исправлен плагин магазина Kobo для изменений на веб-сайте
uk: Отримання книг: виправлено додаток крамниці Kobo відповідно до змін на сайті

source: Edit book: Fix non breaking spaces in snippets being converted to normal spaces
cs: Upravit knihu: Oprava převodu nezalamujících se mezer ve fragmentech na normální mezery
es: Modificar libro: Se corrige el fallo por el que los espacios duros en fragmentos se convertían a espacios normales
ru: Редактор книг: исправлены неразрывные пробелы в фрагментах, которые преобразуются в обычные пробелы
uk: Редагування книг: скасовано перетворення нерозривних пробілів у фрагментах у звичайні

source: ToC Editor: Fix a regression that caused changes to not be saved on machines where running a worker process takes more than ten seconds
cs: Editor obsahu: Oprava regrese, která způsobovala, že se změny neukládaly na počítačích, kde spuštění pracovního procesu trvalo déle než deset sekund
es: Editor de índice: Se corrige una regresión que hacía que los cambios no se guardaran en máquinas donde la ejecución de un proceso de trabajo lleva más de diez segundos
ru: Редактор ToC: исправление регрессии, из-за которой изменения не сохранялись на машинах, на которых выполнение рабочего процесса занимает более десяти секунд.
uk: Редактор таблиці змісту: усунено регресію, яка спричиняла неможливість зберігання змін у системах, де запуск процесу-обробника тривав понад десять секунд

source: Fix error when changing the "Search the net" URLs for the Content server
cs: Oprava chyby při změně adres URL „Prohledat internet“ pro Server s obsahem
es: Se corrige un error al cambiar las URL para «Buscar en al red» en el servidor de contenidos
ru: Исправлена ошибка при изменении URL-адресов 'Поиск в сети' для сервера содержимого.
uk: Усунено помилку, яку було пов'язано зі зміною адрес «Пошук у мережі» на сервері даних

source: 28 May, 2021
cs: 28. května 2021
ru: 28 мая 2021
uk: 28 травня 2021 року

source: E-book viewer: Add a preference under Scrolling behavior to reverse the tap zones used to turn pages. So tapping on the left goes forward and the right backward
cs: Prohlížeč e-knih: Přidání předvolby pod Chování posouvání pro obrácení zón klepnutí používaných k otáčení stránek. Klepnutím na levou stranu se tedy přejde vpřed a na pravou zpět.
es: Visor de libros electrónicos: Se añade una preferencia bajo comportamiento del desplazamiento para invertir las zonas de toque usadas para pasar página, de manera que al tocar en la izquierda se pasa a la siguiente página y en la derecha a la anterior.
ru: Просмотрщик электронных книг: добавлена настройка в разделе «Поведение при прокрутке», для инвертирования зон касания, используемых для перелистывания страниц. Таким образом, нажатие слева - вперёд, а справа - назад
uk: Засіб перегляду книг: додано налаштувань поведінки при гортанні для інвертування зон торкання для гортання сторінок. Таким чином, програму можна налаштувати так, щоб торкання ліворуч гортало сторінки вперед, а праворуч — назад.

source: E-book viewer: Fix regression in 5.15 that caused incorrect display of font sizes that contain a period and use absolute units
cs: Prohlížeč e-knih: Oprava regrese ve verzi 5.15, která způsobovala nesprávné zobrazení velikostí písem, která obsahují tečku a používají absolutní jednotky
es: Visor de libros electrónicos: Se corrige una regresión en 5.15 que hacía que se mostraran incorrectamente los tamaños de letra que contienen un punto y usan unidades absolutas
ru: Просмотрщик электронных книг: исправлена ​​регрессия в версии 5.15, приводившая к неправильному отображению размеров шрифта, содержащих точку и использующих абсолютные единицы измерения.
uk: Засіб перегляду книг: виправлено регресію у версії 5.15, яка спричиняла помилковий показ символів шрифтів, розмір яких містить крапку і використовує абсолютні одиниці.

source: PDF Output: Fix font kerning issues with some TrueType fonts
cs: Výstup PDF: Oprava problémů s prokládáním u některých písem TrueType
es: Salida PDF: Se corrigen problemas de interletraje con algunos tipos de letra TrueType
ru: Вывод PDF: устранение проблем с кернингом шрифтов для некоторых шрифтов TrueType.
uk: Виведення даних до PDF: виправлено проблеми із кернінґом шрифту для деяких шрифтів TrueType.

source: Edit book: Fix a regression in 5.18 that broke editing/creating saved searches
cs: Úprava knihy: Oprava regrese ve verzi 5.18, která poškodila úpravu nebo vytváření uložených hledání
es: Modificar libro: Se corrige una regresión en 5.18 que estropeaba la creación y modificación de búsquedas guardadas
ru: Редактор книг: исправлен регресс в 5.18, нарушавший редактирование/создание сохраненных поисков.
uk: Редагування книг: виправлено регресію версії 5.18, яка заважала редагуванню або створенню збережених пошуків.

source: Windows: Fix for standalone ToC Editor not working on systems where Qt WebEngine causes a crash at exit
cs: Windows: Oprava nefunkčnosti samostatného editoru obsahu na systémech, kde Qt WebEngine způsobuje pád při ukončení systému
es: Windows: Se corrige el fallo por el que el editor de índice independiente no funcionaba en sistemas donde Qt WebEngine provoca un cierre al salir
ru: Windows: исправление для автономного редактора ToC, не работающего в системах, где Qt WebEngine вызывает сбой при выходе.
uk: Windows: виправлено проблему, пов'язану із непрацездатністю окремого редактора таблиці змісту у системах, де використання Qt WebEngine призводить до аварійного завершення програми при виході.

source: Windows MTP driver: When scanning an MTP device such as an Android phone ignore folders that Windows fails to enumerate instead of failing with an error
cs: Ovladač MTP systému Windows: Ignorování složek při skenování zařízení MTP, jako je telefon se systémem Android, které se systému Windows nepodaří vypsat, namísto chybového hlášení.
es: Controlador MTP de Windows: Al explorar un dispositivo MTP, como un teléfono Android, se ignoran las carpetas que Windows no enumera, en lugar de fallar con un error
ru: Драйвер Windows MTP: при сканировании устройства MTP, такого как телефон Android, игнорировать папки, которые Windows не может перечислить, а не выдавать ошибку.
uk: Драйвер MTP для Windows: при скануванні пристроїв MTP, зокрема телефонів під керуванням Android, реалізовано ігнорування тек, які Windows не може нумерувати, замість повідомлення про помилку.

source: ToC Editor: Fix a regression that broke choosing split points in some XHTML files
cs: Editor obsahu: Oprava regrese, která v některých souborech XHTML poškodila výběr bodů rozdělení
es: Editor de índice: Se corrige una regresión que estropeaba la elección de puntos de división en algunos archivos XHTML
ru: Редактор ToC: исправлена ​​регрессия, нарушавшая выбор точек разделения в некоторых файлах XHTML.
uk: Редактор змісту: виправлено регресію, яка заважала вибору точок поділу у деяких файлах XHTML.
