Repository: debian-calibre/calibre
Catalog: translations-git/changelog/*.po
Languages: cs, es, ru, uk

source: Drivers: Fix regression in calibre 5 that broke connecting to SONY devices
cs: Ovladače: Oprava regrese v Calibre 5, která poškodila připojování k zařízením SONY.
es: Controladores: Se corrige una regresión en calibre 5 que estropeaba la conexión con dispositivos SONY
ru: Драйверы: исправлена регрессия в calibre 5, сломавшая подключение к устройствам SONY.
uk: Драйвери: виправлено регресію у calibre 5, яка шкодила з'єднанню з пристроями SONY

source: Open with: On Linux when reading names from .desktop files, use the first matching language
cs: Otevřít v programu: Použití prvního odpovídajícího jazyku na Linuxu při čtení názvů ze souborů .desktop
es: Abrir con: En Linux, al leer nombres de archivos .desktop, se usa el primer idioma que coincida
ru: Открыть с помощью: в Linux во время чтения имён из файлов .desktop используется первый подходящий язык.
uk: Відкриття за допомогою сторонніх програм: у Linux при читанні назв з файлів .desktop реалізовано використання першої відповідної мови

source: Conversion: Fix a regression in calibre 5 that broke conversion of some malformed CSS stylesheets.
cs: Převod: Oprava regrese v Calibre 5, která poškodila převod některých poškozených šablon stylů CSS.
es: Conversión: Se corrige una regresíon en calibre 5 que estropeaba la conversión de algunas hojas de estilos CSS defectuosas.
ru: Конвертация: исправлена ​​регрессия в 5-м calibre, которая нарушила конвертацию некоторых искаженных таблиц стилей CSS.
uk: Перетворення: виправлено регресію у calibre 5, яка заважала перетворенню деяких помилково форматованих таблиць стилів CSS.

source: Conversion: Fix a regression in calibre 5 that broke processing of some PDB files with images.
cs: Převod: Oprava regrese v Calibre 5, která poškodila zpracování některých souborů PDF s obrázky.
es: Conversión: Se corrige una regresión en calibre 5 que estropeaba el procesado de algunos archivos PDB con imágenes.
ru: Конвертация: исправлена ​​регрессия в 5-м calibre, которая нарушала обработку некоторых файлов PDB с изображениями.
uk: Перетворення: виправлено регресію у calibre 5, яка заважала обробці файлів PDB із зображеннями.

source: Conversion: Fix regression in calibre 5 in the handling of @import() rules in stylesheets that import from folders above themselves.
cs: Převod: Oprava regrese v Calibre 5 při zpracování pravidel @import() v šablonách stylů, které se importují ze složek nad nimi samými.
es: Conversión: Se corrige una regresión en calibre 5 en la gestión de reglas @import() en hojas de estilos que importaban de carpetas superiores.
ru: Конвертация: исправлена ​​регрессия в 5-м calibre при обработке правил @import() в таблицах стилей, которые импортируются из вышележащих папок.
uk: Перетворення: виправлено регресію у calibre 5 у обробці правил @import() у таблицях стилів, які імпортують дані з каталогів вищого рівня.

source: Content server: Fix various controls on the book details page not working when viewing a random book.
cs: Server s obsahem: Opravte nefunkčnosti různých ovládacích prvků na stránce s podrobnostmi o knize při prohlížení náhodné knihy.
es: Servidor de contenidos: Se corrige el fallo por el que varios controles en la página de detalles del libro no funcionaban al visualizar un libro aleatorio.
ru: Контент-сервер: исправлены различные элементы управления на странице описания книги, не работавшие при просмотре случайной книги.
uk: Сервер даних: відновлено працездатність різних засобів керування на сторінці подробиць щодо книги при перегляді випадкової книги.

source: Tag browser: Fix a crash when renaming a saved search to a value that already exists.
cs: Prohlížeč štítků: Oprava pádu při přejmenování uloženého hledávání na hodnotu, která již existuje.
es: Explorador de etiquetas: Se corrige un cierre inesperado al cambiar el nombre de una búsqueda guardada a un valor que ya existe.
ru: Браузер тегов: устранение сбоя при переименовании сохраненного поиска в значение, которое уже существует.
uk: Навігатор мітками: виправлено аварійне завершення роботи при перейменуванні збереженого пошуку до значення, яке вже існувало.

source: Tag browser: Fix renaming of custom column with fixed set of values not working.
cs: Prohlížeč štítků: Oprava nefunkčnosti přejmenování vlastního sloupce s pevnou sadou hodnot.
es: Explorador de etiquetas: Se corrige el fallo por el que cambio de nombre de columnas personalizadas con conjunto fijo de valores no funcionaba.
ru: Браузер тегов: исправлено переименование настраиваемого столбца с фиксированным набором значений, которое не работает.
uk: Навігатор мітками: відновлено працездатність перейменування нетипового стовпчика із фіксованим набором значень.

source: Fix a regression in calibre 5 that broke auto-sync of generated catalogs to devices.
cs: Oprava regrese v Calibre 5, která poškodila automatickou synchronizaci generovaných katalogů se zařízeními.
es: Se corrige una regresión en calibre 5 que estropeaba la sincronización automática de catálogos generados con los dispositivos
ru: Исправлена ​​регрессия в calibre 5, которая нарушала автосинхронизацию созданных каталогов с устройствами.
uk: Виправлено регресію у calibre 5, яка шкодила автоматичній синхронізації створених каталогів на пристрої.

source: Fix setting rating via ebook-meta command line tool broken in calibre 5.
cs: Oprava nefunkčnosti nastavení hodnocení pomocí nástroje příkazového řádku ebook-meta v Calibre 5.
es: Se corrige la asignación de calificaciones mediante la herramienta de línea de órdenes ebook-meta, que se estropeó en calibre 5.
ru: Исправлено выставление в calibre 5 оценок с помощью инструмента командной строки ebook-meta.
uk: Відновлено можливість встановлення оцінки за допомогою інструмента командного рядка ebook-meta у calibre 5.

source: When boolean columns are set to bistate, checking "show checkmarks" results in all non-boolean values being shown as false
cs: Když jsou logické sloupce nastaveny na dvojí stav, bude výsledkem zaškrtnutí „zobrazit značky zaškrtnutí“ to, že všechny jiné než logické hodnoty budou zobrazeny jako nepravdivé
es: Cuando las columnas booleanas tienen dos estados, al activar la opción «mostrar marcas de verificación» todos los valores no booleanos se muestran como no
ru: Когда для логических столбцов задано бистатное состояние, при установке флажка 'показать флажки' все не-логические значения отображаются как ложные.
uk: Виправлення: якщо булеві стовпчики встановлено у двопозиційний стан, позначення результатів «Показувати позначки» в усіх небулевих значеннях показуються як false

source: Spell check: Fix using non UTF-8 dictionaries broken in calibre 5
cs: Kontrola pravopisu: Oprava nefunkčnosti používání jiných slovníků než UTF-8 v Calibre 5
es: Comprobación ortográfica: Se corrige el fallo por el los diccionarios no UTF-8 no funcionaban en calibre 5
ru: Проверка орфографии: исправлено использование в calibre 5 словарей с кодировкой, отличающейся от UTF-8.
uk: Перевірка правопису: відновлено працездатність словників у кодуваннях, відмінних від UTF-8, у calibre 5

source: Fix a rare issue where restarting calibre from within the program would fail.
cs: Oprava vzácného problému, kdy selhávalo restartování Calibre ze samotného programu.
es: Se corrige un fallo infrecuente por el que el reinicio de calibre desde el propio programa no funcionaba.
ru: Исправлена редкая ошибка, мешавшая перезапуску calibre прямо из программы.
uk: Виправлено рідкісну проблему, наслідком якої є те, що не можна було виконати перезапуск calibre з самої програми.

source: Version 5.4.2 fixes bugs in 5.4.0 that prevented calibre from starting on macOS and from choosing save file names on Windows.
cs: Verze 5.4.2 opravuje chyby ve verzi 5.4.0, které bránily spuštění Calibre na macOS a výběru názvů uložení souborů ve Windows.
es: La versión 5.4.2 corrige fallos en 5.4.0 que impedían iniciar calibre en macOS y elegir nombres para guardar archivos en Windows.
ru: Версия 5.4.2 исправляет ошибки в 5.4.0, мешавшие запуску calibre в macOS и выбору имени сохраняемого файла в Windows.
uk: У версії 5.4.2 виправлено вади версії 5.4.0, які заважали запуску calibre на macOS та вибору назв файлів для збереження у Windows.

source: 16 Oct, 2020
cs: 16. října 2020
ru: 16 октября 2020
uk: 16 жовтня 2020 року

source: Tag browser: When grouping items by first letter if adjacent letters have few entries combine them into a single group.
cs: Prohlížeč štítků: Pokud mají sousední písmena při seskupování položek podle prvního písmene pouze několik záznamů, kombinovat je do jedné položky.
es: Explorador de etiquetas: Al agrupar elementos por la primera letra, si letras adyacentes tienen pocas entradas, se combinan en un único grupo.
ru: Браузер тегов: при группировании элементов по первой букве, если у соседних букв несколько записей, объединять их в одну группу.
uk: Засіб навігації мітками: реалізовано групування записів до єдиної групи, якщо при групування за першою літерою буде виявлено, що у групах за сусідніми літерами мало записів.

source: Can be controlled via an option in Preferences-&gt;Look &amp; feel-&gt;Tag browser to combine 'first letters' together if there are a small number of items under adjacent letters
cs: Lze ovládat prostřednictvím Předvolby-&gt;Vzhled a chování-&gt;Prohlížeč štítků pro kombinování ‚prvních písmen“ dohromady, pokud je menší počet položek pod sousedními písmeny
es: Puede controlarse mediante una opción en Preferencias &gt; Apariencia &gt; Explorador de etiquetas para combinar «primeras letras» si hay pocos elementos en letras adyacentes
ru: Можно управлять с помощью параметра в разделе «Настройки» -> «Внешний вид» -> «Браузер тегов», чтобы объединить «первые буквы» вместе, если под соседними буквами находится небольшое количество элементов
uk: Цим інструментом можна керувати за допомогою пункту на сторінці «Налаштування-&gt;Вигляд та поведінка-&gt;Навігатор мітками». Слід вказати максимальну кількість записів, за якою будуть поєднуватися записи сусідніх літер при групуванні за першими літерами.

source: Viewer: Allow displaying the current page / total pages in the header/footer. Useful in paged mode to see exactly how many pages are left.
cs: Prohlížeč: Umožnění zobrazení aktuální stránky / celkového počtu stránek v záhlaví nebo zápatí. Užitečné v režimu stránek pro představu, kolik stránek zbývá.
es: Visor: Se permite mostrar la página actual / páginas totales en el encabezado o pie de página. Es útil en modo paginado para ver exactamente cuántas páginas faltan.
ru: Просмотрщик: позволяет отображать текущую страницу/общее количество страниц в верхнем/нижнем колонтитуле. Полезно в постраничном режиме, чтобы точно узнать, сколько страниц осталось.
uk: Засіб перегляду: уможливлено показ поточної сторінки та загальної кількості сторінок у верхньому або нижньому колонтитулі. Корисно для показу точної кількості ще не прочитаних сторінок у режимі поділу на сторінки.

source: Viewer search panel: Show more result context in a tooltip when hovering over a search result.
cs: Panel hledání prohlížeče: Zobrazení více kontextu výsledku v popisku tlačítka při přejetí nad výsledkem hledání.
es: Panel de búsqueda del visor: Se muestra más contexto del resultado en una ayuda emergente al pasar el cursor sobre un resultado de búsqueda.
ru: Панель поиска просмотрщика: отображать больший контекст результатов во всплывающей подсказке при наведении курсора на результат поиска.
uk: Панель пошуку засобу перегляду: реалізовано показ ширшого діапазону даних контексту на панелі підказки, яку програма показує при наведенні вказівника на пункт результатів пошуку.

source: DOCX Input: Add support for Word controls used to rotate or flip images
cs: Vstup DOCX: Přidání podpory pro ovládací prvky Wordu použité pro otáčení nebo překlápění obrázků
es: Entrada DOCX: Se añade compatibilidad para los controles de Word usados para rotar o invertir imágenes
ru: Ввод DOCX: добавлена поддержка элементов управления содержимым Word, использующихся для поворота и зеркального отражения изображений.
uk: Вхідні дані DOCX: додано підтримку засобів керування Word, які використовуються для обертання або віддзеркалення зображень

source: Only works with output formats such as EPUB that support CSS transforms
cs: Funguje pouze s výstupními formáty jako je EPUB, který podporuje transformace CSS
es: Sólo funciona con formatos de salida como EPUB que permiten usar transformaciones CSS
ru: Работает только с выходными форматами, такими как EPUB, поддерживающими CSS-преобразования.
uk: Працює лише із форматами виведення, подібними до EPUB, де передбачено підтримку перетворень CSS

source: Viewer image pop-up: Allow maximizing/minimizing the window.
cs: Automaticky otevíraný obrázek v prohlížeči: Umožnění maximalizace nebo minimalizace okna.
es: Imágenes emergentes del visor: Se permite maximizar o minimizar la ventana.
ru: Всплывающее окно просмотра изображений: позволяет развернуть/свернуть окно.
uk: Контекстна панель зображення у засобі перегляду: уможливлено розгортання і згортання вікна.

source: Edit metadata dialog: Use only a single line for custom column date fields
cs: Dialogové okno úpravy metadat: Použití pouze jednoho řádku pro pole datumů ve vlastním sloupci
es: Cuadro de modificación de metadatos: Se usa una sola línea para los campos de fecha de columna personalizadas
ru: Диалог редактирования метаданных: использовать только одну строку для настраиваемых полей даты столбца
uk: Діалогове вікно редагування метаданих: реалізовано використання лише одного рядка для полів дат нетипових стовпчиків

source: Add an item to search for categories to the category editor context menu.
cs: Přidání položky pro hledání kategorií do místní nabídky editoru kategorií.
es: Se añade un elemento para buscar categorías al menú contextual del editor de categorías.
ru: Добавлен элемент для поиска категорий в контекстное меню редактора категорий.
uk: До контекстного меню редактора категорій додано пункт для пошуку категорій.

source: Category editor: Add a right click menu to change case of the selected entries.
cs: Editor kategorií: Přidání kliknutí pravým tlačítkem myši na nabídku pro změnu velikosti písmen vybraných položek.
es: Editor de categorías: Se añade un menú contextual para cambiar las mayúsculas o minúsculas de las entradas seleccionadas.
ru: Редактор категорий: добавлено контекстное меню для смены регистра выбранных записей.
uk: Редактор категорій: додано контекстне меню для зміни регістру літер позначених записів.

source: Fix a regression in 5.0 that caused performance of dialogs that contain title/series/tags edit fields to be very poor with large libraries.
cs: Oprava regrese v 5.0, která způsobovala velice špatný výkon dialogových oken obsahujících pole úprav názvů, sérií nebo štítků u velkých knihoven.
es: Se corrige una regresión en 5.0 que hacía que el rendimiento de diálogos que contienen campos de edición de título, serie o etiquetas fuese muy malo con bibliotecas grandes.
ru: Исправлена ​​регрессия в 5.0, снижавшая производительность на больших библиотеках диалоговых окон, содержащих поля редактирования заголовков/серий/тегов.
uk: Виправлено регресію у версії 5.0, яка спричиняла надзвичайно повільну обробку у вікнах із полями редагування назви, циклу та міток у великих бібліотеках.

source: Fix a regression in 5.0 that caused some pop-up menus to appear on the wrong monitor in multi-monitor setups
cs: Oprava regrese v 5.0, která způsobovala, že se některé automaticky otevírané nabídky objevovaly na špatném monitoru při používání více monitorů
es: Se corrige una regresión en 5.0 que hacía que algunos menús emergentes apareciesen en un monitor incorrecto en configuraciones con varios monitores
ru: Исправлена ​​регрессия в 5.0: некоторые всплывающие меню отображались на неправильном мониторе в мультимониторных установках.
uk: Виправлено регресію у версії 5.0, яка спричиняла появу контекстних меню не на тому моніторі у системах із декількома моніторами.

source: macOS: Fix a long standing bug that prevented drag and drop of multiple items
cs: macOS: Oprava dlouhotrvající chyby, která bránila přetahování více položek
es: macOS: Se corrige un fallo antiguo que imposibilitaba arrastrar y soltar elementos múltiples
ru: macOS: исправлена давняя ошибка, мешавшая перетаскиванию нескольких файлов.
uk: macOS: виправлено давню ваду, яка заважала нормальному перетягуванню зі скиданням декількох записів одночасно

source: Windows: Fix a regression that broke scanning for default programs for the Open with action
cs: Windows: Oprava regrese, která poškodila vyhledávání výchozích programů pro akci Otevřít v programu
es: Windows: Se corrige una regresión que estropeaba la búsqueda de programas predeterminados para la acción Abrir con
ru: Windows: исправлена регрессия, нарушившая сканирование программ по умолчанию для действия «Открыть с помощью».
uk: Windows: виправлено регресію, яка заважала пошуку типових програм для дії «Відкрити за допомогою»

source: Windows: Fix a regression in 5.0 causing some MOBI files with non-BMP characters not being processed correctly.
cs: Windows: Oprava regrese v 5.0 způsobující, že některé soubory MOBI se znaky, které nejsou BMP, nebyly správně zpracovány.
es: Windows: Se corrige una regresión en 5.0 que hacía que algunos archivos MOBI con caracteres fuera del plano básico multilingüe de Unicode no se procesaran correctamente.
ru: Windows: исправлена регрессия в выпуске 5.0, из-за которой некоторые файлы MOBI с не-BMP символами обрабатывались неправильно.
uk: Windows: виправлено регресію у версії 5.0, яка заважала нормальній обробці деяких файлів MOBI із символами, відмінними від BMP.

source: E-book viewer: Fix scrolling past the end of chapter boundaries not working in books that have negative margins
cs: Prohlížeč e-knih: Oprava nefunkčnosti posouvání za konec hranic kapitol v knihách, které mají záporné okraje
es: Visor de libros electrónicos: Se corrige el fallo por el que no se podía desplazar más allá de los límites del capítulo en libros con márgenes negativos
ru: Просмотрщик электронных книг: исправлена прокрутка за пределами границ главы не работавшая в книгах с отрицательными полями.
uk: Засіб перегляду книг: відновлено працездатність гортання за кінець глави у книгах із від'ємними значеннями розмірів полів

source: Edit metadata dialog: fix incorrect rendering of custom column names that start with emoji.
cs: Dialogové okno úpravy metadat: Oprava nesprávného vykreslení názvů vlastních sloupců, které začínají smajlíky.
es: Cuadro de modificación de metadatos: Se corrige la impresión incorrecta de nombres de columna personalizada que comienzan con emoji.
ru: Диалог редактирования метаданных: исправлено некорректное отображение имен настраиваемых столбцов, начинающихся с эмодзи.
uk: Вікно редагування метаданих: виправлено помилкову обробку назв нетипових стовпчиків, які починаються з емодзі.

source: Quickview: Fix nothing shown after clearing the search.
cs: Rychlé zobrazení: Oprava stavu, kdy se po vymazání hledání nic nezobrazilo.
es: Vista rápida: Se corrige el fallo por el que no se mostraba nada tras limpiar la búsqueda.
ru: Быстрый просмотр: исправлено поведение, когда после очистки поиска ничего не показывалось.
uk: Швидкий перегляд: виправлено помилку, яка призводила до того, що програма нічого не показувала після спорожнення поля пошуку.

source: Dark mode: Fix radio buttons having no outline.
cs: Tmavý režim: Oprava přepínačů, které neměly žádné obrysy.
es: Modo oscuro: Se corrige el fallo por el que los botones de radio no tenían borde.
ru: Тёмный режим: исправлено отсутствие контура у переключателей.
uk: Темний режим: відновлено показ контурів для пунктів варіантів.

source: Annotations browser: When showing a book in the calibre library that is not currently visible, display an error.
cs: Anotace prohlížeče: Zobrazení chyby při zobrazení knihy v knihovně Calibre, která není aktuálně viditelná.
es: Explorador de anotaciones: Al mostrar un libro en la biblioteca de calibre que no es visible actualmente, se muestra un error.
ru: Браузер аннотаций: при отображении книги из не видимой в данный момент библиотеки calibre выводилось сообщение об ошибке.
uk: Навігатор анотаціями: реалізовано показ повідомлення щодо помилки при показ книги, яку зараз не показано у бібліотеці calibre.

source: 07 Oct, 2020
cs: 7. října 2020
es: 7 oct 2020
ru: 07 октября 2020
uk: 7 жовтня 2020 року

source: Browse annotations: Add a check box to restrict the displayed annotations to only the books currently selected in the calibre library.
cs: Procházet anotace: Přidáno zaškrtávací políčko pro omezení zobrazených notací pouze na aktuálně vybrané knihy v knihovně Calibre.
es: Explorar anotaciones: Se añade una casilla para restringir las anotaciones mostradas a los libros actualmente seleccionados en la biblioteca de calibre.
ru: Обзор аннотаций: добавлен флажок для ограничения отображаемых аннотаций только книгами, выбранными сейчас в библиотеке calibre.
uk: Навігація анотаціями: додано пункт для обмеження показу анотацій лише книгами, які позначено у бібліотеці calibre.

source: Allow storing and calling functions in the calibre template language (Preferences-&gt;Template functions)
cs: Umožnění ukládání a vyvolávání funkcí v jazyce šablon Calibre (Předvolby-&gt;Funkce šablon)
es: Se permite guardar e invocar funciones en el lenguaje de plantillas de calibre (Preferencias &gt; Funciones de plantilla)
ru: Разрешено сохранение и вызов функций на языке шаблона calibre (Настройки -> Шаблонные функции)
uk: Уможливлено збереження і виклик функцій мовою шаблонів calibre (Налаштування-&gt;Шаблонні функції)

source: Add a shortcut (Shift+V) to open the last read book.
cs: Přidána klávesová zkratka (Shift+V) pro otevření naposledy čtené knihy.
es: Se añade un atajo (Mayús+V) para abrir el último libro leído.
ru: Добавлено сочетание клавиш (Shift+V) для открытия последней читаемой книги.
uk: Додано клавіатурне скорочення (Shift+V) для відкриття останньої прочитаної книги.

source: Fix import errors with some third party plugin on Windows
cs: Oprava chyb importu u některých modulů třetích stran ve Windows
es: Se corrigen errores de importación en algunos complementos de terceros en Windows
ru: Исправлены ошибки импорта некоторых сторонних плагинов в Windows.
uk: Виправлено помилки імпортування для деяких сторонніх додатків у Windows

source: Viewer: Fix toolbar show controls button not working when no book is open.
cs: Prohlížeč: Oprava nefunkčnosti tlačítka pro zobrazení ovládacích prvků, když není otevřena žádná kniha.
es: Visor: Se corrige el fallo por el que el botón de mostrar controles en la barra de tareas no funcionaba si no hay ningún libro abierto.
ru: Просмотрщик: Исправлена ​​ошибка, из-за которой кнопка управления отображением панели инструментов не работала, когда ни одна книга не открыта.
uk: Засіб перегляду: виправлено помилку, пов'язану із тим, що кнопки на панелі керування було показано непрацездатними, якщо не відкрито жодної книги.

source: Viewer: Fix incorrect positioning of context menu for viewer toolbar.
cs: Prohlížeč: Oprava nesprávného pozicování místní nabídky pro panel nástrojů prohlížeče.
es: Visor: Se corrige la posición incorrecta del menú contextual para la barra de herramientas del visor.
ru: Просмотрщик: Исправлено неправильное расположение контекстного меню для панели инструментов просмотрщика.
uk: Засіб перегляду: виправлено неправильне розташування контекстного меню для панелі інструментів.

source: MOBI Input: Fix regression that broke reading of some documents
cs: Vstup MOBI: Oprava regrese, která poškodila čtení některých dokumentů
es: Entrada MOBI: Se corrige una regresión que estropeó la lectura de algunos documentos
ru: Ввод MOBI: исправлена регрессия, сломавшая чтение некоторых документов.
uk: Вхідні дані у MOBI: виправлено регресію, яка заважала читанню деяких документів
