Repository: debian-calibre/calibre
Catalog: translations-git/changelog/*.po
Languages: cs, es, ru, uk

source: 16 Mar, 2023
uk: 16 березня 2023 року

source: Release
cs: Vydání
es: Versión
ru: Выпуск
uk: Випуск

source: New features
cs: Nové funkce
es: Funcionalidades nuevas
ru: Новые возможности
uk: Нові можливості

source: Edit metadata: When setting a cover from comic files allow choosing which page to use as the cover
uk: Редагування метаданих: при встановленні обкладинки з файлів коміксів уможливлено вибір сторінки, яку буде використано як обкладинку

source: Closes tickets
cs: Uzavřená hlášení
es: Cierra los informes
ru: Закрытые тикеты
uk: Закриті квитки

source: Allow display of columns built from other columns as comments in Book details
uk: Уможливлено показ стовпчиків, побудованих на основі інших стовпчиків, у коментарях до параметрів книги

source: Comments editor: Add a shortcut for "Paste and match style" (Ctrl+Shift+v)
uk: Редактор коментарів: додано клавіатурне скорочення для дії «Вставити і встановити відповідність стилю» (Ctrl+Shift+V)

source: Bug fixes
cs: Opravy chyb
es: Correcciones de defectos
ru: Исправления ошибок
uk: Виправлення вад

source: macOS: ToC Editor: Fix mouse becoming unusable when trying to create a new entry
uk: macOS: редактор таблиці змісту: виправлено помилку, яка призводила до неможливості використання миші при спробі створення запису

source: When computing title sorts strip leading and trailing quotes, not just leading quotes
uk: При упорядкуванні за заголовком реалізовано вилучення початкових і завершальних лапок, а не лише початкових

source: Content server viewer: Fix searching only showing results from the current chapter onwards
uk: Переглядач сервера даних: виправлено помилку, пов'язану із тим, що при пошуку програма показувала лише результати з поточного розділу і далі

source: Check book: Fix some incorrect line numbers reported in a few CSS error messages
uk: Перевірка книги: виправлено певні помилкові номери рядків, про які повідомлялося у декількох повідомленнях про помилки CSS

source: Fix regression in 6.14.0 that caused some generated resources to be excluded from the calibre source bundle
uk: Виправлено регресію у 6.14.0, яка спричиняла виключення ресурсів з пакета початкового коду calibre

source: Fix regression in 6.14.0 that broke using paths with single quotes in them for the calibre library
uk: Виправлено регресію у 6.14.0, яка заважала використанню шляхів із одинарними лапками для бібліотеки calibre

source: Fix ToC Editor on macOS in 6.14.0 not working inside the Edit book tool only
uk: Виправлено непрацездатність редактора змісту у macOS у версії 6.14.0 лише у інструменті редагування книг

source: Improved news sources
cs: Vylepšené zdroje zpráv
es: Fuentes de noticias mejoradas
ru: Улучшенные источники новостей
uk: Поліпшені джерела новин

source: 17 Feb, 2023
uk: 17 лютого 2023 року

source: Content server: E-book viewer: Long tapping on an image now causes it to be displayed in an internal popup rather than a new window as some browsers block the creation of new windows
es: Servidor de contenidos: Visor de libros electrónicos: Un toque prolongado sobre una imagen ahora hace que se muestra la imagen en un cuadro emergente interno en lugar de una nueva ventana, pues algunos navegadores bloquean la creación de ventanas
uk: Сервер даних: засіб перегляду електронних книг: довге торкання на зображенні у новій версії призводить до показу зображення на внутрішній контекстній панелі, а не у новому вікні, оскільки деякі браузери блокують створення нових вікон

source: E-book viewer: Fix some adjacent highlights with nothing in between them not being displayed.
es: Visor de libros electrónicos: Se corrige el fallo por el que algunos resaltados adyacentes sin nada entre ellos no se mostraban.
uk: Засіб перегляду електронних книг: виправлено помилку, пов'язану із тим, що програма не показувала деякі сусідні підсвічування, між якими нічого не було.

source: Content server: Workaround for Safari regression causing bookmarks to disappear on reload
es: Servidor de contenidos: Solución alternativa para una regresión de Safari que hace que los marcadores desaparezcan al volver a cargar
uk: Сервер даних: реалізовано виправлення для регресії з Safari, яка спричиняла зникнення закладок при перезавантаженні книги

source: E-book viewer: Read aloud: Fix a regression in the previous release that caused the Read aloud controls to not reappear when Read aloud is canceled and restarted
es: Visor de libros electrónicos: Lectura en alto: Se corrige una regresión en la versión anterior que hacía que los controles de lectura en alto no volvieran a aparecer cuando la lectura en alto se cancela y se vuelve a iniciar
uk: Засіб перегляду електронних книг: читання уголос: виправлено регресію у попередньому випуску, яка спричиняла повторну появу засобів керування читанням уголос при скасуванні і перезапуску читання уголос

source: E-book viewer: Read aloud: Fix a regression in the previous release that caused an error when using Read aloud on a chapter with no text, such as the cover page
es: Visor de libros electrónicos: Lectura en alto: Se corrige una regresión en la versión anterior que causaba un error al usar la lectura en alto en un capítulo sin texto, como la página de portada
uk: Засіб перегляду електронних книг: читання уголос: виправлено регресію у попередньому випуску, яка спричиняла помилку ви використання читання уголос для глави без тексту, зокрема сторінки обкладинки

source: E-book viewer: Fix a regression that caused a spurious error on Windows when reading out selected text
es: Visor de libros electrónicos: Se corrige una regresión que causaba un error espurio en Windows al leer en alto un texto seleccionado
uk: Засіб перегляду електронних книг: виправлено регресію, яка спричиняла фіктивну помилку у Windows при читанні позначеного фрагмента тексту

source: Fix a regression in calibre 5.0 that broke sorting the device view by title if one of the books has an empty title
es: Se corrige una regresión en calibre 5.0 que estropeaba la ordenación por título de la vista de dispositivo si alguno de los libros tiene un título vacío
uk: Виправлено регресію у calibre 5.0, яка заважала упорядкуванню панелі пристрої за назвами, якщо у якоїсь з книг назва була порожньою

source: Edit book: Spell Check dialog: Fix second word not getting selected when after first word is fixed
es: Modificar libro: Diálogo de comprobación ortográfica: Se corrige el fallo por el que la segunda palabra no se selecciona después de corregir la primera
uk: Редагування книг: вікно перевірки правопису: виправлено помилку, пов'язану із тим, що друге слово не позначалося, якщо виправлено перше слово

source: Improve hover highlight color in tree views
es: Se mejora el color de resaltado al pasar el cursor en vistas de árbol
uk: Удосконалено колір підсвічування при наведенні вказівника миші на панелях ієрархічного перегляду

source: New news sources
cs: Nové zdroje zpráv
es: Nuevas fuentes de noticias
ru: Новые источники новостей
uk: Нові джерела новин

source: 03 Feb, 2023
es: 3 feb 2023
uk: 3 лютого 2023 року

source: E-book viewer: Read aloud: On Windows switch to using the new Microsoft speech subsystem with access to more voices
es: Visor de libros electrónicos: Lectura en alto: En Windows se usa el nuevo subsistema de síntesis de voz de Microsoft con acceso a más voces
uk: Засіб для читання електронних книг: читання вголос: у Windows виконано перехід на нову підсистему озвучування Microsoft зі доступом до ширшого спектра дикторів

source: Note that this means that old voice, speed and audio devices setting will not be used so a reconfiguration might be needed.
es: Tenga en cuenta que esto significa que las configuraciones anteriores de voz, velocidad y dispositivos de audio no se usarán, por lo que puede ser necesario volver a configurar.
uk: Зауважте, що це означає, що застарілі параметри дикторів, швидкості та звукових пристроїв не буде використано, тому потрібне буде нове налаштовування.

source: calibre:// URL scheme: allow specifying a Virtual library for show_book URLs
es: Esquema de URL calibre://: se permite especificar una biblioteca virtual para URL de tipo show_book
uk: Схема адрес calibre://: уможливлено визначення віртуальних бібліотек для адрес show_book

source: Add by ISBN: Allow adding using identifiers other than ISBN as well
es: Añadir por ISBN: Se permite añadir usando también identificadores distintos al ISBN
uk: Додавання за ISBN: уможливлено додавання за допомогою ідентифікаторів, відмінних від ISBN

source: Update bundled Qt to 6.4 this means calibre on macOS is now only supported on Big Sur and newer
es: Se actualiza el Qt incluido a 6.4, esto significa que calibre en macOS sólo es compatible con Big Sur y posteriores
uk: Оновлення пов'язано із Qt 6.4, це означає, що calibre у macOS може бути встановлено лише у системи Big Sur та новіші

source: Spell check dialog: Allow up and down arrow keys to work regardless of focus
es: Diálogo de comprobación de ortografía: Se permite que funcionen las teclas de flecha arriba y abajo independientemente del foco
uk: Вікно перевірки правопису: уможливлено роботу клавіш зі стрілками вгору і вниз, незалежно від фокусування

source: Allow multiple Template tester dialogs
es: Se permiten múltiples diálogos de prueba de plantillas
uk: Уможливлено декілька вікон тестування шаблонів

source: Windows MTP device driver: Ignore failure to enumerate objects inside non-root folders
es: Controlador de dispositivos MTP de Windows: Se ignoran fallos al listar objetos en carpetas que no son raíz
uk: Драйвер пристрою MTP Windows: реалізовано ігнорування помилок при нумеруванні об'єктів у некореневих теках

source: There are apparently a lot of devices out there that fail in this way. So rather than aborting the scan simply ignore the folder.
es: Al parecer hay muchos dispositivos que fallan de esta manera. Así que en lugar de abortar la exploración simplemente se omite la carpeta
uk: Здається, багато пристроїв показують помилки у цей спосіб. Тому, замість переривання сканування, теку буде просто проігноровано.

source: Book list: Fix a regression in the previous release that broke dragging to select multiple books
es: Lista de libros: Se corrige una regresión en la versión anterior que estropeaba la posibilidad de arrastrar para seleccionar varios libros
uk: Список книг: виправлено регресію у попередньому випуску, яка заважала перетягуванню для позначення декількох книг

source: Content server viewer: Fix reload book not actually reloading until the browser is also refreshed
es: Visor del servidor de contenidos: Se corrige el fallo por el que para volver a cargar un libro era necesario refrescar el navegador también
uk: Переглядач сервера даних: виправлено помилку, пов'язану з тим, що при перезавантаженні книги дані не перезавантажувалися, аж доки не оновлювалися дані браузера

source: E-book viewer: Fix occasional false warning about highlight being overwritten
es: Visor de libros electrónicos: Se corrigen las ocasionales advertencias incorrectas sobre reemplazo de resaltados
uk: Засіб для перегляду книг: виправлено помилкове попередження щодо перезапису підсвічування

source: E-book viewer: Fix detection of selected highlights when all text is selected
es: Visor de libros electrónicos: Se corrige la detección de resaltados seleccionados cuando se selecciona todo el texto
uk: Засіб для перегляду книг: виправлено виявлення позначених підсвічувань, коли позначено увесь текст

source: Fix an error when embedding metadata into a large number of books
es: Se corrige un error al incrustar metadatos en un gran número de libros
uk: Виправлено помилку при вбудовуванні метаданих до великої кількості книг

source: When updating metadata in EPUB 2 files and no language is specified, do not remove the &lt;dc:language&gt; tag as this causes epubcheck to complain. Instead set the language to "und"
es: Al actualizar metadatos en archivos EPUB 2 sin idioma especificado, no se elimina la etiqueta &lt;dc:language&gt;, puesto que esto hace que epubcheck se queje. En su lugar se establece el idioma en «und»
uk: При оновленні метаданих у файлах EPUB 2 без визначення мови усунено вилучення теґу &lt;dc:language&gt;, оскільки це спричиняє попередження з боку epubcheck. Замість цього, реалізовано встановлення мови "und"

source: Wireless device driver: Remove the timeout for initial connection
es: Controlador de dispositivo inalámbrico: Se elimina el tiempo de espera máximo para la conexión inicial
uk: Драйвер бездротових пристроїв: вилучено час очікування на початкове з'єднання

source: Use an icon rather than a color to report errors in fields and the search box
es: Se usa un icono en lugar de un color para informar de errores en los campos y en el cuadro de búsqueda
uk: Реалізовано використання піктограми замість кольору для повідомлення про помилки у полях та на панелі пошуку

source: Conversion dialog: Regex builder: Workaround bug in Qt that prevented searching for non breaking spaces in the wizard used to test search expressions
es: Diálogo de conversión: Constructor de expresiones regulares: Se evita un fallo en Qt que hace imposible la búsqueda de espacios duros en el asistente usado para probar expresiones de búsqueda
uk: Вікно перетворення: засіб побудови формальних виразів: реалізовано виправлення вади у Qt, яка заважала пошуку нерозривних пробілів у майстрі, що використовується для перевірки формальних виразів

source: Spell check dialog: move down after correcting word, not up
es: Diálogo de comprobación de ortografía: Se mueve hacia abajo, no hacia arriba, después de corregir una palabra
uk: Вікно перевірки правопису: реалізовано пересування вниз після виправлення слова, а не вгору

source: Get books: Fix Mobileread store plugin not working
es: Obtener libros: Se corrige el fallo por el que el complemento de Mobileread no funcionaba
uk: Отримання книг: виправлено працездатність додатка крамниці Mobileread

source: 06 Jan, 2023
cs: 6. ledna 2023
es: 6 ene 2023
uk: 6 січня 2023 року

source: Edit book: Check book: Allow automatic fixing of various simple CSS errors
es: Modificar libro: Comprobar libro: Se permite la corrección automática de varios errores simples de CSS
uk: Редагування книги: перевірка книги: уможливлено автоматичне виправлення різноманітних простих помилок CSS

source: E-book viewer: When Read aloud is speaking, make the control bar translucent so that words under the bar are visible
es: Visor de libros electrónicos: Mientras tiene lugar la lectura en alto, la barra de control se hace traslúcida para las palabras bajo la barra sean visibles
uk: Засіб для перегляду електронних книг: при читанні вголос панель керування зроблено прозорою, щоб були видимим слова під панеллю

source: Edit book: Switch to a new library (stylelint) for find problems in CSS as the old library was no longer maintained.
es: Modificar libro: Se usa una nueva librería (stylelint) para detectar problemas de CSS, pues la librería anterior ya no tiene mantenimiento
uk: Редагування книг: реалізовано перемикання на нову бібліотеку (stylelint) для пошуку проблем у CSS, оскільки підтримки старої бібліотеки більше не передбачено.

source: Edit book: File browser: Allow using keyboard shortcuts to re-order the spine
es: Modificar libro: Explorador de archivos: Se permite el uso de atajos de teclado para reordenar el lomo
uk: Редагування книги: навігатор книгами: уможливлено клавіатурні скорочення для переупорядкування вмісту

source: calibredb list: Allow specifying multiple fields for --sort-by
es: calibredb list: Se permite especificar varios campos para ordenar con --sort-by
uk: Список calibredb: уможливлено визначення декількох полів для --sort-by

source: Check library: Allow opening the book folder easily
es: Comprobar biblioteca: Se permite abrir la carpeta del libro fácilmente
uk: Перевірка бібліотеки: уможливлено просте відкриття теки з книгами

source: Fix windows not being moved onto the current monitor when they were previously visible on a removed monitor that was to the left of the current monitor
es: Se corrige el fallo por el que las ventanas no se mueven al monitor actual cuando antes eran visibles en un monitor eliminado que estaba a la izquierda del monitor actual
uk: Виправлено помилку, пов'язану із тим, що вікна не пересувалися на поточний монітор, якщо вони раніше були видимими на вилученому моніторі, який був ліворуч від поточного монітора

source: Book list: Fix a regression in the previous release that broke drag and drop of multiple books
es: Lista de libros: Se corrige una regresión en la versión anterior que estropeaba el arrastrado de múltiples libros
uk: Список книг: виправлено регресію у попередньому випуску, яка заважала перетягуванню зі скиданням декількох книг

source: Fix detection of Tolino Vision 6 on macOS/Linux
es: Se corrige la detección de Tolino Vision 6 en macOS y Linux
uk: Виправлено виявлення Tolino Vision 6 у macOS/Linux

source: Content server: Fix auto full screen not working when continuing to read books with user account enabled
es: Servidor de contenidos: Se corrige el fallo por el que la pantalla completa automática no funcionaba al continuar leyendo libros con la cuenta de usuario activada
uk: Сервер даних: виправлено автоматичний перехід до повноекранного режиму при продовженні читання книг із увімкненим обліковим записом користувача

source: Edit book: Set semantics: Fix error when setting the "Notes" semantic
es: Modificar libro: Establecer conceptos: Se corrige un error al establecer el concepto «Notas»
uk: Редагування книг: встановлення семантики: виправлено помилку при встановленні семантики «Нотатки»

source: HTMLZ output: Fix images referred to in CSS stylesheets not being converted
es: Salida HTMLZ: Se corrige el fallo por el que las imágenes con referencias en las hojas de estilo CSS no se convertían
uk: Виведення до HTMLZ: виправлено помилку, пов'язану із тим, що зображення, на які посилалася таблиця стилів CSS не перетворювалися

source: Book details panel: Fix HTML comment tags in the comments breaking display of book details
es: Panel de detalles del libro: Se corrige el fallo por el que las etiquetas de comentario HTML en los comentarios estropeaban la visualización de los detalles del libro
uk: Панель подробиць щодо книги: виправлено помилку, пов'язану із тим, що теґи HTML у коментарях заважали показу подробиць щодо книги

source: Content server home page: When showing recently read books from across devices hide the entries for which loading the cover fails
es: Página de inicio del servidor de contenidos: Al mostrar los libros leídos recientemente de varios dispositivos se ocultan las entradas para las que falla la carga de la portada
uk: Домашня сторінка сервера даних: реалізовано приховування записів, для яких не вдається завантажити обкладинку при перегляді прочитаних на різних пристроях книг

source: Windows Text-to-speech: Do not fail to configure if one of the voices has no defined language
es: Síntesis de voz en Windows: No se genera un fallo de configuración si una de las voces no tiene idioma definido
uk: Синтез мовлення з тексту у Windows: реалізовано можливість налаштовування, якщо для одного з мовців немає визначеної мови

source: Fix a regression in calibre 5 that broke using a file for the --extra-css option of ebook-convert
es: Se corrige una regresión en calibre 5 que estropeaba el uso de un archivo para la opción --extra-css de ebook-convert
uk: Виправлено регресію у calibre 5, яка заважала використанню файла для параметра --extra-css команди ebook-convert

source: Content server FTS: Fix page header bar not visible
es: Búsqueda de texto completo del servidor de contenidos: Se corrige el fallo por el que la barra de encabezado de página no era visible
uk: Повнотекстовий пошук на сервері даних: виправлено помилку, пов'язану із тим, що панель заголовка сторінки лишалася невидимою

source: Content server: Fix identifiers from third party metadata download plugins not becoming clickable links on the book details page
es: Servidor de contenidos: Se corrige el fallo por el que los identificadores de complementos de descarga de metadatos de terceros no se convertían en enlaces activos en la página de detalles del libro
uk: Сервер даних: виправлено помилку пов'язану із тим, що ідентифікатор від сторонніх додатків отримання метаданих не ставали придатними до натискання посиланнями на сторінці подробиць щодо книги

source: Edit book: Warn when saving will overwrite a read-only file
es: Modificar libro: Se advierte cuando el guardado reemplazará un archivo de sólo lectura
uk: Редагування книги: реалізовано попередження при переписуванні збереженим файлом придатного лише для читання файла

source: Fix restoring geometry of maximized/fullscreen dialogs forcing them visible
es: Se corrige el fallo por el que al restaurar la geometría de diálogos maximizados o a pantalla completa se forzaba que fueran visibles
uk: Виправлено примусове встановлення видимості при відновленні геометрії максимізованих або повноекранних вікон

source: Fix a regression in the previous release that caused spurious error message when doing some out of band searches
es: Se corrige una regresión en la versión anterior que ocasionaba mensajes de error espurios al efectuar algunas búsquedas fuera de banda
uk: Усунено регресію попереднього випуску, яка спричиняла хибне повідомлення про помилку при виконанні деяких зовнішніх пошуків

source: Fix a regression in the previous release that broke choosing new programs for the Open with function
es: Se corrige una regresión en la versión anterior que estropeaba la elección de nuevos programas para la función Abrir con
uk: Усунено регресію попереднього випуску, яка заважала вибору нових програм для функціональної можливості «Відкрити за допомогою»

source: 16 Dec, 2022
es: 16 dic 2022
ru: 16 декабря 2022 г.
uk: 16 грудня 2022 року

source: Content server: Add support for searching the full text of books. Simply click the FTS link on the search page to start a full text search.
es: Servidor de contenidos: Se añade la posibilidad de buscar en el texto completo de los libros. Pulse en enlace a la búsqueda de texto completo en la página de búsqueda para iniciar una búsqueda de texto completo.
ru: Контент-сервер: добавлена ​​поддержка поиска по полному тексту книг. Просто щелкните ссылку FTS на странице поиска, чтобы начать полнотекстовый поиск.
uk: Сервер даних: додано підтримку повнотекстового пошуку у книгах. Просто натисніть посилання на повнотекстовий пошук на сторінці пошуку.

source: Content server: When using user accounts, the homepage now shows recently read books from any device not just the current device
es: Servidor de contenidos: Al usar cuentas de usuario, la página de inicio ahora muestra los libros leídos recientemente en todos los dispositivos, no sólo el actual
ru: Контент-сервер: при использовании учетных записей пользователей на домашней странице теперь отображаются недавно прочитанные книги с любого устройства, а не только с текущего.
uk: Сервер даних: якщо використано облікові записи користувачів, на домашній сторінці у новій версії буде показано нещодавно прочитані книги з усіх пристроїв, а не лише з поточного.

source: Kobo driver: Bump the max supported firmware version
es: Controlador Kobo: Se actualiza la máxima versión de firmware con compatibilidad
ru: Драйвер Kobo: увеличена максимальная поддерживаемая версия прошивки
uk: Драйвер Kobo: збільшено максимальний номер підтримуваної версії мікропрограми

source: Conversion: New Output profile for the Kindle Scribe
es: Conversión: Nuevo perfil de salida para el Kindle Scribe
ru: Конвертация: новый профиль вывода для Kindle Scribe
uk: Перетворення: новий профіль виведення для Kindle Scribe
