Repository: debian-calibre/calibre
Catalog: translations-git/changelog/*.po
Languages: cs, es, ru, uk

source: Fix PDB E-reader output broken in calibre 5
cs: Oprava poškozeného výstupu elektronické čtečky PDB v Calibre 5
es: Se corrige la salida PDB E-reader estropeada en calibre 5
ru: Исправлен вывод PDB E-reader, сломанный в 5-м calibre
uk: Виправлено помилки у виведенні PDB у calibre 5

source: Edit book: Reports: Include descendant selectors that use classes when counting class usage
cs: Upravit knihu: Hlášení: Zahrnutí selektorů potomků, které používají třídy, při počítání použití tříd
es: Modificar libro: Informes: Se incluyen selectores descendientes que usan clases al contar el uso de clases
ru: Редактор книг: Отчеты: Включить нисходящие селекторы, использующие классы при подсчете использования классов
uk: Редагування книги: звіти: реалізовано включення підлеглих засобів вибору, які використовують класи, при підрахунках використання класів

source: E-book viewer: Fix an error when opening some books with highlights that span in-line text formatting
cs: Prohlížeč e-knih: Oprava chyby při otevírání některých knih se zvýrazněními, která zahrnují řádkové formátování textu
es: Visor de libros electrónicos: Se corrige un error al abrir algunos libros con resaltados que incluyen formato de texto en línea
ru: Просмотрщик электронных книг: исправление ошибки при открытии некоторых книг с выделением, охватывающим встроенное форматирование текста.
uk: Засіб перегляду електронних книг: виправлено помилку при відкритті деяких книг із підсвічуваннями, які включають вбудоване форматування тексту

source: MTP driver: Do not send the calibre device db files to the root folder on the Supernote A5 x as it fails
cs: Ovladač MTP: Neodeílat soubory db zařízení Calibre do kořenové složky v Supernote A5 x, protože to selže
es: Controlador MTP: No se envían los archivos db de dispositivo de calibre a la carpeta raíz de la Supernote A5 x, ya que falla
ru: Драйвер MTP: не отправлять device db файлы Calibre в корневую папку на Supernote A5 x - сбоит.
uk: Драйвер MTP: усунено надсилання файлів баз даних пристрою calibre до кореневої теки на Supernote A5 x, оскільки воно завершується помилкою

source: ToC Editor: Workaround an occasional error when closing on Windows if the file being edited is in a DropBox/antivirus prone folder
cs: Editor obsahu: Vyřešení občasné chyba při zavírání ve Windows, pokud je upravovaný soubor ve složce DropBoxu nebo antiviru
es: Editor de índice: Solución alternativa para un error ocasional al cerrar en Windows si el archivo que se está editando está en una carpeta objetivo de DropBox o antivirus
ru: Редактор ToC: временное решение проблемы при закрытии в Windows, если редактируемый файл находится в папке DropBox / под контролем антивируса
uk: Редактор змісту: реалізовано обхідний шлях для рідкісної помилки при закритті у Windows, якщо файл, який було змінено, перебуває у теці DropBox або теці, захищеній антивірусом

source: Fix a regression in the previous release that broke creating new keyboard shortcuts
cs: Oprava regrese v předchozím vydání, která poškodila vytvoření nové klávesové zkratky
es: Se corrige una regresión en la versión anterior que estropeaba la creación de nuevos atajos de teclado
ru: Исправлена регрессия в предыдущем выпуске, нарушавшая создание новых клавиатурных сокращений
uk: Усунено регресію попереднього випуску, яка заважала створенню клавіатурних скорочень

source: Comments editor: When flowing the tool bar onto multiple lines do not split up groups of buttons
cs: Editor komentářů: Při přetékání panelu nástrojů na více řádků nerozdělovat skupiny tlačítek
es: Editor de comentarios: Al dividir la barra de herramientas en varias líneas no se dividen los grupos de botones
ru: Редактор комментариев: при разделении панели инструментов на несколько строк не разделять группы кнопок.
uk: Редактор коментарів: при поділі довгої панелі інструментів на декілька рядків усунено можливість поділу груп кнопок

source: Various compatibility fixes for Python 3.10 used by some Linux distributions
cs: Různé opravy kompatibility pro Python 3.10 používaném v některých distribucích Linuxu
es: Varios cambios para compatibilidad con Python 3.10, que usan algunas distribuciones de Linux
ru: Различные исправления совместимости для Python 3.10, используемые некоторыми дистрибутивами Linux.
uk: Різноманітні виправлення сумісності із Python 3.10, який використано у деяких дистрибутивах Linux

source: 03 Dec, 2021
cs: 3. prosince 2021
es: 3 dic 2021
ru: 03 декабря, 2021
uk: 3 грудня 2021 року

source: Allow changing the icon used for calibre libraries. Right click the library icon in calibre and choose "Change the icon for this library"
cs: Umožnění změnit ikonu používanou pro knihovny Calibre. Klikněte pravým tlačítkem myši na ikonu knihovny v Calibre a zvolte „Změnit ikonu pro tuto knihovnu
es: Se permite cambiar el icono usado para las bibliotecas de calibre. Pulse con el botón derecho en el icono de la biblioteca y seleccione «Cambiar el icono para esta biblioteca»
ru: Разрешено изменение значка, используемого для библиотек calibre. Щёлкните правой кнопкой мыши значок библиотеки в calibre и выберите "Изменить значок для этой библиотеки"
uk: Уможливлено зміну піктограми, яка використовується для бібліотек calibre. Клацніть правою кнопкою миші на піктограмі бібліотеки у calibre і виберіть у меню пункт «Змінити піктограму для цієї бібліотеки»

source: Comments editor: Use a single line for all three toolbars if they fit
cs: Editor komentářů: Použití jednoho řádku pro všechny tři panely nástrojů, pokud se vejdou
es: Editor de comentarios: Se usa una sola línea para las tres barras de herramientas si caben
ru: Редактор комментариев: использовать одну строку для всех трех панелей инструментов, если они умещаются
uk: Редактор коментарів: реалізовано використання одного рядка для усіх трьох панелей інструментів, якщо вони у ньому вміщуються.

source: Edit book: Allow merging HTML files by drag and drop of the files onto another HTML file
cs: Upravit knihu: Umožnění sloučení souborů HTML přetažením souborů na jiný soubor HTML
es: Modificar libro: Se permite combinar archivos HTML arrastrando y soltando archivos sobre otro archivo HTML
ru: Редактор книг: разрешено объединение файлов HTML при перетаскивании файлов на другой файл HTML
uk: Редагування книг: уможливлено об'єднання файлів HTML перетягуванням зі скиданням одного файла HTML на інший

source: Kobo driver: Add support for listing purchased audiobooks
cs: Ovladač Kobo: Přidání podpory pro výpis zakoupených audioknih
es: Controlador Kobo: Se añade compatibilidad para mostrar audiolibros comprados
ru: Драйвер Kobo: добавлена ​​поддержка для перечисления приобретённых аудиокниг
uk: Драйвер Kobo: додано підтримку побудови списку придбаних звукових книг

source: Edit metadata all-in-one mode: The cover and formats column now gives as much vertical space as possible to the cover image
cs: Upravit metadat v režimu vše v jednom: Sloupec obálky a formátů nyní poskytuje co nejvíce svislého prostoru pro obrázek obálky
es: Modo todo en uno de modificación de metadatos: Las columnas de portada y formatos ahora dan todo el espacio vertical posible a la imagen de portada
ru: Универсальный режим редактирования метаданных: столбец обложки и форматов теперь даёт максимум вертикального пространства для изображения обложки
uk: Редагування метаданих у режимі «все в одному»: у стовпчиках обкладинок і форматів нової версії передбачено набагато більше вертикального місця для зображення обкладинки.

source: Add books dialog: When a non-book file type is added the next time the dialog is used, preselect the "All files" filter
cs: Dialogové okno Přidat knihy: Když je přidán soubor jiného typu než kniha, tak při příštím použití dialogového okna předem vybrat filtr „Všechny soubory“
es: Diálogo de añadir libros: Cuando se añade un archivo que no es un libro, la próxima vez que se usa el diálogo se preselecciona el filtro «Todos los archivos»
ru: Диалог добавления книг: при добавлении типа файла, отличного от книги, при следующем использовании диалогового окна предвыбирается фильтр "Все файлы"
uk: Вікно додавання книг: якщо ви додаватимете дані, файл яких не належить до типу електронних книг, наступного разу, коли ви користуватиметеся діалоговим вікном вибору файлів, у ньому буде вибрано фільтр «усі файли».

source: calibre-server --manage-users: Allow managing users while the server is running and also add actions to automate changing user account restrictions
cs: calibre-server --manage-users: Umožnění správy uživatelů za běhu serveru a také přidání akcí pro automatickou změnu omezení účtu uživatele
es: calibre-server --manage-users: Se permite administrar usuarios mientras el servidor está en ejecución y se añaden acciones para automatizar el cambio de restricciones de las cuentas de usuario.
ru: calibre-server --manage-users: разрешено управление пользователями во время работы сервера, а также добавлены действия для автоматизации изменения ограничений учётной записи пользователя
uk: calibre-server --manage-users: уможливлено керування записами користувачів під час роботи сервера, а також додано пункти дій для автоматичної зміни обмежень облікових записів користувачів

source: EPUB 3 metadata: If the book contains a "subtitle" append it to the main title when reading metadata
cs: Metadata EPUB 3: Pokud kniha obsahuje „podnázev“, připojit ho při čtení metadat k hlavnímu názvu
es: Metadatos EPUB 3: Si el libro contiene un subtítulo, se añade al título principal al leer los metadatos
ru: Метаданные EPUB 3: если книга содержит "subtitle" ("подзаголовок"), добавить его к основному заголовку при чтении метаданных
uk: Метадані EPUB 3: якщо у книзі міститься запис «subtitle» у новій версії його буде додано до основного заголовка при читанні метаданих

source: E-book viewer: Fix an occasional hang on startup at "Loading section"
cs: Prohlížeč e-knih: Oprava občasného zaseknutí při spuštění na „Načítání oddílu“
es: Visor de libros electrónicos: Se corrige un cuelgue ocasional al inicio en «Cargando sección»
ru: Просмотрщик электронных книг: исправлено периодическое зависание при загрузке в "Загрузка секции"
uk: Засіб перегляду електронних книг: усунено рідкісне зависання під час запуску на етапі «Завантажуємо розділ»

source: Get books: Update the Kobo plugin for website changes
cs: Získat knihy: Aktualizace modulu Kobo kvůli změnám stránek
es: Obtener libros: Se actualiza el complemento Kobo por cambios en el sitio web
ru: Приобрести книги: обновлен плагин Kobo из-за изменений на сайтах.
uk: Отримання книг: оновлено додаток Kobo відповідно до змін на сайті

source: Bulk edit metadata dialog: Fix changing the search mode resetting other fields
cs: Dialogové okno hromadné úpravy metadat: Oprava změny režimu vyhledávání, která obnovovala ostatní pole
es: Diálogo de modificación de metadatos en masa: Se corrige el fallo por el que al cambiar el modo de búsqueda se restablecían otros campos
ru: Диалог массового редактирования метаданных: исправлено изменение режима поиска, сбрасывающее другие поля
uk: Вікно пакетного редагування метаданих: виправлено помилку, яка призводила до спорожнення усіх полів при зміні режиму пошуку

source: E-book viewer: Fix sorting of highlights incorrect in books that use HTML ids with a hyphen in them
cs: Prohlížeč e-knih: Oprava nesprávného řazení zvýraznění v knihách, které používají identifikátory HTML obsahující spojovník
es: Visor de libros electrónicos: Se corrige el orden incorrecto de los resaltados en libros que usan id HTML con guión
ru: Просмотрщик электронных книг: исправление неправильной сортировки выделений в книгах, в которых используются идентификаторы HTML с дефисом
uk: EЗасіб перегляду електронних книг: виправлено неправильне упорядковування підсвічувань у книгах, де використано ідентифікатори HTML із символами дефіса

source: PDF Output: Fix the option to break long words at the ends of lines causing boxes to be rendered at the end of the line on macOS with some fonts
cs: Výstup PDF: Oprava volby zalamování dlouhých slov na konci řádků, která způsobovala, že se u některých písem v macOS na konci řádku vykreslovaly rámečky
es: Salida PDF: Se corrige el fallo por el que la opción para dividir las palabras largas al final de renglón hacía que aparecieran cuadrados al final del renglón en macOS con algunos tipos de letra
ru: Вывод в формате PDF: исправлена ​​возможность разбиения длинных слов на концах строк, из-за чего в MacOS с некоторыми шрифтами в конце строки отображались поля
uk: Виведення до PDF: виправлено роботу пункту для перенесення довгих слів наприкінці рядка; помилку можна було спостерігати у macOS при використанні деяких шрифтів

source: Google metadata plugin: When searching by ISBN if no results are found retry using an alternate query syntax
cs: Modul metadat Google: Pokud při vyhledávání podle ISBN nejsou nalezeny žádné výsledky, zkusit znovu použít alternativní syntaxi dotazu
es: Complemento de metadatos de Google: Al buscar pos ISBN, si no se encuentra resultados se vuelve a intentar con una sintaxis de consulta alternativa
ru: Плагин метаданных Google: при поиске по ISBN, если результаты не найдены, повторить попытку, используя альтернативный синтаксис запроса
uk: Додаток метаданих Google: при пошуку за ISBN нова версія виконає повторну спробу із використанням альтернативного синтаксису запиту, якщо нічого не буде знайдено за основним запитом

source: 5.33.2 fixes a couple of regressions that broke the toolbar in the popup comments editor dialog and rendering of the download metadata button in the edit metadata dialog on Windows, as well as reading files from MTP devices on Windows
cs: 5.33.1 opravuje několik regresí, které poškodily panel nástrojů v automaticky otevíraném dialogovém okně editoru komentářů a vykreslování tlačítka pro stažení metadat v dialogovém okně pro úpravu metadat ve Windows, stejně jako čtení souborů z MTP zařízení na Windows
es: La versión 5.33.2 corrige un par de regresiones que estropeaban la barra de herramientas en el diálogo emergente de modificación de comentarios y la apariencia del botón de descarga de metadatos en el diálogo de modificación de metadatos en Windows, así como la lectura de archivos de dispositivos MTP en Windows
ru: 5.33.2 исправлена пара регрессий, которые нарушали работу панели инструментов в диалоговом окне редактора всплывающих комментариев и отображение кнопки загрузки метаданных в диалоговом окне редактирования метаданных в Windows, а также чтение файлов с устройств MTP в Windows.
uk: У 5.33.2 виправлено двійко регресій, які заважали роботі панелі інструментів у редакторі контекстних коментарів та показу кнопки отримання метаданих у вікні редагування метаданих у Windows, а також читанню файлів з пристроїв MTP у Windows

source: 12 Nov, 2021
cs: 12. listopadu 2021
ru: 12 ноя, 2021
uk: 12 листопада 2021 року

source: Edit book: Add a tool to transform HTML tags based on rules (Tools-&gt;Transform HTML)
cs: Upravit knihu: Přidání nástroje pro převod značek HTML na základě pravidel (Nástroje-&gt;Převod HTML)
es: Modificar libro: Se añade una herramienta para transformar etiquetas HTML según reglas (Herramientas &gt; Transformar HTML)
ru: Редактор книг: добавлен инструмент для трансформации HTML-тегов на основе правил (Утилиты-&gt;Трансформировать HTML)
uk: Редагування книг: додано інструмент для перетворення теґів HTML на основі визначених правил (Інструменти-&gt;Перетворити HTML)

source: Allows for making transformations such as changing one html tag to another, deleting tags, wrapping them in another tag, etc. Also available during conversions via the Look &amp; feel-&gt;Transform HTML section of the conversion dialog.
cs: Umožňuje provádět převody, jako je změna jedné značky html na jinou, odstranění značek, jejich zabalení do jiné značky apod. K dispozici také během převodů prostřednictvím oddílu Vzhled a chování-&gt;Převod HTML v dialogovém okně převodu.
es: Permite realizar transformaciones como cambiar una etiqueta HTML en otra, borrar etiquetas, envolverlas en otra etiqueta, etc. También está disponible durante las conversiones en la sección Apariencia &gt; Transformar HTML del diálogo de conversión.
ru: Позволяет выполнять трансформации, такие как замена одного тега HTML на другой, удаление тегов, их перенос в другой тег и т. д. Доступен во время трансформаций в разделе диалогового окна трансформации Внешний вид-> Трансформировать HTML .
uk: Цей інструмент забезпечує виконання перетворень, зокрема заміни одного теґу html на інший, огортання теґів у інші тощо. Доступ до цього інструмента можна також отримати за допомогою розділу «Вигляд і поведінка -&gt; Перетворити HTML» діалогового вікна перетворення.

source: Driver for the new Tolino Vision 6
cs: Ovladač pro nové Tolino Vision 6
es: Controlador para el nuevo Tolino Vision 6
ru: Драйвер для нового Tolino Vision 6
uk: Драйвер до нової Tolino Vision 6

source: Kobo driver: Add support for the latest firmware released last week
cs: Ovladač Kobo: Přidána podpora pro nejnovější verzi firmwaru vydanou minulý týden
es: Controlador Kobo: Se añade compatibilidad para el último «firmware» publicado la semana pasada
ru: Драйвер Kobo: добавлена ​​поддержка последней прошивки, выпущенной на прошлой неделе.
uk: Драйвер Kobo: додано підтримку найсвіжішої версії мікропрограми, яку було випущено минулого тижня

source: When picking a random book ensure recently chosen books are not re-selected
cs: Zajištění, aby při výběru náhodné knihy nebyly znovu vybrány nedávno vybrané knihy
es: Al escoger un libro aleatorio se procura que no se vuelvan a seleccionar los libros elegidos recientemente
ru: При выборе случайной книги, проверка того что недавно выбранные книги не выбирались повторно.
uk: Усунено повторний вибір нещодавно вибраних книг при виборі випадкової книги

source: Icon theme chooser dialog: Allow right clicking on a theme to visit its homepage
cs: Dialogové okno pro výběr motivu ikony: Umožnění kliknutím pravým tlačítkem myši na motiv navštívit jeho domovskou stránku
es: Diálogo de elección de tema de iconos: Se permite pulsar con el botón derecho sobre un tema para visitar su página principal
ru: Диалоговое окно выбора темы значка: разрешён щелчок правой кнопкой мыши по теме, чтобы перейти на её домашнюю страницу
uk: Вікно вибору теми піктограм: уможливлено клацання правою кнопкою миші на пункті теми для переходу до домашньої сторінки теми

source: Amazon metadata download: Add support for more markup variations in amazon's sites that could prevent the fetching of ratings, comments and series metadata for some books
cs: Stahování metadat Amazon: Přidání podpory pro další varianty značení na stránkách Amazonu, které by mohly zabránit načítání hodnocení, komentářů a metadat sérií pro některé knihy
es: Descarga de metadatos de Amazon: Se añade compatibilidad para más variaciones de marcado en las páginas de Amazon que pueden evitar que se reconozcan metadatos de calificaciones, comentarios y series en algunos libros
ru: Загрузка метаданных Amazon: добавлена поддержка дополнительных вариантов разметки на сайтах Amazon, которые могут препятствовать получению оценок, комментариев и метаданных серий для некоторых книг.
uk: Отримання метаданих Amazon: додано підтримку ширшого діапазону розмітки на сайтах amazon, яка може заважати отриманню даних оцінок, коментарів та метаданих деяких книг

source: Google search: Add support for new beta search results page markup that was preventing using cached Google pages to search for Amazon metadata
cs: Vyhledávání na Googlu: Přidání podpory pro nové značení stránky s výsledky vyhledávání v beta verzi, které zabraňovalo použití stránek Google uložených v mezipaměti pro vyhledávání metadat Amazonu
es: Búsqueda de Google: Se añade compatibilidad con el nuevo marcado beta en la página de resultados que evitaba que se usaran las páginas de Google en caché para buscar metadatos de Amazon
ru: Поиск Google: добавлена ​​поддержка новой разметки страницы результатов поиска бета-версии, которая не позволяла использовать кешированные страницы Google для поиска метаданных Amazon.
uk: Пошук Google: додано підтримку нової тестової розмітки сторінки результатів пошуку, яка заважала використанню кешованих сторінок Google для пошуку метаданих Amazon

source: PDF Output: Fix the option to preserve cover aspect ratio being ignored when converting comics
cs: Výstup PDF: Oprava ignorování volby zachování poměru stran obálky při převodu komiksů
es: Salida PDF: Se corrige el fallo por el que la opción para mantener las proporciones de la portada se ignoraba al convertir cómics
ru: Вывод в PDF: исправлена ​​опция, позволявшая игнорировать соотношение сторон обложки при преобразовании комиксов.
uk: Виведення PDF: виправлено роботу параметра збереження співвідношення сторін зображення обкладинки при перетворенні коміксів

source: DOCX Input: Sanitize image filenames more strictly to workaround broken EPUB software
cs: Vstup DOCX: Přísnější oprava názvů souborů obrázků pro vyřešení nefunkčního softwaru EPUB
es: Entrada DOCX: Se limpian los nombres de archivo de imágenes de una manera más estricta para evitar problemas con software EPUB deficiente
ru: Ввод DOCX: более строгая очистка имён файлов изображений, для обхода неисправного ПО, работающего с EPUB
uk: Вхідні дані DOCX: реалізовано ретельнішу строгу обробку назв файлів, щоб запобігти помилкам із неякісним програмним забезпеченням для роботи з EPUB

source: Linux binary: Fix file dialogs not working on Fedora 35 under KDE
cs: Binární systém Linux: Oprava nefunkčnosti souborových dialogů na Fedoře 35 pod KDE
es: Binario Linux: Se corrige el fallo por el que los diálogos de archivo no funcionaban en Fedora 35 en KDE
ru: Двоичный файл Linux: исправление диалоговых окон файлов, которые не работали в Fedora 35 под KDE
uk: Виконуваний файл у Linux: виправлено непрацездатність діалогових вікон у Fedora 35 у середовищі KDE

source: When sending email to the Kindle and PocketBook sync services use ASCII filenames as there have been some reports of issues with non-ASCII filenames with these services.
cs: Použití názvů souborů ASCII při odesílání e-mailů do synchronizačních služeb Kindle a PocketBook, protože se objevila hlášení o problémech s názvy souborů, které nejsou ASCII, v těchto službách.
es: Al enviar correos electrónicos a los servicios de sincronización de Kindle y PocketBook se usan nombres de archivo ASCII, pues ha habido algunos informes de problemas con nombres de archivo no ASCII en estos servicios.
ru: При отправке электронной почты в службы синхронизации Kindle и PocketBook использовать имена файлов в формате ASCII, поскольку были сообщения о проблемах с именами файлов, отличными от ASCII, в этих службах.
uk: Реалізовано використання назв файлів з символів ASCII при надсиланні повідомлень електронної пошти до служб синхронізації Kindle і PocketBook, оскільки надійшло декілька звітів щодо проблем із назвами файлів, які містили символи поза ASCII, із цими службами.

source: Book Details: Fix missing copy options on composite columns
cs: Podrobnosti o knize: Oprava chybějících veleb kopírování u složených sloupců
es: Detalles del libro: Se corrige la falta de opciones de copia en columnas compuesta
ru: Сведения о книге: исправление отсутствующих параметров копирования в составных столбцах
uk: Подробиці щодо книги: додано пропущені пункти копіювання для композитних стовпчиків

source: Ask for confirmation when deleting covers from books
cs: Požádání o potvrzení při odstraňování obálek z knih
es: Se pide confirmación al borrar portadas de libros
ru: Просить подтверждения при удалении обложек из книг
uk: Реалізовано запит щодо підтвердження вилучення обкладинок книг

source: 29 Oct, 2021
cs: 29. října 2021
ru: 29 октября, 2021
uk: 29 жовтня 2021 року
