Repository: debian-calibre/calibre
Catalog: translations-git/changelog/*.po
Languages: cs, es, ru, uk

source: E-book viewer: Fix popup footnote blank when the footnote link points to a &lt;body&gt; tag
cs: Prohlížeč e-knih: Oprava automaticky otevíraného okna poznámky pod čarou, když odkaz na poznámku pod čarou ukazuje na značku &lt;body&gt;
es: Visor de libros electrónicos: Se corrige el fallo por el que la nota emergente aparecía en blanco cuando el enlace de la nota apunta a una etiqueta &lt;body&gt;
ru: Просмотрщик электронных книг: исправлена пустая всплывающая сноска, когда ссылка сноски указывает на тег &lt;body&gt;
uk: Перегляд електронних книг: виправлено помилку, пов'язану із тим, що програма показувала контекстну панель підрядкової примітки порожньою, якщо посилання примітки вказувало на теґ &lt;body&gt;

source: E-book viewer: Fix jumping to highlights in text that occurs after a line break and newline character not working in paged mode
cs: Prohlížeč e-knih: Oprava nefunkčnosti přeskakování na zvýraznění v textu, které se vyskytuje za koncem řádku a znaku nového řádku, v režimu stránek
es: Visor de libros electrónicos: Se corrige el fallo por el que el salto a resaltados justo después de un salto de línea y carácter de nueva línea no funcionaba en modo paginado
ru: Просмотрщик электронных книг: Исправлен переход к выделению в тексте, происходивший после разрыва строки и символа новой строки, не работавший в постраничном режиме.
uk: Перегляд електронних книг: виправлено помилку пов'язану із тим, що перехід до підсвічувань у тексті після розриву рядка і символу нового рядка не працював у режимі поділу тексту на сторінки

source: Kindle Output: Strip EXIF metadata from JPEG images as the Kindle renderer has issues with it
cs: Výstup pro Kindle: Odstranění metadat EXIF z obrázků JPEG, protože nástroj pro vykreslování Kindle s nimi má problémy
es: Salida Kindle: Se descartan los metadatos EXIF de imágenes JPEG, puesto que el procesador de Kindle tiene problemas con ellos
ru: Вывод Kindle: удаляются метаданные EXIF ​​из изображений JPEG, так как у модуля рендеринга Kindle есть проблемы с этим.
uk: Виведення до Kindle: реалізовано вилучення метаданих EXIF із зображень JPEG, оскільки обробник зображень Kindle має проблеми із такими метаданими

source: 10 Sep, 2021
cs: 10. srpna 2021
ru: 10 сен, 2021
uk: 10 вересня 2021 року

source: When adding markdown (.md) or textile (.textile) files that contain references to images, automatically add them as txtz with the images
cs: Při přidávání souborů markdown (.md) nebo textile (.textile), které obsahují odkazy na obrázky, jsou automaticky přidány jako txtz s obrázky
es: Al añadir archivos markdown (.md) o textile (.textile) que contienen referencias a imágenes, se añaden automáticamente como txtz con las imágenes
ru: При добавлении файлов markdown (.md) или textile (.textile), которые содержат ссылки на изображения, автоматически добавлять их как txtz вместе с изображениями.
uk: Реалізовано автоматично додавання файлів markdown (.md) або textile (.textile), які містять посилання на зображення, як txtz із зображеннями

source: DOCX Output: Correctly convert soft hyphens in the input document to DOCX soft hyphens
cs: Výstup DOCX: Správný převod pohyblivých spojovníků ve vstupním dokumentu na pohyblivé spojovníky DOCX
es: Salida DOCX: Se convierten correctamente los guiones discrecionales en el documento de entrada a guiones discrecionales DOCX
ru: Вывод DOCX: правильное преобразование мягких переносов во входном документе в мягкие переносы DOCX.
uk: Виведення до DOCX: реалізовано правильне перетворення м'яких дефісів у вхідному документі у м'які дефіси DOCX

source: DOCX Input: Fix a bookmark at the end of a paragraph causing the bookmark at the start of the paragraph to be skipped
cs: Vstup DOCX: Oprava záložky na konci odstavce způsobující přeskočení záložky na začátku odstavce
es: Entrada DOCX: Se corrige el fallo por el que un marcador al final de un párrafo hacía que se saltara el marcador al principio del párrafo
ru: Ввод DOCX: исправление закладки в конце абзаца, в результате чего закладка в начале абзаца пропускалась
uk: Вхідні дані DOCX: виправлено помилку, яку було пов'язано із тим, що закладна на кінці абзацу призводила до того, що програма пропускала закладку на початку абзацу.

source: Edit book: Spell check: Fix EPUB 3 nav document not being spell checked when not in the spine
cs: Upravit knihu: Kontrola pravopisu: Oprava stavu, kdy v dokument EPUB 3 není kontrolován pravopis, když není v páteři
es: Modificar libro: Comprobación ortográfica: Se corrige el fallo por el que no se comprobaba la ortografía del documento de navegación EPUB 3 si no estaba en el lomo
ru: Редактор книг: проверка орфографии: исправление навигационного документа EPUB 3, не проверяющего орфографию, когда он не находится в корешке
uk: Редагування книги: перевірка правопису: виправлено помилку, пов'язану із тим, що програма не перевіряла правопису у документі nav EPUB 3, якщо він не перебував в основній частині книги

source: PDF Output: Fix a rare failure when the input document has a ToC item pointing to the last page
cs: Výstup PDF: Oprava vzácného selhání, když vstupní dokument obsahuje položku obsahu směřující na poslední stránku
es: Salida PDF: Se corrige un fallo infrecuente cuando el documento de entrada tiene una entrada del índice que apunta a la última página
ru: Вывод PDF: исправлена ​​редкая ошибка, когда во входном документе есть элемент ToC, указывающий на последнюю страницу.
uk: Виведення до PDF: виправлено рідкісну помилку, яка виникала, якщо у вхідному документі була таблиця змісту, пункт якої вказував на останню сторінку.

source: Windows: Fix a regression in calibre 5 that caused drag and drop from WinZip to not work
cs: Windows: Oprava regrese v Calibre 5, která způsobovala nefunkčnost přetahování z WinZip
es: Windows: Se corrige una regresión en calibre 5 que hacía que arrastrar y soltar desde WinZip no funcionara
ru: Windows: исправлена ​​регрессия в calibre 5, из-за которой перетаскивание из WinZip не работало.
uk: Windows: усунено регресію у calibre 5, яка спричиняла неможливість перетягування пунктів з вікна WinZip.

source: TXT Output: Fix a regression in calibre 5 that caused the max line length option to not work
cs: Výstup TXT: Oprava regrese v Calibre 5, která způsobovala nefunkčnost volby maximální délky řádku
es: Salida TXT: Se corrige una regresión en calibre 5 que hacía que la opción de longitud de línea máxima no funcionara
ru: Вывод TXT: исправлена ​​регрессия в calibre 5, из-за которой параметр максимальной длины строки не работал.
uk: Виведення до TXT: усунено регресію у calibre 5, яка спричиняла непрацездатність пункту максимальної довжини рядка.

source: When auto converting added TXT files with image references to TXTZ use a full markdown parser to detect markdown images
cs: Při automatickém převodu přidaných souborů TXT s obrázky odkazujícími na TXTZ použít plný analyzátor markdown pro rozpoznání obrázků markdown
es: Al convertir automáticamente los archivos TXT añadidos con referencias a imágenes a TXTZ, se usa el analizador de markdown para detectar imágenes markdown
ru: При автоматическом преобразовании добавленных файлов TXT со ссылками на изображения в TXTZ использовать полный markdown анализатор для обнаружения markdown изображений.
uk: Реалізовано повну обробку розмітки для виявлення зображень при автоматичному перетворенні доданих файлів TXT із посиланнями на зображення до TXTZ.

source: 27 Aug, 2021
cs: 27. srpna 2021
es: 27 ago 2021
ru: 27 августа, 2021
uk: 27 серпня 2021 року

source: Dark color scheme: Use a darker blue for highlighted items
cs: Tmavé barevné schéma: Použití tmavší modré pro zvýrazněné položky
es: Esquema de color oscuro: Se usa un azul más oscuro para los elementos resaltados
ru: Тёмная цветовая схема: использовать более тёмный синий для выделенных элементов.
uk: Темна схема кольорів: використано темніший синій колір для підсвічених записів

source: Content server book viewer: Show a message when a search finds no matches
cs: Prohlížeč knih serveru s obsahem: Zobrazení zprávy, když vyhledávání nenalezne žádné shody
es: Visor de libros del servidor de contenidos: Se muestra un mensaje cuando una búsqueda no encuentra coincidencias
ru: Просмотрщик книг на контент-сервере: показывать сообщение, если поиск не находит совпадений
uk: Засіб перегляду книг на сервері даних: реалізовано показ повідомлення, якщо пошук не дає результатів

source: MOBI Output: Fix JPEG images without any JFIF metadata not being rendered on the Kindle
cs: Výstup MOBI: Oprava nevykreslování obrázků JPEG bez metadat JFIF na Kindle
es: Salida MOBI: Se corrige el fallo por el que las imágenes JPEG sin metadatos JFIF no se mostraban en los Kindle
ru: Вывод MOBI: исправлены изображения JPEG без каких-либо метаданных JFIF, не отображаемые на Kindle
uk: Виведення до MOBI: виправлено помилку, яка призводила до того, що зображення JPEG без метаданих JFIF не можна було переглядати на Kindle

source: Comic input: Fix single color images having their colors changed by normalization
cs: Vstup Komiks: Oprava změny barev normalizací u jednobarevných obrázků
es: Entrada de cómic: Se corrige el fallo por el que las imágenes de un solo color se modificaban por la normalización
ru: Комикс ввод: исправление одноцветных изображений, у которых цвета изменены путем нормализации
uk: Вхідні дані коміксів: виправлено помилку, яка призводила до зміни кольорів однотонних зображень під час нормалізації

source: E-book viewer: Fix creating multiple highlights in a single paragraph that also contains some extra text formatting at the start causing the second and subsequent highlights to malfunction
cs: Prohlížeč e-knih: Oprava vytváření více zvýraznění v jednom odstavci, který obsahuje také nějaké dodatečné formátování textu na začátku, což způsobuje nefunkčnost druhého a následujících zvýraznění
es: Visor de libros electrónicos: Se corrige el fallo por el que al crear varios resaltados en un único párrafo que también contiene algún formato extra hacía que el segundo resaltado y los posteriores fueran defectuosos
ru: Просмотрщик электронных книг: исправлено создание нескольких выделений в одном абзаце, содержащем дополнительное форматирование текста в начале, что приводит к неправильной работе второго и последующих выделений.
uk: Засіб перегляду електронних книг: виправлено помилку, пов'язану із тим, що створення декількох підсвічувань у одному абзаці, який також містить певне додаткове форматування тексту на початку, призводило до помилкової роботи другого і послідовних за ним підсвічувань

source: Edit book: Fix a regression in the previous release that broke the options in the Remove unused CSS dialog
cs: Úprava knihy: Oprava regrese v předchozím vydání, která poškodila volby v dialogovém okně Odebrat nepoužívaná CSS
es: Modificar libro: Se corrige una regresión en la versión anterior que estropeaba las opciones en el diálogo Eliminar CSS sin usar
ru: Редактор книг: исправлен регресс в предыдущем выпуске, который нарушил параметры в диалоговом окне «Удалить неиспользуемый CSS».
uk: Редагування книг: виправлено регресію у попередньому випуску, яка призводила до помилкової роботи пунктів у вікні вилучення невикористаних записів CSS

source: 13 Aug, 2021
cs: 13. srpna 2021
es: 13 ago 2021
ru: 13 августа 2021
uk: 13 серпня 2021 року

source: Edit/Polish book: Remove unused CSS now also removes unreferenced stylesheets
cs: Upravit/Vylepšit knihu: Odebrání nepoužívaných CSS nyní také odebere neodkazované šablony stylů
es: Modificar y pulir libro: Eliminar CSS sin usar también elimina hojas de estilos sin referencias
ru: Редактировать / Полировать книгу: удаление неиспользуемого CSS теперь также удаляет неиспользуемые таблицы стилей
uk: Редагування/Коригування книги: дія з вилучення невикористаних CSS у новій версії тако вилучає невикористані таблиці стилів

source: E-book viewer: Add some CSS variables and classes that allow writing calibre specific CSS in ebooks. See <a href="%(h0)s">%(h0)s</a>
cs: Prohlížeč e-knih: Přidány některé proměnné a třídy CSS, které umožňují psát CSS specifické pro Calibre v e-knihách. Viz <a href="%(h0)s">%(h0)s</a>
es: Visor de libros electrónicos: Se añaden variables y clases CSS que permiten escribir CSS específico para calibre en los libros electrónicos. Ver <a href="%(h0)s">%(h0)s</a>
ru: Просмотрщик электронных книг: добавлены переменные и классы CSS, позволяющие писать calibre-специфичные CSS в электронных книгах. Смотрите<a href="%(h0)s">%(h0)s</a>
uk: Засіб для перегляду електронних книг: додано деякі змінні і класи CSS, за допомогою яких уможливлено написання специфічних для calibre CSS в електронних книгах. Див. <a href="%(h0)s">%(h0)s</a>

source: A new framework plugins can use to be notified about changes to calibre libraries
cs: Nové rozhraní framework, které mohou moduly používat k informování o změnách v knihovnách Calibre
es: Una nueva infraestructura que los complementos pueden usar para ser notificados de cambios en las bibliotecas de calibre
ru: Новые плагины фреймворка можно использовать для получения уведомлений об изменениях в библиотеках calibre.
uk: Додатки до нових бібліотек можуть бути використані для сповіщення щодо змін у бібліотеках calibre

source: Edit metadata dialog: When pasting into the identifiers field if the clipboard contains a URL paste it directly as a URL identifier
cs: Dialogové okno Upravit metadata: Pokud schránka obsahuje adresu URL, pak ji při vkládání do pole identifikátorů vložit přímo jako identifikátor URL
es: Diálogo de modificación de metadatos: Al pegar en el campo de identificadores, si el portapapeles contiene un URL, se pega directamente como identificador de URL
ru: Диалог редактирования метаданных: при вставке в поле идентификаторов, если буфер обмена содержит URL-адрес, вставить его непосредственно как идентификатор URL-адреса.
uk: Вікно редагування метаданих: при вставленні до поля ідентифікаторів даних, які містять адресу, адресу буде безпосередньо вставлено як ідентифікатор-адресу

source: E-book viewer: When displaying popup footnotes use the same writing direction as the main text for the footnote popups size and header
cs: Prohlížeč e-knih: Při zobrazování automaticky otevíraných poznámek pod čarou použít pro velikost a záhlaví automaticky otevíraných poznámek pod čarou stejný směr psaní jako u hlavního textu
es: Visor de libros electrónicos: Al mostrar notas emergentes se usa la misma dirección de escritura que en texto principal para el tamaño y cabecera de la nota emergente
ru: Просмотрщик электронных книг: при отображении всплывающих сносок использовать то же направление письма, что и у основного текста, для размера и заголовка всплывающих сносок.
uk: Засіб для перегляду електронних книг: при показі контекстних підрядкових нотаток для розміру і заголовка використано той самий напрямок написання, що і у основному тексті

source: E-book viewer: Improve the text layout when looking up words in Google
cs: Prohlížeč e-knih: Zlepšení rozložení textu při vyhledávání slov v Google
es: Visor de libros electrónicos: Se mejora la presentación del texto al buscar palabras en Google
ru: Просмотрщик электронных книг: улучшение макета текста при поиске слов в Google
uk: Засіб для перегляду електронних книг: удосконалено компонування тексту при пошуку слів у Google

source: Content server viewer: Fix read aloud not working on mobile browsers
cs: Prohlížeč serveru s obsahem: Oprava nefunkčnosti čtení nahlas v mobilních prohlížečích
es: Visor del servidor de contenidos: Se corrige el fallo por el que la lectura en alto no funcionaba en navegadores móviles
ru: Просмотрщик контент-сервера: исправлено - чтение вслух не работало в мобильных браузерах.
uk: Переглядач сервера даних: усунено непрацездатність засобу читання тексту уголос у мобільних браузерах

source: 30 Jul, 2021
cs: 30. července 2021
ru: 30 июл, 2021
uk: 30 липня 2021 року

source: Conversion: Insert metadata as jacket: Allow adding timestamp and publisher fields. Also allow controlling the formatting of date/time fields
cs: Převod: Vložení metadat jako přebalu: Povolení přidání polí časového razítka a vydavatele. Umožňuje také ovládat formátování polí s datem a časem
es: Conversión: Insertar metadatos como sobrecubierta: Se permite añadir campos de marca temporal y editiorial. También se permite modificar el formato de campos de fecha u hora
ru: Конвертация: Вставить метаданные как обложку: Разрешено добавление полей метки времени и издателя. Также разрешено управление форматированием полей даты/времени
uk: Перетворення: вставлення метаданих як суперобкладинки: уможливлено додавання полів часової позначки і видавця. Також уможливлено керування форматуванням полів дати і часу.

source: Cover browser: Add an option to view the central book by double clicking instead of single clicking (Preferences-&gt;Look &amp; feel-&gt;Cover browser)
cs: Prohlížeč obálek: Přidání volby zobrazit centrální knihu poklepáním namísto jednoduchého kliknutí (Předvolby-&gt;Vzhled a chování-&gt;Prohlížeč obálek)
es: Explorador de portadas: Se añade una opción para ver el libro central pulsando dos veces en lugar de una (Preferencias &gt; Apariencia &gt; Explorador de portadas)
ru: Браузер обложек: добавлена возможность просмотра центральной книги двойным щелчком вместо одиночного (Настройки-> Внешний вид-> Браузер обложек)
uk: Навігація обкладинками: додано пункт параметрів для перегляду центральної книги подвійним клацанням, замість одинарного клацання («Налаштування -&gt; Вигляд та поведінка -&gt; Таблиця обкладинок»)

source: Tag browser: Add actions to the configure menu to toggle the display of counts and average rating
cs: Prohlížeč štítků: Přidání akcí do nabídky konfigurace pro přepínání zobrazení počtů a průměrného hodnocení
es: Explorador de etiquetas: Se añaden acciones al menú de configuración para conmutar los recuentos y calificaciones promedio
ru: Браузер тегов: добавлены действия в меню настройки для переключения отображения количества и среднего рейтинга.
uk: Навігатор мітками: у меню налаштовування додано пункти дій для перемикання показу лічильників та середніх оцінок.

source: Tag browser: Allow plugins to add entries to the context menu
cs: Prohlížeč štítků: Umožnění modulům přidávat položky do místní nabídky
es: Explorador de etiquetas: Se permite a los complementos añadir entradas al menú contextual
ru: Браузер тегов: разрешено плагинам добавлять записи в контекстное меню
uk: Навігатор мітками: уможливлене додавання додатками пунктів у контекстне меню.

source: fetch-ebook-metadata: Fix an error when using the --cover option and no cover is found
cs: fetch-ebook-metadata: Oprava chyby při použití volby --cover a nenalezení obálky
es: fetch-ebook-metadata: Se corrige un error al usar la opción --cover si no se encuentra ninguna portada
ru: fetch-ebook-metadata: исправлена ошибка при использовании параметра --cover, и обложка не найдена
uk: fetch-ebook-metadata: виправлено помилку, яка виникала при використанні параметра --cover, якщо не знайдено жодної обкладинки.

source: HTML Input: Fix the presence of BookDesigner markup causing conversion to fail
cs: Vstup HTML: Oprava selhání převodu způsobeného přítomností značení BookDesigner
es: Entrada HTML: Se corrige el error por el que el marcado de BookDesigner ocasionaba un fallo de conversión
ru: Ввод HTML: исправлено наличие разметки BookDesigner, приводящей к сбою конвертации.
uk: Вхідні дані HTML: виправлено помилку, пов'язану із тим, що наявність розмітки BookDesigner призводила до неможливості перетворення.

source: TXT Input: Do not fail if the txt file references a directory as a resource
cs: Vstup TXT: Neselže, pokud soubor txt odkazuje na adresář jako na zdroj
es: Entrada TXT: No se genera un error si el archivo txt hace referencia a un directorio como recurso
ru: Ввод TXT: не сбоить, если файл txt ссылается на каталог как на ресурс.
uk: Вхідні дані TXT: усунено аварійне завершення роботи, якщо файл txt посилається на каталог як ресурс

source: 09 Jul, 2021
cs: 9. července 2021
es: 9 jul 2021
ru: 09 июл, 2021
uk: 9 липня 2021 року

source: Annotations browser: Show highlight color in the preview panel
cs: Prohlížeč anotací: Zobrazení barvy zvýraznění v panelu náhledu
es: Explorador de anotaciones: Se muestra el color de resaltado en el panel de vista previa
ru: Браузер аннотаций: отображение цвета выделения на панели предварительного просмотра
uk: Панель навігації анотаціями: реалізовано показ кольору підсвічування на панелі попереднього перегляду

source: TXTZ format: Store type of text formatting in the metadata and use it automatically when converting from TXTZ
cs: Formát TXTZ: Uložení typu formátování textu do metadat a jeho automatické použití při převodu z TXTZ
es: Formato TXTZ: Se almacena el tipo de formato de texto en los metadatos y se usa automáticamente al convertir a otro formato
ru: Формат TXTZ: сохраняйте тип форматирования текста в метаданных и автоматически используйте его при преобразовании из TXTZ.
uk: Формат TXTZ: реалізовано зберігання типу форматування тексту у метаданих і його автоматичне використання при перетворенні з TXTZ

source: Edit metadata dialog: Allow holding Ctrl and clicking the item editor buttons to instead open the manage dialog
cs: Dialogové okno Upravit metadata: Povolení podržení Ctrl a kliknutí na položku editoru, aby se namísto toho otevřelo dialogové okno pro správu.
es: Diálogo de modificación de metadatos: Se permite mantener pulsar los botones del editor de elementos manteniendo pulsada la tecla Ctrl para abrir el diálogo de administración
ru: Диалог редактирования метаданных: разрешено удерживать Ctrl и нажимать кнопки редактора элементов вместо открытия диалогового окна управления.
uk: Вікно редагування метаданих: уможливлено відкриття вікна керування при утриманні натиснутою клавіші Ctrl і клацанні на кнопках редактора пунктів

source: Annotations browser: Fix searching for words in languages such as Chinese that do not have word delimiters not working
cs: Prohlížeč anotací: Oprava nefungujícího vyhledávání slov v jazycích, jako je čínština, které nemají oddělovače slov
es: Explorador de anotaciones: Se corrige la búsqueda de palabras en idiomas como el chino que no tienen separadores de palabras
ru: Браузер аннотаций: исправление ошибки поиска слов на таких языках, как китайский, без разделителей слов.
uk: Панель навігації анотаціями: відновлено працездатність пошуку для мов, подібних до китайської, у яких немає роздільників слів

source: News download: Fix URLs with spaces in them not being downloaded since calibre 5.0
cs: Stahování zpráv: Oprava adres URL s mezerami, které se od verze Calibre 5.0 nestahovaly
es: Descarga de notcias: Se corrige la descarga de URL con espacios, que funcionaba desde calibre 5.0
ru: Загрузка новостей: исправление URL-адресов с пробелами в них, которые не загружались с версии 5.0.
uk: Отримання новин: усунено непрацездатність адрес із пробілами, яку було помилково впроваджено у calibre 5.0

source: When searching for books by an author from the Manage authors dialog, use exact matches
cs: Používání přesné shody při vyhledávání knih od autora v dialogovém okně Spravovat autory
es: Al buscar libros de un autor desde el diálogo de administración de autores, se usan coincidencias exactas
ru: При поиске книг по автору в диалоговом окне управления авторами использовать точное совпадение
uk: Реалізовано використання точних відповідностей при пошуку книг за автором у вікні «Керування записами авторів»
