Repository: debian-calibre/calibre
Catalog: translations-git/changelog/*.po
Languages: cs, es, ru, uk

source: Get books: Update English language Amazon plugins for website changes
cs: Získat knihy: Aktualizace modulů Amazonu v angličtině kvůli změnám webových stránek
es: Obtener libros: Se actualizan los complementos de Amazon en inglés por cambios en el sitito web
ru: Приобрести книги: обновлены англоязычные плагины Amazon вследствие изменений на сайте
uk: Отримання книг: оновлено додатки англійської мови Amazon відповідно до змін на сайті

source: 01 Apr, 2022
cs: 1. dubna 2022
es: 1 abr 2022
ru: 01 апр, 2022
uk: 1 квітня 2022 року

source: Content server viewer: Allow editing bookmarks
cs: Prohlížeč Serveru s obsahem: Umožnění úprav záložek
es: Visor del servidor de contenidos: Se permite modificar marcadores
ru: Просмотрщик контент-сервера: разрешено редактирование закладок
uk: Переглядач сервера даних: уможливлено редагування закладок

source: Read covers from CBC comic files
cs: Čtení obálek ze souborů s komiksy CBC
es: Se leen portadas de archivos de cómic CBC
ru: Чтение обложек из CBC файлов комиксов
uk: Реалізовано читання зображень обкладинок з файлів коміксів CBC

source: Allow filtering authors/tags when creating virtual library based on them
cs: Umožnění filtrování autorů nebo štítků při vytváření virtuální knihovny na jejich základě
es: Se permite filtrar autores y etiquetas al crear bibliotecas virtuales basadas en ellos
ru: Разрешить фильтрацию авторов/тегов при создании виртуальной библиотеки на их основе
uk: Уможливлено фільтрування за авторами і мітками при створенні віртуальної бібліотеки на їхній основі

source: Add a copy button to the image view popup
cs: Přidání tlačítka pro kopírování do automaticky otevíraného okna zobrazení obrázku
es: Se añade un botón para copiar en el visor de imagen emergente
ru: Добавлена кнопка копирования во всплывающее окно просмотра изображения
uk: На контекстну панель перегляду зображень додано кнопку копіювання

source: Template language: Support for nested functions and a string concatenation operator
cs: Jazyk šablony: Podpora vnořených funkcí a operátoru spojování řetězců
es: Lenguaje de plantillas: Se admiten funciones anidadas y se añade un operador de concatenación de textos
ru: Язык шаблонов: поддержка вложенных функций и оператора конкатенации строк.
uk: Мова шаблонів: реалізовано підтримку вкладених функцій та оператор об'єднання рядків

source: DOCX Output: Fix a comment immediately after a &lt;li&gt; tag breaking the conversion
cs: Výstup DOCX: Oprava stavu, kdy komentář bezprostředně za značkou &lt;li&gt; poškozoval převod
es: Salida DOCX: Se corrige el fallo por el que un comentario justo después de una etiqueta &lt;li&gt; estropeaba la conversión
ru: Вывод DOCX: исправлен комментарий сразу после тега &lt;li&gt; , нарушающего конвертирование.
uk: Виведення до DOCX: виправлено помилку, яка призводила до невдалого перетворення, якщо коментар одразу слідував за теґом &lt;li&gt;

source: Standalone ToC editor: Fix spurious error message if left open for more than two minutes
cs: Samostatný editor obsahu: Oprava falešného chybového hlášení, pokud zůstane otevřený déle než dvě minuty
es: Editor independiente de índices: Se elimina el mensaje de error incorrecto si se deja abierto por más de dos minutos
ru: Автономный редактор ToC: исправление ложного сообщения об ошибке, если оставить его открытым более двух минут.
uk: Окремий редактор таблиці змісту: усунено зайві повідомлення про помилку, якщо вікно редактора лишалося відкритим понад дві хвилини

source: Fix search-as-you-type triggers extra search after manual confirmation
cs: Oprava stavu, kdy vyhledávání během psaní spouští další vyhledávání po ručním potvrzení
es: Se corrige el fallo por el que la búsqueda mientras se escribe genera una búsqueda adicional después de confirmar manualmente
ru: Исправлена ​​​​ошибка, из-за которой поиск по мере ввода запускал дополнительный поиск после ручного подтверждения.
uk: Виправлено працездатність перемикачів додаткового пошуку під час введення після підтвердження вручну

source: 18 Mar, 2022
cs: 18. března 2022
ru: 18 мар, 2022
uk: 18 березня 2022 року

source: E-book viewer: Allow scrolling of the ToC, highlights, bookmarks, etc. with touch gestures
cs: Prohlížeč e-knih: Umožnění posouvání obsahu, zvýraznění, záložek atd. pomocí dotykových gest
es: Visor de libros electrónicos: Se permite el desplazamiento del índice, resaltados, marcadores, etc. con gestos de toque
ru: Просмотр электронных книг: разрешена прокрутка оглавления, выделения, закладок и т. д. с помощью сенсорных жестов.
uk: Засіб для перегляду книг: уможливлено гортання змісту, роботу із підсвічуваннями, закладками тощо за допомогою жестів на сенсорній панелі

source: Edit metadata dialog: When using the change case operations if some text is selected, only operate on the selected text
cs: Dialogové okno Upravit metadata: Pokud je vybrán nějaký text, tak při použití operací změny velikosti písmen pracovat pouze s vybraným textem
es: Diálogo de modificación de metadatos: Al usar las operaciones de cambio de mayúsculas y minúsculas, si hay algún texto seleccionado se opera sólo sobre el texto seleccionado
ru: Диалоговое окно «Редактировать метаданные»: в операциях изменения регистра, если выделен какой-либо текст, работать только с выделенным текстом.
uk: Вікно редагування метаданих: реалізовано застосування дій зі зміни регістру символів лише до позначеного фрагмента тексту

source: Use atomic writes for the config files ensures no partial data is written in case of crash/powerloss
cs: Použití atomických zápisů pro konfigurační soubory zajišťuje, že v případě pádu nebo výpadku napájení nebudou zapsána žádná částečná data
es: Se usan operaciones de escritura atómicas para los archivos de configuración, para asegurar que la escritura no queda a medias en caso de cuelgue o cierre
ru: Использование атомарной записи для файлов конфигурации гарантирует, что частичные данные не будут записаны в случае сбоя или потери питания.
uk: Реалізовано атомарні запис до файлів налаштувань з метою запобігання частковому запису даних у випадках аварійного завершення роботи або втрати живлення

source: 5.39.1 fixes a couple of regressions that broke case change in the Bulk metadata edit dialog and remembering column widths in the book list on some systems.
cs: 5.39.1 opravuje několik regresí, které v některých systémech poškodily změnu velikosti písmen v dialogovém okně pro hromadnou úpravu metadat a při zapamatování šířky sloupců v seznamu knih.
es: 5.39.1 corrige un par de regresiones que estropeaban el cambio de mayúsculas y minúsculas en el diálogo de modificación de metadatos en masa y la persistencia de las anchuras de columna en la lista de libros en algunos sistemas.
ru: 5.39.1 исправляет несколько регрессий, которые нарушали изменение регистра в диалоговом окне массового редактирования метаданных и запоминание ширины столбцов в списке книг на некоторых системах.
uk: У 5.39.1 виправлено пару регресій, які заважали зміні регістру символів у вікні пакетного редагування метаданих та запам'ятовуванню ширин стовпчиків у списку книг у деяких системах.

source: Content server: Fix reading of books with thousands of internal files not working in the Chrome browser
cs: Server s obsahem: Oprava nefunkčního čtení knih s tisíci interními soubory v prohlížeči Chrome
es: Servidor de contenidos: Se corrige el fallo por el que la lectura de libros con miles de archivos internos no funcionaba en el navegador Chrome
ru: Контент-сервер: исправлено чтение книг с тысячами внутренних файлов, не работающих в браузере Chrome.
uk: Сервер даних: відновлено можливість читання книг із тисячами вбудованих файлів у Chrome

source: Catalog generation: Fix a rare crash when generating very large catalogs
cs: Generování katalogu: Oprava vzácného pádu při generování velmi velkých katalogů
es: Generación de catálogos: Se corrige un fallo ocasional al generar catálogos muy grandes
ru: Генерация каталога: исправление редкого сбоя при создании очень больших каталогов.
uk: Створення каталогів: виправлено рідкісне аварійне завершення роботи при створенні дуже великих каталогів

source: Edit/Polish book: Fix hardcoded Unicode ligatures not being preserved in AZW3 format books
cs: Upravit nebo Vylepšit knihu: Oprava nezachovávání pevně zakódovaných ligatur Unicode v knihách ve formátu AZW3
es: Modificar y pulir libro: Se corrige el fallo por el que las ligaduras explícitas Unicode no se mantenían en libros en formato AZW3
ru: Редактировать/полировать книгу: исправлены жёстко закодированные лигатуры Unicode, не сохранявшиеся в книгах формата AZW3.
uk: Редагування/Удосконалення книг: виправлено помилку, пов'язану із тим, що програма не зберігала жорстко зашиті лігатури Unicode до книг у форматі AZW3

source: Fix automatic searches causing search box to lose focus when search as you type is enabled in Preferences-&gt;Searching
cs: Oprava automatického vyhledávání způsobujícího ztrátu zaměření vyhledávacího pole, když je povoleno vyhledávání během psaní v Předvolby-&gt;Vyhledávání
es: Se corrige el fallo por el que las búsquedas automáticas hacían que el cuadro de búsqueda perdiera el foco cuando la opción para buscar según se escribe se activa en Preferencias &gt; Búsqueda
ru: Исправлен автопоиск, из-за которого поле поиска теряло фокус, когда поиск по мере ввода включен в Настройки -> Поиск
uk: Виправлено помилку, пов'язану із втратою фокусування полем для пошуку при автоматичних пошуках під час введення даних, які увімкнено на сторінці «Налаштування -&gt; Пошук»

source: Edit book: Check book: Auto fix package identifier being empty
cs: Upravit knihu: Zkontrolovat knihu: Automatická oprava prázdného identifikátoru balíčku
es: Modificar libro: Comprobar libro: Se corrige automáticamente el identificador de paquete vacío
ru: Редактор книг: Проверить книгу: идентификатор пакета автоисправления был пуст
uk: Редагування книг: перевірка книг: реалізовано автоматичне виправлення порожніх ідентифікаторів пакунків

source: Amazon metadata download: Fix getting series info from amazon.jp
cs: Stahování metadat Amazonu: Oprava získávání informací o sérii z amazon.jp
es: Descarga de metadatos de Amazon: Se corrige la obtención de la información de serie de amazon.jp
ru: Загрузка метаданных Amazon: исправлена ​​ошибка получения информации о сериях с amazon.jp
uk: Отримання метаданих з Amazon: виправлено отримання даних циклів з amazon.co.jp.

source: Edit book: Insert hyperlinks: When sorting anchors on elements without any text content, use the anchor itself
cs: Upravit knihu: Vložit hypertextové odkazy: Při řazení kotev na prvcích bez textového obsahu použít samotnou kotvu
es: Modificar libro: Insertar enlaces: Al ordenar puntos de anclaje en elementos sin ningún contenido textual, se usa el mismo punto de anclaje.
ru: Редактор книг: Вставка гиперссылок: при сортировке якорей по элементам без текстового содержимого использовать сам якорь
uk: Редагування книг: вставлення гіперпосилань: реалізовано використання самої прив'язки при упорядковуванні прив'язок до елементів без будь-якого текстового контексту

source: Edit book: Make the saved search panel freely resizable
cs: Upravit knihu: Umožnit volnou změnu velikosti panelu uloženého hledání
es: Modificar libro: Se hace el panel de búsqueda guardada completamente redimensionable
ru: Редактор книг: Сохраненная панель поиска свободно изменяема по размеру
uk: Редагування книг: реалізовано довільну зміну розмірів для панелі збережених пошуків

source: Edit book: When dragging to select a region or adjust the selection fix mouse moving outside the image causing the region to no longer be adjusted
cs: Upravit knihu: Oprava situace, kdy při přetahování pro výběr oblasti nebo úpravu výběru pohyb myši mimo obrázek způsoboval, že oblast již nebyla upravována
es: Modificar libro: Al arrastrar para seleccionar una región o ajustar la selección, se corrige el fallo por el que al mover el ratón fuera de la imagen la región ya no se ajustaba
ru: Редактор книг: При перетаскивании, чтобы выбрать область или отрегулировать выделение, исправлено перемещение мыши за пределы изображения, в результате чего область больше не будет регулироваться.
uk: Редагування книг: виправлено помилку, пов'язану із тим, що виведення вказівника миші за зображення при перетягуванні для вибору області або коригування позначеної ділянки призводило до скасовування коригування розмірів

source: 04 Mar, 2022
cs: 4. března 2022
es: 6 mar 2022
ru: 04 мар, 2022
uk: 4 березня 2022 року

source: E-book viewer: When displaying estimated time to completion for reading a book, remember the reading rate the next time the book is opened
cs: Prohlížeč e-knih: Při zobrazování odhadované doby do dočtení knihy si pamatovat rychlost čtení při dalším otevření knihy
es: Visor de libros electrónicos: Cuando se muestra el tiempo estimado para terminar el libro, se recuerda el ritmo de lectura de la última vez que se abrió el libro
ru: Просмотр электронных книг: при отображении примерного времени до завершения чтения книги запоминать скорость чтения при следующем открытии книги.
uk: Засіб перегляду електронних книг: при показу оцінки часу на завершення читання книги реалізовано запам'ятовування швидкості читання для наступного відкриття книги

source: Dark theme: Highlight the current cell in the book list with a lighter background and different foreground to make it more obvious
cs: Tmavý motiv: Zvýraznění aktuální buňky v seznamu knih světlejším pozadím a jiným popředím, aby byla zřetelnější
es: Tema oscuro: Se resalta la celda actual en la lista de libros con un fondo más claro y un primer plano diferente para hacerlo más evidente
ru: Тёмная тема: выделять текущую ячейку в списке книг более светлым фоном и другим передним планом, чтобы сделать её более заметной
uk: Темна тема: реалізовано підсвічування поточної комірки у списку книг світлим тлом та іншим кольором тексту, щоб комірку було краще помітно

source: An option to disable editing composite columns in the main book list when Tabbing through them (Preferences-&gt;Look &amp; feel-&gt;Edit metadata)
cs: Možnost zakázat úpravu složených sloupců v hlavním seznamu knih, když jimi procházíte klávesou Tab (Předvolby-&gt;Vzhled a chování-&gt;Upravit metadata)
es: Una opción para desactivar la modificación de columnas compuestas en la lista de libros principal al usar el tabulador (Preferencias &gt; Apariencia &gt; Modificar metadatos)
ru: Возможность отключить редактирование составных столбцов в основном списке книг при переходе через них (Настройки->Внешний вид->Редактировать метаданные)
uk: Реалізовано пункт вимикання редагування складених стовпчиків у основному списку книг при переході між ними за допомогою Tab (Налаштування-&gt;Вигляд та поведінка-&gt;Редагування метаданих)

source: Tag editor: Fix regression in previous release that caused double clicking on tags to not work on non Linux platforms
cs: Editor štítků: Oprava regrese v předchozím vydání, která způsobovala, že poklepání na štítky nefungovalo na jiných platformách než Linux
es: Editor de etiquetas: Se corrige una regresión en la versión anterior que hacía que no funcionara la doble pulsación sobre etiquetas en sistemas no Linux
ru: Редактор тегов: Исправлена ​​регрессия в предыдущем выпуске, из-за которой двойной щелчок по тегам не работал на платформах, отличных от Linux.
uk: Редактор міток: виправлено регресію у попередньому випуску, яка спричиняла непрацездатність подвійного клацання на мітках на платформах, відмінних від Linux

source: Copy to library: Fix annotations not being copied
cs: Kopírovat do knihovny: Oprava nekopírování anotací
es: Copiar a biblioteca: Se corrige el fallo por el que las anotaciones no se copiaban
ru: Копировать в библиотеку: исправление некопируемых аннотаций.
uk: Копіювання до бібліотеки: виправлено копіювання анотацій

source: Edit book: Spell check: Fix words after a comment not being checked
cs: Upravit knihu: Kontrola pravopisu: Oprava nekontrolování slov po komentáři
es: Modificar libro: Comprobación de ortografía: Se corrige el fallo por el que las palabras después de un comentario no se comprobaban
ru: Редактор книг: Проверка орфографии: исправление слов после комментария не проверялось
uk: Редагування книги: перевірка правопису: виправлено перевірку слів після коментаря

source: PDF Output: Fix conversion failing if there are ToC entries pointing to removed content
cs: Výstup PDF: Oprava selhání převodu, pokud existují položky obsahu odkazující na odebraný obsah
es: Salida PDF: Se corrige el fallo por el que la conversión fallaba si hay entradas de índice que apuntan a contenido eliminado
ru: PDF вывод: Исправлен сбой преобразования, если есть записи ToC, указывающие на удалённый контент
uk: Виведення до PDF: виправлено помилки перетворення, якщо запис таблиці змісту вказують на вилучені дані

source: E-book viewer: Fix an error when opening books with MathML for the second time if the last read position was at a MathML element
cs: Prohlížeč e-knih: Oprava chyby při druhém otevření knih s MathML, pokud byla poslední pozice čtení na prvku MathML
es: Visor de libros electrónicos: Se corrige un error al abrir libros con MathML por segunda vez si la última posición de lectura está en un elemento MathML
ru: Просмотр электронных книг: исправлена ​​ошибка при открытии книг с помощью MathML во второй раз, если последняя позиция чтения была в элементе MathML.
uk: Засіб перегляду електронних книг: виправлено помилку при відкритті книг із MathML вдруге, якщо останньою позицією читання був елемент MathML

source: Edit book: Fix double clicking to select a word also selecting smart quotes surrounding the word
cs: Upravit knihu: Oprava stavu, kdy poklepání pro vybrání slova také vybralo chytré uvozovky obklopující slovo
es: Modificar libro: Se corrige el fallo por el que la doble pulsación para seleccionar una palabra también seleccionaba las comillas tipográficas que rodean la palabra
ru: Редактор книг: Исправление: двойной щелчок, для выбора слова, также выбирал умные кавычки, окружающие слово.
uk: Редагування книг: виправлено помилку, пов'язану із тим, що подвійне клацання для позначення слова також позначало лапки навколо нього

source: EPUB 3 metadata: Fix non-integer series index being sometimes represented using exponential notation
cs: Metadata EPUB 3: Oprava stavu, kdy neceločíselné pořadí v sérii bylo někdy zobrazováno pomocí exponenciálního zápisu
es: Metadatos EPUB 3: Se corrige el fallo por el que los índices de serie no enteres a veces se representaban con notación exponencial
ru: Метаданные EPUB 3: исправление индекса нецелочисленной серии, которое иногда представлялось с использованием экспоненциальной записи.
uk: Метадані EPUB 3: виправлено помилку, пов'язану із тим, що нецілі індекси у послідовності іноді представлялися в експоненційній формі запису

source: 18 Feb, 2022
cs: 18. února 2022
ru: 18 февраля 2022 г.
uk: 18 лютого 2022 року

source: Book details: Add actions to trim the cover to the right-click menu
cs: Podrobnosti o knize: Přidání akcí pro oříznutí obálky do nabídky pravého tlačítka myši
es: Detalles del libro: Se añaden acciones para recortar la portada al menú del botón derecho
ru: Сведения о книге: добавлены действия по обрезке обложки в контекстное меню.
uk: Подробиці щодо книги: до контекстного меню додано пункти обрізання зображення обкладинки

source: Allow removing multiple email addresses at once in Preferences-&gt;Sharing by email
cs: Povolení odebrání více e-mailových adres najednou v Předvolby-&gt;Sdílení knih e-mailem
es: Se permite eliminar varias direcciones de correo electrónico de una vez en Preferencias &gt; Compartir por correo electrónico
ru: Разрешено удаление нескольких адресов электронной почты одновременно в Preferences-&gt;Sharing by email
uk: Уможливлено вилучення одразу декількох адрес електронної пошти у «Налаштування-&gt;Обмін ел. поштою»

source: Book details: Use a better mono-spaced font on Windows by default
cs: Podrobnosti o knize: Ve výchozím nastavení systému Windows použito lepší písmo s pevnou šířkou
es: Detalles del libro: Se usa un mejor tipo de letra monoespaciado en Windows de manera predeterminada
ru: Сведения о книге:использовать лучший моноширинный шрифт в Windows по умолчанию
uk: Подробиці щодо книги: типово, у Windows використано кращий моноширинний шрифт

source: Add a tweak in Preferences-&gt;Tweaks to change the behavior of the Tab key when completing entries
cs: Přidání vylepšení v Předvolby-&gt;Vylepšení pro změnu chování klávesy Tab při dokončování položek
es: Se añade un ajuste en Preferencias &gt; Ajustes para modificar el comportamiento de la tecla Tab al completar entradas
ru: Добавлена настройка в Настройки-&gt;Твики, чтобы изменить поведение клавиши Tab при дополнении записей
uk: До списку панелі «Налаштування-&gt;Коригування» додано коригування для зміни поведінки у відповідь на натискання клавіші Tab при автоматичному завершенні записів

source: Edit metadata: In "All in one" mode add an adjustable splitter between the cover and formats boxes
cs: Upravit metadata: Přidání nastavitelného rozdělovače mezi pole obálky a formátů v režimu „Vše v jednom“
es: Modificar metadatos: En el modo «Todo en uno», se añade un separador ajustable entre los cuadros de portada y formatos
ru: Редактировать метаданные: в режиме Все в одном добавлен регулируемый разделитель между полями обложки и форматов.
uk: Редагування метаданих: у режимі «Усе в одному» додано рухомий роздільник між пунктами обкладинки і форматів

source: Textile output: Don't fail if input document has invalid padding or margin specifications
cs: Výstup Textile: Neselže, pokud má vstupní dokument neplatné specifikace odsazení nebo okrajů
es: Salida Textile: No se produce un fallo si el documento de entrada tiene especificaciones de margen o espaciado no válidas
ru: Textile вывод: не сбоить, если входной документ имеет недопустимые характеристики отступов или полей
uk: Виведення до textile: усунено проблеми із вхідними документами із некоректними специфікаціями фасок або полів

source: E-book viewer: Fix image display window not remembering its size and settings when run from within calibre
cs: Prohlížeč e-knih: Oprava okna pro zobrazení obrázků, které si nepamatovalo svou velikost a nastavení při spuštění z Calibre
es: Visor de libros electrónicos: Se corrige el fallo por el que la ventana de imagen no recordaba su tamaño y configuración cuando se ejecuta desde calibre
ru: Просмотрщик электронных книг: исправлено окно отображения изображения, которое не запоминало размер и настройки при запуске из calibre
uk: Засіб перегляду книг: виправлено помилку, пов'язану із тим, що програма не запам'ятовувала розмір і параметри вікна показу зображення, якщо його було відкрито з calibre

source: E-book viewer: Fix setting to use roman numerals for series not being respected
cs: Prohlížeč e-knih: Oprava nerespektování nastavení použití římských číslic pro série
es: Visor de libros electrónicos: Se corrige el fallo por el que el uso de números romanos para las series no se respetaba
ru: Просмотрщик электронных книг: исправлена настройка - использовать римские цифы для серий
uk: Засіб перегляду книг: виправлено помилку, пов'язану із тим, що програма не застосовувала визначений параметр нумерації римськими цифрами для книг у циклах

source: Edit book: When saving a copy do not fail if the original file has no write permissions
cs: Upravit knihu: Při ukládání kopie neselže, pokud původní soubor nemá oprávnění k zápisu
es: Modificar libro: Al guardar una copia, no se produce un fallo si el archivo original no tiene permiso de escritura
ru: Редактор книг: При сохранении копии не произойдет сбой, если исходный файл не имеет прав на запись
uk: Редагування книг: усунено аварійне завершення роботи, якщо при збереженні копії книги у програми не було доступ до запису до початкового файла
