Repository: debian-calibre/calibre
Catalog: translations-git/changelog/*.po
Languages: cs, es, ru, uk

source: E-book viewer: Redesign the reference mode to also work on touch screens without a mouse. Now in reference mode paragraph numbers are displayed for all paragraphs
cs: Prohlížeč e-knih: Přepracování režimu odkazů tak, aby fungoval i na dotykových obrazovkách bez myši. Nyní se v režimu odkazů zobrazují čísla odstavců pro všechny odstavce
es: Visor de libros electrónicos: El modo de referencia ha sido rediseñado para que funcione también en pantallas táctiles sin un ratón. Ahora en el modo de referencia se muestra los números de párrafo en todos los párrafos
ru: Просмотрщик электронных книг: измените режим справки, чтобы он работал и на сенсорных экранах без мыши. Теперь в справочном режиме номера абзацев отображаются для всех абзацев.
uk: Засіб перегляду книг: перероблено режим посилань так, щоб він працював на сенсорних екранах без миші. У новій версії номери абзаців у режимі посилань показано для усіх абзаців.

source: Edit book: Allow Ctrl-clicking on class names to jump to the first style rule that matches the tag and class
cs: Upravit knihu: Umožnění kliknutí na názvy tříd se stisknutou klávesou Ctrl pro přechod na první pravidlo stylu, které odpovídá značce a třídě
es: Modificar libro: Se permite pulsar con Ctrl sobre nombres de clase para saltar a la primera regla de estilo que coincida con la etiqueta y la clase
ru: Редактор книг: Ctrl+щелчок по именам классов - прыжок к первому правилу стиля, которое соответствует тегу и классу.
uk: Редагування книг: реалізовано дію із переходу до першого відповідного стильового правила для теґу або класу у відповідь на клацання із одночасним утриманням натиснутою клавіші Ctrl.

source: Content server: When browsing highlights for a book allow selecting multiple highlights to delete or export quickly
cs: Server s obsahem: Při procházení zvýraznění pro knihu umožnit výběr více zvýraznění k rychlému odstranění nebo exportu
es: Servidor de contenidos: Al navegar por los resaltados de un libro se permite seleccionar varias resaltados para borrarlos o exportarlos rápidamente
ru: Контент-сервер: при просмотре выделений для книги позволяет выбрать несколько выделений для быстрого удаления или экспорта
uk: Сервер даних: реалізовано можливість позначення декількох підсвічувань одночасно для швидкого вилучення або експортування при навігації підсвічуваннями книги

source: Allow creating keyboard shortcuts to copy show and view URLs for selected books to clipboard
cs: Umožnění vytvořit klávesové zkratky pro kopírování adres URL zobrazení a prohlížení vybraných knih do schránky.
es: Se permite crear atajos de teclado para copiar al portapapeles los URL para mostrar o ver los libros seleccionados
ru: Разрешено создание сочетаний клавиш для копирования URL-адресов показа и просмотра выбранных книг в буфер обмена
uk: Уможливлено створення клавіатурних скорочень для копіювання адрес перегляду для позначених книг до буфера обміну даними

source: calibredb: Add a timeout option to control the timeout when connecting to the calibre server
cs: calibredb: Přidání volby časového limitu pro ovládání časového limitu při připojování k serveru Calibre
es: calibredb: Se añade una opción de tiempo de espera máximo para la conexión con el servidor de calibre
ru: calibredb: добавлен параметр для управления тайм-аутом при подключении к серверу calibre
uk: calibredb: додано параметр часу очікування для керування часом очікування на з'єднання із сервером calibre

source: Content server: Fix dragging selection handles not working in Safari
cs: Server s obsahem: Oprava nefunkčnosti zpracování přetahování výběru v prohlížeči Safari
es: Servidor de contenidos: Se corrige el fallo por el que el arrastre de las asas de selección no funcionaba en Safari
ru: Контент-сервер: исправлено перетаскивание маркеров выделения, которые не работают в Safari.
uk: Сервер даних: відновлено можливість перетягувати елементи керування вибором у Safari

source: E-book viewer: Fix links with a href of "#" not working
cs: Prohlížeč e-knih: Oprava nefunkčnosti odkazů s a href s hodnotou „#“
es: Visor de libros electrónicos: Se corrige el fallo por el que los enlaces con «#» como valor de href no funcionaban
ru: Просмотрщик электронных книг: исправлены неработавшие ссылки с href "#"
uk: Засіб перегляду книг: відновлено працездатність посилань href із «#»

source: E-book viewer: Hide the controls when clicking the back or forward buttons
cs: Prohlížeč e-knih: Skrytí ovládacích prvků při kliknutí na tlačítka zpět nebo vpřed
es: Visor de libros electrónicos: Se ocultan los controles al pulsar en los botones atrás o adelante
ru: Просмотрщик электронных книг: скрытие элементов управления при нажатии кнопок назад или вперед
uk: Засіб перегляду книг: реалізовано приховування засобів керування при натисканні кнопок «Назад» і «Далі»

source: E-book viewer: When jumping to a highlight using the highlights panel, the back button should return to position before jump
cs: Prohlížeč e-knih: Při skoku na zvýraznění pomocí panelu zvýraznění by tlačítko zpět mělo vrátit na pozici před skokem
es: Visor de libros electrónicos: Al ir a un resaltado usado el panel de resaltados, el botón atrás debería volver a la posición anterior
ru: Просмотрщик электронных книг: при прыжке к выделению с помощью панели выделения кнопка «Назад» должна вернуться в положение до прыжка.
uk: Засіб перегляду книг: виправлено повернення до попередньої позиції у відповідь на натискання кнопки «Назад» при переході до підсвічування за допомогою панелі підсвічувань

source: E-book viewer: Fix incorrect tooltip when hovering over a section title in the search results list
cs: Prohlížeč e-knih: Oprava nesprávného popisku při najetí na název oddílu v seznamu výsledků vyhledávání
es: Visor de libros electrónicos. Se corrige la ayuda emergente incorrecta al pasar con el cursor sobre un título de sección en la lista de resultados de búsqueda
ru: Просмотрщик электронных книг: исправление неверной подсказки при наведении курсора на заголовок раздела в списке результатов поиска.
uk: Засіб перегляду книг: виправлено помилкову підказку у відповідь на наведення вказівника на заголовок розділу у списку результатів пошуку

source: HTMLZ Output: Fix a regression in calibre 5 that broke creating HTMLZ documents when using the option to place CSS inline
cs: Výstup HTMLZ: Oprava regrese v Calibre 5, která poškodila vytváření dokumentů HTMLZ při použití volby umístění vloženého CSS
es: Salida HTMLZ: Se corrige una regresión en calibre 5 que estropeaba la creación de documentos HTMLZ al usar la opción de poner el CSS en línea
ru: Вывод HTMLZ: исправлена ​​регрессия в calibre 5, которая нарушала создание документов HTMLZ при использовании встроенной CSS
uk: Виведення даних до HTMLZ: виправлено регресію у calibre 5, яка заважала створенню документів HTMLZ при використанні параметра вбудовування CSS

source: 22 Jan, 2021
cs: 22. ledna 2021
es: 22 ene 2021
ru: 22 января 2021
uk: 22 січня 2021 року

source: Bulk metadata edit: Add a new control to compress the cover image files for all selected books
cs: Hromadná úprava metadat: Přidání nového ovládání pro komprimaci souborů obrázků obálek pro všechny vybrané knihy
es: Modificación de metadatos en masa: Se añade una nueva opción para comprimir los archivos de imagen de portada para todos los libros seleccionados
ru: Массовое редактирование метаданных: добавлен новый элемент управления для сжатия файлов изображений обложек для всех выбранных книг.
uk: Пакетне редагування метаданих: додано новий засіб керування для стискання файлів зображень обкладинок для усіх позначених книг

source: Add support for the CB7 comic file file format
cs: Přidání podpory pro formát souborů komiksu CB7
es: Se añade compatibilidad con el formato de archivo de cómic CB7
ru: Добавлена ​​поддержка формата файлов комиксов CB7
uk: Додано підтримку формату файлів коміксів CB7

source: E-book viewer: Allow adding a button to the selection bar that copies the currently selected text along with a calibre:// URL to show the text in the book
cs: Prohlížeč e-knih: Umožnění přidání tlačítka do panelu výběru, které zkopíruje aktuálně vybraný text spolu s URL adresou calibre:// pro zobrazení textu v knize
es: Visor de libros electrónicos: Se permite añadir un botón a la barra de selección que copia el texto actualmente seleccionado junto con un URL calibre:// para mostrar el texto en el libro
ru: Просмотрщик электронных книг: разрешено добавление кнопки на панель выбора, которая копирует текущий выделенный текст вместе с calibre:// URL-адресом для отображения текста в книге.
uk: Засіб перегляду книг: уможливлено додавання на панель вибору кнопки для копіювання поточного позначеного тексту разом із адресою calibre:// для показу тексту у книзі

source: Conversion: Insert metadata: Allow showing identifiers such as ISBN in the jacket page template
cs: Převod: Vložit metadata: Umožnění zobrazování identifikátorů, jako je ISBN, v šabloně stránky přebalu
es: Conversión: Insertar metadatos: Se permite mostrar identificadores como el ISBN en la plantilla de página de sobrecubierta
ru: Конвертация: Вставить метаданные: разрешено отображение таких идентификаторов как ISBN в шаблоне страницы обложки.
uk: Перетворення: вставлення метаданих: уможливлено показ ідентифікаторів, зокрема ISBN, на шаблоні сторінки-обгортки

source: Conversion: Insert metadata: Allow hiding entries in the jacket template when they are not present in the metadata
cs: Převod: Vložit metadata: Umožnění skrytí položek v šabloně přebalu, pokud nejsou přítomny v metadatech
es: Conversión: Insertar metadatos: Se permite ocultar entradas en la plantilla de página de sobrecubierta cuando no se encuentran en los metadatos
ru: Конвертация: Вставить метаданные: разрешено скрытие записей в шаблоне обложки, если они отсутствуют в метаданных
uk: Перетворення: вставлення метаданих: уможливлено приховування записів на шаблоні обгортки, якщо їх немає у метаданих

source: calibre-server --manage-users: Add a scriptable interface: calibre-server --manage-users -- help
cs: calibre-server --manage-users: Přidání skriptovatelného rozhraní: calibre-server --manage-users -- help
es: calibre-server --manage-users: Se añade una interfaz automatizable: calibre-server --manage-users -- help
ru: calibre-server --manage-users: добавлен интерфейс с поддержкой сценариев: calibre-server --manage-users --help
uk: calibre-server --manage-users: додано інтерфейс для керування зі скриптів: calibre-server --manage-users -- help

source: E-book viewer: Add keyboard shortcuts to copy the current location to the clipboard
cs: Prohlížeč e-knih: Přidání klávesových zkratek pro kopírování aktuálního umístění do schránky
es: Visor de libros electrónicos: Se añaden atajos de teclado para copiar la ubicación actual al portapapeles
ru: Просмотрщик электронных книг: добавлено сочетание клавиш для копирования текущего местоположения в буфер обмена
uk: Засіб перегляду книг: додано клавіатурні скорочення для копіювання поточного місця до буфера обміну даними

source: E-book viewer: Highlight all currently visible Table of Contents entries, not just the first
cs: Prohlížeč e-knih: Zvýraznění všech aktuálně viditelných položek obsahu, nejen první
es: Visor de libros electrónicos: Se resaltan todas las las entradas del Índice visibles actualmente, no sólo la primera
ru: Просмотрщик электронных книг: выделить все видимые в данный момент записи Оглавления, а не только первую.
uk: Засіб перегляду книг: реалізовано підсвічування усіх поточних видимих записів змісту, а не лише першого

source: Add a new tweak under Preferences-&gt;Tweaks-&gt;Author sort name algorithm to optionally recognize common surname prefixes such as von, van, de, etc. when generating sort names.
cs: Přidání nového vylepšení pod Předvolby-&gt;Vylepšení-&gt;Algoritmus řazení jmen autorů, které při generování názvů řazení volitelně rozpoznává běžné předpony příjmení, jako jsou von, van, de atd.
es: Se añade un nuevo ajuste en Preferencias &gt; Ajustes &gt; Algoritmo de orden de autor para permitir reconocer partículas de apellido frecuentes, como de, von, van, etc. al generar los nombres de ordenación.
ru: Добавлена новая настройка в разделе Настройки -> Твики -> Алгоритм сортировки по имени автора, чтобы при генерации имен сортировки при необходимости распознавать общие префиксы фамилий, такие как von, van, de и т. д.
uk: Додано нове коригування «Налаштування-&gt;Коригування-&gt;Алгоритм упорядковування імен авторів» для додаткового розпізнавання префіксів прізвищ, зокрема фон, ван, де тощо при створення записів для упорядковування.

source: E-book viewer: Move read aloud pop-up bar to the bottom of the screen in flow mode
cs: Prohlížeč e-knih: Přesunutí automaticky otevíraného panelu čtení nahlas do spodní části obrazovky v plovoucím režimu
es: Visor de libros electrónicos: Se muove la barra emergente de lectura en alto a la parte baja de la pantalla en modo continuo
ru: Просмотрщик электронных книг: всплывающая панель для чтения вслух перемещена в нижнюю часть экрана в потоковом режиме
uk: Засіб перегляду книг: у режимі неперервного сувою панель читання уголос пересунуто униз вікна

source: E-book viewer: Fix scrolling with two fingers on touch pad on macOS not smooth
cs: Prohlížeč e-knih: Oprava neplynulého posouvání dvěma prsty na touchpadu v macOS
es: Visor de libros electrónicos: Se corrige el fallo por el que el desplazamiento con dos dedos en el panel táctil en macOS no era suave
ru: Просмотрщик электронных книг: исправлена неплавная прокрутка двумя пальцами на сенсорной панели в macOS
uk: Засіб перегляду книг: виправлено плавність гортання двома пальцями на сенсорних панелях у macOS

source: PDF Output: When converting fixed layout input documents fix anchors inserted for navigation sometimes being rendered as blue boxes
cs: Výstup PDF: Oprava kotev vložených pro navigaci, které se někdy zobrazovaly jako modré rámečky, při převodu vstupních dokumentů s pevným rozložením
es: Salida PDF: Al convertir documentos de entrada de formato rígido, se corrige el fallo por el que los puntos de anclaje insertados para la navegación a veces aparecían como cuadros azules
ru: Вывод PDF: при преобразовании входных документов с фиксированным макетом исправлен рендеринг якорей, вставляемых для навигации, иногда они отображались в виде синих боксов
uk: Виведення до PDF: виправлено помилку, пов'язану із тим, що прив'язки навігації іноді показувалися синім кольором після перетворення документів із фіксованим компонуванням

source: Edit book: Remove unused CSS: Fix selectors that don't match from CSS rules containing multiple selectors not being removed
cs: Upravit knihu: Odebrat nepoužívaná pravidla CSS: Oprava neodebírání selektorů, které se neshodují s pravidly CSS obsahujícími více selektorů
es: Modificar libro: Eliminar CSS sin usar: Se corrige el fallo por el que los selectores no usados de reglas CSS con varios selectores no se eliminaban
ru: Редактор книг: удалить неиспользуемые CSS: исправлены селекторы, не соответствующие правилам CSS, содержащим несколько неудаляемых селекторов
uk: Редагування книг: вилучення невикористаних CSS: виправлено помилку, пов'язану із тим, що програма не вилучала засоби вибору з невідповідних правил CSS, які містили декілька засобів вибору

source: Bulk metadata download: Fix series number not being changes if the series is the same as the existing series
cs: Hromadné stahování metadat: Oprava nezměněného čísla série, pokud je série stejná jako stávající série
es: Descarga de metadatos en masa: Se corrige el fallo por el que el número de serie no se cambiaba si la serie es la misma que la actual
ru: Массовое скачивание метаданных: исправление - номер серии не менялся, если серия была такой же, как и существующая серия.
uk: Пакетне отримання метаданих: виправлено помилку, пов'язану із тим, що програма не змінювала номера у циклі, якщо цикл збігався із наявним

source: E-book viewer: Fix a regression that caused non-HTML descriptions to not be displayed in the metadata page
cs: Prohlížeč e-knih: Oprava regrese, která způsobovala, že se na stránce s metadaty nezobrazovaly popisy, které nejsou v jazyce HTML
es: Visor de libros electrónicos: Se corrige una regresión que hacía que las descripciones que no era HTML no se mostraran en la página de metadatos
ru: Просмотрщик электронных книг: Исправлена ​​регрессия, из-за которой описания не в формате HTML не отображались на странице метаданных.
uk: Засіб перегляду книг: виправлено регресію, пов'язану із тим, що програма не показувала на сторінці метаданих описів, які не було форматовано у HTML

source: E-book viewer: Fix clock being displayed in 24 hr format on some systems even though system locale is set to use 12 hr format.
cs: Prohlížeč e-knih: Oprava zobrazování hodin ve 24hodinovém formátu v některých systémech, i když je v systémovém národním prostředí nastaven 12hodinový formát.
es: Visor de libros electrónicos: Se corrige el fallo por el que la hora se mostraba en formato de 24 h en algunos sistemas, incluso cuando la configuración del sistema establece que se use el farmato de 12 h.
ru: Просмотрщик электронных книг: исправлено отображение часов в 24-часовом формате в некоторых системах, даже если для языкового стандарта системы задано использование 12-часового формата.
uk: Засіб перегляду книг: виправлено помилку, пов'язану із тим, що час у деяких системах було показано у 24-годинному форматі, хоча локаль визначала показ часу у 12-годинному форматі.

source: Bulk metadata edit: Fix regression that inverted the meaning of the case sensitivity setting in the Search &amp; replace tab
cs: Hromadná úprava metadat: Oprava regrese, která převracela význam nastavení citlivosti velkých a malých písmen na kartě Hledat a nahradit
es: Modificar metadatos en masa: Se corrige una regresión que invertía el significado de la configuración para distinguir mayúsculas y minúsculas en la pestaña de Búsqueda y sustitución
ru: Массовое редактирование метаданных: исправлена регрессия, которая инвертировала значение параметра чувствительности к регистру на вкладке 'Поиск и замена'.
uk: Пакетне редагування метаданих: виправлено регресію, у результаті якої інвертувалося значення використання регістру символів на вкладці пошуку із заміною

source: calibredb list: Fix incorrect output when redirecting to file
cs: Seznam calibredb: Oprava nesprávného výstupu při přesměrování do souboru
es: calibredb list: Se corrige la salida incorrecta al redirigirla a un archivo
ru: список calibredb: исправлен неправильный вывод при перенаправлении в файл
uk: Список calibredb: виправлено помилкове виведення при переспрямуванні до файла

source: 5.10.1 fixes a regression in 5.10.0 that broke conversion when including metadata as a jacket page and using long text custom columns
cs: 5.10.1 opravuje regresi ve verzi 5.10.0, která způsobila chybu při převodu, když byla metadata zařazena jako stránka s přebalem a byly použity vlastní sloupce s dlouhým textem
es: 5.10.1 corrige una regresión en 5.10.0 que estropeaba la conversión al incluir metadatos como página de sobrecubierta y usar columnas personalizadas de texto largo
ru: 5.10.1 исправлена регрессия в 5.10.0, ломавшая конвертирование при включении метаданных в качестве страницы обложки и использовании настраиваемых столбцов с длинным текстом.
uk: У версії 5.10.1 виправлено регресію версії 5.10.0, яка заважала перетворенню даних при включенні метаданих як сторінки-обгортки і використанні нетипових стовпчиків із довгими фрагментами тексту

source: 08 Jan, 2021
cs: 8. ledna 2021
es: 8 ene 2021
ru: 08 января 2021
uk: 8 січня 2021 року

source: Annotations: Allow exporting highlights and bookmarks in Markdown format, with a link to open the book at the highlight location
cs: Anotace: Umožnění exportovat zvýraznění a záložky ve formátu Markdown s odkazem na otevření knihy v místě zvýraznění
es: Anotaciones: Se permite exportar resaltados y marcadores en formato Markdown, con un enlace para abrir el libro en posición anotada
ru: Аннотации: разрешён экспорт выделенных фрагментов и закладок в формате Markdown со ссылкой для открытия книги в месте выделения.
uk: Анотації: уможливлено експортування підсвічувань та закладок у форматі Markdown із посиланнями для відкриття книги у підсвіченому місці

source: Content server viewer: Allow exporting all highlights
cs: Prohlížeč Serveru s obsahem: Umožnění exportu všech zvýraznění
es: Visor del servidor de contenidos: Se permite exportar todos los resaltados
ru: Просмотрщик контент-сервера: разрешён экспорт всех выделений
uk: Переглядач сервера даних: уможливлено експортування усіх підсвічувань

source: Icon rules editor: Add a button to open the icons folder
cs: Editor pravidel pro ikony: Přidání tlačítka pro otevření složky s ikonami
es: Editor de reglas de iconos: Se añade un botón para abrir la carpeta de iconos
ru: Редактор правил значков: добавлена кнопка, чтобы открыть папку значков
uk: Редактор правил піктограм: додано кнопку для відкриття теки піктограм

source: Quickview: Dropdown menu for all selectable columns
cs: Rychlé zobrazení: Rozevírací nabídka pro všechny vybratelné sloupce
es: Vista rápida: Menú desplegable para todas las columnas seleccionables
ru: Быстрый просмотр: раскрывающееся меню для всех выбираемых столбцов
uk: Швидкий перегляд: реалізовано спадне меню для усіх придатних до позначення стовпчиків

source: Fix a regression that caused the Content server to crash if a client closed a connection during a file transfer on macOS and Linux.
cs: Oprava regrese, která způsobovala pád Serveru s obsahem, pokud klient uzavřel připojení během přenosu souboru na MacOS a Linuxu
es: Se corrige una regresión que hacía que el servidor de contenidos se cerrara si un cliente cerraba una conexión durante una transferencia de archivos en macOS y Linux.
ru: Исправлена регрессия, приводившая к сбою контент-сервера, если клиент закрыл соединение во время передачи файла в macOS и Linux.
uk: Виправлено регресію, яка спричиняла аварійне завершення роботи сервера даних, якщо клієнтом було розірвано з'єднання під час передавання файла у macOS та Linux.

source: LRF Output: Fix conversion broken in calibre 5 when font size rescaling is active
cs: Výstup LRF: Oprava poškozeného převodu v Calibre 5, když je aktivní změna velikosti písma
es: Salida LRF: Se corrige el fallo por el que la conversión estaba estropeada en calibre 5 con el redimensionado de tipos de letra activo
ru: Вывод LRF: исправлен сбой конвертирования в calibre 5 при активном изменении размера шрифта
uk: Виведення до LRF: виправлено помилку, яка заважала перетворенню даних у calibre 5, якщо було використано зміну масштабів розміру шрифту

source: E-book viewer: Cancel any speech in progress when hiding the selection popup bar after triggering the speak aloud action on it
cs: Prohlížeč e-knih: Zrušení probíhajícího mluvení při skrytí automaticky otevíraného panelu výběru po přepnutí akce mluvení nahlas na něm
es: Visor de libros electrónicos: Se cancela la lectura en alto al ocultar la barra emergente de selección tras activar la lectura en alto sobre ella
ru: Просмотрщик электронных книг: отмена любого текущего озвучивания при скрытии всплывающей панели выбора после запуска на ней действия "Озвучить"
uk: Засіб перегляду книг: реалізовано скасовування поступу читання книги уголос при приховуванні контекстної панелі вибору після вмикання на ній дії із читання уголос
