Repository: debian-calibre/calibre
Catalog: translations-git/changelog/*.po
Languages: cs, es, ru, uk

source: Content server viewer: Fix mouse wheel scrolling not working on the box used to edit notes for highlights
cs: Prohlížeč serveru s obsahem: Oprava nefunkčního posouvání kolečkem myši v poli použitém pro úpravu poznámek pro zvýraznění
es: Visor del servidor de contenidos: Se corrige el fallo por el que la rueda del ratón no funcionaba en el cuadro usado para modificar las notas de los resaltados
ru: Просмотрщик контент-сервера: Исправлена ​​ошибка, из-за которой прокрутка колеса мыши не работала в поле редактирования заметок для выделения.
uk: Засіб перегляду сервера даних: відновлено працездатність гортання коліщатком миші на панелі, яку призначено для редагування нотаток до підсвічувань

source: E-book viewer: Fix read aloud word tracking in flow mode not very reliable
cs: Prohlížeč e-knih: Oprava, kdy sledování slov při čtení nahlas v plovoucím režimu není příliš spolehlivé
es: Visor de libros electrónicos: Se corrige el fallo por el que el seguimiento de palabras de la lectura en alto en modo continuo no era muy fiable
ru: Просмотрщик электронных книг: Исправлено не очень надежное отслеживание слов при озвучивании в потоковом режиме
uk: Засіб перегляду книг: виправлень стеження за словами у режимі читання уголос, якщо увімкнено режим неперервного сувою

source: E-book viewer: Fix navigation shortcuts not working in Read aloud mode
cs: Prohlížeč e-knih: Oprava nefunkčnosti navigačních zkratek v režimu Číst nahlas
es: Visor de libros electrónicos: Se corrige el fallo por el que los atajos de navegación no funcionaban en modo de lectura en alto
ru: Просмотрщик электронных книг: исправлены сочетания клавиш навигации, не работающие в режиме чтения вслух
uk: Засіб читання книг: виправлено працездатність навігаційних клавіатурних скорочень у режимі читання уголос

source: 17 Apr, 2021
cs: 17. dubna 2021
es: 17 abr 2021
ru: 17 апреля 2021
uk: 17 квітня 2021 року

source: CHM Input: Fix handling of some CHM files that use non-ASCII internal filenames and don't specify a character encoding in their metadata
cs: Vstup CHM: Oprava zpracování některých souborů CHM, které používají interní názvy souborů jiné než ASCII a neurčují kódování znaků ve svých metadatech
es: Entrada CHM: Se corrige el manejo de algunos archivos CHM que usan nombres de archivo interno con caracteres no ASCII y no especifican codificación de caracteres en los metadatos
ru: Ввод CHM: исправлена ​​обработка некоторых файлов CHM, использующих внутренние имена файлов, отличные от ASCII, и не указывающих кодировку символов в своих метаданных.
uk: Вхідні дані CHM: виправлено обробку деяких файлів CHM, у яких на внутрішньому рівні використовуються назви файлів із символами поза ASCII і не вказано кодування символів у метаданих.

source: Fix a regression in the previous release that prevented calibre from starting if there was a failure in a third party plugin
cs: Oprava regrese v předchozím vydání, která bránila spuštění Calibre, pokud došlo k chybě v modulu třetí strany
es: Se corrige una regresión en la versión anterior que evitaba que calibre se iniciara si ocurría un fallo en un complemento de terceros
ru: Исправлена регрессия в предыдущем выпуске, из-за которого calibre не запускался в случае сбоя в стороннем плагине.
uk: Виправлено регресію попереднього випуску, яка заважала запуску calibre після помилки у сторонньому додатку.

source: Content server viewer: Fix a regression in the previous that broke handling of URLs in stylesheets
cs: Prohlížeč Serveru s obsahem: Oprava regrese v předchozím vydání, která poškodila zpracování adres URL v šablonách stylů
es: Visor del servidor de contenidos: Se corrige una regresión en la versión anterior que estropeaba la gestión de URL en hojas de estilos
ru: Просмотрщик контент-сервера: исправлена регрессия в предыдущем выпуске, нарушавшая обработку URL-адресов в таблицах стилей.
uk: Засіб перегляду сервера даних: усунено регресію у попередньому випуску, яка заважала нормальній обробці адрес у таблицях стилів.

source: Fix a regression in the previous release that broke changing sections in the convert single book dialog after changing the input or output formats
cs: Oprava regrese v předchozím vydání, která poškodila změnu sekcí v dialogovém okně převodu jedné knihy po změně vstupních nebo výstupních formátů
es: Se corrige una regresión en la versión anterior que estropeaba el cambio de secciones en el diálogo de conversión de un solo libro después de cambiar el formato de entrada o salida
ru: Исправлена регрессия в предыдущем выпуске, нарушавшая изменение разделов в диалоговом окне конвертации отдельной книги после изменения входных или выходных форматов
uk: Виправлено регресію попереднього випуску, яка заважала зміні розділів у вікні перетворення окремої книги після зміни вхідного або вихідного форматів.

source: Fix using 'is set' rules not working for column rules with rating values
cs: Oprava nefunkčnosti použití pravidel „je nastaveno“ pro pravidla sloupců s hodnotami hodnocení
es: Se corrige el fallo por el que las reglas «is set» no funcionaban en columnas con calificaciones
ru: Исправлено использование правил 'is set' не работавшее для правил столбца со значениями рейтинга
uk: Виправлено помилку, пов'язану із тим, що правила «встановлено» не працювали у правилах стовпчиків зі значеннями оцінок.

source: E-book viewer: Fix a regression in 5.15 that causes the viewer to ignore page-break CSS properties (in 5.16.1)
cs: Prohlížeč e-knih: Oprava regrese v 5.15, která způsobila, že prohlížeč ignoroval vlastnosti CSS zalomení stránky (v 5.16.1)
es: Visor de libros electrónicos: Se corrige una regresión en 5.15 que hacía que el visor ignorara las propiedades CSS de salto de página (en 5.16.1)
ru: Просмотрщик электронных книг: исправление регрессии в 5.15, из-за которой просмотрщик игнорировал свойства CSS разрыва страницы (в 5.16.1).
uk: Засіб перегляду книг: виправлено регресію у версії 5.15, яка спричиняла ігнорування у засобі перегляду властивостей CSS із розривами рядків (версія 5.16.1)

source: Fix a regression that broke using stored templates (in 5.16.1)
cs: Oprava regrese, která se poškodila používání uložených šablon (v 5.16.1)
es: Se corrige una regresión que estropeaba el uso de plantillas guardadas (en 5.16.1)
ru: Исправлена регрессия, сломавшая использование сохраненных шаблонов (в 5.16.1)
uk: Усунено регресію, яка заважала використанню збережених шаблонів (версія 5.16.1)

source: Fix auto scroll books shortcut not working in standalone cover browser window (in 5.16.1)
cs: Oprava nefunkčnosti klávesové zkratky pro automatické posouvání knihami v samostatném okně prohlížeče obálek (v 5.16.1)
es: Se corrige el fallo por el que el atajo para el desplazamiento automático de libros no funcionaba en la ventana de explorador de portadas independiente (en 5.16.1)
ru: Исправлена ​​ошибка, из-за которой клавиатурное сочетание автоматической прокрутки книг не работало в автономном окне браузера обложек (в 5.16.1)
uk: Відновлено працездатність клавіатурного скорочення для автоматичного гортання книг у окремому вікні навігатора обкладинками (версія 5.16.1)

source: E-book viewer: Fix jumping to previous section sometimes not working in flow mode (in 5.16.1)
cs: Prohlížeč e-knih: Oprava občasné nefunkčnosti přeskočení na předchozí sekci v plovoucím režimu (v 5.16.1)
es: Visor de libros electrónicos: Se corrige el fallo por el que el salto a la sección previa a veces no funcionaba en modo continuo (en 5.16.1)
ru: Просмотрщик электронных книг: исправлена ошибка, переход к предыдущему разделу не работал в потоковом режиме.
uk: Засіб перегляду книг: виправлено ваду, пов'язану із тим, що у режимі неперервного перегляду іноді не працював перехід до попереднього розділу (версія 5.16.1)

source: E-book viewer: Fix a regression in 5.15 that broke changing keyboard shortcuts in the viewer preferences (in 5.16.1)
cs: Prohlížeč e-knih: Oprava regrese v 5.15, která poškodila změnu klávesových zkratek v předvolbách prohlížeče (v 5.16.1)
es: Visor de libros electrónicos: Se corrige una regresión en 5.15 que estropeaba el cambio de atajos de teclado en las preferencias del visor (en 5.16.1)
ru: Просмотрщик электронных книг: исправление регрессии в 5.15, ломались клавиатурные сочетания в настройках просмотрщика (в 5.16.1).
uk: Засіб перегляду книг: виправлено регресію у версії 5.15, яка заважала зміні клавіатурних скорочень у налаштуваннях засобу перегляду (версія 5.16.1)

source: E-book viewer: Fix a regression in 5.15 that broke using the delete key to delete highlights (in 5.16.1)
cs: Prohlížeč e-knih: Oprava regresi v 5.15, která se poškodila použití klávesy Delete k odstranění zvýraznění (v 5.16.1)
es: Visor de libros electrónicos: Se corrige una regresión en 5.15 que estropeaba el uso de la tecla Supr para eliminar resaltados (en 5.16.1)
ru: Просмотрщик электронных книг: исправление регрессии в 5.15, ломалась клавиша Delete для удаления выделений (в 5.16.1)
uk: Засіб перегляду книг: виправлено регресію у версії 5.15, яка заважала використанню клавіші Delete для вилучення підсвічувань (версія 5.16.1)

source: 16 Apr, 2021
cs: 16. dubna 2021
es: 16 abr 2021
ru: 16 апреля 2021
uk: 16 квітня 2021 року

source: Allow auto scrolling through the list of books by pressing the X key or right clicking on the cover browser
cs: Umožnění automatického posouvání seznamem knih stisknutím klávesy X nebo kliknutím pravým tlačítkem myši na prohlížeč obálek
es: Se permite el desplazamiento automático de la lista de libros pulsando la tecla X o con el botón derecho en el explorador de portadas
ru: Разрешена автоматическая прокрутка списка книг, при нажатии клавишу X или щелчком правой кнопкой мыши в браузере обложек
uk: Уможливлено автоматичне гортання списку книг натисканням клавіші X або за допомогою клацання правою кнопкою миші на панелі навігації обкладинками

source: Useful to have a "slideshow" of book covers. The speed of scrolling can be controlled in Preferences-&gt;Look &amp; feel-&gt;Cover browser
cs: Užitečné pro získání „prezentace“ obálek knih. Rychlost posouvání může být ovládána v Předvolby-&gt;Vzhled a chování-&gt;Prohlížeč obálek
es: Es útil para hacer un "pase de portadas" de los libros. La velocidad de desplazamiento se puede controlar en Preferencias &gt; Apariencia &gt; Explorador de portadas
ru: Полезно для слайд-шоу обложек книг. Скорость прокрутки можно контролировать в настройках-> Внешний вид-> Браузер обложек.
uk: Корисно для створення «показів слайдів» з обкладинок книг. Швидкість гортання можна контролювати Налаштування-&gt;Вигляд та поведінка-&gt;Переглядач обкладинок

source: E-book viewer: Speed up first time open for EPUB files with lots of styling
cs: Prohlížeč e-knih: Zrychlení prvního otevření souborů EPUB s mnoha styly
es: Visor de libros electrónicos: Se acelera la primera apertura de archivos EPUB con muchos estilos
ru: Просмотрщик электронных книг: ускорение первого открытия файлов EPUB с большим количеством стилей
uk: Засіб перегляду книг: пришвидшено перше відкриття файлів EPUB зі значними змінами у стилях

source: E-book viewer preferences: Allow searching for keyboard shortcuts
cs: Předvolby prohlížeče e-knih: Umožnění vyhledávání klávesových zkratek
es: Preferencias del visor de libros electrónicos: Se permite la búsqueda de atajos de teclado
ru: Настройка просмотрщика электронных книг: разрешён поиск сочетаний клавиш
uk: Налаштування засобу перегляду книг: уможливлено пошук клавіатурних скорочень

source: Edit book: Allow editing WEBP images
cs: Úprava knihy: Umožnění úpravy obrázků WEBP
es: Modificar libro: Se permite modificar imágenes WEBP
ru: Редактор книг: разрешено редактирование изображений WEBP
uk: Редагування книг: уможливлено редагування зображень WEBP

source: Various improvements to the template language, see <a href="%(h0)s">%(h0)s</a>
cs: Různá vylepšení jazyka šablon, viz <a href="%(h0)s">%(h0)s</a>
es: Varias mejoras en el lenguaje de plantillas, ver <a href="%(h0)s">%(h0)s</a>
ru: Различные улучшения языка шаблонов, см.<a href="%(h0)s">%(h0)s</a>
uk: Різноманітні удосконалення у мові шаблонів, див. <a href="%(h0)s">%(h0)s</a>

source: E-book viewer: Show the current progress percentage in the bottom bar of the viewer controls. This can be customized in the viewer preferences under Headers and footers
cs: Prohlížeč e-knih: Zobrazení aktuálního procenta postupu ve spodním panelu ovládacích prvků prohlížeče. Toto lze přizpůsobit v předvolbách prohlížeče v části Záhlaví a zápatí
es: Visor de libros electrónicos: Se muestra el porcentaje de progreso en la barra inferior de los controles del visor. Esto puede personalizarse en las preferencias del visor, en Encabezados y pies de página
ru: Просмотрщик электронных книг: Показывать текущий процент выполнения в нижней строке элементов управления средства просмотра. Это можно настроить в настройках просмотрщика в разделе Верхние и нижние колонтитулы.
uk: Засіб перегляду книг: реалізовано показ поточної частки прочитаного на нижній панелі інструментів керування переглядом. Налаштувати показ можна у параметрах засобу перегляду, розділ «Верхні і нижні колонтитули».

source: E-book viewer: Add an option under Preferences-&gt;Miscellaneous to not restore open panels such as Search, Table of Contents etc on restart
cs: Prohlížeč e-knih: Přidání volby pod Předvolby->Různé, aby se při restartu neobnovily otevřené panely, jako je vyhledávání, obsah atd.
es: Visor de libros electrónicos: Se añade una opción en Preferencias &gt; Miscelánea para no restaurar los paneles abiertos, como búsqueda, índice, etc., al reiniciar
ru: Просмотрщик электронных книг: Добавлен параметр в разделе «Настройки» -> «Разное», чтобы не восстанавливать открытые панели, такие как «Поиск», «Оглавление» и т. п., при перезапуске.
uk: Засіб перегляду книг: на сторінці «Налаштування-&gt;Різне» додано пункт, за допомогою якого можна наказати програмі не відновлювати відкриті панелі, зокрема панель пошуку і змісту, після перезапуску.

source: When exporting highlights as text or markdown also output top level chapter titles
cs: Při exportu zvýraznění jako textu nebo markdown vypisovat také názvy kapitol nejvyšší úrovně
es: Al exportar resaltados como texto o markdown, también se exportan los títulos de capítulo de nivel superior
ru: При экспорте выделения в виде текста или markdown также выводить заголовки глав верхнего уровня.
uk: Реалізовано додавання заголовків глав верхнього рівня при експортуванні підсвічувань у форматі тексту або коду markdown.

source: Allow downloading metadata from amazon.se
cs: Umožnění stahování metadat z amazon.se
es: Se permite descargar metadatos de amazon.se
ru: Разрешена загрузка метаданных с amazon.se
uk: Уможливлено отримання метаданих з amazon.se

source: Preferences-&gt;Tweaks: Allow specifying that calibre should open the book details window when double clicking on a book
cs: Předvolby->Vylepšení: Umožnění určit, že má Calibre otevřít okno s podrobnostmi o knize při poklepání na knihu
es: Preferencias &gt; Ajustes: Se permite especificar que calibre debe abrir la ventana de detalles del libro al pulsar dos veces sobre un libro
ru: Настройки-> Твики: Разрешено указывать, что calibre должен открывать окно сведений о книге при двойном щелчке по книге.
uk: Налаштування-&gt;Коригування: уможливлено параметр, який наказує calibre відкривати вікно параметрів книги при подвійному клацанні лівою кнопкою миші на пункті книги.

source: MOBI Output: Convert WebP images to PNG so they work with Amazon's software
cs: Výstup MOBI: Převést obrázky WebP na PNG, aby fungovaly se softwarem Amazonu
es: Salida MOBI: Se convierten las imágenes WebP a PNG para que funcionen con los lectores de Amazon
ru: Вывод MOBI: конвертация изображений WebP в PNG, чтобы они работали с программным обеспечением Amazon.
uk: Виведення до MOBI: реалізовано перетворення зображень WebP до формату PNG, щоб з ними можна було працювати за допомогою програмного забезпечення Amazon.

source: DOCX Input: When converting embedded fonts, replace spaces in the filename with underscores to keep the execrable epubcheck happy
cs: Vstup DOCX: Při převodu vložených písem nahradit mezery v názvu souboru podtržítky, aby byl execrable epubcheck spokojený
es: Salida DOCX: Al convertir los tipos de letra incrustados, se sustituyen los espacios en los nombres de archivo por guiones bajos para contentar al execrable epubchek
ru: Ввод DOCX: при преобразовании встроенных шрифтов заменять пробелы в имени файла подчеркиванием, чтобы отвратительный epubcheck оставался счастливым.
uk: Вхідні дані DOCX: при перетворенні вбудованих шрифтів реалізовано заміну пробілів у назвах файлів символами підкреслювання для сумісності з перевірками epubcheck.

source: E-book viewer: Selection bar: Add keyboard shortcuts for all buttons. Hover over a button in the bar to see the shortcut
cs: Prohlížeč e-knih: Panel výběru: Přidání klávesové zkratky pro všechna tlačítka. Najetím na tlačítko v panelu se zobrazí klávesová zkratka
es: Visor de libros electrónicos: Barra de selección: Se añaden atajos de teclado para todos los botones. Pase el cursor sobre un botón para ver el atajo
ru: Просмотрщик электронных книг: Панель выбора: добавление сочетаний клавиш для всех кнопок. Наведите курсор на кнопку на панели, чтобы увидеть сочетание
uk: Засіб перегляду книг: панель вибору: додано клавіатурні скорочення для усіх кнопок. Наведіть вказівник миші на кнопку на панелі, щоб переглянути скорочення.

source: FB2 Output: Fix a regression in calibre 5 that caused paragraphs containing only non-breaking spaces to be removed
cs: Výstup FB2: Oprava regrese v Calibre 5, která způsobovala odebrání odstavců obsahujících pouze pevné mezery
es: Salida FB2: Se corrige una regresión en calibre 5 que eliminaba los párrafos que contienen sólo espacios duros
ru: Вывод FB2: исправлена ​​регрессия calibre 5, из-за которой абзацы, содержащие только неразрывные пробелы, удалялись.
uk: Виведення FB2: виправлено регресію у calibre 5, яка спричиняла вилучення абзаців, які містять нерозривні пробіли.

source: Metadata comments editor: Fix setting block alignment destroying other block level properties
cs: Editor komentářů metadat: Oprava nastavení zarovnání bloku, které ničí ostatní vlastnosti na úrovni bloku
es: Editor de comentarios en metadatos: Se corrige el fallo por el que al establecer la alineación de un bloque se destruían otras propiedades del bloque
ru: Редактор комментариев метаданных: исправлена настройка выравнивания блока, разрушавшая другие свойства уровня блока.
uk: Редактор метаданих коментарів: виправлено помилку, пов'язану із тим, що встановлення вирівнювання блоку руйнувало інші властивості рівня блоку.

source: E-book viewer: Fix margins not being adjusted immediately when preferences are changed
cs: Prohlížeč e-knih: Oprava, kdy se okraje při změně předvoleb neupravují okamžitě
es: Visor de libros electrónicos: Se corrige el fallo por el que los márgenes no se ajustaban inmediatamente al cambiar las preferencias
ru: Просмотрщик электронных книг: исправлена ​​ошибка, из-за которой поля не корректировались сразу после изменения настроек.
uk: Засіб перегляду книг: виправлено помилку, пов'язану із тим, що поля не коригувалися негайно після зміни налаштувань.

source: Edit book: Upgrade book internals: Fix skipping the NCX removal dialog not remembering the chosen option
cs: Úprava knihy: Upgrade vnitřních prvků knihy: Oprava, kdy si přeskočení dialogového okna odebrání NCX nepamatuje vybranou volbu
es: Modificar libro: Actualizar el código del libro: Se corrige el fallo por el que al saltar el diálogo de eliminación de NCX no se recordaba la opción elegida
ru: Редактор книг: Обновить внутренние компоненты книги: Исправлен пропуск диалогового окна удаления NCX, не запоминающего выбранную опцию
uk: Редагування книг: оновлення внутрішніх частин книги: виправлено помилку, пов'язану із тим, що закриття вікна вилучення NCX призводило до відкидання змінених параметрів.

source: Conversion: When specifying a line-height do not apply it to the &lt;html&gt; tag, as it is pointless and causes the execrable epubcheck to complain
cs: Převod: Při zadávání výšky řádku ji nepoužít na značku <html>, protože je to zbytečné a způsobuje to stížnosti execrable epubcheck
es: Conversión: Al especificar una altura de línea, no se aplica a la etiqueta &lt;html&gt;, pues no sirve de nada y hace que el execrable epubcheck se queje
ru: Конвертация: при указании высоты строки не применять её к тегу , так как это бессмысленно и заставляет ужасный epubcheck жаловаться.
uk: Перетворення: при визначенні висоти рядка скасовано застосування висоти до теґу &lt;html&gt;, оскільки у цьому немає сенсу і призводить до попереджень з боку epubcheck.

source: E-book viewer: Improve scrolling behavior when extending the selection using keyboard shortcuts
cs: Prohlížeč e-knih: Zlepšení chování při posouvání při rozšiřování výběru pomocí klávesových zkratek
es: Visor de libros electrónicos: Se mejora el comportamiento del desplazamiento al extender la selección mediante atajos de teclado
ru: Просмотрщик электронных книг: Улучшение прокрутки при расширении выделения с помощью сочетаний клавиш
uk: Засіб перегляду книг: удосконалено поведінку при гортанні при розширенні позначення за допомогою клавіатурних скорочень.

source: E-book viewer: Fix read percent for HTML files that are rendered in a single screen being 0% rather than 100%
cs: Prohlížeč e-knih: Oprava procenta čtení pro soubory HTML, které jsou vykresleny na jedné obrazovce, kdy byla 0 % místo 100 %.
es: Visor de libros electrónicos: Se corrige el fallo por el que el porcentaje de lectura de archivos que se muestran en una sola página se mostraba como 0% en lugar de 100%
ru: Просмотрщик электронных книг: исправлен процент чтения для файлов HTML, отображаемых на одном экране, составлявший 0%, а не 100%.
uk: Засіб перегляду книг: виправлено помилку, пов'язану із тим, що частка прочитаного у файлах HTML, для показу яких достатньо одного екрана, показувалася як 0%, а не 100%.

source: E-book viewer: Highlights panel: Do not expand all sections when adding/deleting/modifying highlights
cs: Prohlížeč e-knih: Panel s zvýraznění: Při přidávání, odstraňování nebo úpravě zvýraznění nerozbalovat všechny oddíly
es: Visor de libros electrónicos: Panel de resaltados: No se expanden todas las secciones al añadir, eliminar o modificar resaltados
ru: Просмотрщик электронных книг: Панель выделений: не раскрывать все разделы при добавлении/удалении/изменении выделения.
uk: Засіб перегляду книг: панель підсвічувань: усунено розгортання усіх розділів при додаванні, вилученні підсвічувань та внесення змін до підсвічувань.

source: CHM Input: Fix a regression in calibre 5.0 that broke opening of some files that don't specify a character encoding
cs: Vstup CHM: Oprava regrese v Calibre 5.0, která poškodila otevírání některých souborů, které neurčují kódování znaků
es: Entrada CHM: Se corrige una regresión en calibre 5.0 que estropeaba la apertura de algunos archivos que no especifican una codificación de caracteres
ru: CHM Input: исправлена ​​регрессия в calibre 5.0, которая нарушала открытие некоторых файлов, в которых не указана кодировка символов.
uk: Вхідні дані CHM: виправлено регресію у calibre 5.0, яка заважала відкриттю деяких файлів, у яких не вказано кодування символів.
