Repository: debian-calibre/calibre
Catalog: translations-git/changelog/*.po
Languages: cs, es, ru, uk

source: EPUB2 metadata: Read ISBNs in identifier elements without schemes if they are valid ISBNs and no properly identified isbns are present
cs: Metadata EPUB2: Čtení kódu ISBN v prvcích identifikátorů bez schémat, pokud se jedná o platné kódy ISBN a nejsou přítomny žádné správně identifikované kódy ISBN
es: Metadatos EPUB2: Se leen ISBN en elementos de identificador sin esquema si son ISBN válidos y no hay otros ISBN adecuadamente identificados
ru: Метаданные EPUB2: считывание ISBN в элементах идентификатора без схем, если они являются действительными ISBN и отсутствуют правильно идентифицированные ISBN.
uk: Метадані EPUB2: реалізовано читання ISBN у елементах ідентифікатора без схем, якщо вони є чинними ISBN і немає належно ідентифікованих ISBN.

source: Update Amazon metadata plugin for changes to amazon websites
cs: Aktualizace modulu metadat Amazonu kvůli změnám na webových stránkách Amazonu
es: Actualizado el complemento de metadatos Amazon por cambios en los sitios web.
ru: Обновлён плагин метаданных Amazon для изменений на веб-сайтах Amazon
uk: Оновлено додаток метаданих Amazon відповідно до змін на сайтах amazon.

source: Edit book: Fix detection of class names containing hyphens/underscores
cs: Upravit knihu: Oprava rozpoznávání názvů tříd obsahujících pomlčky nebo podtržítka
es: Modificar libro: Se corrige la detección de nombres de clase que contienen guiones o guiones bajos
ru: Редактор книг: исправлено обнаружение имен классов, содержащих дефисы/подчеркивания.
uk: Редагування книг: виправлено виявлення назв класів, які містять дефіси або символи підкреслювання.

source: 26 Mar, 2021
cs: 26. března 2021
ru: 26 марта 2021
uk: 26 березня 2021 року

source: Edit book: When right clicking on a class in a HTML file, add an option to rename the class throughout the book
cs: Upravit knihu: Přidání možnosti přejmenovat třídu v celé knize při kliknutí pravým tlačítkem myši na třídu v souboru HTML
es: Modificar libro: Al pulsar con el botón derecho sobre una clase en un archivo HTML, se añade una opción para cambiar el nombre de la clase en todo el libro
ru: Редактировать книгу: при щелчке правой кнопкой мыши по классу в HTML-файле добавьте возможность переименовать класс по всей книге.
uk: Редагування книг: до контекстного меню класу у файлі HTML (можна викликати клацанням правою кнопкою миші) додано пункт перейменовування класу у всій книзі

source: Adding from ISBN: Add an option to check if there are existing books with the specified ISBNs already in the library
cs: Přidání z ISBN: Přidání volby kontroly, jestli v knihovně již existují knihy se zadanými ISBN
es: Añadir desde ISBN: Se añade una opción para comprobar si ya hay libros con los ISBN especificados en la biblioteca
ru: Добавление по ISBN: добавлена опция, чтобы проверить, есть ли в библиотеке книги с указанными номерами ISBN.
uk: Додавання з ISBN: додано пункт перевірки наявності книг із вказаними ISBN у бібліотеці

source: Template tester: Instead of next/last, the template tester now shows the template values for selected books
cs: Tester šablon: Namísto další a poslední se nyní v testeru šablon zobrazují hodnoty šablon pro vybrané knihy
es: Prueba de plantillas: En lugar de siguiente/anterior, la prueba de plantillas ahora muestra los valores de la plantilla para los libros seleccionados
ru: Тестер шаблонов: вместо следующего/последнего тестера шаблонов теперь отображаются значения шаблонов для выбранных книг.
uk: Засіб тестування шаблонів: замість пунктів наступного і останнього шаблонів у засобі тестування нової версії буде показано значення шаблонів для позначених книг

source: Content server: Allow swiping left and right to show next/previous book on the book details page
cs: Server s obsahem: Umožnění zobrazení další nebo předchozí knihy na stránce s podrobnostmi o knize přejetím doleva nebo doprava
es: Servidor de contenidos: Se permite deslizar a izquierda y derecha para mostrar el libro anterior o siguiente en la página de detalles del libro
ru: Контент сервер: разрешено смахивание влево и вправо для отображения следующей/предыдущей книги на странице сведений о книге.
uk: Сервер даних: уможливлено перехід до наступної або попередньої книги на сторінці подробиць щодо книги за допомогою рухів пальцем ліворуч і праворуч

source: E-book viewer: Make the commonly used Shift+Arrow key shortcuts for modifying selections using the keyboard work. Also add shortcuts for selecting by character, line and paragraph.
cs: Prohlížeč e-knih: Zprovoznění běžně používaných klávesových zkratek Shift+šipky pro úpravu výběrů pomocí klávesnice. Také přidání klávesových zkratek pro výběr podle znaků, řádků a odstavců.
es: Visor de libros electrónicos: Los atajos comunes Mayús+Flecha para modificar selecciones con el teclado ahora funcionan. Se añaden también atajos para seleccionar por carácter, línea y párrafo.
ru: Просмотрщик электронных книг: используйте обычно используемые сочетания клавиш Shift + стрелка для изменения выбора с помощью клавиатуры. Также добавлены сочетания клавиш для выбора по символу, строке и абзацу.
uk: Засіб перегляду електронних книг: уможливлено використання поширених клавіатурних скорочень Shift+клавіша зі стрілкою для зміни позначеного набору за допомогою клавіатури. Також додано скорочення для позначення за символами, рядками та абзацами.

source: MOBI Output: Fix latest Kindle firmware not displaying select publisher font option for calibre produced AZW3 files
cs: Výstup MOBI: Oprava nejnovějšího firmwaru Kindle, který nezobrazuje volbu výběru písma vydavatele pro soubory AZW3 vytvořené v Calibre
es: Salida MOBI: Se corrige el fallo por el que el «firmware» de Kindle no mostraba la opción para usar los tipos de letra del libro en archivoz AZW3 creados por calibre.
ru: Вывод MOBI: исправлена ​​ошибка, из-за которой последняя прошивка Kindle не отображала вариант выбора шрифта издателя для файлов AZW3, произведенных calibre.
uk: Виведення до MOBI: виправлено помилку, пов'язану із тим, що на останніх мікропрограмах Kindle не було показано пункт вибору шрифту для видавництва для створених calibre файлів AZW3

source: E-book viewer: Fix errors when viewing books with mathematics that are split over multiple internal files
cs: Prohlížeč e-knih: Oprava chyb při prohlížení knih s matematikou, která je rozdělena do více interních souborů
es: Visor de libros electrónicos: Se corrigen errores al mostrar libros con fórmulas matemáticas divididas en varios archivos internos
ru: Просмотрщик электронных книг: исправление ошибок при просмотре математических книг, разделенных на несколько внутренних файлов.
uk: Засіб перегляду електронних книг: виправлено помилки при перегляді книг, у яких містяться формули, поділені на декілька вбудованих файлів

source: Content server viewer: Fix highlights not sorted correctly in the highlights panel
cs: Prohlížeč serveru s obsahem: Oprava zvýraznění, která nejsou správně seřazena na panelu zvýraznění
es: Visor del servidor de contenidos: Se corrige el fallo por el que los resaltados no se ordenaban correctamente en el panel de resaltados
ru: Просмотрщик контент-сервера: исправлено некорректная сортировка выделений на панели выделений.
uk: Переглядач сервера даних: виправлено неправильне упорядковування підсвічувань на панелі підсвічувань

source: Get books: Fix Smashwords plugin not working because of website changes
cs: Získat knihy: Oprava nefunkčnosti modulu Smashwords kvůli změnám webových stránek
es: Obtener libros: Se corrige el fallo por el que el complemento de Smashwords no funcionaba debido a cambios en la web
ru: Получить книги: исправлен плагин Smashwords, не работавший из-за изменений на сайте
uk: Отримання книг: усунено непрацездатність додатка Smashwords через зміни на сайті

source: Improve the performance of QuickView especially when using composite columns
cs: Zlepšení výkonu Rychlého zobrazení, zejména při použití složených sloupců
es: Se mejora el rendimiento de la vista rápida, especialmente cuando se usan columnas compuestas
ru: Повышение производительности QuickView, особенно при использовании составных столбцов
uk: Пришвидшено роботу швидкого перегляду, особливо при використанні композитний стовпчиків

source: Improve performance of the virtual_libraries() template function
cs: Zlepšení výkonu funkce šablony virtual_libraries()
es: Se mejora el rendimiento de la función de plantilla virtual_libraries()
ru: Повышение производительности функции шаблона virtual_libraries()
uk: Удосконалено швидкодію функції шаблонів virtual_libraries()

source: Browser viewer: Fix Go to Location not working for positions
cs: Prohlížeč prohlížeče: Oprava nefunkčnosti Přechodu na umístění pro pozice
es: Visor del navegador: Se corrige el fallo por el que Ir a ubicación no funcionaba para posiciones
ru: Браузерный просмотрщик: исправление функции 'Перейти к месту' не работавшей для позиций
uk: Навігатор засобу перегляду: виправлено помилку, пов'язану із тим, що перехід до місця не працював для позицій

source: E-book viewer: Fix searching in the Table of Contents not working
cs: Prohlížeč e-knih: Oprava nefunkčního vyhledávání v obsahu
es: Visor de libros electrónicos: Se corrige el fallo por el que la búsqueda en el índice no funcionaba
ru: Просмотрщик электронных книг: исправлена ​​ошибка, из-за которой поиск в оглавлении не работал
uk: Засіб перегляду книг: виправлено помилку, пов'язану із непрацездатністю пошуку у таблиці змісту

source: E-book viewer: In paged mode, fix scrolling not working correctly when margins are set to zero
cs: Prohlížeč e-knih: Oprava nesprávně fungujícího posouvání v režimu stránek, když jsou okraje nastaveny na nulu
es: Visor de libros electrónicos: Se corrige el fallo por el que el desplazamiento en modo páginado no funcionaba correctamente con los márgenes puestos a cero
ru: Просмотрщик электронных книг: исправлена ​​ошибка, из-за которой в постраничном режиме прокрутка работала неправильно, если для полей задано нулевое значение.
uk: Засіб перегляду книг: у режимі поділу на сторінки виправлено помилку, пов'язану із некоректною роботою гортання, якщо встановлено нульові розміри полів

source: E-book viewer: Fix incorrect ToC navigation in books that link the entries to inline tags that wrap block tags that span multiple pages
cs: Prohlížeč e-knih: Oprava nesprávné navigace v obsahu v knihách, které odkazují položky na vložené značky, které obklopují blokové značky, které pokrývají více stránek
es: Visor de libros electrónicos: Se corrige el índice incorrecto en libros cuyas entradas enlazan con etiquetas en línea que contienen etiquetas de bloque que se extienden por varias páginas
ru: Просмотрщик электронных книг: исправление неправильной навигации по ToC в книгах, которые связывают записи со встроенными тегами, которые переносят теги блоков, охватывающие несколько страниц.
uk: Засіб перегляду книг: виправлено помилкову навігацію таблицею змісту у книгах, де записи таблиці пов'язано із вбудованими теґами, які огортають теґи блоків, у яких містяться декілька сторінок

source: Category editor: Searching in library shouldn't automatically open Quickview
cs: Editor kategorií: Vyhledávání v knihovně by nemělo automaticky otevírat Rychlé zobrazení
es: Editor de categorías: La búsqueda en la biblioteca no debería abrir automáticamente la vista rápida
ru: Редактор категорий: поиск в библиотеке не должен автоматически открывать Quickview
uk: Редактор категорій: усунено автоматичне відкриття швидкого перегляду при пошуку у бібліотеці

source: Conversion: Fix a hang caused by long sequences of non-word characters when heuristics are enabled, either explicitly or for some input formats such as TXT
cs: Převod: Oprava chyby způsobené dlouhými sekvencemi neslovních znaků, pokud je zapnuta heuristika, a to buď explicitně, nebo pro některé vstupní formáty, jako je TXT
es: Conversión: Se corrige un cuelgue causado por secuencias largas de caracteres no alfanuméricos cuando se activa el procesado heurístico, ya sea explícitamente o para algunos formatos de entrada como TXT
ru: Конвертация: исправление зависания, вызванного длинными последовательностями символов, отличных от слов, когда эвристика включена явно или для некоторых форматов ввода, таких как TXT.
uk: Перетворення: усунено зависання, яке спричинене довгими послідовностями спеціальних символів, якщо увімкнено евристику, явним чином чи лише для деяких форматів вхідних даних, зокрема TXT

source: Fix a regression in calibre 5 that broke --explode-book and --implode-book actions for calibre-debug.exe
cs: Oprava regrese v Calibre 5, která poškodila akce --explode-book a --implode-book pro calibre-debug.exe
es: Se corrige una regresión en calibre 5 que estropeaba las acciones --explode-book e --implode-book para calibre-debug.exe
ru: Исправлена регрессия в calibre 5, которая нарушила действия --explode-book и --implode-book для calibre-debug.exe.
uk: Виправлено регресію у calibre 5, яка заважала нормальній роботі параметрів --explode-book і --implode-book у calibre-debug.exe

source: Fix a regression in calibre 5 that broke setting metadata in RTF files
cs: Oprava regrese v Calibre 5, která poškodila nastavení metadat v souborech RTF
es: Se corrige una regresión en calibre 5 que estropeaba el establecimiento de metadatos en archivos RTF
ru: Исправлена регрессия в calibre 5, которая нарушила метаданные настроек в файлах RTF.
uk: Виправлено регресію у calibre 5, яка перешкоджала встановленню метаданих у файлах RTF

source: 10 Mar, 2021
cs: 10. března 2021
ru: 10 марта 2021
uk: 10 березня 2021 року

source: E-book Viewer: Allow editing the current book by pressing Ctrl+D or adding a button for it to the viewer tool bar
cs: Prohlížeč e-knih: Umožnění úpravy aktuální knihy stisknutím klávesové zkratky Ctrl+D nebo přidáním tlačítka na panel nástrojů prohlížeče
es: Visor de libros electrónicos: Se permite modificar el libro actual pulsando Ctrl+D o añadiendo un botón para ello en la barra de herramientas del visor
ru: Просмотрщик электронных книг: позволено редактировать текущую книгу, нажав Ctrl + D или добавив кнопку для неё на панель инструментов просмотрщика.
uk: Засіб для перегляду книг: уможливлено редагування поточної книги натисканням комбінації клавіш Ctrl+D або кнопки, яку додано на панель інструментів засобу для перегляду

source: Edit book: Add a command line flag to allow selecting the specified text when opening a book
cs: Upravit knihu: Přidání příznaku příkazového řádku pro umožnění vyběru zadaného textu při otevření knihy
es: Modificar libro: Se añade una opción de línea de órdenes para seleccionar el texto especificado al abrir el libro
ru: Редактировать книгу: добавлен флаг командной строки, чтобы разрешить выбор указанного текста при открытии книги.
uk: Редагування книг: додано прапорець командного рядка для уможливлення позначення вказаного тексту при відкритті книги

source: Edit metadata dialog: When trimming covers, show the size of the current trim region
cs: Dialogové okno Upravit metadata: Při ořezávání obálek zobrazit velikost aktuální oblasti ořezu
es: Diálogo de modificación de metadatos: Al recortar portadas, se muestra el tamaño de la zona de recorte actual
ru: Диалоговое окно «Редактировать метаданные»: при обрезке обложек показывать размер текущей области обрезки.
uk: Вікно редагування метаданих: реалізовано показ розмірів поточної ділянки обрізання при обрізанні зображень обкладинок

source: Fix a regression in the previous release that broke sending of emails with text longer than 900 characters
cs: Oprava regrese v předchozím vydání, která poškodila odesílání e-mailů s textem delším než 900 znaků
es: Se corrige una regresión en la versión anterior que estropeaba el envío de correos electrónicos con texto de más de 900 caracteres.
ru: Исправлен регресс в предыдущем выпуске, из-за которого нарушалась отправка электронных писем с текстом длиной более 900 символов.
uk: Усунено регресію попереднього випуску, яка заважала надсиланню повідомлень електронної пошти, розмір яких перевищував 900 символів

source: E-book viewer: Fix using keyboard to extend selection not turning pages
cs: Prohlížeč e-knih: Oprava neotáčení stránek při použití klávesnice pro rozšíření výběru
es: Visor de libros electrónicos: Se corrige el fallo por el que el uso del teclado para extender la selección no pasaba páginas
ru: Просмотрщик электронных книг: исправлено использование клавиатуры, чтобы расширить выбор, не переворачивая страницы
uk: Засіб перегляду електронних книг: виправлено помилку, яку було пов'язано із тим, що при використанні клавіатури для розширення позначеної області не горталися сторінки

source: Fix searching for items from the Manage dialog not working correctly
cs: Oprava nesprávně fungujícího vyhledávání položek z dialogového okna Správa
es: Se corrige el fallo por el que la búsqueda de elementos en el diálogo de administración no funcionaba correctamente
ru: Исправлена ​​ошибка, из-за которой поиск элементов в диалоговом окне управления работал некорректно
uk: Виправлено пошук записів у вікні керування

source: PDF input: Replace paragraph separator characters with spaces
cs: Vstup PDF: Nahrazení znaků oddělovače odstavců mezerami
es: Entrada PDF: Se sustituyen los caracteres de separación de párrafos por espacios
ru: Ввод PDF: замените символы-разделители абзацев пробелами
uk: Вхідні дані у PDF: реалізовано заміну символів ділення на абзаци на пробіли

source: 26 Feb, 2021
cs: 26. února 2021
ru: 26 февраля 2021
uk: 26 лютого 2021 року

source: E-book viewer: When searching start the search from the current position, jumping to the first match at or after the current page
cs: Prohlížeč e-knih: Při vyhledávání začít hledat od aktuální pozice a přejít na první shodu na aktuální stránce nebo za ní
es: Visor de libros electrónicos: Al buscar, comenzar la búsqueda en la posición actual, saltando a la primera coincidencia en la página actual o después
ru: Просмотрщик электронных книг: при поиске запускать поиск с текущей позиции, переходя к первому совпадению на текущей странице или после неё.
uk: Засіб перегляду книг: реалізовано перехід до першого відповідника на поточній або наступних сторінках на початку пошуку від поточної позиції

source: E-book viewer: Have the Table of Contents view automatically scroll to keep the chapter being read currently visible
cs: Prohlížeč e-knih: Automatické posouvání zobrazení obsahu tak, aby aktuálně čtená kapitola zůstala viditelná
es: Visor de libros electrónicos. Se desplaza el Índice automáticamente para mantener visible el capítulo actual
ru: Просмотрщик электронных книг: автоматическая прокрутка просмотра содержания, чтобы текущая глава оставалась видимой.
uk: Засіб перегляду книг: реалізовано автоматичне гортання у таблиці змісту так, щоб поточна глава лишалася видимою

source: Various improvements to the calibre template language, see <a href="%(h0)s">%(h0)s</a>
cs: Různá vylepšení jazyka šablon Calibre, viz <a href="%(h0)s">%(h0)s</a>
es: Varias mejoras en el lenguaje de plantillas de calibre, véase <a href="%(h0)s">%(h0)s</a>
ru: Различные улучшения языка шаблонов calibre, см. <a href="%(h0)s">%(h0)s</a>
uk: Різноманітні удосконалення у мові шаблонів calibre, див. <a href="%(h0)s">%(h0)s</a>

source: Edit book: File browser: Show total size of items in category when hovering over category with mouse
cs: Upravit knihu: Prohlížeč souborů: Zobrazení celkové velikosti položek v kategorii při najetí myší na kategorii
es: Modificar libro: Explorador de archivos: Se muestra el tamaño total de una categoría al pasar el cursor sobre la categoría
ru: Редактир книг: Браузер файлов: отображение общего размера элементов в категории при наведении курсора мыши на категорию
uk: Редактор книг: навігатор файлами: реалізовано показ загального розміру записів у категорії у відповідь на наведення вказівника миші на пункт категорії

source: Kobo driver: Add support for latest firmware and also an option to choose the color used for cover letterboxing
cs: Ovladač Kobo: Přidání podpory pro nejnovější firmware a také možnost zvolit barvu použitou pro letterboxing obálky
es: Controlador Kobo: Se añade compatibilidad para el nuevo «firmware» y una opción para elegir el color de fondo usado para las portadas
ru: Драйвер Kobo: добавлена ​​поддержка последней версии прошивки, а также возможность выбрать цвет, используемый для почтового ящика.
uk: Драйвер Kobo: додано підтримку найсвіжішої мікропрограми, а також параметр для вибору кольору для полів зображення обкладинки

source: E-book viewer: Fix selection popup bar sometimes going off screen when dragging up to the top line of text
cs: Prohlížeč e-knih: Oprava automaticky otevíraného panelu výběru, který někdy odchází mimo obrazovku při přetažení na horní řádek textu
es: Visor de libros electrónicos: Se corrige el fallo por el que la barra emergente de selección a veces se salía de la pantalla al arrastrar hacia la linea superior del texto
ru: Просмотрщик электронных книг: исправлена ​​ошибка, из-за которой всплывающая панель выбора иногда выходила за пределы экрана при перетаскивании в верхнюю строку текста.
uk: Засіб перегляду книг: виправлено помилку, пов'язану із тим, що контекстна панель вибору іноді опинялася за екраном при перетягуванні за верхній рядок тексту

source: Get books: Update the Biblio and Chitanka stores for website changes
cs: Získat knihy: Aktualizace obchodů Biblio a Chitanka kvůli změnám webových stránek
es: Obtener libros: Se actualizan las librerías Biblio y Chitanka por cambios en el sitio web
ru: Приобрести книги: обновление магазинов Biblio и Chitanka из-за изменений на сайте
uk: Отримання книг: оновлено додатки крамниць Biblio і Chitanka відповідно до змін на сайтах

source: Edit book: Fix editing of JavaScript files not working
cs: Upravit knihu: Oprava nefunkční úpravy souborů JavaScript
es: Modificar libro: Se corrige el fallo por el que la modificación de archivos JavaScript no funcionaba
ru: Редактор книг: Исправлено неработающее редактирование файлов JavaScript
uk: Редагування книг: виправлено помилку, пов'язану із непрацездатністю засобу редагування файлів JavaScript

source: 12 Feb, 2021
cs: 12. února 2021
ru: 12 февраля 2021
uk: 12 лютого 2021 року

source: Edit book: Add a tool to split the tag at the current cursor position, creating a new tag with the same style and class attributes. To add the tool go to the Toolbars section in the editor preferences
cs: Upravit knihu: Přidání nástroje pro rozdělení značky na aktuální pozici kurzoru a vytvoření nové značku se stejnými atributy stylu a třídy. Pro přidání nástroj přejděte do části Panely nástrojů v předvolbách editoru
es: Modificar libro: Se añade una herramienta para dividir la etiqueta en la posición actual del cursor, creando una nueva etiqueta con el mismo estilo y atributos de clase. Para añadir la herramienta vaya a la sección de barras de herramientas en las preferencias del editor
ru: Редактор книг: добавлен инструмент для разделения тега в текущей позиции курсора, создающий новый тег с тем же стилем и атрибутами класса. Чтобы добавить инструмент, перейдите в раздел Панели инструментов в настройках редактора.
uk: Редагування книг: додано інструмент для поділу теґу на поточній позиції курсора зі створенням теґу із тими самими атрибутами стилю і класу. Для додавання кнопки скористайтеся розділом панелей інструментів у налаштуваннях редактора.

source: E-book viewer: Show the URL when hovering over external links
cs: Prohlížeč e-knih: Zobrazení adresy URL při najetí myší na externí odkazy
es: Visor de libros electrónicos: Se muestra el URL al pasar el cursor sobre enlaces externos
ru: Просмотрщик электронных книг: показывать URL-адрес при наведении курсора на внешние ссылки
uk: Засіб перегляду книг: реалізовано показ адреси у відповідь на наведення вказівника миші на зовнішні посилання
