Repository: debian-calibre/calibre
Catalog: translations-git/changelog/*.po
Languages: cs, es, ru, uk

source: Check library: Allow ignoring folder names as well as files names
es: Comprobar biblioteca: Se permite ignorar nombres de carpeta además de nombres de archivo
ru: Проверить библиотеку: разрешить игнорировать имена папок, а также имена файлов
uk: Перевірка бібліотеки: уможливлено ігнорування тек із вказаними назвами, так само, як файлів

source: Edit book: Fix various formatting operations not inserting the tags in the correct place in the presence of non-BMP characters
es: Modificar libro: Se corrige el fallo por el que varias operaciones de formato no insertaban las etiquetas en el lugar correcto en presencia de caracteres fuera del plano básico multilingüe de Unicode.
ru: Редактор книг: исправлены различные операции форматирования, которые не вставляли теги в нужное место при наличии символов, отличных от BMP.
uk: Редагування книг: виправлено різноманітні дії з форматування — тепер теґи вставляються у належні місця, якщо у тексті є символи поза BMP

source: Edit book: Use &lt;s&gt; instead of &lt;strike&gt; for strikethrough
es: Modificar libro: Se usa &lt;s&gt; en lugar de &lt;strike&gt; para tachados
ru: Редактор книг: используются &lt;s&gt; вместо &lt;strike&gt; для зачёркивания.
uk: Редагування книги: використано &lt;s&gt; замість &lt;strike&gt; для перекреслювання

source: Edit book: Fix export saved search to search panel not preserving the wrap checkbox state
es: Modificar libro: Se corrige el fallo por el que la exportación de una búsqueda guardada al ponel de búsqueda no mantenía el estado de la casilla de dar la vuelta
ru: Редактор книг: Исправлен экспорт сохраненного поиска в панель поиска, не сохранявший состояние флажка переноса.
uk: Редагування книг: виправлено помилку, пов'язану із тим, що експортування збереженого пошуку на панель пошуку не зберігало стан пункту перенесення

source: Content server: Redirect the index page to always have trailing slash when using URL prefixes
es: Servidor de contenidos: Se redirige la página de índice para que siempre tenga una barra al final al usar prefijos de URL
ru: Контент-сервер: перенаправлена страница индекса, чтобы всегда иметь завершающую косую черту при использовании префиксов URL.
uk: Сервер даних: реалізовано переспрямовування сторінки покажчика так, щоб в адресі завжди містилася кінцева похила риска, якщо використано префікси адрес

source: Book list: Workaround for change in Qt 6 behavior where clicking on an already selected row does not deselect other rows
es: Lista de libros: Se evita el cambio de comportamiento de Qt 6 por el que al pulsar sobre una fila ya seleccionada no deselecciona otras filas
ru: Список книг: Обходной путь для изменения поведения Qt 6, когда щелчок по уже выбранной строке не отменяет выбор других строк
uk: Список книг: реалізовано обхідний код для змін у поведінці Qt 6 — клацання на вже позначеному рядку не скасовує позначення інших рядків

source: Windows: Fix a regression in calibre 6 causing Open with to not extract icons from EXE files
es: Windows: Se corrige una regresión en calibre 6 que hacía que Abrir con no extrajera iconos de archivos EXE
uk: Windows: виправлено регресію у calibre 6, яка спричиняла неможливість видобування піктограм з файлів EXE для меню «Відкрити за допомогою»

source: 25 Nov, 2022
ru: 25 нояб. 2022 г.
uk: 25 листопада 2022 року

source: E-book viewer: When exporting highlights as plain text include titles from chapters at all levels not just the first level
es: Visor de libros electrónicos: Al exportar los resaltados como texto plano, se incluyen los títulos de los capítulos en todos los niveles, no sólo en el primero.
ru: Просмотр электронных книг: при экспорте выделенных фрагментов в виде обычного текста включать заголовки из глав на всех уровнях, а не только на первом уровне.
uk: Засіб для читання електронних книг: при експортуванні підсвічувань у форматі звичайного тексту реалізовано включення заголовків з глав на усіх рівнях, а не лише на першому рівні

source: Edit book: Reports: Show the number of words per file in the Files section of the report
es: Modificar libro: Informes: Se muestra el número de palabras por archivo en la sección Archivos del informe.
ru: Редактор книг: Отчёты: Показать количество слов в файле в разделе отчёта «Файлы».
uk: Редагування книг: звіти: реалізовано показ кількості слів в окремих файлах у розділі «Файли» звіту

source: Windows builds: sign DLLs in addition to EXEs to make Microsoft's new "Smart App Control" tool happy
es: Versionos para Windows: Se firman los DLL además de los EXE para contentar a la nueva herramienta de Microsoft «Smart App Control».
ru: Сборки Windows: подпись DLL в дополнение к EXE, чтобы порадовать новый инструмент Microsoft «Smart App Control»
uk: Збірки для Windows: реалізовано підписування DLL, окрім EXE, щоб задовольнити вимоги нового інструмента «Smart App Control»

source: Sending by email: When adding comments also add series
es: Envío por correo electrónico: Al añadir comentarios se añade también la serie
ru: Отправка по электронной почте: при добавлении комментариев также добавлять серии
uk: Надсилання електронною поштою: реалізовано додавання циклів при додаванні коментарів

source: Nook driver: Put files in NOOK/Books instead of NOOK/My Files on recent nook devices so they are all listed in one place in the NOOK UI
es: Controlador Nook: Se ponen los archivos en NOOK/Books en lugar de NOOK/My Files en dispositivos nook recientes para que aparezcan todos en un solo lugar en la interfaz de NOOK.
ru: Драйвер Nook: поместить файлы в NOOK/Books вместо NOOK/My Files на последних устройствах Nook, для их перечисления в одном месте пользовательского интерфейса NOOK.
uk: Драйвер Nook: реалізовано запис файлів до NOOK/Books, замість NOOK/My Files, на свіжих пристроях nook, щоб усі ці файли було показано в одному списку в інтерфейсі NOOK

source: calibredb list: Allow using a template as one of the returned fields
es: calibredb list: Se permite el uso de una plantilla como uno de los campos devueltos
ru: список calibredb: разрешить использование шаблона в качестве одного из возвращаемых полей.
uk: Список calibredb: уможливлено використання шаблона, як одного з повернутих полів

source: Tag browser: Add context menu action to turn on/off sub-categorization for a category
es: Explorador de etiquetas: Se añade una acción de menú contextual para activar o desactivar la subcategorización de una categoría
ru: Браузер тегов: добавлено действие контекстного меню, чтобы включить/выключить подкатегорию для категории.
uk: Навігатор мітками: додано пункт контекстного меню для вмикання і вимикання підкатегорій для категорї

source: Merging books: Fix title sort not being updated when the title is updated
es: Unión de libros: Se corrige el fallo por el que la ordenación de títulos no se actualizaba al actualizar el título
ru: Объединение книг: исправлена ​​​​ошибка, из-за которой сортировка заголовков не обновлялась при обновлении заголовка.
uk: Об'єднання книг: виправлено оновлення упорядкування за заголовком після оновлення заголовка

source: Content server viewer: Fix incorrect sorting of highlights in the same paragraph
es: Visor del servidor de contenidos: Se corrige la ordenación incorrecta de los resaltados de un mismo párrafo.
ru: Просмотрщик контент-сервера: исправление неправильной сортировки выделения в одном и том же абзаце.
uk: Переглядач сервера даних: виправлено помилкове упорядкування підсвічувань у тому самому абзаці

source: Content server viewer: When exporting highlights as text include chapter titles
es: Visor del servidor de contenidos: Al exportar los resaltados como texto se incluyen los títulos de los capítulos
ru: Просмотрщик контент-сервера: при экспорте выделенного в виде текста включают заголовки глав.
uk: Переглядач сервера даних: реалізовано включення заголовка глави при експортуванні підсвічувань

source: Improve rendering of the separator handle dots introduced in the previous release
es: Mejora de la representación de los puntos separadores introducidos en la versión anterior
ru: Улучшена визуализация точек маркера-разделителя, представленных в предыдущем выпуске.
uk: Удосконалено обробку крапкового роздільника, який впроваджено у попередньому випуску

source: Edit book: Fix regression in previous release causing applying any container update marking all open image editors as modified
es: Modificar libro: Se corrige la regresión en la versión anterior por la que la aplicación de cualquier actualización de contenedor marcaba todos los editores de imágenes abiertos como modificados
ru: Редактор книг: исправлена ​​регрессия в предыдущем выпуске, из-за которой применялось любое обновление контейнера, помечающее все открытые редакторы изображений как изменённые.
uk: Редагування книг: усунено регресію попереднього випуску, яка спричиняла до того, що застосування будь-якого оновлення контейнера позначало усі відкриті редактори зображень як такі, що до них внесено зміни

source: Fix a regression in the previous release that caused copying book details to clipboard to use unix line endings on windows
es: Se corrige una regresión en la versión anterior que provocaba que al copiar detalles del libro al portapapeles se utilizaran finales de línea de Unix en Windows
ru: Исправлена ​​регрессия в предыдущем выпуске, из-за которой при копировании сведений о книге в буфер обмена использовались окончания строк unix в windows
uk: Усунено регресію попереднього випуску, яка спричиняла використання завершень рядків UNIX у Windows при копіюванні подробиць щодо книги до буфера обміну даними

source: 04 Nov, 2022
es: 4 nov 2022
ru: 04 ноя, 2022
uk: 4 листопада 2022 року

source: Allow customizing the buttons available to the right of the search bar in the main calibre window via Preferences-&gt;Toolbars &amp; menus-&gt;The buttons on the searchbar
es: Se permite personalizar los botones disponibles a la derecha de la barra de búsqueda en la ventana principal de calibre mediante Preferencias &gt; Barras de herramientas y menús &gt; Los botones de la barra de búsqueda
ru: Разрешена настройка кнопок, доступных справа от панели поиска в главном окне calibre, через «Настройки» -> «Панели инструментов и меню» -> «Кнопки на панели поиска».
uk: Уможливлено налаштовування кнопок, праворуч від поля для пошуку у головному вікні calibre за допомогою пункту «Налаштування-&gt;Панелі інструментів і меню-&gt;Кнопки на панелі пошуку»

source: Book details panel: Allow adjusting the space used by the cover with a splitter
es: Panel de detalles del libro: Se permite ajustar el espacio usado por la portada con un separador
ru: Панель Описание книги: Разрешено регулировать разделителем пространство, используемое обложкой
uk: Панель подробиць щодо книги: уможливлено коригування розміру, який програма використовуватиме для обкладинки з роздільником

source: Make splitter handles more visible in the calibre UI style
es: Se hacen más visibles las asas de separador en la interfaz gráfica de calibre
ru: Ручки разделителя сделаны более заметными в стиле пользовательского интерфейса calibre.
uk: Елементи керування роздільником зроблено помітнішими у стилі інтерфейсу користувача calibre

source: When sending by email to Kindle do not include the author in the filename as Amazon is currently reading the author from the file metadata but not the title
es: Al enviar por correo electrónico al Kindle no se incluye el autor en el nombre de archivo, pues Amazon lee actualmente el autor de los metadatos del archivo, pero no el título
ru: При отправке по электронной почте на Kindle не указывать автора в имени файла, так как Amazon в настоящее время читает автора из метаданных файла, но не из заголовка.
uk: При надсилання повідомлення електронної пошти на Kindle усунено включення автора у назву файла, оскільки у поточній версії Amazon читає запис автора з метаданих файла, а не із заголовка файла

source: Book list: Fix incorrect rendering of yes/no icons when they are configured to have only two values
es: Lista de libros: Se corrige la presentación incorrecta de los iconos de sí y no cuando se configuran para tener sólo dos valores
ru: Список книг: исправлено неправильное отображение значков «да/нет», когда они настроены так, чтобы иметь только два значения.
uk: Список книг: виправлено некоректну обробку піктограм «так/ні», якщо для них налаштовано лише два значення

source: Nook driver: Send books to the NOOK folder for the 2021 Nook model as well
es: Controlador Nook: Se envían libros a la carpeta NOOK en el modelo Nook de 2021 también
ru: Драйвер Nook: отправка книги в папку NOOK и для модели Nook 2021 года.
uk: Драйвер Nook: реалізовано надсилання до теки NOOK і для моделі 2021

source: Improve performance in very large libraries of various UI operations such as right clicking, marking books, etc.
es: Se mejora el rendimiento en bibliotecas muy grandes de varias operaciones de la interfaz gráfica, tales como pulsar con el botón derecho, marcar libros, etc.
ru: Улучшена производительность в очень больших библиотеках различных операций пользовательского интерфейса, таких как щелчок правой кнопкой мыши, пометка книг и т. д.
uk: Пришвидшено роботу програм із дуже великими бібліотеками, зокрема обробку клацання правою кнопкою миші, позначення книг тощо

source: Fix edit metadata dialog not remembering its position and improve how calibre restores window position and size on multi-monitor systems
es: Se corrige el fallo por el que el diálogo de modificación de metadatos no recordaba su posición y se mejora la manera en que calibre restablece la posición y tamaño de las ventanas en sistemas con varias pantallas
ru: Исправление диалогового окна редактирования метаданных, которое не запоминало своё положение, и улучшение способа восстановления положения и размера окна calibre в системах с несколькими мониторами.
uk: Виправлено помилку, пов'язану із тим, що програма не запам'ятовувала розташування вікна редагування метаданих та удосконалено роботу механізмів відновлення розташування вікна та його розмірів у системах з багатьма моніторами

source: Conversion: Fix CSS styles applied to SVG elements being discarded
es: Conversión: Se corrige el fallo por el que se descartaban los estilos CSS aplicados a elementos SVG
ru: Конвертация: исправлено отбрасывание стилей CSS, применённых к элементам SVG.
uk: Перетворення: виправлено помилку, пов'язану із тим щодо програма відкидала стилі CSS, які було застосовано до елементів SVG

source: EPUB Input: Fix empty Adobe page number template file causing conversion to fail
es: Entrada EPUB: Se corrige el fallo por el que un archivo vacío de plantilla de números de página de Adobe hacía fallar la conversión
ru: Ввод EPUB: исправление пустого файла шаблона номера страницы Adobe, вызывающего сбой преобразования.
uk: Вхідні дані EPUB: виправлено помилку, пов'язану із тим, що порожній файл шаблона номерів сторінок Adobe призводив до неможливості перетворення

source: E-book viewer: Fix rendering of comments in metadata display when using a dark color scheme
es: Visor de libros electrónicos: Se corrige la presentación de comentarios en los metadatos al usar un esquema de colores oscuro
ru: Просмотр электронных книг: исправление рендеринга комментариев в отображении метаданных при использовании тёмной цветовой схемы
uk: Засіб перегляду книг: виправлено обробку коментарів при показі метаданих і використанні темної схеми кольорів

source: AZW3 Input: Fix svg images that use a prefix for the SVG namespace not being recognized
es: Entrada AZW3: Se corrige el fallo por el que las imágenes svg que usan un prefijo para el espacio de nombres SVG no se reconocían
ru: Ввод AZW3: исправлены изображения SVG, которые используют префикс для нераспознанного пространства имён SVG
uk: Вхідні дані AZW3: виправлено розпізнавання зображень svg, де використано префікс для простору назв SVG

source: Edit book: Fix double clicking in the see what changed dialog not opening the file in the editor since calibre 6.0
es: Modificar libro: Se corrige el fallo por el que la doble pulsación para ver el diálogo de qué ha cambiado no abría el archivo en el editor desde calibre 6.0
ru: Редактор книг: исправлен двойной щелчок в диалоговом окне «Посмотреть, что изменилось», не открывая файл в редакторе, начиная с calibre 6.0
uk: Редагування книг: виправлено помилку, пов'язану із тим, що подвійне клацання ну вікні показу змін не відкривало файл у редакторі, починаючи з версії calibre 6.0

source: Edit book: Fix modified indicator on images not working correctly when replacing the image
es: Modificar libro: Se corrige el fallo por el que el indicador de imagen modificada no funcionaba correctamente al sustituir la imagen
ru: Редактор книгу: исправлен изменённый индикатор на изображениях, не работавший должным образом при замене изображения
uk: Редагування книг: виправлено непрацездатність індикатора змін для зображень при заміні зображення

source: Amazon metadata download: Adapt the plugin for website changes
es: Descarga de metadatos de Amazon: Se adapta el complemento a los cambios en el sitio web
ru: Загрузка метаданных Amazon: плагин адаптирован к изменениям веб-сайта
uk: Отримання метаданих Amazon: роботу додатка скориговано за змінами на сайті

source: 14 Oct, 2022
ru: 14 октября 2022 г.
uk: 14 жовтня 2022 року

source: Template language: A new "Python template mode" which allows using arbitrary Python code in templates
es: Lenguaje de plantillas: Un nuevo «modo de plantilla de Python» permite usar código Python arbitrario en las plantillas
ru: Язык шаблонов: новый «режим шаблона Python», который позволяет использовать произвольный код Python в шаблонах
uk: Мова шаблонів: новий «режим шаблонів Python», який уможливлює використання довільного коду Python у шаблонах

source: Tag browser: Allow removing format from selected books by right clicking on the format in the Tag browser
es: Explorador de etiquetas: Se permite eliminar un formato de los libros seleccionados pulsando con el botón derecho sobre el formato en el explorador de etiquetas
ru: Браузер Тегов: Разрешить удаление формата из выбранных книг, щелчком правой кнопкой мыши по формату в Браузере Тегов
uk: Навігатор мітками: уможливлено вилучення формату з позначених книг — достатньо клацнути правою кнопкою на пункті формату на панелі навігації мітками

source: E-book viewer: Ask for confirmation when creating a highlight that will overwrite existing highlights
es: Visor de libros electrónicos: Se pide confirmación al crear un resaltado que sustituirá resaltados existentes
ru: Просмотр электронных книг: запрос подтверждения при создании выделения, которое перезапишет существующие выделения
uk: Засіб перегляду електронних книг: реалізовано запит щодо підтвердження при створенні підсвічування, яке переписує наявні підсвічування

source: Book list: Allow changing column widths via a dedicated dialog by right clicking on column headers
es: Lista de libros: Se permite cambiar los anchos de columna mediante un diálogo específico pulsando con el botón derecho sobre los encabezados de columna
ru: Список книг: разрешено изменение ширины столбцов в специальном диалоговом окне, щелчком правой кнопкой мыши по заголовкам столбцов
uk: Список книг: уможливлено зміну ширини стовпчиків за допомогою відповідного вікна, яке можна відкрити клацанням правою кнопкою миші на заголовках стовпчиків

source: E-book viewer: Fix a regression that broke adding of new lookup sources
es: Visor de libros electrónicos: Se corrige una regresión que estropeaba la adición de nuevos orígenes de consulta
ru: Просмотр электронных книг: исправление регрессии, препятствовавшей добавлению новых источников поиска
uk: Засіб перегляду електронних книг: виправлено регресію, яка заважала додаванню нових джерел пошуку

source: E-book viewer: Fix copy to clipboard not ignoring text from elements that are marked as non user selectable
es: Visor de libros electrónicos: Se corrige el fallo por el que la copia al portapapeles no ignoraba el texto de elementos marcados como no seleccionables
ru: Просмотр электронных книг: исправлено копирование в буфер обмена, не игнорируя текст из элементов, помеченных как недоступные для выбора пользователем
uk: Засіб перегляду електронних книг: виправлено копіювання до буфера обміну даними — раніше програма не ігнорувала текст з елементів, які позначено як непридатні до позначення користувачем

source: Content server: When adding books, run all file type plugins before reading metadata
es: Servidor de contenidos: Al añadir libros, se ejecutan todos los complementos de tipo de archivo antes de leer los metadatos
ru: Контент-сервер: при добавлении книг запуск плагинов всех типов файлов перед чтением метаданных
uk: Сервер даних: при додаванні книг реалізовано запуск додатків усіх типів файлів до читання метаданих

source: Edit book: Preview panel: In dark mode when all of the background/foreground/link colors are set to "No change" do not render the book using dark colors
es: Modificar libro: Panel de vista previa: En modo oscuro, cuando todos los colores de fondo y primer plano se establecen como «Sin modificar», no se muestra el libro con colores oscuros
ru: Редактор книг: панель предварительного просмотра: в тёмном режиме, когда для всех цветов фона/переднего плана/ссылок установлено значение «Без изменений», книга не отображалась в тёмных тонах
uk: Редагування книг: панель попереднього перегляду: у темному режимі, якщо для усіх кольорів тла, переднього плану та посилань встановлено значення «Не змінювати», програма не використовуватиме для обробки зображення темні кольори

source: Version 6.7.1 fixes a regression in the previous release that broke the delete specific format from book function
es: La versión 6.7.1 corrige una regresión en la versión anterior que estropeaba la función para eliminar un formato específico del libro
ru: Версия 6.7.1 исправляет регрессию в предыдущем выпуске, нарушавшую функцию удаления определённого формата из книги
uk: У версії 6.7.1 виправлено регресію попереднього випуску, яку було пов'язано із помилкою у функції вилучення заданого формату з книги

source: 30 Sep, 2022
ru: 30 сентября 2022 г.
uk: 30 вересня 2022 року

source: Book details: allow displaying multi-valued categories such as tags on separate lines via Preferences-&gt;Look &amp; feel-&gt;Book details
es: Detalles del libro: Se permite mostrar categorías con varios valores como las etiquetas en varias líneas mediante Preferencias &gt; Apariencia &gt; Detalles del libro
ru: Сведения о книге: разрешено отображение многозначных категорий, таких как теги, в отдельных строках через Настройки -> Оформление -> Описание книги
uk: Подробиці щодо книги: уможливлено показ багатозначних категорій, окрема міток, в окремих рядках за допомогою пункту «Налаштування-&gt;Вигляд та поведінка-&gt;Подробиці щодо книги»

source: Tag browser: When searching the Tag browser allow also filtering the book list to show only books that match one of the categories currently shown in the Tag browser.
es: Explorador de etiquetas: Al buscar en el explorador de etiquetas se filtra también la lista de libros para mostrar sólo los libros que coinciden con alguna de las categorías mostradas actualmente en el explorador de etiquetas.
ru: Браузер Тегов: при поиске в Браузере Тегов разрешено также фильтровать список книг, чтобы отображались только книги, которые соответствуют одной из категорий, отображаемых в данный момент в Браузере Тегов
uk: Панель навігації мітками: при пошуку панель навігації мітками також уможливлює фільтрування списку книг так, щоб було показано лише книги, які відповідають одній з категорій, які показано на панелі навігації мітками.
