Repository: debian-calibre/calibre
Catalog: translations-git/changelog/*.po
Languages: cs, es, ru, uk

source: Embed fonts tool: Create &lt;head&gt; when missing
cs: Nástroj pro vkládání písem: Vytvoření &lt;head&gt;, když chybí
es: Herramienta de incrustación de tipos de letra: Se crea un elemento &lt;head&gt; si falta
ru: Инструмент для встраивания шрифтов: создать head, если он отсутствует
uk: Інструмент вбудовування шрифтів: реалізовано створення &lt;head&gt;, якщо у файлі не було цього теґу

source: Tag editor: Improve performance when very large number of tags present
cs: Editor štítků: Zlepšení výkonu při velkém počtu štítků
es: Editor de etiquetas: Se mejora el rendimiento cuando hay un número muy grande de etiquetas
ru: Редактор тегов: Повышение производительности при наличии очень большого количества тегов
uk: Редактор міток: підвищено швидкодію, якщо у файлі дуже багато міток

source: 04 Feb, 2022
cs: 4. února 2022
es: 4 feb 2022
ru: 04 фев, 2022
uk: 4 лютого 2022 року

source: Edit metadata dialog: Allow controlling which custom columns are present in this dialog via Preferences-&gt;Look &amp; feel-&gt;Edit metadata
cs: Dialogové okno Upravit metadata: Umožnění ovládat, které vlastní sloupce jsou v tomto dialogovém okně přítomny prostřednictvím Předvolby-&gt;Vzhled a chování-&gt;Upravit metadata
es: Diálogo de modificación de metadatos: Se permite controlar qué columnas personalizadas aparecen en este diálogo mediante Preferencias &gt; Apariencia &gt; Modificar metadatos
ru: Диалог «Редактировать метаданные»: контроль настраиваемых столбцов в этом диалоге, «Настройки» -> «Внешний вид» -> «Редактировать метаданные».
uk: Вікно редагування метаданих: уможливлено визначення, які нетипові стовпчики буде показано у цьому діалоговому вікні, за допомогою сторінки «Налаштування-&gt;Вигляд та поведінка-&gt;Редагування метаданих»

source: Edit metadata dialog: Allow manually sizing the various sections of the dialog in "All on 1 tab" mode
cs: Dialogové okno Upravit metadata: Umožnění ručního nastavení velikosti různých částí dialogového okna v režimu „Vše na 1 kartu“.
es: Diálogo de modificación de metadatos: Se permite redimensionar manualmente las distintas secciones del diálogo en el modo «Todo en una pestaña»
ru: Диалог «Редактировать метаданные»: разрешить вручную изменять размер разделов диалога в режиме «Все на 1 вкладке».
uk: Вікно редагування метаданих: у режимі «усе на одній вкладці» вікна уможливлено визначення розмірів різних розділів вручну

source: Edit book: Spell checking: Update the bundled English and Spanish dictionaries
cs: Upravit knihu: Kontrola pravopisu: Aktualizace přiložených anglických a španělských slovníků
es: Modificar libro: Comprobación de ortografía: Actualización de los diccionarios incorporados inglés y español
ru: Редактор книг: Проверка орфографии: обновлены прилагаемые словари английского и испанского языков.
uk: Редагування книги: перевірка правопису: оновлено вбудовані словники англійської та іспанської мов

source: BibTeX catalogs: Support tags like custom columns
cs: Katalogy BibTeX: Podpora štítků, jako jsou vlastní sloupce
es: Catálogos BibTeX: Se permiten etiquetas como columnas personalizadas
ru: Каталоги BibTeX: поддержка тегов, таких как настраиваемые столбцы.
uk: Каталоги BibTeX: реалізовано підтримку міток, подібних до нетипових стовпчиків

source: Amazon metadata download: Fix paragraphs in the comments being merged
cs: Stahování metadat z Amazon: Oprava slučování odstavců v komentářích
es: Descarga de metadatos de Amazon: Se corrige el fallo por el que los párrafos de los comentarios se condensaban
ru: Загрузка метаданных Amazon: исправление слияния абзацев в комментариях.
uk: Отримання метаданих Amazon: виправлено помилку, пов'язану із об'єднанням абзаців у коментарях

source: Amazon.de metadata download: Fix published date and series information not being fetched for some books
cs: Stahování metadat z Amazon.de: Oprava data vydání a informace o sérii, které se pro některé knihy nenačítaly
es: Descarga de metadatos de Amazon.de: Se corrige el fallo por el que la fecha de publicación y la información de serie de algunos libros no se capturaba
ru: Загрузка метаданных Amazon.de: исправлена ​​ошибка, из-за которой информация о дате публикации и серии не загружалась для некоторых книг.
uk: Отримання метаданих Amazon.de: виправлено помилку, пов'язану із неможливістю отримання даних щодо дати публікації та циклу для деяких книг

source: Email delivery: Fix sending email via Hotmail not working since this week because Microsoft changed the SMTP server name
cs: Doručování e-mailem: Oprava nefunkčnosti odesílání e-mailů prostřednictvím Hotmail od tohoto týdne, protože Microsoft změnil název SMTP serveru
es: Envío de correo electrónico: Se corrige el envío de correos electrónicos por Hotmail, que no funcionaba desde esta semana porque Microsoft ha cambiado el nombre del servidor SMTP
ru: Доставка электронной почты: исправлена ​​​​ошибка, из-за которой отправка электронной почты через Hotmail не работала, т.к. Microsoft изменила имя SMTP-сервера.
uk: Надсилання пошти: відновлено працездатність надсилання пошти за допомогою Hotmail, оновлено змінену Microsoft назву сервера SMTP

source: Do not remove articles for titles in the Polish language
cs: Neodebírat články pro názvy v polském jazyce
es: No se eliminan los artículos de los títulos en polaco
ru: Не удалять статьи для заголовков на польском языке
uk: Усунено вилучення артиклів для заголовків польською мовою

source: E-book viewer: When using Read aloud do not automatically lookup the highlighted word until read aloud is paused or stopped
cs: Prohlížeč e-knih: Při použití hlasitého čtení automaticky nevyhledávat zvýrazněné slovo, dokud není hlasité čtení pozastaveno nebo zastaveno
es: Visor de libros electrónicos: Cuando se usa la lectura en alto, no se consulta automáticamente la palabra resaltada hasta que se pause o detenga la lectura
ru: Просмотрщик электронных книг: при использовании функции «Чтение вслух» не выполнять автоматический поиск выделенного слова до тех пор, пока чтение вслух не будет приостановлено или остановлено.
uk: Засіб перегляду електронних книг: вимкнено автоматичний пошук підсвіченого слова у режимі читання уголос до призупинення або припинення читання

source: E-book viewer: Fix Ctrl+p shortcut for printing not working
cs: Prohlížeč e-knih: Oprava nefunkční klávesové zkratky Ctrl+p pro tisk
es: Visor de libros electrónicos: Se corrige el fallo por el que el atajo Ctrl+p para imprimir no funcionaba
ru: Просмотрщик электронных книг: исправлено неработающее сочетание клавиш Ctrl+p для печати
uk: Засіб перегляду книг: відновлено працездатність комбінації клавіш Ctrl+P для друку книги

source: Show an error when viewing a specific format and the file is missing
cs: Zobrazení chyby při zobrazení určitého formátu a chybějícího souboru
es: Se muestra un error cuando se visualiza un formato específico y falta el archivo
ru: Показывать ошибку при просмотре определённого формата и отсутствии файла
uk: Реалізовано показ повідомлення про помилку при спробі перегляду книги у певному форматі, якщо цього формату не виявлено

source: Edit book: Fix renaming of classes that start/end with non word characters not working
cs: Upravit knihu: Oprava nefunkčnosti přejmenování tříd, které začínají nebo končí neslovními znaky
es: Modificar libro: Se corrige el fallo por el que cambio de nombre de clases que empiezan o terminan por caracteres no alfanuméricos no funcionaba
ru: Редактор книг: исправлено неработающее переименование классов, которые начинались/заканчивались несловными символами.
uk: Редагування книг: відновлено працездатність засобу перейменування класів, якщо назва класу починається або завершується нелітерними символами

source: Edit book: Preview panel: Fix hyphenation at end of line being rendered as boxes on macOS
cs: Upravit knihu: Panel náhledu: Oprava dělení slov na konci řádku, které se v macOS zobrazovaly jako rámečky
es: Modificar libro: Panel de vista previa: Se corrige el fallo por el que la división de palabras al final de renglón se mostraba como recuadros en macOS
ru: Редактор книг: панель предварительного просмотра: исправление переноса в конце строки, отображаемого в виде прямоугольников на macOS.
uk: Редактор книг: панель попереднього перегляду: виправлено помилку, пов'язану із тим, що символи перенесення у macOS програма показувала як квадратики

source: Fix incorrect selection size displayed in Trim image dialog when image is scaled down to fit
cs: Oprava nesprávné velikosti výběru zobrazené v dialogovém okně Oříznout obrázek, když je obrázek zmenšen, aby se vešel
es: Se corrige el tamaño de selección incorrecto mostrado en el diálogo de recortar imagen cuando la imagen se reduce para encajar
ru: Исправлен неправильный размер выделения, отображаемый в диалоговом окне «Обрезка изображения», когда изображение уменьшено до нужного размера.
uk: Виправлено помилковий показ розміру позначеної області у вікні обрізання зображення, якщо зображення було масштабовано за областю перегляду

source: Edit book: Fix pasting files from another editor instance failing if a file with the same name already exists
cs: Upravit knihu: Oprava selhání vkládání souborů z jiné instance editoru, pokud již existuje soubor se stejným názvem
es: Modificar libro: Se corrige el fallo por el que al pegar archivos de otra copia del editor fallaba si ya existe un archivo con el mismo nombre
ru: Редактор книг: Исправлена ​​ошибка вставки файлов из другого экземпляра редактора, если файл с таким именем уже существует.
uk: Редагування книг: виправлено помилку, результатом якої було те, що не можна було вставити файли з іншого екземпляра редактора, якщо такий файл вже існував у книзі.

source: When reviewing metadata if the newly downloaded metadata has no language but there is an existing language, ensure it is preserved
cs: Pokud při přezkoumávání metadat nově stažená metadata neobsahují žádný jazyk, ale nějaký jazyk již existuje, zajistí se jeho zachování
es: Al revisar metadatos, si los nuevos metadatos descargados no contienen idioma pero hay un idioma existente, se mantiene el idioma
ru: При просмотре метаданных, если только что загруженные метаданные не имеют языка, но есть существующий язык, убедиться, что они сохранены.
uk: Реалізовано збереження мови наявних метаданих при рецензуванні метаданих, якщо в отриманих метаданих не вказано мови

source: 21 Jan, 2022
cs: 21. ledna 2022
es: 21 ene 2022
ru: 21 января 2022 г.
uk: 21 січня 2022 року

source: Coloring/icon rules: Allow creating a rule for date columns that matches *today*
cs: Pravidla obarvení/ikon: Umožnění vytvoření pravidla pro sloupce s datem, které odpovídají *dnes*
es: Reglas de coloreado e iconos: Se permite crear una regla para columnas de fecha que coincidan con *hoy*
ru: Правила раскраски/значка: Разрешить создание правила для столбцов даты, которое соответствует *сегодня*
uk: Правила для розфарбовування та піктограм: уможливлено створення правила для стовпчиків даних, які відповідають критерію *сьогодні*

source: Content server: Show total number of results when searching for books
cs: Server s obsahem: Zobrazení celkového počtu výsledků při vyhledávání knih
es: Servidor de contenidos: Se muestra el número total de resultados al buscar libros
ru: Контент-сервер: показывать общее количество результатов при поиске книг.
uk: Сервер даних: реалізовано показ загальної кількості результатів при пошуку книг

source: E-book viewer: Fix searching for text near the end of a chapter sometimes not working
cs: Prohlížeč e-knih: Oprava vyhledávání textu na konci kapitoly, které někdy nefunguje
es: Visor de libros electrónicos: Se corrige el fallo por el que la búsqueda de texto cerca del final de un capítulo no funcionaba
ru: Просмотрщик электронных книг: исправлена ​​ошибка, из-за которой поиск около конца главы иногда не работал
uk: Засіб перегляду книг: виправлено помилку, пов'язану із непрацездатністю пошуку для тексту наприкінці глави

source: E-book viewer: Fix auto hyphenation on macOS not rendering the hyphens correctly
cs: Prohlížeč e-knih: Oprava automatického dělení slov v systému macOS, které nevykreslovalo spojovníky správně
es: Visor de libros electrónicos: Se corrige el fallo por el que la división de palabras automática en macOS no mostraba los guiones correctamente
ru: Просмотрщик электронных книг: исправлена ​​ошибка некорректного рендеринга автопереноса слов на macOS
uk: Засіб перегляду книг: виправлено помилку, пов'язану із тим, що автоматичне розставлення дефісів призводило до неправильного показу дефісів у macOS.

source: Edit book: Reports: Fix thumbnails of SVG images not rendered
cs: Upravit knihu: Hlášení: Oprava nevykreslování náhledů obrázků SVG
es: Modificar libro: Informes: Se corrige el fallo por el que no se mostraban miniaturas de imágenes SVG
ru: Просмотрщик электронных книг: Отчёты: исправлен рендеринг превью SVG изображений
uk: Редагування книг: звіти: виправлено помилку, яка заважала показу мініатюр зображень SVG

source: ODT metadata: Support reading tags from multiple &lt;keyword&gt; elements
cs: Metadata ODT: Podpora čtení štítků z více prvků &lt;keyword&gt;
es: Metadatos ODT: Se permite la lectura de etiquetas de múltiples elementos &lt;keyword&gt;
ru: Метаданные ODT: поддержка чтения тегов из нескольких элементов &lt;keyword&gt;
uk: Метадані ODT: реалізовано підтримку читання теґів з декількох елементів &lt;keyword&gt;

source: LRF Input: Fix a regression in calibre 5 that broke parsing of some LRF files
cs: Vstup LRF: Oprava regrese v Calibre 5, která poškodila analýzu některých souborů LRF
es: Entrada LRF: Se corrige una regresión en calibre 5 que estropeaba el procesamiento de algunos archivos LRF
ru: Ввод LRF: исправлена ​​регрессия в calibre 5, из-за которой нарушался анализ некоторых файлов LRF.
uk: Вхідні дані LRF: виправлено регресію у calibre 5, яка заважала обробці деяких файлів LRF

source: MOBI output: Don't fail if input document contains invalid % based lengths
cs: Výstup MOBI: Neselže, pokud vstupní dokument obsahuje neplatné délky založené na %
es: Salida MOBI: No se genera un fallo si el documento de entrada contiene dimensiones de porcentaje inválidas
ru: Вывод MOBI: не сбоить, если входной документ содержит недопустимую длину на основе %
uk: Виведення до MOBI: усунено проблеми із вхідними документами, що містять некоректні значення часток довжини

source: AZW3 Input: Handle AZW3 files with incorrect TAGX Offset INDX header fields
cs: Vstup AZW3: Zpracování souborů AZW3 s nesprávnými poli hlavičky TAGX Offset INDX
es: Entrada AZW3: Se aceptan archivos AZW3 con desplazamiento TAGX incorrecto en campos de cabecera INDX
ru: Ввод AZW3: обрабатывать файлы AZW3 с неправильными полями заголовка TAGX Offset INDX.
uk: Вхідні дані AZW3: реалізовано обробку файлів AZW3 із некоректними полями заголовка INDX відступу TAGX

source: Comic conversion: Fix conversion of comic images that are stored as grayscale images in JPEG format not working when converting to PDF with image processing turned off
cs: Převod komiksu: Oprava převodu obrázků komiksů, které jsou uloženy jako obrázky ve stupních šedi ve formátu JPEG, která nefungovala při převodu do PDF s vypnutým zpracováním obrázků
es: Conversión de cómics: Se corrige el fallo por el que la conversión de imágenes de cómic almacenadas en escala de grises en formato JPEG no funcionaba al convertir a PDF con el procesado de imágenes desactivado
ru: Конвертация комиксов: исправление преобразования изображений, хранящихся в градациях серого в формате JPEG, не работает при преобразовании в PDF с отключенной обработкой изображений.
uk: Перетворення коміксів: виправлено перетворення зображень коміксів, які зберігаються як зображення у відтінках сірого у форматі JPEG, при перетворенні до PDF із вимкненою обробкою зображень

source: calibredb catalog: Fix --ids and --search options not working for CSV/XML catalogs
cs: Katalog calibredb: Oprava nefunkčnosti voleb --ids a --search pro katalogy CSV/XML
es: calibredb catalog: Se corrige el fallo por el que las opciones --ids y --search no funcionaban con catálogos CSV o XML
ru: Каталог calibredb: исправить параметры --ids и --search, не работающие для каталогов CSV/XML.
uk: Каталог calibredb: усунено непрацездатність параметрів --ids і --search для каталогів CSV/XML

source: Tag browser: Fix the find box not using all available width
cs: Prohlížeč štítků: Oprava vyhledávacího pole, které nevyužívalo celou dostupnou šířku
es: Explorador de etiquetas: Se corrige el fallo por el que el cuadro de búsqueda no utilizaba toda la anchura disponible
ru: Браузер тегов: исправлено поле поиска, не использовавшее всю доступную ширину
uk: Навігація мітками: виправлено помилку, пов'язану із тим, що панель пошуку не використовувала усієї доступної ширини

source: E-book viewer: Remove books that do not exist from the recently opened book list
cs: Prohlížeč e-knih: Odebrání neexistujících knih ze seznamu naposledy otevřených knih
es: Visor de libros electrónicos: Se eliminan los libros que no existen de la lista de libros abiertos recientemente
ru: Просмотрщик электронных книг: удаление несуществующих книг из недавно открытого списка книг
uk: Засіб перегляду електронних книг: реалізовано усування пунктів криг, які не існують, зі списку нещодавно відкритих книг

source: Completion popups: Fix display of items containing line breaks
cs: Automaticky otevíraná okna o dokončení: Oprava zobrazení položek obsahujících zalomení řádků
es: Completados emergentes: Se corrige la apariencia de los elementos que contienen saltos de línea
ru: Всплывающие диалоги автозавершения: исправлено отображение элементов, содержащих разрывы строк.
uk: Контекстні панелі автоматичного доповнення: виправлено показ записів, у яких містяться розриви рядків

source: Fix line breaks in custom column descriptions not being rendered in their tooltips
cs: Oprava zalomení řádků v popisech vlastních sloupců, které se nevykreslovalo v jejich popiscích tlačítek
es: Se corrige el fallo por el que los saltos de línea e las descripciones de columnas no se mostraban en sus ayudas emergentes
ru: Исправлена ​​ошибка, из-за которой разрывы строк в описаниях пользовательских столбцов не отображались во всплывающих подсказках.
uk: Виправлено помилку, пов'язану із тим, що програма не показувала на панелях підказок розриви рядків в описах нетипових стовпчиків

source: Fix Preferences-&gt;Searching-&gt;Clear search histories not taking effect till a restart for some search boxes
cs: Oprava chyby, kdy se Předvolby-&gt;Vyhledávání-&gt;Vymazat historie hledání u některých vyhledávacích polí projevilo až po restartu
es: Se corrige el fallo por el que Preferencias &gt; Búsqueda &gt; Limpiar historiales de búsqueda no surtía efecto hasta un reinicio para algunos cuadros de búsqueda
ru: Исправлено: Настройки-> Поиск-> Очистить историю поиска, не срабатывала до перезапуска для некоторых окон поиска.
uk: Виправлено помилку, пов'язану із тим, що пункт «Налаштування-&gt;Пошук-&gt;Спорожнити журнали пошуку» не діяв, аж до перезапуску, у деяких полях для пошуку

source: Hierarchical entries in user category may not merge correctly in tag browser
cs: Hierarchické položky v uživatelské kategorii se nemusely správně sloučit v prohlížeči štítků
es: Las entradas jerárquicas e categorías de usuario pueden no combinarse correctamente en el explorador de etiquetas
ru: Иерархические записи в категории пользователя могли неправильно объединяться в браузере тегов.
uk: Виправлено злиття ієрархічних записів у категорії користувача навігатора мітками

source: 17 Dec, 2021
cs: 17. prosince 2021
es: 17 dic 2021
ru: 17 декабря, 2021
uk: 17 грудня 2021 року

source: Happy holidays to everyone!
cs: Šťastné a veselé všem!
es: ¡Felices fiestas a todos!
ru: Счастливых праздников всем!
uk: Усім веселих свят!

source: Driver for the new Nook Glowlight 4
cs: Ovladač pro nový Nook Glowlight 4
es: Controlador para el nuevo Nook Glowlight 4
ru: Драйвер для нового Nook Glowlight 4
uk: Драйвер для нової Nook Glowlight 4

source: Edit book: Spell check tool: Add an exclude files button to exclude some files from being checked
cs: Upravit knihu: Nástroj kontroly pravopisu: Přidání tlačítka pro vyloučení některých souborů z kontroly
es: Modificar libro: Herramienta de comprobación ortográfica: Se añade un botón para excluir archivos de la comprobación
ru: Редактор книг: инструмент проверки орфографии: добавлена кнопка исключения файлов, чтобы исключить некоторые файлы из проверки
uk: Редагування книг: інструмент перевірки правопису: додано кнопку виключення файлів для виключення деяких з файлів з первірки

source: EPUB/MOBI Catalogs: Increase the maximum thumbnail size to 3 inches from 2 inches
cs: Katalogy EPUB/MOBI: Zvětšení maximální velikosti náhledu ze 2 palců na 3 palce
es: Catálogos EPUB/MOBI: Se aumenta el tamaño máximo de miniatura de 2 pulgadas a 3 pulgadas
ru: Каталоги EPUB/MOBI: увеличен максимальный размер миниатюр с 2 дюймов до 3 дюймов.
uk: Каталоги EPUB/MOBI: максимальний розмір мініатюр збільшено з 2 дюймів до 3 дюймів

source: Allow creating a shortcut in Preferences-&gt;Shortcuts-&gt;Edit metadata to paste metadata ignoring the value of the exclude_fields tweak
cs: Umožnění vytvoření klávesové zkratky v Předvolby-&gt;Klávesové zkratky-&gt;Upravit metadata pro vložení metadat bez ohledu na hodnotu vylepšení exclude_fields
es: Se permite crear un atajo en Preferencias &gt; Atajos &gt; Modificar metadatos para pegar metadatos ignorando el valor del ajuste exclude_fields
ru: Разрешить создание ярлыка в "Настройки -> Ярлыки -> Редактировать метаданные" для вставки метаданных, игнорируя значение настройки exclude_fields.
uk: Уможливлено створення клавіатурного скорочення «Налаштування-&gt;Скорочення-&gt;Редагувати метадані» для вставлення метаданих з ігноруванням значення коригування exclude_fields

source: E-book viewer: Displays links marked up as glossary and bibliography links as popups
cs: Prohlížeč e-knih: Zobrazení odkazů označených jako slovník pojmů a odkazů na bibliografii jako automaticky otevíraná okna
es: Visor de libros electrónicos: Se muestran los enlaces marcados como glosario y bibliografía en ventanas emergentes
ru: Просмотрщик электронных книг: отображать ссылки, помеченные как глоссарий, и библиографические ссылки в виде всплывающих окон.
uk: Засіб перегляду електронних книг: реалізовано показ посилань, позначених як посилання на глосарій та бібліографію, як контекстних панелей

source: Add a tweak in Preferences-&gt;Tweaks to provide the sort value for undefined numbers
cs: Přidání vylepšení v Předvolby-&gt;Vylepšení pro zadání hodnoty řazení pro nedefinovaná čísla
es: Se añade un ajuste en Preferencias &gt; Ajustes para asignar un valor de ordenación para números indefinidos
ru: Добавлена настройка в Настройки -> Твики, чтобы указать значение сортировки для неопределённых чисел
uk: Додано коригування у «Налаштування-&gt;Коригування» для надання значення упорядковування для невизначених чисел

source: Edit book: Fix pressing F8 to jump to next misspelled word not working after last word in current file
cs: Upravit knihu: Oprava nefunkčnosti stisknutí klávesy F8 pro přechod na další chybně napsané slovo po posledním slově v aktuálním souboru
es: Modificar libro: Se corrige el fallo por el que F8 para ir al siguiente error de ortografía no funcionaba después de la última palabra en el archivo actual
ru: Редактор книг: Исправлена ​​ошибка, из-за которой нажатие F8 для перехода к следующему слову с ошибкой не работало после последнего слова в текущем файле
uk: Редагування книг: виправлено помилку, пов'язану із тим, що натискання F8 для переходу до наступного слова із помилкою не працювало після останнього слова у поточному файлі
