Repository: debian-calibre/calibre
Catalog: translations-git/changelog/*.po
Languages: cs, es, ru, uk

source: Color/icon rules editor: Fix duplicate rule button not working correctly
cs: Editor pravidel pro barvy nebo ikony: Oprava nesprávně fungujícího tlačítka pro duplikování pravidla
es: Editor de reglas de colores o iconos: Se corrige el fallo por el que el botón de duplicar regla no funcionaba correctamente
ru: Редактор правил цвета/значка: исправление неправильно работающей кнопки дублирования правила
uk: Редактор правил кольорів і піктограм: виправлено працездатність кнопки дублювання правила

source: Fix dropping files onto Book details causing an error if the confirmation dialog is disabled
cs: Oprava stavu, kdy přetahování souborů na Podrobnosti o knize způsobovalo chybu, pokud je potvrzovací dialogové okno zakázáno
es: Se corrige el fallo por el que al soltar archivos sobre los detalles del libro se producía un error si el cuadro de confirmación está desactivado
ru: Исправлено перетаскивание файлов в Сведения о книге, вызывающее ошибку, если диалоговое окно подтверждения отключено
uk: Усунено причину повідомлення про помилку при скиданні файлів на панель подробиць щодо книги, якщо вимкнено діалогове вікно підтвердження дії

source: 24 Dec, 2020
cs: 24. prosince 2020
es: 24 dic 2020
ru: 24 декабря 2020
uk: 24 грудня 2020 року

source: Happy holidays to all calibre users!
cs: Šťastné a veselé Vánoce všem uživatelům Calibre!
es: ¡Felices fiestas a todos los usuarios de calibre!
ru: Всех пользователей calibre с наступающим!
uk: Веселих свят усіх користувачам calibre!

source: E-book viewer: Add a mode to follow links with only the keyboard (triggered by Alt+F)
cs: Prohlížeč e-knih: Přidán režim pro sledování odkazů pouze pomocí klávesnice (přepínaný pomocí Alt+F)
es: Visor de libros electrónicos: Se añade un modo para seguir enlaces usando sólo el teclado (se activa con Alt+F)
ru: Просмотрщик электронных книг: добавлен режим для перехода по ссылкам только с помощью клавиатуры (запуск - Alt + F)
uk: Засіб перегляду книг: додано режим переходу за посиланнями лише за допомогою клавіатури (вмикається і вимикається комбінацією клавіш Alt+F)

source: Edit book: A new option to show a configurable number lines above the current line when syncing the position of the preview panel to the current position in the code editor (under Preview settings in the Editor preferences).
cs: Upravit knihu: Nová volba pro zobrazení konfigurovatelné číselné řádky nad aktuálním řádkem při synchronizaci polohy panelu náhledu s aktuální pozicí v editoru kódu (v části Nastavení náhledu v Předvolbách editoru).
es: Modificar libro: Una nueva opción para mostrar un número configurable de líneas sobre la actual al sincronizar la posición del panel de previsualización con la posición actual en el panel de código (en Configuración de previsualización en las preferencias del editor).
ru: Редактор книг: новый параметр для отображения настраиваемого числа строк над текущей строкой при синхронизации положения панели предварительного просмотра с текущим положением в редакторе кода (в настройках предварительного просмотра в настройках редактора).
uk: Редагування книг: додано новий параметр для показу вказаної користувачем кількості рядків над поточним рядком при синхронізації позицій на панелі попереднього перегляду із поточною позицією у редакторі коду (пункт параметра розташовано у налаштуваннях попереднього перегляду вікна налаштувань редактора).

source: Windows: Automatically resolve shortcuts (.lnk files) when adding books to calibre.
cs: Windows: Automatické řešení zástupců (souborů .lnk) při přidávání knih do Calibre.
es: Windows: Se resuelven automáticamente los atajos (archivos .lnk) al añadir libros a calibre.
ru: Windows: автоматически резолвить ярлыки (файлы .lnk) при добавлении книг в calibre.
uk: Windows: реалізовано автоматичну обробку ярликів (файлів .lnk) при додаванні книг до calibre.

source: Content server viewer: Don't enter full screen mode automatically when reading on desktop like devices (this can be controlled via a setting in the viewer preferences under Page layout)
cs: Prohlížeč serveru s obsahem: Při čtení na zařízeních podobných stolním počítačům nepřepínat automaticky do celoobrazovkového režimu (toto může být ovládáno prostřednictvím nastavením v předvolbách prohlížeče pod Rozložení stránky)
es: Visor del servidor de contenidos: No se activa automáticamente el modo de patalla completa al leer en dispositivos de escritorio (esto puede controlarse con una configuración e las preferencias del visor, en Estructura de la página)
ru: Просмотрщик контент-сервера: не переходить в полноэкранный режим автоматически при чтении на настольных устройствах (контролируется параметром в настройках просмотрщика в разделе «Макет страницы»)
uk: Переглядач сервера даних: усунено автоматичний перехід у повноекранний режим при читанні на пристроях, подібних до робочої станції (переходом можна керувати за допомогою пункту у налаштуваннях переглядача, розділ компонування сторінки)

source: E-book viewer tool bar: Add a select all action and a Read aloud action (can be added by right clicking the tool bar and configuring it)
cs: Panel nástrojů Prohlížeče e-knih: Přidání akcí Vybrat vše a Číst nahlas (může být přidáno kliknutím pravým tlačítkem myši na panel nástrojů a jeho konfigurací)
es: Barra de herramientas del visor de libros electrónicos: Se añaden acciones para seleccionar todo y para leer en alto (se pueden añadir pulsando con el botón derecho sobre la barra de herramientas y configurándola)
ru: Панель инструментов просмотрщика электронных книг: добавлены действия «Выбрать всё» и «Чтение вслух» (добавляется при настройке панели инструментов щелчком правой кнопки мыши)
uk: Панель інструментів засобу перегляду книг: додано пункт вибору усього тексту та пункт дії для читання тексту уголос (можна додати на панель інструментів і налаштувати за допомогою контекстного меню)

source: Template/formatter enhancements: Add a 'for' statement and add the ability for a developer to pass extra information to a template.
es: Mejoras de plantilla y formateador: Se añade una instrucción «for» y la posibilidad de que un desarrollador pase información adicional a una plantilla
ru: Улучшения в шаблоне/форматтере: добавлен оператор "for" и добавлена возможность разработчикам передавать дополнительную информацию в шаблон
uk: Удосконалення у мові шаблонів і форматування: додано інструкцію «for» та можливість для розробників передавати додаткові дані шаблону.

source: Rules editors for icon/coloring rules: Add a button to duplicate rules and to convert a rule to advanced template mode
es: Editor de reglas de icono y coloreado: Se añade un botón para duplicar reglas y para convertirlas a modo de plantilla avanzado
ru: Редакторы правил для значков/правил окраски: добавлена кнопка для дублирования правил и преобразования правила в расширенный режим шаблона.
uk: Редактори правил для розфарбовування і піктограм: додано кнопку для дублювання правил і перетворення правила до розширеного режиму шаблонів

source: Content server viewer: Fix regression in 5.0 that broke scrolling on iOS
es: Visor del servidor de contenidos: Se corrige una regresión en 5.0 que estropeaba el desplazamiento en iOS
ru: Просмотрщик контент-сервера: исправлена регрессия в версии 5.0, нарушавшая прокрутку на iOS
uk: Засіб перегляду сервера даних: усунено регресію у версії 5.0, яка заважала гортанню у iOS

source: E-book viewer: Fix error when scrolling to some search results in flow mode
es: Visor de libros electrónicos: Se corrige un error al desplazarse a algunos resultados de búsqueda en modo continuo
ru: Просмотрщик электронных книг: исправление ошибки при прокрутке к некоторым результатам поиска в потоковом режиме
uk: Засіб перегляду книг: виправлено помилку при гортанні результатів пошуку у режимі неперервного гортання

source: AZW3 Input: Fix rare AID based links not working.
es: Entrada AZW3: Se corrige el fallo por el que los infrecuentes enlaces basados en AID no funcionaban
ru: Ввод AZW3: исправление редких неработающих ссылок на основе AID.
uk: Вхідні дані AZW3: виправлено обробку рідкісних випадків посилань на основі AID

source: E-book viewer: Fix clock in header/footer not using system time format
es: Visor de libros electrónicos: Se corrige el fallo por el que el reloj en encabezado o pie de página no usaba el formato de hora del sistema
ru: Просмотрщик электронных книг: исправлены часы в верхнем/нижнем колонтитуле, не использующие формат системного времени
uk: Засіб перегляду книг: реалізовано використання формату часу системи для годинників у верхньому та нижньому колонтитулах

source: Windows: Fix Read aloud not working with books that have a single large internal text file, such as MOBI or DOCX books
es: Windows: Se corrige el fallo por el que la lectura en alto no funcionaba con libros que tienen un único archivo interno, como libros MOBI o DOCX
ru: Windows: исправлена ​​ошибка, из-за которой чтение вслух не работало с книгами с одним большим внутренним текстовым файлом, такими как книги MOBI или DOCX.
uk: Windows: виправлено працездатність засобу читання уголос для книг, у яких зберігається великий вбудований текстовий файл, зокрема книг MOBI і DOCX

source: PDF Output: Fix a regression causing conversion to fail when typesetting Chinese text
es: Salida PDF: Se corrige una regresión que hacía que fallara la conversión al generar texto chino
ru: Вывод PDF: исправлена ​​регрессия, приводящая к сбою конвертации при наборе текста на китайском языке
uk: Виведення до PDF: усунено регресію, яка призводила до неможливості перетворення книг із текстом китайськими ієрогліфами

source: Amazon metadata download: Fix no results being found when using the automatic or Google servers because of a change in the markup of the Google search results page.
es: Descarga de metadatos de Amazon: Se corrige el fallo por el que no se encontraban resultados al usar los servidores automáticos de Google debido a un cambio el el código de la página de resultados de búsqueda de Google.
ru: Загрузка метаданных Amazon: исправлено отсутствие результатов при использовании автоматических серверов или серверов Google из-за изменения разметки страницы результатов поиска Google.
uk: Отримання метаданих Amazon: виправлено помилку, яка призводила до того, що програма не показувала результатів пошуку, якщо використовувала автоматичний сервер або сервер Google. Причиною була зміна форматування сторінки результатів пошуку Google.

source: Version 5.8.1 fixes a couple of regressions that broke the Save to disk function and changing Page layout settings in the viewer.
es: La versión 5.8.1 corrige un par de regresiones que estropeaban la función Guardar en el disco y el cambio de las configuraciones de estructura de página en el visor.
ru: В версии 5.8.1 исправлена ​​пара ошибок, из-за которых нарушалась функция сохранения на диск и изменение настроек макета страницы в просмотрщике.
uk: У версії 5.8.1 виправлено декілька регресій, які перешкоджали нормальній роботи інструментів збереження даних на диск та параметрів компонування сторінки у засобі перегляду.

source: 12 Dec, 2020
cs: 12. prosince 2020
es: 12 dic 2020
ru: 12 декабря 2020
uk: 12 грудня 2020 року

source: E-book viewer: Add a "Read aloud" function that works via the operating system's Text-to-speech engine.
es: Visor de libros electrónicos: Se añade la función «Leer en alto», que utiliza el motor de síntesis de voz del sistema operativo.
ru: Читалка электронных книг: добавлена функция «Чтение вслух», работающая через системный механизм преобразования текста в речь.
uk: Засіб перегляду електронних книг: додано можливість «Читати уголос», яка працює на основі рушія озвучення тексту операційної системи.

source: Click the "Read aloud" button in the viewer controls to start reading the book text aloud from the current page.
es: Pulse el botón «Leer en alto» en los controles del visor para leer el libro en alto a partir de la página actual.
ru: Нажмите кнопку «Чтение вслух» в элементах управления просмотрщиком, чтобы начать чтение текста книги вслух с текущей страницы.
uk: Натисніть кнопку «Читати уголос» на панелі керування засобом перегляду, щоб розпочати читання тексту уголос, починаючи з поточної сторінки.

source: A new busy spinner for waiting animations
es: Una nueva animación rotativa para las esperas
ru: Новый спиннер для анимации ожидания.
uk: Реалізовано нову піктограму індикатора зайнятості для анімації очікування

source: Edit metadata: Add buttons to easily set yes/no fields also shortcut to clear the field.
es: Modificar metadatos: Se añaden botones para establecer rápidamente los campos de sí o no, y un atajo para limpiar el campo.
ru: Редактирование метаданных: добавлены кнопки для упрощения настройки полей «да/нет», а также ярлык для очистки поля.
uk: Редагування метаданих: додано кнопки для полегшення встановлення значень для полів «так/ні», а також кнопку для спорожнення поля.

source: PDF Output: Fix a regression in the previous release that broke text rendering for some fonts due to a bug in Qt WebEngine (full fix is in 5.7.2).
es: Salida PDF: Se corrige una regresión en la versión anterior que estropeaba la generación de texto con algunos tipos de letra debido a un fallo en Qt WebEngine (la corrección completa está en 5.7.2).
ru: Вывод PDF: исправлена регрессия предыдущего выпуска, из-за ошибки в Qt WebEngine сломавшая рендеринг текста для некоторых шрифтов (полностью исправлена в 5.7.2).
uk: Виведення до PDF: виправлено регресію у попередньому випуску, яка заважала обробці деяких шрифтів через ваду у WebEngine Qt (повне виправлення у 5.7.2).

source: PDF Output: Fix conversion failing when adding header/footer and the input document defines margins/padding on the &lt;html&gt; tag.
es: Salida PDF: Se corrige el fallo de la conversión al añadir encabezados o pies de página si el documento de entrada define márgenes o espacios en la etiqueta &lt;html&gt;.
ru: Вывод PDF: исправлена ошибка преобразования при добавлении верхнего/нижнего колонтитула и заданных во входном документе полях/отступах в теге &lt;html&gt;.
uk: Виведення даних до PDF: уможливлено перетворення при додаванні верхнього або нижнього колонтитулів, коли вхідний документ визначає поля або фаски у тезі &lt;html&gt;.

source: Windows: Fix the case of library names in copied calibre:// links sometimes incorrect.
es: Windows: Se corrige el fallo por el que las mayúsculas o minúsculas de los nombres de biblioteca en enlacies calibre:// copiados son a veces incorrectas.
ru: Windows: исправлена редкая ошибка с неправильным регистром в названии библиотек в скопированных ссылках calibre://.
uk: Windows: виправлено регістр символів у назвах бібліотек у скопійованих посиланнях calibre://.

source: AZW3 Input: Fix a regression in calibre 5 that broke processing of files with inline flow replacements.
es: Entrada AZW3: Se corrige una regresión en calibre 5 que estropeaba el procesado de archivos con sustituciones de flujo en línea.
ru: Ввод AZW3: исправлена регрессия в calibre 5, нарушившая обработку файлов с инлайновой потоковой заменой.
uk: Вхідні дані AZW3: усунено регресію у calibre 5, яка заважала обробці файлів із вбудованими замінниками обтікання текстом.

source: Fix hiding and showing Book details panel changes its size by a pixel or two.
es: Se corrige el fallo por el que al ocultar y mostrar el panel de detalles del libro su tamaño cambia uno o dos píxeles.
ru: Исправлено скрытие и отображение Панели сведений о книге изменяло свой размер на один или два пикселя.
uk: Виправлено помилку, яку було пов'язано із тим, що приховування і показ панелі подробиць щодо книги призводило до зміни розмірів панелі на піксель або два.

source: Get books: Fix amazon.fr not working because of website changes.
es: Obtener libros: Se corrige el fallo por el que amazon.fr no funcionaba debido a cambios en la web.
ru: Приобрести книги: исправлен неработающий из-за изменений веб-сайта amazon.fr.
uk: Отримання книг: усунено непрацездатність amazon.fr через зміни на сайті.

source: Bulk metadata search/replace: Fix text transform function not being applied to the test result in character mode
es: Buscar y sustituir metadatos en masa: Se corrige el fallo por el que la función de transformación de texto no se aplicaba a los resultados de la prueba en modo carácter
ru: Массовый поиск/замена метаданных: исправлена ​​ошибка, из-за которой функция преобразования текста не применялась к результатам теста в символьном режиме.
uk: Пакетний пошук із заміною у метаданих: виправлено застосування функції перетворення тексту до тестового результату у режимі символів

source: Book list: Improve rendering of column headers when they don't fit, by eliding them instead of just cutting off rendering.
es: Lista de libros: Se mejora el aspecto de las cabeceras de columnas cuando no caben, eliminando letras en lugar de recortar el resultado.
ru: Список книг: улучшен рендеринг заголовков столбцов, когда они не помещаются, то удаляются, а не просто отключается рендеринг.
uk: Список книг: удосконалено обробку заголовків стовпчиків, які не вміщаються в область перегляду, — у новій версії замість непоказаної частини додається багатокрапка замість обрізання показаного рядка.

source: Fix template function "first_non_empty" fails if no argument evaluates non-empty
es: Se corrige el fallo por el que la función de plantilla «first_non_empty» falla si no hay ningún argumento que no esté vacío
ru: Исправлен сбой шаблонной функции first_non_empty если ни один аргумент не оценивает непустое значение
uk: Виправлено шаблонну функцію «first_non_empty» — нова версія працює, якщо аргумент no не є порожнім

source: Fix regression in 5.7.0 causing failure to start if one of the previously used libraries had a stored path ending in a slash.
es: Se corrige una regresión en 5.7.0 que impedía el inicio si alguna de las bibliotecas usadas previamente tiene una ruta terminada en una barra.
ru: Исправлена регрессия в версии 5.7.0, приводящая к ошибке запуска, если сохранённый путь к одной из ранее использовавшихся библиотек заканчивался косой чертой.
uk: Усунено регресію у версії 5.7.0, яка спричиняла неможливість запуску, якщо одну з попередньо використаних бібліотек було збережено за шляхом, який завершується символом похилої риски.

source: 27 Nov, 2020
cs: 27. listopadu 2020
ru: 27 ноября 2020
uk: 27 листопада 2020 року

source: Edit book: Show a non-modal popup for a few seconds to allow undoing file delete operations
es: Modificar libro: Se muestra una ventana emergente durante unos segundos para permitir deshacer operaciones de borrado de archivos
ru: Редактор книг: отображение на несколько секунд немодального всплывающего окна, позволяющего отменить удаление файлов.
uk: Редактор книг: реалізовано показ протягом декількох секунд немодального контекстного вікна, за допомогою якого можна скасовувати дії з вилучення

source: Device books view: Add an action to the context menu to easily jump to the matching book in the calibre library view
es: Vista de libros en el dispositivo: Se añade una acción al menú contextual para ir al libro correspondiente en la vista de la biblioteca de calibre
ru: Просмотр книг на устройстве: добавлено действие в контекстное меню для легкого перехода к соответствующей книге в представлении библиотеки calibre.
uk: Панель перегляду книг на пристрої: до контекстного меню додано пункт дій для спрощення переходу до відповідних книг на панелі перегляду бібліотеки calibre

source: Add ability to undo Generate cover in the Edit metadata screen, by long clicking the Generate cover button
es: Se añade la posibilidad de de deshacer la generación de portada en la ventana de modificación de metadatos, manteniendo pulsado el botón de generar portada.
ru: Добавлена возможность отменить создание обложки на экране редактирования метаданных, долго удерживая нажатой кнопку «Создать обложку».
uk: Додано можливість скасовувати створення зображення обкладинки у вікні редагування метаданих — достатньо натиснути і потримати кнопку «Створити обкладинку»

source: Edit book: Allow adding tags to the list of tags for the insert tag button
es: Modificar libro: Se permite añadir etiquetas a la lista del botón para insertar etiqueta
ru: Редактор книг: разрешено добавление тегов в список тегов для кнопки вставки тега
uk: Редагування книги: уможливлено додавання міток до списку міток для кнопки вставлення мітки

source: calibredb add: New option --automerge to automatically merge duplicates
es: calibredb add: Nueva opción --automerge para unir automáticamente los duplicados
ru: calibredb add: новая опция --automerge для автоматического объединения дубликатов.
uk: calibredb add: новий параметр --automerge для автоматичного об'єднання дублікатів

source: Add an edit notes action to the context menu in the viewer highlights panel
es: Se añade una acción de modificar notas al menú contextual del panel de resaltados del visor
ru: Добавлено действие для редактирования заметок в контекстное меню панели выделений в читалке.
uk: До контекстного меню на панелі підсвічувань засобу перегляду книг додано пункт редагування нотаток

source: Content server viewer: Allow viewing images in a new window by right clicking them, matches the calibre builtin viewer behavior
es: Visor del servidor de contenidos: Se permite ver imágenes en una nueva ventana pulsando con el botón derecho sobre ellas, igual que en el visor incorporado de calibre
ru: Просмотрщик контент-сервера: разрешён просмотр изображений в новом окне по щелчку правой кнопки мыши, соответствует поведению встроенного просмотрщика calibre
uk: Засіб перегляду книг сервера даних: уможливлено перегляд зображень у новому вікні — достатньо клацнути на них правою кнопкою; відповідає поведінці вбудованого засобу перегляду calibre

source: Book details window: Allow opening the edit metadata window using either the keyboard shortcut or the context menu
es: Ventana de detalles del libro: Se permite abrir la ventana de modificación de metadatos usando el atajo de teclado o el menú contextual
ru: Окно описания книги: разрешено открывать окно редактирования метаданных с помощью сочетания клавиш или контекстного меню.
uk: Вікно подробиць щодо книги: уможливлено відкриття вікна редагування метаданих за допомогою клавіатурного скорочення або контекстного меню

source: Allow copying the current search as a calibre:// URL by right clicking the search box
es: Se permite copiar la búsqueda actual como un URL calibre:// pulsando con el botón derecho sobre el cuadro de búsqueda
ru: Разрешено копирование текущего поиска в виде URL-адреса calibre://, щелчком правой кнопкой мыши по полю поиска
uk: Уможливлено копіювання поточного пошуку як адреси calibre:// за допомогою клацання правою кнопкою миші на полі пошуку

source: Book details panel: Add entries to copy calibre:// links for the current book to the context menu
es: Panel de detalles del libro: Se añaden entradas para copiar enlaces calibre:// para el libro actual al menú contextual
ru: Панель описания книги: в контекстное меню добавлен действие по копированию ссылок calibre:// для текущей книги.
uk: Панель даних щодо книги: до контекстного меню додано пункти для копіювання посилань calibre:// для поточної книги

source: Edit book: Upgrade book: Ask whether to keep the NCX based Table of Contents
es: Modificar libro: Actualizar libro: Se pregunta si se conserva el índice basado en NCX
ru: Редактор книг: Обновить книгу: спросить, следует ли сохранять оглавление на основе NCX
uk: Редагування книг: оновлення книги: реалізовано запит щодо збереження NCX на основі таблиці змісту
