Repository: debian-calibre/calibre
Catalog: translations-git/changelog/*.po
Languages: cs, es, ru, uk

source: To use enable the two Preferences: "Preferences-&gt;Look &amp; feel-&gt;Tag browser-&gt;Hide empty categories" and "Find shows all items that match". Then, when searching the Tag browser, press Ctrl+Alt+Shift+F to restrict the displayed books.
es: Para usar esta función, active las dos preferencias: «Preferencias &gt; Apariencia &gt; Explorador de etiquetas &gt; Ocultar categorías vacías» y «Buscar muestra todos los elementos que coinciden». Después, al buscar en el explorador de etiquetas, pulse Ctrl+Alt+Mayús+F para restringir los libros mostrados.
ru: Чтобы использовать, включите две настройки: "Настройки -> Оформление -> Браузер тегов -> Скрыть пустые категории (столбцы)" и "Найти и показать все соответствующие элементы". Затем при поиске в браузере тегов нажмите Ctrl+Alt+Shift+F, чтобы ограничить отображаемые книги.
uk: Щоб скористатися цим, увімкніть два пункти налаштувань: «Налаштування-&gt;Вигляд та поведінка-&gt;Навігатор мітками-&gt;Приховати порожні категорії» і «Пошук показує усі відповідні записи». Далі, при пошуку на панелі навігатора мітками, натисніть Ctrl+Alt+Shift+F, щоб обмежити список показаних книг.

source: Edit book: When right clicking on HTML files in EPUB 3 books, allow marking them as the Table of Contents (NAV document)
es: Modificar libro: Al pulsar con el botón derecho sobre archivos HTML de libros EPUB 3, se permite marcarlos como índice (documento NAV)
ru: Редактор книг: при щелчке правой кнопкой мыши на файлах HTML в книгах EPUB 3 разрешить помечать их как оглавление (документ NAV)
uk: Редагування книг: при клацанні правою кнопкою миші на файлах HTML у книгах EPUB 3 уможливлено позначення їх як таблиці змісту (документ NAV)

source: EPUB Output: Fix converting a document with obfuscated fonts to EPUB 3 not working
es: Salida EPUB: Se corrige el fallo por el que la conversión de un documento con tipos de letra ofuscados a EPUB 3 no funcionaba
ru: Вывод EPUB: исправление неработающей конвертации документа с обфусцированными шрифтами в EPUB 3
uk: Виведення до EPUB: виправлено перетворення документа із зашифрованими шрифтами до EPUB 3

source: Edit book: Fix an error when processing books that contain comments inside unknown CSS @ rules
es: Modificar libro: Se corrige un error al procesar libros que contienen comentarios dentro de reglas @ CSS desconocidas
ru: Редактор книг: исправлена ​​ошибка при обработке книг, содержащих комментарии внутри неизвестных @ правил CSS
uk: Редагування книг: виправлено помилку при обробці книг, які містять коментарі всередині невідомих правил @ CSS

source: Content server: Fix jumping to locations such as bookmarks not working on iPhone/iPad running iOS &gt;= 15
es: Servidor de contenidos: Se corrige el fallo por el que el salto a ubicaciones como los marcadores no funcionaba en iPhone/iPad con iOS &gt;= 15
ru: Контент-сервер: исправление перехода к таким местам, как закладки, не работающим на iPhone/iPad под управлением iOS &gt;= 15
uk: Сервер вмісту: виправлено перехід до місць, подібних до закладок, який не працював на iPhone/iPad із iOS &gt;= 15

source: Font subsetting: Fix :first-line and :first-letter pseudo classes not being handled correctly
es: Reducción de tipos de letra: Se corrige el fallo por el que las pseudoclases :first-line y :first-letter no se manejaban correctamente
ru: Подмножество шрифтов: исправление: псевдоклассы :first-line и :first-letter обрабатываются некорректно
uk: Підмножини шрифтів: виправлено помилкову обробку перших псевдокласів :first-line і :first-letter

source: Workaround for Amazon's email delivery service not reading metadata from inside ebook files
es: Solución alternativa para el hecho de que el servicio de distribución de correo electrónico de Amazon no lee los metadatos contenidos en los archivos de libro
ru: Обходной путь для службы доставки электронной почты Amazon, не считывающей метаданные из файлов электронных книг
uk: Реалізовано обхідний маневр для роботи служби доставлення електронною поштою Amazon — служба не могла читати метадані з файлів електронних книг

source: Edit book: File list: Fix pressing Tab key while renaming a file not starting the rename of the next file
es: Modificar libro: Lista de archivos: Se corrige el fallo por el que al pulsar el tabulador mientras se cambia el nombre de un archivo no comenzaba el cambio de nombre del siguiente archivo.
ru: Редактор книг: Список файлов: исправлена ​​ошибка, из-за которой нажатие клавиши Tab при переименовании файла не запускало переименование следующего файла
uk: Редагування книг: список файлів: виправлено роботу клавіші Tab під час перейменування файла — вона знову починає перейменування наступного файла

source: Version 6.6.1 fixes a regression that caused the Edit metadata window to not remember its last used size. Note that you will have to resize it once after updating to 6.6.1, after which the size will be remembered.
es: La versión 6.6.1 corrige una regresión que hacía que la ventana de modificación de metadatos no recordara el último tamaño usado. Tenga en cuenta que tendrá que redimensionarla una vez después de actualizar a 6.6.1. después se recordará el tamaño.
ru: Версия 6.6.1 исправляет регрессию, из-за которой окно редактирования метаданных не помнило свой последний использовавшийся размер. Учтите, что после обновления до 6.6.1 вам придется изменить его размер один раз, после чего размер запомнится.
uk: У версії 6.6.1 виправлено регресію, яка спричиняла те, що програма не запам'ятовувала останній використаний розмір для вікна редагування метаданих. Зауважте, що вам доведеться один раз змінити розмір вікна після оновлення 6.6.1 — після цього програма почне запам'ятовувати розмір.

source: 16 Sep, 2022
cs: 16. srpna 2022
ru: 16 сент., 2022
uk: 16 вересня 2022 року

source: Kobo driver: support the new Kobo Clara 2e
cs: Ovladač Kobo: podpora nového Kobo Clara 2e
es: Controlador Kobo: compatibilidad con el nuevo Kobo Clara 2e
ru: Драйвер Kobo: поддержка Clara 2e
uk: Драйвер Kobo: реалізовано підтримку нової Kobo Clara 2e

source: When running calibre with the --with-library command line flag and calibre is already running, switch to the specified library in calibre
cs: Při spuštění Calibre s příznakem příkazového řádku --with-library a Calibre je již spuštěno, dojde k přepnutí na zadanou knihovnu v Calibre
es: Al ejecutar calibre con la opción --with-library, si calibre ya está en ejecución se cambia a la biblioteca especificada en calibre
ru: При запуске calibre с флагом командной строки --with-library и уже запущенной calibre переключитесь на указанную библиотеку в calibre
uk: Реалізовано підтримку перемикання на вказану бібліотеку у calibre, якщо програму запущено із прапорцем командного рядка --with-library

source: E-book viewer: Ask for confirmation when deleting a custom highlight style
cs: Prohlížeč e-knih: Požadování potvrzení při odstraňování vlastního stylu zvýraznění
es: Visor de libros electrónicos: Se pide confirmación al borrar un estilo de resaltado personalizado
ru: Просмотр электронных книг: запрашивать подтверждение при удалении пользовательского стиля выделения
uk: Засіб перегляду електронних книг: реалізовано запит щодо підтвердження при вилученні нетипового стилю підсвічування

source: Do not show the virtual libraries tab bar when no virtual libraries are present
cs: Nezobrazovat panel karet virtuálních knihoven, pokud nejsou přítomny žádné virtuální knihovny
es: No muestra la barra de pestañas de bibliotecas virtuales cuando no hay bibliotecas virtuales
ru: Не показывать панель вкладок виртуальных библиотек, если виртуальные библиотеки отсутствуют
uk: Усунено показ панелі вкладок віртуальних бібліотек, якщо у бібліотеці їх немає

source: Tag mapper: When specifying the replacement tag allow completion from the tags in the currently open library
cs: Mapovač štítků: Při zadávání náhradního štítku umožnit doplnění ze štítků z aktuálně otevřené knihovny
es: Conversor de etiquetas: Al especificar la etiqueta de sustitución se permite completar según las etiquetas en la biblioteca actualmente abierta
ru: Преобразователь тегов: при указании заменяющего тега разрешить завершение тегов в текущей открытой библиотеке.
uk: Прив'язка міток: при визначенні мітки заміни уможливлено доповнення з міток поточної відкритої бібліотеки

source: Template language: New functions strcasecmp() and to_hex()
cs: Jazyk šablony: Nové funkce strcasecmp() a to_hex()
es: Lenguaje de plantillas: Nuevas funciones strcasecmp() y to_hex()
ru: Язык шаблонов: новые функции strcasecmp() и to_hex()
uk: Мова шаблонів: нові функції strcasecmp() і to_hex()

source: Comments editor: Workaround for Qt inserting invalid font-weight when converting a paragraph to a heading
cs: Editor komentářů: Řešení chyby, kdy Qt při převodu odstavce na nadpis vloží neplatný styl font-weight
es: Editor de comentarios: Solución alternativa para los valores inválidos de font-weight insertados por Qt al convertir un párrafo a encabezado
ru: Редактор комментариев: обходной путь для Qt, при вставке неверного веса шрифта при преобразовании абзаца в заголовок
uk: Редактор коментарів: виправлено помилку у Qt, яка призводила до вставлення некоректної ваги шрифту при перетворенні абзацу на заголовок

source: E-book viewer: When displaying highlights do not group highlights from different chapters when the chapter titles are identical
es: Visor de libros electrónicos: Al mostrar resaltados no se agrupan resaltados de distintos capítulos cuando los títulos de capítulo son idénticos
ru: Просмотр электронных книг: при отображении основных моментов не группировать основные моменты из разных глав, если названия глав идентичны
uk: Засіб перегляду електронних книг: при показі підсвічувань усунено групування підсвічувань з різних глав, якщо заголовки глав є однаковими

source: Tag browser: Fix error if a User category contains a reference to a deleted custom column
es: Explorador de etiquetas: Se corrige un error si una categoría de usuario contiene una referencia a una columna personalizada borrada
ru: Браузер тегов: исправлена ​​ошибка, если категория пользователя содержит ссылку на удалённый настраиваемый столбец.
uk: Панель навігації мітками: виправлено помилку, яка могла статися, якщо у категорії користувача містилося посилання на вилучений нетиповий стовпчик

source: When sending books by email to the Kindle and PocketBook email delivery services use random subject and filenames consisting of simple English letters to try to workaround various bugs in their email processing code
es: Al enviar libros por correo electrónico a los servicios de reparto de correo de Kindle y PocketBook se usan asuntos y nombres de archivo aleatorios formados por letras simples para tratar de evitar varios fallos en su código de procesamiento de correos electrónicos
ru: При отправке книг по электронной почте в службы доставки электронной почты Kindle и PocketBook использовать случайную тему и имена файлов, состоящие из простых английских букв, чтобы попытаться обойти различные ошибки в их коде обработки электронной почты.
uk: Реалізовано використання випадкових значень теми та назв файлів, що складаються з простих англійських літер, при надсиланні книг електронною поштою на Kindle і PocketBook, щоб запобігти різноманітним проблемам у коді обробки електронної пошти

source: 02 Sep, 2022
es: 2 sep 2022
ru: 02 сент., 2022
uk: 2 вересня 2022 року

source: Conversion pipeline: Add support for !important when flattening CSS rules
es: Conversión: Se añade compatibilidad con !important al aplanar las reglas CSS
ru: Конвейер преобразования: добавлена ​​поддержка !important при выравнивании правил CSS.
uk: Конвеєр перетворення: додано підтримку !important при спрощенні правил CSS

source: Content server: Use the chapter title as the base bookmark name when creating new bookmarks
es: Servidor de contenidos: Se usa el título de capítulo como base para el nombre de los nuevos marcadores
ru: Конетент-сервер: используйте название главы в качестве основного имени закладки при создании новых закладок.
uk: Сервер даних: реалізовано використання заголовка глави як основи назви закладки при створенні закладок

source: Allow changing the search order when clicking on items in the Tag browser (Preferences-&gt;Look &amp; feel-&gt;Tag browser-&gt;Hierarchy and searching)
es: Se permite cambiar el orden de búsqueda al pulsar elementos en el explorador de etiquetas (Preferencias &gt; Apariencia &gt; Explorador de etiquetas &gt; Jerarquía y búsqueda)
ru: Разрешить изменение порядка поиска при нажатии на элементы в браузере тегов (Настройки->Внешний вид->Браузер тегов->Иерархия и поиск)
uk: Уможливлено зміну порядку пошуку при натисканні пунктів на панелі навігації мітками (Налаштування-&gt;Вигляд та поведінка-&gt;Навігатор мітками-&gt;Ієрархія і пошук)

source: Check library: Make vacuuming the full text database optional as it is very slow and memory intensive
es: Comprobar biblioteca: La limpieza de la base de datos de búsqueda de texto completo es opcional, ya que es muy lenta y consume mucha memoria
ru: Проверить библиотеку: сделать очистку полнотекстовой базы данных необязательной, так как это очень медленно и требует большого объёма памяти.
uk: Перевірка бібліотеки: оптимізацію бази даних повнотекстового пошуку зроблено необов'язковою, оскільки вона дуже повільна і має значні вимоги до об'єму пам'яті

source: Tag browser: Move the preferences for controlling the order and display of categories in the Tag browser from Preferences-&gt;Tweaks to Preferences-&gt;Look &amp; feel-&gt;Tag browser
es: Explorador de etiquetas: Se mueven las preferencias para controlar el orden y la forma de mostrar las categorías del explorador de etiquetas de Preferencias &gt; Ajustes a Preferencias &gt; Apariencia &gt; Explorador de etiquetas
ru: Браузер тегов: перемещены настройки для управления порядком и отображением категорий в браузере тегов из «Настройки» -> «Твики» в «Настройки» -> «Внешний вид» -> «Браузер тегов».
uk: Панель навігації мітками: налаштування, які пов'язано із керуванням порядком і показом категорій на панелі навігації мітками, перенесено зі сторінки Налаштування-&gt;Коригування до сторінки Налаштування-&gt;Вигляд та поведінка-&gt;Навігатор мітками

source: User category editor: Hide items not visible in the Tag browser
es: Editor de categorías de usuario: Se ocultan los elementos que no son visibles en el explorador de etiquetas
ru: Редактор категорий пользователей: скрыть элементы, невидимые в браузере тегов.
uk: Редактор категорій користувача: реалізовано приховування записів, які не видно на панелі навігації мітками

source: Allow adding a button to show the Manage categories window to the toolbars via Preferences-&gt;Toolbars &amp; menus
es: Se permite añadir un botón para mostrar la ventana de administración de categorías en las barras de herramientas mediante Preferencias &gt; Barras de herramientas y menús
ru: Разрешить добавление кнопки для отображения окна «Управление категориями» на панели инструментов через «Настройки» -> «Панели инструментов и меню».
uk: Уможливлено додавання на панелі інструментів кнопки для показу вікна керування категоріями, слід скористатися пунктом «Налаштування -&gt; Панелі інструментів і меню»

source: Google metadata download: When excluding results from a web search because they don't match the specified title/author ignore diacritics, accents, etc.
es: Descarga de metadatos de Google: Al excluir resultados de una búsqueda en la web porque no coinciden con el autor o título especificados, se ignoran los acentos, marcas diacríticas, etc.
ru: Загрузка метаданных Google: при исключении результатов из веб-поиска, поскольку они не соответствуют указанному заголовку/автору, игнорируются диакритические знаки, акценты и т. д.
uk: Отримання метаданих Google: реалізовано ігнорування діакритичних символів, акцентів тощо при виключенні результатів з пошуку в інтернеті, оскільки вони не відповідають вказаним записам назви або автора.

source: E-book viewer: Lookup: Google dictionary: Add some padding at the left and right margins
es: Visor de libros electrónicos: Consulta: Diccionario de Google: Se añade algo de espacio en los márgenes laterales
ru: Просмотр электронных книг: поиск: словарь Google: добавлены отступы слева и справа
uk: Засіб читання книг: пошук: словник Google: додано фаски на лівому і правому полях

source: E-book viewer: Lookup word in Google dictionary: Fix meanings of some words not being shown in the user's preferred language
es: Visor de libros electrónicos: Consulta de palabra en el diccionario de Google: Se corrige el fallo por el que el significado de algunas palabras no se mostraba en el idioma preferido del usuario
ru: Просмотр электронных книг: поиск слова в словаре Google: исправление значений некоторых слов, не отображаемых на предпочитаемом пользователем языке.
uk: Засіб читання книг: пошук слів у словнику Google: виправлено помилку, яку пов'язано із тим, що деякі слова не було показано бажаною для користувачів мовою

source: Fix calibredb backup_metadata --all operating only on dirty books not all books
es: Se corrige el fallo por el que calibredb backup_metadata --all sólo actuaba sobre libros sucios y no sobre todos los libros
ru: Исправлена ​​ошибка, из-за которой резервирование базы данных calibredb backup_metadata --all работало только с грязными книгами, а не со всеми книгами.
uk: Виправлено помилку, пов'язано із тим, що команда calibredb backup_metadata --all працює лише для книг із помилками, а не для усіх книг

source: Do not VACUUM FTS db when exporting library as it can be very slow
es: No se limpia la base de datos de búsqueda de texto completo al exportar la biblioteca, ya que puede ser muy lento
ru: Не очищать FTS VACUUM FTS db при экспорте библиотеки, так как это может быть очень медленным.
uk: Усунено оптимізацію бази даних повнотекстового пошуку при експортуванні бібліотеки, оскільки ця дія може бути дуже повільною

source: Windows: Nicer error message when attempting to run viewer/editor on machine without MediaPack installed
es: Windows: Mensaje de error más claro al intentar ejecutar el visor o editor en un equipo sin MediaPack instalado
ru: Windows: более удобное сообщение об ошибке при попытке запустить программу просмотра/редактора на машине без установленного MediaPack.
uk: Windows: удосконалено повідомлення про помилку при спробі запуску засобу перегляду або редагування у системах без встановленого MediaPack

source: Edit book: Reports: Fix rendering of images in the images report table
es: Modificar libro: Informes: Se corrigen las imágenes en la table de informe de imágenes
ru: Редактор книг: отчеты: исправлен рендеринг изображений в таблице отчётов изображений.
uk: Редагування книг: звіти: виправлено обробку зображень у таблиці звіту щодо зображень

source: Content server: Fix formatting of dates for custom columns using ISO format
es: Servidor de contenidos: Se corrige el formato de las fechas en columnas personalizadas que usan el formato ISO
ru: Контент-сервер: исправление форматирования дат для настраиваемых столбцов с использованием формата ISO.
uk: Сервер даних: виправлено форматування дат для нетипових стовпчиків із використанням формату ISO

source: 12 Aug, 2022
cs: 12. srpna 2022
es: 12 ago 2022
ru: 12 авг. 2022
uk: 12 серпня 2022 року

source: E-book viewer: Allow searching for nearby words using a new "Nearby words" search mode
cs: Prohlížeč e-knih: Umožnění vyhledávání slov poblíž pomocí nového režimu vyhledávání „Slova poblíž“
es: Visor de libros electrónicos: Se permite buscar palabras cercanas con el nuevo modo de búsqueda «palabras cercanas»
ru: Просмотр электронных книг: разрешить поиск близлежащих слов с помощью нового режима поиска «Близлежащие слова».
uk: Засіб перегляду книг: уможливлено пошук сусідніх слів за допомогою нового режиму «Сусідні слова»

source: calibredb: New fts_search and fts_index commands to perform full text searching from the command line
cs: calibredb: Nové příkazy fts_search a fts_index pro fulltextové vyhledávání z příkazového řádku
es: calibredb: Nuevas órdenes fts_search y fts_index para controlar la búsqueda de texto completo desde la línea de órdenes
ru: calibredb: новые команды fts_search и fts_index для выполнения полнотекстового поиска из командной строки.
uk: calibredb: нові команди fts_search і fts_index для виконання повнотекстового пошуку з командного рядка

source: Image viewing popup: Allow zooming using the standard shortcuts of Ctrl+plus/minus
cs: Automaticky otevírané okno prohlížení obrázků: Umožnění zvětšování pomocí standardních klávesových zkratek Ctrl+plus/mínus
es: Visor de imágenes emergente: Se permite ampliar y reducir con los atajos usuales Ctrl+más y Ctrl+menos
ru: Всплывающее окно просмотра изображения: разрешить масштабирование с помощью стандартных сочетаний клавиш Ctrl+плюс/минус
uk: Контекстне вікно перегляду зображень: уможливлено масштабування за допомогою стандартних скорочень Ctrl++/-

source: Fix a regression in calibre 6.0 that broke remembering the previous sort order for a column
cs: Oprava regrese v Calibre 6.0, která poškodila zapamatování předchozího pořadí řazení pro sloupec
es: Se corrige una regresión en calibre 6.0 que estropeaba la conservación del orden anterior de una columna
ru: Исправлена ​​регрессия в calibre 6.0, которая нарушала запоминание предыдущего порядка сортировки для столбца.
uk: Виправлено регресію у версії calibre 6.0, яка призводила до неможливості запам'ятовування попереднього способу упорядковування для стовпчика

source: Fix a regression in calibre 6.0 that broke processing of very high resolution images
cs: Oprava regrese v Calibre 6.0, která poškodila zpracování obrázků s velmi vysokým rozlišením
es: Se corrige una regresión en calibre 6.0 que estropeaba el procesado de imágenes de muy alta resolución
ru: Исправлена ​​регрессия в calibre 6.0, из-за которой нарушалась обработка изображений с очень высоким разрешением.
uk: Усунено регресію у calibre 6.0, яка заважала обробці зображень із дуже високою роздільністю

source: Full text search: Fix error when using restrict searched books and more than 900 books are present in the searched list
cs: Fulltextové vyhledávání: Oprava chyby při použití omezení vyhledávaných knih a více než 900 knih v seznamu vyhledávaných knih
es: Búsqueda de texto completo: Se corrige un error al restringir la los libros en los que se busca con más de 900 libros en la lista de búsqueda
ru: Полнотекстовый поиск: исправлена ​​ошибка при использовании ограничения искомых книг, когда в списке поиска присутствует более 900 книг.
uk: Повнотекстовий пошук: виправлено помилку при використанні обмеження на книги для пошуку і наявності у списку пошуку понад 900 книг

source: E-book viewer: Fix parsing of CSS styles with @supports rules not working
cs: Prohlížeč e-knih: Oprava nefunkční analýzy stylů CSS s pravidly @supports
es: Visor de libros electrónicos: Se corrige el fallo por el que los estilos CSS con reglas @supports no funcionaban
ru: Просмотр электронных книг: Исправлен синтаксический анализ стилей CSS с неработающими правилами @supports.
uk: Засіб перегляду книг: виправлено непрацездатність стилів CSS із правилами @supports

source: E-book viewer: Speed up initial render of books with lots of CSS in &lt;style&gt; tags by not prettying the CSS
cs: Prohlížeč e-knih: Zrychlení počátečního vykreslování knih s velkým množstvím CSS ve značkách &lt;style&gt; tím, že se CSS nezkrášluje
es: Visor de libros electrónicos: Se acelera la presentación inicial de libros con mucho código CSS en etiquetas &lt;style&gt; omitiendo la mejora del código CSS
ru: Просмотр электронных книг: ускорен первоначальный рендеринг книг с большим количеством CSS в тегах
uk: Засіб перегляду книг: пришвидшено початкову обробку книг із багатьма CSS у теґах &lt;style&gt; шляхом усування зайвої обробки CSS
