Repository: debian-calibre/calibre
Catalog: translations-git/content-server/*.po
Languages: fr, it, nl, pt, zh_tw

source: Offline storage quota exceeded! Try deleting some stored books first.
fr: Quota de stockage hors ligne dépassé ! Effacez certains livres enregistrés et réessayez.
it: Spazio di archiviazione Offline terminato! Prima prova a eliminare alcuni libri archiviati.
nl: Offline opslagquota overschreden! Probeer eerst om wat opgeslagen boeken te verwijderen.
pt: Quota de armazenamento offline excedida. Tente apagar algum dos livros armazenados.
zh_tw: 已超過離線儲存配額！請嘗試先刪除一些儲存的書本。

source: Your browser does not support IndexedDB. Cannot read books. Consider using a modern browser, such as Chrome or Firefox.
fr: Votre navigateur ne prend pas en charge IndexedDB. Impossible de lire les livres. Envisager l'utilisation d'un navigateur moderne, comme Firefox ou Chrome.
it: Il tuo browser non supporta IndexedDB. Impossibile leggere i libri. Prendi in considerazione di usare un browser moderno, come Chrome o Firefox.
nl: Uw browser ondersteunt IndexedDB niet. Kan geen boeken lezen. Overweeg het gebruik van een moderne browser, zoals Chrome of Firefox.
pt: O seu navegador não suporta IndexedDB. Não é possível ler livros. Considere usar um navegador moderno, como o Chrome ou o Firefox.
zh_tw: 您的瀏覽器不支援 IndexedDB。無法閱讀書本。請考慮使用現代的瀏覽器，例如 Chrome 或 Firefox。

source: Please close all other browser tabs with calibre open
fr: Merci de fermer tous les autres onglets ouverts avec calibre
it: Per favore chiudi tutti i browser tabs con Calibre aperto
nl: Sluit aub alle andere browser tabbladen met calibre open
pt: Por favor, feche todos os outros separadores do navegador que tenham o Calibre aberto
zh_tw: 請關閉所有其他開啟 calibre 的瀏覽器分頁

source: You must allow calibre to use IndexedDB storage in your browser to read books
fr: Autorisez calibre à utiliser le stockage IndexedDB dans votre navigateur pour lire les livres
it: Devi permettere a Calibre di usare lo spazio di archiviazione IndexedDB nel tuo browser per leggere i libri
nl: U moet calibre toegang geven om IndexedDB opslag te gebruiken in uw browser om boeken te lezen
pt: Tem de permitir ao Calibre o uso do armazenamento IndexedDB do seu navegador para ler livros
zh_tw: 您必須在瀏覽器中允許 calibre 使用 IndexedDB 儲存空間以閱讀書本

source: Database upgraded!
fr: Base de données mise à jour !
it: Database aggiornato!
nl: De gegevensbank is geüpgraded!
pt: Base de dados atualizada!
zh_tw: 資料庫已升級！

source: There was an error while interacting with the database used to store books for offline reading. Click "Show details" for more information.
fr: Il y a une une erreur pendant l'interaction avec la base de données utilisée pour stocker les livres pour une lecture hors ligne. Cliquez "Afficher les détails" pour plus d'informations.
it: Si è verificato un errore durante l'interazione con il database usato per memorizzare i libri per la lettura non in linea. Fai clic su "Mostra dettagli" per maggiori informazioni.
nl: Er is een fout opgetreden tijdens de interactie met de gegevensbank die wordt gebruikt om boeken op te slaan voor offline lezen. Klik op "Toon Details" voor meer informatie.
pt: Ocorreu um erro enquanto interagia com a base de dados utilizada para guardar os livros para leitura off-line. Clique em "Mostrar detalhes" para mais informação.
zh_tw: 與用於儲存書本以離線閱讀的資料庫互動時發生錯誤，請點選 「顯示詳細資料」 查看更多資訊。

source: Failed to read from the books database
fr: Échec de la lecture à partir de la base de données de livres
it: Lettura dal database dei libri non riuscita
nl: Lezen van de boek gegevensbank mislukt
pt: Falha ao ler a base de dados dos livros
zh_tw: 書本資料庫讀取失敗

source: Failed to read from the objects database
fr: Échec de la lecture à partir de la base de données des objets
it: Lettura dal database degli oggetti fallita
nl: Kan de objecten gegevensbank niet lezen
pt: Falha ao ler a base de dados dos objetos
zh_tw: 物件資料庫讀取失敗

source: Failed to write to the books database
fr: Échec de l'écriture sur la base de données livres
it: Impossibile scrivere sul database dei libri
nl: Schrijven van boek gegevensbank mislukt
pt: Falha ao escrever na base de dados dos livros
zh_tw: 書本資料庫寫入失敗

source: Failed to store book data ({0}) with error: {1}
fr: Échec à sauvegarder les données du livre ({0}) avec erreur : {1}
it: Impossibile archiviare le informazione del libro ({0}) con errore: {1}
nl: Opslaan van boek gegevens mislukt ({0}) met de fout: {1}
pt: Falha no armazenamento da informação do livro ({0}) com o erro: {1}
zh_tw: 無法儲存書本資料 ({0}) ，錯誤為：{1}

source: Failed to store mathjax file ({0}) with error: {1}
fr: Échec lors du stockage du fichier mathjax ({0}) avec l'erreur : {1}
it: Archiviazione del file mathJax ({0}) fallita con errore: {1}
nl: Opslaan van mathjax bestand mislukt ({0}) met de fout: {1}
pt: Falha ao armazenar o ficheiro MathJax ({0}) com o erro: {1}
zh_tw: 無法儲存 mathjax 檔案 ({0}) ，錯誤為：{1}

source: Failed to write to the objects database
fr: Échec lors de l'écriture sur la base de données objets
it: Impossibile scrivere sul database degli oggetti
nl: Schrijven van objecten gegevensbank mislukt
pt: Falha na escrita para a base de dados de objetos
zh_tw: 無法寫入物件資料庫

source: Failed to read the file {0} for the book {1} from the browser offline cache.
fr: Échec lors de la lecture du fichier {0} pour le livre {1} depuis le cache hors ligne du navigateur.
it: Non è stato possibile leggere il file {0} per il libro {1} dalla cache offline del browser.
nl: Het bestand {0} voor het boek {1} kon niet gelezen worden van de offline cache.
pt: Falha ao ler o ficheiro {0} para o livro {1} da cache offline do navegador.
zh_tw: 無法從瀏覽器離線快取中讀取書本 {1} 的檔案 {0}。

source: This usually means the cache is close to full. Clear the browser cache from the browser settings.
fr: Cela signifie généralement que le cache est pratiquement plein. Effacer le cache du navigateur depuis les paramètres du navigateur.
it: Di solito questo significa che la cache è prossima all'essere piena. Svuotare la cache del browser tramite le impostazioni del browser.
nl: Dit wil meestal zeggen dat het cache bijna vol is. Ledig het cache geheugen via de browser instellingen.
pt: Isto normalmente significa que a Cache está quase cheia. Limpe a Cache do navegador nas definições do navegador.
zh_tw: 這通常代表快取幾乎滿了。請從瀏覽器設定清除瀏覽器快取。

source: Cannot read file from book
fr: Impossible de lire le fichier du livre
it: Impossibile leggere il file dal libro
nl: Kan het bestand van het boek niet lezen
pt: Não foi possível ler o ficheiro do livro
zh_tw: 無法從書本讀取檔案

source: Failed to read the MathJax files from the browser offline cache.
fr: Échec lors de la lecture des fichiers MathJax à partir du cache hors ligne du navigateur.
it: Non è stato possibile leggere i file MathJax dalla cache offline del browser.
nl: Lezen van de MathJax bestanden vanuit de offline cache mislukt.
pt: Falha a ler os ficheiros MathJax do cache offline do navegador.
zh_tw: 無法從瀏覽器離線快取中讀取 MathJax 檔案。

source: Failed to read recent books from local storage
fr: Échec lors de la lecture de livres récents depuis le stockage local
it: Impossibile ottenere i libri recenti dalla memoria locale
nl: Het is mislukt om recente boeken te lezen van lokale de opslag
pt: Falha ao ler livros recentes do armazenamento local
zh_tw: 無法從本機儲存空間讀取最近的書本

source: Scroll to the beginning of the current file
fr: Faire défiler jusqu'au début du document en cours
it: Vai all'inizio dell'archivio corrente
nl: Blader naar het begin van het huidige bestand
pt: Rolar até ao início do ficheiro atual
zh_tw: 捲動到目前檔案的開頭

source: When the e-book is made of multiple individual files, scroll to the start of the current file
fr: Lorsque le livre numérique est composé de plusieurs fichiers individuels, faire défiler jusqu'au début du fichier actuel
it: Quando l'e-book è composto da più file singoli, scorri all'inizio del file corrente
nl: Als het e-boek uit verschillende bestanden bestaat, scrol naar het begin van het huidige bestand
pt: Quando o ebook for composto por vários ficheiros individuais, rolar até ao início do ficheiro atual
zh_tw: 当电子书由多个单独的文件组成时，滚动到当前文件的开头。

source: Scroll to the beginning of the book
fr: Faire défiler jusqu'au début du livre
it: Scorri all'inizio del libro
nl: Blader naar het begin van het boek
pt: Rolar até ao início do livro
zh_tw: 捲動到書籍的開頭

source: Scroll to the end of the book
fr: Faire défiler jusqu'à la fin du livre
it: Scorri alla fine del libro
nl: Blader naar het einde van het boek
pt: Rolar até ao fim do livro
zh_tw: 捲動到書籍的結尾

source: Scroll to the end of the current file
fr: Faire défiler jusqu'à la fin du document en cours
it: Vai alla fine dell'archivio corrente
nl: Blader naar het einde van het huidige bestand
pt: Rolar até ao fim do ficheiro atual
zh_tw: 捲動到目前檔案的結尾

source: When the e-book is made of multiple individual files, scroll to the end of the current file
fr: Lorsque le livre numérique est composé de plusieurs fichiers individuels, faire défiler jusqu'à la fin du fichier actuel
it: Quando l'e-book è composto da più file singoli, scorri alla fine del file corrente
nl: Als het e-boek uit verschillende bestanden bestaat, scrol naar het einde van het huidige bestand
pt: Quando o ebook for composto por vários ficheiros individuais, rolar até ao fim do ficheiro atual
zh_tw: 当电子书由多个单独的文件组成时，滚动到当前文件的末尾。

source: Scroll backwards smoothly (by screen-fulls in paged mode)
fr: Défilement vers l'arrière en douceur (par écran plein en mode paginé)
it: Scorri all'indietro in modo fluido (per schermate in modalità Pagine)
nl: Blader gelijkmatig terug (bij volledig scherm in pagina-stand)
pt: Rolar para trás suavemente (por ecrãs completos em modo paginado)
zh_tw: 平滑地向后滚动（在页面模式下屏幕全屏）

source: Scroll backwards, smoothly in flow mode and by screen fulls in paged mode
fr: Défilement vers l'arrière, en douceur en mode flux et par écran plein en mode paginé
it: Scorri all'indietro, in modo fluido in modalità Flusso e per schermate in modalità Pagine
nl: Blader terug, gelijkmatig in vloeiende-stand en bij volledig scherm in pagina-stand
pt: Rolar para trás, suavemente em modo contínuo e por ecrãs completos em modo paginado
zh_tw: 向后滚动，在滑动模式下平滑地滚动，在分页模式下全屏显示

source: Scroll forwards smoothly (by screen-fulls in paged mode)
fr: Défilement vers l'avant en douceur (par écran plein en mode paginé)
it: Scorri in avanti in modo fluido (per schermate in modalità Pagine)
nl: Blader gelijkmatig vooruit (bij volledig scherm in pagina-stand)
pt: Rolar para a frente suavemente (por ecrãs completos em modo paginado)
zh_tw: 平滑地向前滚动（在分页模式下屏幕全屏）

source: Scroll forwards, smoothly in flow mode and by screen fulls in paged mode
fr: Défilement vers l'avant, en douceur en mode flux et par écran plein en mode paginé
it: Scorri in avanti, in modo fluido in modalità Flusso e per schermate in modalità Pagine
nl: Blader vooruit, gelijkmatig in vloeiende-stand en bij volledig scherm in pagina-stand
pt: Rolar para a frente, suavemente em modo contínuo e por ecrãs completos em modo paginado
zh_tw: 向前滚动，在滑动模式下平滑地滚动，在分页模式下全屏翻页

source: Scroll left
fr: Faire défiler vers la gauche
it: Scorri a sinistra
nl: Naar links scrollen
pt: Rolar para a esquerda
zh_tw: 向左捲動

source: Scroll leftwards by a little in flow mode and by a page in paged mode
fr: Défiler un peu vers la gauche en mode flux et d'une page en mode paginé
it: Scorri piano verso sinistra in modalità Flusso e di una pagina in modalità Pagine
nl: Langzaam naar links scrollen in vloeiende-stand en bij een pagina in pagina-stand
pt: Rolar para a esquerda, por pequenos espaços no modo contínuo e por página no modo paginado
zh_tw: 在滑动模式下向左滑动一点，在分页模式下向左翻页

source: Scroll right
fr: Faire défiler vers la droite
it: Scorri a destra
nl: Naar rechts scrollen
pt: Rolar para a direita
zh_tw: 向右捲動

source: Scroll rightwards by a little in flow mode and by a page in paged mode
fr: Défiler un peu vers la droite en mode flux et d'une page en mode paginé
it: Scorri piano verso destra in modalità Flusso e di una pagina in modalità Pagine
nl: Langzaam naar rechts scrollen in vloeiende-stand en bij een pagina in pagina-stand
pt: Rolar para a direita, por pequenos espaços no modo contínuo e por página no modo paginado
zh_tw: 在滑动模式下向右滑动一点，在分页模式下向右翻一页

source: Scroll backwards by screen-fulls
fr: Faire défiler vers l'arrière par écrans pleins.
it: Scorri indietro per schermate
nl: Blader gelijkmatig terug bij volledig scherm
pt: Rolar para trás, ecrã a ecrã
zh_tw: 向后滑动全屏

source: Scroll forwards by screen-fulls
fr: Faire défiler vers l'avant par écrans pleins.
it: Scorri avanti per schermate
nl: Blader gelijkmatig vooruit bij volledig scherm
pt: Rolar para a frente, ecrã a ecrã
zh_tw: 向前滑动全屏

source: Scroll to the previous section
fr: Faire défiler vers la section précédente
it: Scorri alla sezione precedente
nl: Scroll naar de vorige paragraaf
pt: Rolar para a secção anterior
zh_tw: 捲動到上一節

source: Scroll to the next section
fr: Faire défiler vers la section suivante
it: Scorri alla prossima sezione
nl: Scroll naar de volgende paragraaf
pt: Rolar para a secção seguinte
zh_tw: 捲動到下一節

source: Show/hide Table of Contents
fr: Afficher/masquer la Table des Matières
it: Mostra/nascondi l'indice
nl: Toon/verberg inhoudsopgave
pt: Mostrar/ocultar o índice
zh_tw: 顯示/隱藏目錄

source: Follow links with the keyboard
fr: Suivre les liens avec le clavier
it: Apri link con la tastiera
nl: Volg links met het toetsenbord
pt: Seguir hiperligações com o teclado
zh_tw: 使用键盘快捷键跟踪链接

source: Copy current location to clipboard
fr: Copier l'emplacement actuel dans le presse-papiers
it: Copia la collocazione corrente negli appunti
nl: Kopieer huidige locatie naar klembord
pt: Copiar localização atual para a área de transferência
zh_tw: 將目前位置複製到剪貼簿

source: Copy current location as calibre:// URL to clipboard
fr: Copier l'emplacement actuel comme URL calibre:// dans le presse-papiers
it: Copia la collocazione corrente come URL calibre:// negli appunti
nl: Kopieer huidige locatie als calibre:// URL naar klembord
pt: Copiar a localização atual para a área de transferência como um URL calibre://
zh_tw: 使用 calibre:// URL 的樣示,將目前位置複製到剪貼簿

source: Start search
fr: Lancer la recherche
it: Avvia la ricerca
nl: Begin met zoeken
pt: Iniciar pesquisa
zh_tw: 開始搜尋

source: Find next
fr: Trouver le suivant
it: Trova successivo
nl: Volgende zoeken
pt: Encontrar seguinte
zh_tw: 找下一個

source: Find previous
fr: Trouver le précédent
it: Trova precedente
nl: Vorige zoeken
pt: Encontrar anterior
zh_tw: 找上一個

source: Increase font size
fr: Augmenter la taille de la police
it: Aumenta la dimensione dei caratteri
nl: Lettertype vergroten
pt: Aumentar tamanho do tipo de letra
zh_tw: 增加字型大小

source: Decrease font size
fr: Diminuer la taille de la police
it: Riduci la dimensione dei caratteri
nl: Lettertype verkleinen
pt: Diminuir tamanho do tipo de letra
zh_tw: 減少字型大小

source: Restore default font size
fr: Restaurer la taille de police par défaut
it: Ripristina dimensione predefinita dei caratteri
nl: Standaard font grootte herstellen
pt: Repor tamanho predefinido da letra
zh_tw: 恢复默认字体大小

source: Increase number of pages per screen
fr: Augmenter le nombre de pages par écran
it: Aumenta il numero di pagine per schermata
nl: Verhoog het aantal pagina's per scherm
pt: Aumentar o número de páginas por ecrã
zh_tw: 增加每個螢幕的頁數

source: Decrease number of pages per screen
fr: Diminuer le nombre de pages par écran
it: Diminuisci il numero di pagine per schermata
nl: Verlaag het aantal pagina's per scherm
pt: Diminuir o número de páginas por ecrã
zh_tw: 減少每個螢幕的頁數

source: Make number of pages per screen automatic
fr: Rendre automatique le nombre de pages par écran
it: Rendi automatico il numero di pagine per schermata
nl: Maak het aantal pagina's per scherm automatisch
pt: Automatizar o número de páginas por ecrã
zh_tw: 自動設定每個螢幕的頁數

source: Toggle full screen
fr: Passer en mode plein écran
it: Commuta schermo intero
nl: Volledig scherm aan/uit
pt: Alternar ecrã inteiro
zh_tw: 切換全螢幕

source: Toggle between Paged mode and Flow mode for text layout
fr: Basculer entre le mode paginé et le mode continu pour la mise en page du texte
it: Passa tra le modalità di presentazione del testo Pagine e Flusso
nl: Wissel tussen Pagina-stand en Vloeiende-stand voor tekst layout
pt: Alternar entre modo paginado e modo fluido para o visual do texto
zh_tw: 文字配置在頁面模式和直流模式間切換

source: Toggle the scrollbar
fr: Basculer la barre de défilement
it: Mostra/nascondi la barra di scorrimento
nl: Schakel de schuifbalk in
pt: Alternar a barra de rolamento
zh_tw: 切換捲軸

source: Show/hide bookmarks
fr: Afficher/masquer les signets
it: Mostra/nascondi i segnalibri
nl: Toon/verberg bladwijzers
pt: Mostrar/ocultar marcadores
zh_tw: 顯示/隱藏書籤

source: Create a new bookmark
fr: Créer un nouveau signet
it: Crea un nuovo segnalibro
nl: Maak een nieuwe bladwijzer
pt: Criar um novo favorito
zh_tw: 建立新書籤

source: Show the book metadata
fr: Afficher les métadonnées du livre
it: Mostra i metadati del libro
nl: Toon de metadata van het boek
pt: Mostrar os metadados do livro
zh_tw: 顯示書籍詮釋資料

source: Alter the current selection forward by a word
fr: Modifier la sélection actuelle d'un mot
it: Sposta di una parola avanti la selezione corrente
nl: Wijzig de huidige selectie vooruit door een woord
pt: Alterar a seleção atual em uma palavra para frente
zh_tw: 目前選取範圍向前一個字

source: Alter the current selection backwards by a word
fr: Modifier la sélection actuelle d'un mot
it: Sposta di una parola indietro la selezione corrente
nl: Wijzig de huidige selectie achteruit door een woord
pt: Alterar a seleção atual em uma palavra para trás
zh_tw: 目前選取範圍向後一個字

source: Alter the current selection forward by a character
fr: Modifier la sélection actuelle en avançant d'un caractère
it: Sposta di un carattere avanti la selezione corrente
nl: Wijzig de huidige selectie vooruit met een letter
pt: Alterar a seleção atual em um caractere para frente
zh_tw: 将当前选定内容向前更改一个字符

source: Alter the current selection backwards by a character
fr: Modifier la sélection actuelle en reculant d'un caractère
it: Sposta di un carattere indietro la selezione corrente
nl: Wijzig de huidige selectie achteruit met een letter
pt: Alterar a seleção atual em um caractere para trás
zh_tw: 将当前选定内容向后更改一个字符

source: Alter the current selection forward by a line
fr: Modifier la sélection actuelle en avançant d'une ligne
it: Avanza di una linea la selezione corrente
nl: Wijzig de huidige selectie vooruit met een regel
pt: Alterar a seleção atual em uma linha para frente
zh_tw: 将当前选定内容向前更改一行

source: Extend the current selection to the start of the line
fr: Étendre la sélection actuelle au début de la ligne
it: Estendi la selezione corrente fino all'inizio della linea
nl: Breid huidige selectie uit tot het begin van de regel
pt: Expandir a seleção atual até ao início da linha
zh_tw: 扩展选择到行首

source: Extend the current selection to the end of the line
fr: Étendre la sélection actuelle à la fin de la ligne
it: Estendi la selezione corrente fino alla fine della linea
nl: Breid huidige selectie uit tot het einde van de regel
pt: Expandir a seleção atual até ao fim da linha
zh_tw: 扩展选择到行尾

source: Select all
fr: Sélectionner tout
it: Seleziona tutto
nl: Alles selecteren
pt: Selecionar tudo
zh_tw: 全部選取

source: Alter the current selection backwards by a line
fr: Modifier la sélection actuelle en reculant d'une ligne
it: Arretra di una linea la selezione corrente
nl: Wijzig de huidige selectie achteruit met een regel
pt: Alterar a seleção atual em uma linha para trás
zh_tw: 将当前选定内容向后更改一行

source: Alter the current selection forward by a paragraph
fr: Modifier la sélection actuelle en avançant d'un paragraphe
it: Avanza di un paragrafo la selezione corrente
nl: Wijzig de huidige selectie vooruit met een paragraaf
pt: Alterar a seleção atual em um parágrafo para frente
zh_tw: 将当前选定内容向前更改一个段落

source: Alter the current selection backwards by a paragraph
fr: Modifier la sélection actuelle en reculant d'un paragraphe
it: Arretra di un paragrafo la selezione corrente
nl: Wijzig de huidige selectie achteruit met een paragraaf
pt: Alterar a seleção atual em um parágrafo para trás
zh_tw: 将当前选定内容向后更改一个段落

source: Show the E-book viewer controls
fr: Afficher les contrôles de la Visionneuse de livre numérique
it: Mostra i controlli del lettore E-book
nl: Toon de e-boekviewer controls
pt: Mostrar os controles do visualizador de ebooks
zh_tw: 显示电子书阅读器控件

source: Show E-book viewer preferences
fr: Afficher les préférences de la Visionneuse de livre numérique
it: Mostra le preferenze del lettore di E-Book
nl: Toon de e-boekviewer voorkeuren
pt: Mostrar preferências do visualizador de ebooks
zh_tw: 显示电子书阅读器首选项

source: Go to a specified book location or position
fr: Aller à un emplacement ou une position spécifique du livre
it: Vai a una specifica collocazione o posizione del libro
nl: Ga naar een geselecteerd boek of positie
pt: Ir para um local ou posição especificas do livro
zh_tw: 前往書籍的指定位置

source: Toggle auto-scroll
fr: Basculer vers le défilement automatique
it: Attiva/disattiva auto scorrimento
nl: Schakel automatisch scrollen in
pt: Alternar rolamento automático
zh_tw: 切換自動捲動

source: Auto scroll faster
fr: Défilement automatique plus rapide
it: Accelera auto scorrimento
nl: Sneller automatisch bladeren
pt: Rolamento automático rápido
zh_tw: 較快速自動捲動

source: Auto scroll slower
fr: Défilement automatique plus lent
it: Rallenta auto scorrimento
nl: Trager automatisch bladeren
pt: Rolamento automático lento
zh_tw: 較慢速自動捲動

source: Sync last read position/annotations
fr: Sync dernière position lue/annotations
it: Sincronizza annotazioni/ultima posizione di lettura
nl: Sync laatst gelezen positie/annotaties
pt: Sincronizar última posição de leitura/anotações
zh_tw: 同步到最近的阅读位置/批注

source: Navigation
it: Navigazione
nl: Verkenner
pt: Navegação
zh_tw: 導覽

source: Show/hide Inspector
fr: Afficher/masquer l'Inspecteur
it: Mostra/nascondi l'Ispettore
nl: Toon/verberg Controleur
pt: Mostrar/ocultar o inspetor
zh_tw: 顯示/隱藏元素查看器

source: Show/hide the word lookup panel
fr: Afficher/masquer le panneau de recherche de mot
it: Mostra/nascondi il pannello di ricerca parole
nl: Toon/verberg de woorden pop-up venster
pt: Mostrar/ocultar o painel de pesquisa de termos
zh_tw: 顯示/隱藏字詞查詢面板

source: Quit the E-book viewer
fr: Quitter la Visionneuse de livre numérique
it: Esci dal lettore E-book
nl: Sluit de e-boekviewer
pt: Fechar o visualizador de ebooks
zh_tw: 退出電子書閱讀器

source: Toggle the toolbar
fr: Basculer la barre d'outils
it: Mostra/nascondi la barra degli strumenti
nl: Wissel de werkbalk
pt: Alternar barra de ferramentas
zh_tw: 切換工具列

source: Toggle the highlights panel
fr: Basculer le panneau des mises en évidence
it: Mostra/nascondi il pannello evidenziazioni
nl: Schakel het deelvenster met markeringen
pt: Alternar o painel de realces
zh_tw: 切換醒目提示面板

source: Edit this book
fr: Éditer ce livre
it: Modifica questo libro
nl: Bewerk dit boek
pt: Editar este livro
zh_tw: 編輯這本書本

source: Sample to preview font size
fr: Échantillon pour prévisualiser la taille de la police
it: Anteprima per vedere la dimensione carattere
nl: Voorbeeld om de lettergrootte te bekijken
pt: Amostra para pré-visualizar o tamanho do tipo de letra
zh_tw: 預覽文字大小的範例

source: Empty
fr: Vide
it: Vuoto
nl: Leeg
pt: Vazio
zh_tw: 空白

source: Book title
fr: Titre du livre
it: Titolo del libro
nl: Boek titel
pt: Título do livro
zh_tw: 書名

source: Authors
fr: Auteurs
it: Autori
nl: Auteurs
pt: Autor(es)
zh_tw: 作者

source: Series
fr: Séries
it: Serie
nl: Reeksen
pt: Séries
zh_tw: 系列

source: Top level section
fr: Section de niveau supérieur
it: Sezione primaria
nl: Volgende paragraaf
pt: Secção de topo
zh_tw: 頂層章節

source: Current section
fr: Section actuelle
it: Sezione corrente
nl: Huidige paragraaf
pt: Secção atual
zh_tw: 目前章節

source: Clock
fr: Horloge
it: Orologio
nl: Klok
pt: Relógio
zh_tw: 時鐘

source: Progress
fr: Progression
it: Avanzamento
nl: Voortgang
pt: Progresso
zh_tw: 進度
