Repository: debian-calibre/calibre
Catalog: translations-git/content-server/*.po
Languages: fr, it, nl, pt, zh_tw

source: Failed to communicate with "{}", network error. Is the server running and accessible?
fr: Échec lors de la communication avec "{}", erreur réseau, le serveur est-il en fonctionnement et accessible ?
it: Impossibile comunicare con "{}", errore di rete, il server è avviato ed accessibile?
nl: Gegevensuitwisseling met "{}" niet mogelijk, netwerkfout. Is de server actief en toegankelijk?
pt: Falha ao comunicar com "{}", por erro de rede. O servidor estará ativo e acessível?
zh_tw: 無法與「{}」通訊，網路錯誤。伺服器是否正在運行而且能夠存取嗎？

source: Failed to communicate with "{}", timed out after: {} seconds
fr: Échec lors de la communication avec "{}", interrompue après : {} secondes
it: Impossibile comunicare con "{}". Timeout dopo {} secondi
nl: Verbinding mislukt met "{}", time-out na: {} seconden
pt: Não foi possível comunicar com "{}", ligação expirou após: {} segundos
zh_tw: 無法與「{}」通訊，經過 {} 秒後超時

source: Failed to communicate with "{}", aborted
fr: Échec lors de la communication avec "{}", abandonné
it: Impossibile comunicare con "{}". Annullato
nl: Verbinding mislukt met "{}", afgebroken
pt: Falha ao comunicar com "{}", processo abortado
zh_tw: 無法與「{}」通訊，終止

source: Failed to communicate with "{}", with status: [{} ({})] {}<br><br>{}
fr: Échec lors de la communication avec "{}", avec le statut : {} ({})] {}<br><br>{}
it: Impossibile comunicare con "{}", in stato: [{} ({})] {}<br><br>{}
nl: Gegevensuitwisseling met "{}" niet mogelijk, met status:[{} ({})] {} <br><br>{}
pt: Falha ao comunicar com "{}", com o estado: [{} ({})] {}<br><br>{}
zh_tw: 無法與「{}」通訊，狀態：[{} ({})] {}<br><br>{}

source: Failed to load file from book
fr: Échec du chargement du fichier à partir du livre
it: Impossibile caricare il file dal libro
nl: Fout bij laden bestand uit boek
pt: Falha ao carregar ficheiro do livro
zh_tw: 無法從書籍載入檔案

source: Could not load the file: {} with error: {}
fr: Impossible de charger le fichier : {} comportant l'erreur : {}
it: Impossibile caricare il file: {} errore: {}
nl: Kan het bestand: {} door fout: {}
pt: Não foi possível carregar o ficheiro: {} com o erro: {}
zh_tw: 無法載入檔案：{} 錯誤：{}

source: Could not load the file: {} unknown response type: {}
fr: Impossible de charger le fichier : {} réponse de type inconnue : {}
it: Impossibile caricare il file: {} risposta sconosciuta: {}
nl: Kan het bestand niet laden: {} onbekende melding {}
pt: Não foi possível carregar o ficheiro: {} . Tipo de resposta desconhecido: {}
zh_tw: 無法載入檔案：{} 未知回應類型：{}

source: Could not open book
fr: Impossible d'ouvrir le livre
it: Impossibile aprire il libro
nl: Kon boek niet openen
pt: Não foi possível abrir o livro
zh_tw: 無法開啟這本書

source: Failed to load book manifest, click "Show details" for more info
fr: Échec lors du chargement manifeste du livre, cliquez sur "Afficher les détails" pour plus d'information.
it: Impossibile caricare il manifesto del libro. Fai click su "Mostra dettagli" per maggiori informazioni
nl: Fout bij laden boek eigenschappen, klik op "Toon details" voor meer informatie
pt: Falha ao carregar o manifesto do livro. Carregue em "Mostrar detalhes" para mais informações
zh_tw: 無法載入書本的資訊清單 (manifest)，更多資訊請點選「顯示詳細資訊」

source: Unhandled error
fr: Erreur non gérée
it: Errore non gestito
nl: Onbehandelde fout
pt: Erro por tratar
zh_tw: 未處理的錯誤

source: Close
fr: Fermer
it: Chiudi
nl: Sluiten
pt: Fechar
zh_tw: 關閉

source: Show details
fr: Afficher les détails
it: Mostra i dettagli
nl: Toon details
pt: Mostrar detalhes
zh_tw: 顯示詳細資料

source: OK
pt: Confirmar
zh_tw: 確定

source: Cancel
fr: Annuler
it: Annulla
nl: Annuleren
pt: Cancelar
zh_tw: 取消

source: Yes
fr: Oui
it: Sì
nl: Ja
pt: Sim
zh_tw: 是

source: No
fr: Non
nl: Nee
pt: Não
zh_tw: 否

source: Show this confirmation again
fr: Afficher cette confirmation à nouveau
it: Mostra ancora questa conferma
nl: Deze bevestiging nogmaals tonen
pt: Mostrar novamente esta confirmação
zh_tw: 未來也顯示這個確認訊息

source: Loading, please wait...
fr: Chargement, veuillez patienter...
it: Caricamento in corso, attendere...
nl: Laden, een ogenblik geduld ...
pt: A carregar, por favor, aguarde...
zh_tw: 載入中，請稍候

source: Error:
fr: Erreur :
it: Errore:
nl: Fout:
pt: Erro:
zh_tw: 錯誤：

source: Warning:
fr: Avertissement :
it: Avviso:
nl: Waarschuwing:
pt: Alerta:
zh_tw: 警告：

source: Fit image to screen
pt: Ajustar imagem ao ecrã

source: Do not fit image to window
pt: Não ajustar imagem ao ecrã

source: Fit image to window
pt: Ajustar imagem à janela

source: Loading image, please wait…
pt: A carregar imagem. Por favor, aguarde...

source: Loading the image failed
pt: Falha a carregar a imagem

source: Upload books by either <a>selecting the book files</a> or drag and drop the files here
fr: Transférer les livres soit <a>en sélectionnant les fichiers du livre</a> soit en faisant un glisser-déposer des fichiers ici
it: Carica i libri <a>selezionando i file</a> o trascinandoli qui
nl: Upload boeken door <a>de boekbestanden te selecteren</a> of sleep de bestanden hierheen
pt: Carregue livros através da <a>seleção dos ficheiros dos livros</a> ou arraste e solte os ficheiros para aqui
zh_tw: 如於上傳書籍，可<a>選擇文件</a>，或拖曳文件至此

source: {percent:.0%} of {total}
fr: {percent:.0%} de {total}
it: {percent:.0%} di {total}
nl: {percent:.0%} van {total}
pt: {percent:.0%} de {total}
zh_tw: {percent:.0%} / {total}

source: Yellow highlight
fr: Mise en évidence jaune
it: Evidenziatore giallo
nl: Gele markering
pt: Realce amarelo
zh_tw: 黃色醒目提示

source: Green highlight
fr: Mise en évidence verte
it: Evidenziatore verde
nl: Groene markering
pt: Realce verde
zh_tw: 綠色醒目提示

source: Blue highlight
fr: Mise en évidence bleue
it: Evidenziatore blu
nl: Blauwe markering
pt: Realce azul
zh_tw: 藍色醒目提示

source: Pink highlight
fr: Mise en évidence rose
it: Evidenziatore rosa
nl: Roze markering
pt: Realce rosa
zh_tw: 粉紅色醒目提示

source: Purple highlight
fr: Mise en évidence violette
it: Evidenziatore viola
nl: Paarse markering
pt: Realce púrpura
zh_tw: 紫色醒目提示

source: Unknown highlight
fr: Mise en évidence inconnue
it: Evidenziatore sconosciuto
nl: Onbekende markering
pt: Realce desconhecido
zh_tw: 未知醒目提示

source: Red wavy underline
fr: Souligné en rouge ondulé
it: Sottolineatura rossa ondulata
nl: Rode golvende onderlijn
pt: Sublinhado ondulado vermelho
zh_tw: 紅色波浪狀底線

source: Red strikeout
fr: Barré rouge
it: Barrato rosso
nl: Rood doorstreept
pt: Risco vermelho
zh_tw: 紅色刪除線

source: Unknown underline
fr: Souligné inconnu
it: Sottolineatura sconosciuta
nl: Onbekende onderstreping
pt: Sublinhado desconhecido
zh_tw: 未知底線

source: Custom style
fr: Style personnalisé
it: Stile personalizzato
nl: Aangepaste stijl
pt: Estilo personalizado
zh_tw: 自訂樣式

source: Style name:
fr: Nom du style :
it: Nome stile:
nl: Stijl naam:
pt: Nome do estilo:
zh_tw: 樣式名稱：

source: Name for this style
fr: Nom pour ce style
it: Nome per questo stile
nl: Naam voor deze stijl
pt: Nome para este estilo
zh_tw: 這個樣式的名稱

source: Type of style:
fr: Type de style
it: Tipo di stile:
nl: Type stijl:
pt: Tipo do estilo:
zh_tw: 樣式類型：

source: Color
fr: Couleur
it: Colore
nl: Kleur
pt: Cor
zh_tw: 顏色

source: Underline
fr: Souligné
it: Sottolineato
nl: Onderstreept
pt: Sublinhado
zh_tw: 底線

source: Color for light color themes:
fr: Couleur pour les thèmes de couleur claire :
it: Colore per temi chiari:
nl: Kleur voor lichte kleurthema's:
pt: Cor para temas de cores claras:
zh_tw: 亮色配色方案的顏色：

source: Color for dark color themes:
fr: Couleur pour les thèmes de couleur sombre :
it: Colore per temi scuri:
nl: Kleur voor donkere kleurthema's:
pt: Cor para temas de cores escuras:
zh_tw: 暗色配色方案的顏色：

source: Color for the line:
fr: Couleur pour la ligne :
it: Colore della linea:
nl: Kleur voor de lijn:
pt: Cor para a linha:
zh_tw: 線條顏色：

source: Text color
fr: Couleur du texte
it: Colore testo
nl: Tekst kleur
pt: Cor do texto
zh_tw: 文字顏色

source: Custom color:
fr: Couleur personnalisée
it: Colore personalizzato:
nl: Aangepaste kleur:
pt: Cor personalizada:
zh_tw: 自訂顏色：

source: Position of line:
fr: Position de la ligne :
it: Posizione della linea:
nl: Positie van lijn:
pt: Posição da linha:
zh_tw: 線條位置：

source: Over-line
fr: Surligné
it: Sopralineato
nl: Boven-lijn
pt: Sobrescrito
zh_tw: 頂線

source: Strikeout
fr: Barré
it: Barrato
nl: Doorstreept
pt: Riscado
zh_tw: 刪除線

source: Style of line:
fr: Style de la ligne
it: Stile della linea:
nl: Stijl van lijn:
pt: Estilo da linha:
zh_tw: 線條樣式：

source: Solid
fr: Pleine
it: Singola
nl: Solide
pt: Sólido
zh_tw: 實線

source: Double
it: Doppia
nl: Dubbel
pt: Duplo
zh_tw: 雙線

source: Dotted
fr: Pointillée
it: Puntini
nl: Gestippeld
pt: Pontilhado
zh_tw: 點線

source: Dashed
fr: En pointillé
it: Trattini
nl: Onderbroken
pt: Tracejado
zh_tw: 虛線

source: Wavy
fr: Ondulée
it: Ondulata
nl: Golvend
pt: Ondulado
zh_tw: 波浪線

source: Discard
fr: Annuler
it: Annulla
nl: Annuleren
pt: Cancelar
zh_tw: 放棄

source: Save
fr: Enregistrer
it: Salva
nl: Opslaan
pt: Guardar
zh_tw: 儲存

source: No name specified
fr: Aucun nom spécifié
it: Nessun nome specificato
nl: Geen naam opgegeven
pt: Nenhum nome especificado
zh_tw: 沒有指定名稱

source: You must give your custom style a name
fr: Vous devez donner un nom à votre style personnalisé
it: Devi dare un nome al tuo stile personalizzato
nl: U moet uw aangepaste stijl een naam geven
pt: Deve indicar um nome para o seu estilo personalizado
zh_tw: 您必須給您的自訂樣式一個名稱

source: Remove style
fr: Supprimer le style
it: Rimuovi stile
nl: Stijl verwijderen
pt: Remover estilo
zh_tw: 移除樣式

source: Remove this custom highlight style
fr: Supprimer ce style de mise en évidence personnalisée
it: Rimuovi questo stile di evidenziazione personalizzato
nl: Verwijder deze aangepaste markeringsstijl
pt: Remover este estilo de realce personalizado
zh_tw: 移除這個自訂醒目提示樣式

source: Apply
fr: Appliquer
it: Applica
nl: Toepassen
pt: Aplicar
zh_tw: 儲存

source: Create
fr: Créer
it: Crea
nl: Creëer
pt: Criar
zh_tw: 建立

source: Finish editing highlight
fr: Terminer l'édition d'une mise en évidence
it: Concludi la modifica dell'evidenziazione
nl: Voltooi het bewerken van de markering
pt: Terminar edição do realce
zh_tw: 結束編輯醒目提示

source: Create highlight
fr: Créer une mise en évidence
it: Crea evidenziazione
nl: Creëer een markering
pt: Criar realce
zh_tw: 建立醒目提示

source: Add notes for this highlight. Double click or long tap on a highlight to read its notes.
fr: Ajouter des notes pour cette mise en évidence. Double-cliquer ou tapoter longuement sur un surlignage pour lire ses notes.
it: Aggiungi note a questa evidenziazione. Fai doppio clic o tieni premuto su un'evidenziazione per leggerne le note.
nl: Voeg notities toe voor dit markering. Dubbelklik of tik lang op een markering om de aantekeningen te lezen.
pt: Adicionar notas a este realce. Pode fazer duplo clique ou toque longo num realce para ler suas notas.
zh_tw: 加入這個醒目提示的備註。在醒目提示上按兩下或長按來閱讀備註。

source: Abort
fr: Interrompre
it: Interrompi
nl: Afbreken
pt: Cancelar
zh_tw: 中止

source: Add a new highlight style
fr: Ajouter un nouveau style de mise en évidence
it: Aggiungi un nuovo stile di evidenziazione
nl: Voeg een nieuwe markeringsstijl toe
pt: Adicionar um novo estilo de realce
zh_tw: 加入新的醒目提示樣式

source: Are you sure?
fr: Êtes-vous certain ?
it: Sei sicuro?
nl: Weet u het zeker?
pt: Tem a certeza?
zh_tw: 您確定嗎？

source: Do you want to permanently delete this highlighting style?
fr: Êtes-vous sûr de vouloir supprimer définitivement ce style de mise en évidence ?
it: Vuoi eliminare definitivamente questo stile di evidenziazione?
nl: Wilt u deze markeerstijl definitief verwijderen?
pt: Quer eliminar permanentemente este estilo de realce?

source: Unknown chapter
fr: Chapitre indéterminé
it: Capitolo sconosciuto
nl: Onbekend hoofdstuk
pt: Capítulo desconhecido

source: Export highlights
fr: Exporter les mises en évidence
it: Esporta evidenziazioni
nl: Exporteer markeringen
pt: Exportar realces
zh_tw: 匯出醒目提示

source: Format for exported highlights:
fr: Format pour les mises en évidence exportées :
it: Formato per le evidenziazioni esportate:
nl: Formateer voor geëxporteerde markeringen:
pt: Formato para os realces exportados:
zh_tw: 导出的突出显示格式：

source: Plain text
fr: Texte simple
it: Testo semplice
nl: Platte tekst
pt: Texto simples
zh_tw: 純文字

source: Copy
fr: Copier
it: Copia
nl: Kopiëren
pt: Copiar
zh_tw: 複製

source: Download
fr: Télécharger
it: Scarica
nl: Downloaden
pt: Descarregar
zh_tw: 下載

source: Not found
fr: Introuvable
it: Non trovata
nl: Niet gevonden
pt: Não encontrado
zh_tw: 未找到

source: No other matches found for: {}
fr: Aucun autre résultat trouvé pour : {}
it: Nessun'altra corrispondenza trovata per: {}
nl: Geen andere overeenkomsten gevonden voor: {}
pt: Sem outras correspondências para: {}
zh_tw: 沒有找到其他符合項目：{}

source: No matches found for: {}
fr: Pas de correspondance trouvée pour : {}
it: Nessuna corrispondenza trovata per: {}
nl: Geen overeenkomsten gevonden voor: {}
pt: Nenhuma correspondência encontrada para: {}
zh_tw: 沒有找到符合項目：{}

source: Do you want to permanently delete this highlight?
fr: Êtes-vous sûr de vouloir supprimer définitivement cette mise en évidence ?
it: Vuoi eliminare definitivamente questa evidenziazione?
nl: Wilt u deze markering definitief verwijderen?
pt: Deseja apagar de forma permanente este realce?
zh_tw: 您要永久刪除這個醒目提示嗎？

source: Notes
it: Note
nl: Aantekeningen
pt: Notas
zh_tw: 備註

source: Do you want to permanently delete the selected highlight?
fr: Êtes-vous sûr de vouloir supprimer définitivement la mise en évidence sélectionnée {}?
it: Vuoi eliminare definitivamente l'evidenziazione selezionata?
nl: Wilt u de geselecteerde markering definitief verwijderen?
pt: Deseja apagar permanentemente o realce selecionado?

source: Show in book
fr: Afficher dans le livre
it: Mostra nel libro
nl: Toon in boek
pt: Mostrar no livro
zh_tw: 在書籍中顯示

source: Edit notes
fr: Modifier les notes
it: Modifica note
nl: Bewerk notities
pt: Editar notas
zh_tw: 編輯備註

source: Remove highlight
fr: Supprimer la mise en évidence
it: Rimuovi evidenziazione
nl: Markering verwijderen
pt: Remover realce
zh_tw: 移除醒目提示

source: Next match
fr: Résultat suivant
it: Prossima corrispondenza
nl: Volgend overeenkomst
pt: Correspondência seguinte
zh_tw: 下一個相符項目

source: Previous match
fr: occurrence précédente
it: Risultato precedente
nl: Vorige overeenkomst
pt: Correspondência anterior
zh_tw: 上一個相符項目

source: Search
fr: Rechercher
it: Cerca
nl: Zoeken
pt: Pesquisar
zh_tw: 搜尋

source: Clear
fr: Effacer
it: Svuota
nl: Wissen
pt: Limpar
zh_tw: 清除

source: Clear selection
fr: Annuler la sélection
it: Elimina selezione
nl: Wis selectie
pt: Limpar seleção
zh_tw: 清除選取範圍

source: Remove
fr: Supprimer
it: Rimuovi
nl: Verwijderen
pt: Remover
zh_tw: 移除

source: Remove selected highlights
fr: Supprimer les mise en évidence sélectionnées
it: Elimina l'evidenziazione selezionata
nl: Verwijder geselecteerde markeringen
pt: Remover realces selecionados
zh_tw: 移除選中的醒目提示

source: All
fr: Tout
it: Tutti
nl: Alle
pt: Todos
zh_tw: 全部

source: Select all highlights
fr: Sélectionner toutes les mise en évidence
it: Seleziona tutte le evidenziazioni
nl: Selecteer alle markeringen
pt: Selecionar todos os realces
zh_tw: 選擇所有醒目提示

source: Export
fr: Exporter
it: Esporta
nl: Exporteren
pt: Exportar
zh_tw: 匯出

source: Export all or selected highlights
fr: Exporter tout ou les mise en évidences sélectionnées
it: Esporta tutto o seleziona evidenziazioni
nl: Exporteer alle of geselecteerde markeringen
pt: Exportar todos os realces ou só os selecionados
zh_tw: 匯出所有或選中的醒目提示

source: Unknown
fr: Inconnu(e)
it: Sconosciuto
nl: Onbekend
pt: Desconhecido
zh_tw: 未知

source: Table of Contents section:
fr: Section de la Table des Matières :
it: Sezione dell'indice:
nl: Inhoudsopgave sectie:
pt: Secção do índice:

source: Open a book from your computer
fr: Ouvrir un livre depuis votre ordinateur
it: Apri un libro dal tuo computer
nl: Open en boek van uw computer
pt: Abrir um livro do seu computador
zh_tw: 從電腦開啟一本書

source: Recently viewed books
fr: Livres récemment consultés
it: Libri visualizzati di recente
nl: Recentelijk bekeken boeken
pt: Livros visualizados recentemente
zh_tw: 最近檢視的書籍

source: Clear recent list
fr: Effacer la liste des livres récents
it: Cancella l'elenco recente
nl: Legen lijst recent bekeken
pt: Limpar a lista recente
zh_tw: 清除最近檢視清單

source: Speaking failed
fr: L'expression orale a échoué
it: Sintesi vocale fallita
nl: Spreken mislukt
pt: Falha na leitura em voz
zh_tw: 朗读失败

source: System
fr: Système
it: Sistema
nl: Systeem
pt: Sistema
zh_tw: 系統

source: White
fr: Blanc
it: Bianco
nl: Wit
pt: Branco
zh_tw: 白

source: Black
fr: Noir
it: Nero
nl: Zwart
pt: Preto
zh_tw: 黑

source: Sepia light
fr: Sépia léger
it: Seppia chiaro
nl: Sepia licht
pt: Sépia claro
zh_tw: 棕褐色亮

source: Sepia dark
fr: Sépia sombre
it: Seppia scuro
nl: Sepia donker
pt: Sépia escuro
zh_tw: 棕褐色暗

source: No matches found
fr: Aucune correspondance trouvée
it: Nessuna corrispondenza trovata
nl: Geen zoekresultaten gevonden
pt: Nenhuma correspondência encontrada
zh_tw: 未尋獲相符檔案

source: The text "{}" was not found in the Table of Contents
fr: Le texte "{}" n'a pas été trouvé dans la Table des Matières
it: Il testo "{}" non è stato trovato nel Sommario
nl: The tekst "{}" is niet gevonden in de inhoudsopgave
pt: O texto "{}" não foi encontrado no índice
zh_tw: 在目錄中找不到文字「{}」

source: Search Table of Contents
fr: Rechercher dans la Table des Matières
it: Cerca nell'indice
nl: Doorzoek inhoudsopgave
pt: Pesquisar no índice
zh_tw: 搜尋目錄

source: Loading data, please wait...
fr: Chargement des données, veuillez patienter…
it: Caricamento dati, attendere prego...
nl: Gegevens aan het laden, even geduld...
pt: A carregar dados, por favor, aguarde...
zh_tw: 正在載入資料，請稍候…

source: Footnote
fr: Note de bas de page
it: Nota a piè pagina
nl: Voetnoot
pt: Nota de rodapé
zh_tw: 註腳

source: Go to this footnote in the main view
fr: Allez à cette note de pied de page dans la vue principale
it: Vai a questo piè di pagina nella vista principale
nl: Ga naar deze voetnoot in de hoofdweergave
pt: Ir para esta nota de rodapé no visualizador principal
zh_tw: 在主視圖前往這個註腳

source: Close the footnotes window
fr: Fermer la fenêtre des notes de pied de page
it: Chiudi la finestra dei piè di pagina
nl: Sluit het voetnoten venster
pt: Fechar janela de notas de rodapé
zh_tw: 關閉註腳視窗

source: Loading note, please wait...
fr: Chargement de la note, veuillez patienter…
it: Caricamento note, attendere prego...
nl: Notitie aan het laden, even geduld...
pt: A carregar nota, por favor, aguarde...
zh_tw: 正在載入註腳，請稍候…

source: Pause reading
fr: Pause de la lecture
it: Metti in pausa la lettura
nl: Pauzeer lezen
pt: Pausar leitura
zh_tw: 暫停閱讀

source: Start reading
fr: Commencer la lecture
it: Comincia la lettura
nl: Begin lezen
pt: Iniciar leitura
zh_tw: 開始閱讀

source: Resume reading
fr: Reprendre la lecture
it: Riprendi la lettura
nl: Ga verder met lezen
pt: Retomar leitura
zh_tw: 繼續閱讀

source: Slow down speech
fr: Réduire la vitesse d'élocution
it: Diminuisci la velocità del parlato
nl: Vertraag spraak
pt: Abrandar voz
zh_tw: 降低語音速度

source: Speed up speech
fr: Accélérer la vitesse d'élocution
it: Aumenta la velocità del parlato
nl: Versnel spraak
pt: Acelerar voz
zh_tw: 加快語音速度

source: Configure Read aloud
fr: Configurer Parler à voix haute
it: Configura Leggi ad alta voce
nl: Luidop lezen instellen
pt: Configurar leitura em voz alta
zh_tw: 設定朗讀音量

source: Close Read aloud
fr: Fermer Lire à voix haute
it: Ferma Leggi ad alta voce
nl: Luidop lezen sluiten
pt: Fechar leitura em voz alta
zh_tw: 關閉朗讀功能

source: Tap/click on a word to start from there
fr: Tapoter/cliquer sur un mot pour commencer à partir de là
it: Tocca/fai clic su una parola da cui partire
nl: Tik/klik op een woord om daar te starten
pt: Toque/carregue numa palavra para começar a partir daí
zh_tw: 点击以单词并从此开始

source: Tap/click on a word to skip to it
fr: Tapoter/cliquer sur un mot pour sauter à partir de là
it: Tocca/fai clic su una parola per saltarla
nl: Tik/klik op een woord om ernaar te springen
pt: Toque/carregue numa palavra para a saltar
zh_tw: 点击单词以略过

source: Tap/click on a word to continue from there
fr: Tapoter/cliquer sur un mot pour continuer à partir de là
it: Tocca/fai clic su una parola da cui continuare
nl: Tik/klik op een woord om van daar verder te gaan
pt: Toque/carregue numa palavra para continuar a partir daí
zh_tw: 点击以单词并从此继续

source: Required fields missing
fr: Des champs requis sont manquants
it: Campi richiesti mancanti
nl: Vereiste velden missen
pt: Campos obrigatórios em falta
zh_tw: 需要的欄位遺失

source: You must specify both a name and a URL.
fr: Vous devez spécifier à la fois un nom et une URL.
it: E' necessario inserire sia il nome che l'URL.
nl: U moet zowel en naam evenals een URL specificeren.
pt: Deve especificar um nome e um URL
zh_tw: 您必須指定名稱與網址。

source: Enter the name and URL for a custom lookup source. The URL must contain {0} in it, which will be replaced by the word being looked up. For example: {1}
fr: Entrez le nom et l'URL d'une source de recherche personnalisée. L'URL doit contenir {0}, qui sera remplacé par le mot recherché. Par exemple : {1}
it: Inserire il nome e l'URL della fonte di ricerca personalizzata. L'URL deve contenere {0}, che sarà sostituito dalla parola cercata. Per esempio: {1}
nl: Voer de naam en URL in voor een aangepaste opzoekbron. De URL moet {0} bevatten, die zal worden vervangen door het woord dat wordt opgezocht. Bijvoorbeeld: {1}
pt: Indique o nome e URL para uma fonte personalizada de consulta. O URL deve conter o marcador {0}, que será substituído pela palavra a ser pesquisada. Por exemplo: {1}
zh_tw: 输入名称和 URL 来自定义查找源。URL 必须包含 {0}，这将被实际搜索的关键词替换。比如：{1}

source: Name:
fr: Nom :
it: Nome:
nl: Naam:
pt: Nome:
zh_tw: 名稱：

source: Add
fr: Ajouter
it: Aggiungi
nl: Voeg toe
pt: Adicionar
zh_tw: 加入

source: Choose a custom lookup to remove
fr: Choisissez une recherche personnalisée à supprimer
it: Scegliere ricerca personalizzata da rimuovere
nl: Kies een aangepaste opzoeking om te verwijderen
pt: Escolher um limitador personalizado a remover
zh_tw: 選擇要移除的自訂查詢

source: Cancel (no removals)
fr: Annuler (pas de suppressions)
it: Annulla (nessuna rimozione)
nl: Annuleren (geen verwijderingen)
pt: Cancelar (sem remover)
zh_tw: 取消（不移除）

source: Google dictionary
fr: Dictionnaire Google
it: Dizionario di Google
nl: Google woordenboek
pt: Dicionário Google
zh_tw: Google 字典

source: Search the internet
fr: Rechercher sur internet
it: Cerca in internet
nl: Zoek op het internet
pt: Pesquisar na Internet
zh_tw: 在網路上搜尋

source: Add a custom lookup
fr: Ajouter une recherche personnalisée
it: Aggiungere ricerca personalizzata
nl: Voeg een aangepaste opzoeking toe
pt: Adicionar um limitador personalizado
zh_tw: 加入自訂查詢

source: Remove a custom lookup
fr: Supprimer une recherche personnalisée
it: Rimuovere ricerca personalizzata
nl: Verwijder een aangepaste opzoeking
pt: Remover um limitador personalizado
zh_tw: 移除自訂查詢

source: Are you sure you want to remove this book from local storage? You will have to re-download it from calibre if you want to read it again.
fr: Êtes-vous certain de vouloir supprimer ce livre du stockage local ? Vous aurez à le re-télécharger depuis calibre si vous voulez le lire à nouveau.
it: Sei sicuro di voler rimuovere questo libro dall'archivio locale? Dovrai scaricarlo nuovamente da calibre se vorrai leggerlo ancora.
nl: Weet u zeker dat u dit boek van de lokale opslag wilt verwijderen? U dient het boek opnieuw te downloaden van calibre wanneer u dit nogmaals wilt lezen.
pt: Tem a certeza de que deseja remover este livro do seu armazenamento local? Você terá de o descarregar novamente do Calibre caso o pretenda ler de novo.
zh_tw: 您確定要從本機儲存空間移除這本書嗎？如果您想要再次閱讀，您必須從 calibre 重新下載。

source: Delete book
fr: Supprimer le livre
it: Elimina libro
nl: Verwijder boek
pt: Eliminar livros
zh_tw: 刪除書本
