Repository: debian-calibre/calibre
Catalog: translations-git/content-server/*.po
Languages: fr, it, nl, pt, zh_tw

source: Level &1 TOC (XPath expression):
fr: Niveau &1 TDM (expression XPath) :
it: Livello &1 indice (espressione XPath):
nl: Niveau &1 inhoudsopgave (XPath-uitdrukking):
pt: Índice - nível &1 (Expressão XPath):
zh_tw: 第 &1 級目錄頁 (XPath 表示式):

source: Level &2 TOC (XPath expression):
fr: Niveau &2 TDM (expression XPath) :
it: Livello &2 indice (espressione XPath):
nl: Niveau &2 inhoudsopgave (XPath-uitdrukking):
pt: Índice - nível &2 (Expressão XPath):
zh_tw: 第 &2 級目錄頁 (XPath 表示式):

source: Level &3 TOC (XPath expression):
fr: Niveau &3 TDM (expression XPath) :
it: Livello &3 indice (espressione XPath):
nl: Niveau &3 inhoudsopgave (XPath-uitdrukking):
pt: Índice - nível &3 (Expressão XPath):
zh_tw: 第 &3 級目錄頁 (XPath 表示式):

source: Search:
fr: Rechercher :
it: Cerca:
nl: Zoeken:
pt: Pesquisar:
zh_tw: 搜尋：

source: Replace:
fr: Remplacer :
it: Sostituisci:
nl: Vervang:
pt: Substituir:
zh_tw: 取代：

source: &Disable comic processing
fr: &Désactiver le traitement des bandes dessinées
it: &Disabilita l'elaborazione di fumetti
nl: Stripverwerking &deactiveren
pt: Desativar &processamento de banda desenhada
zh_tw: 停用漫畫處理(&D)

source: Disable conversion of images to &black and white
fr: Désactiver la conversion en noir et &blanc des images
it: Disabilita la conversione delle immagini in bianco e nero
nl: Conversie van af&beeldingen naar zwart-wit uitschakelen
pt: Desativar conversão de imagens para preto e &branco
zh_tw: 停用將圖片轉換為黑白(&B)

source: Don't add links to &pages to the Table of Contents for CBC files
fr: Ne pas ajouter les liens aux &pages de la Table des Matières pour les fichiers CBC
it: Non aggiungere i collegamenti delle &pagine all'indice per i file CBC
nl: Voeg geen &paginalinks aan de inhoudsopgave van CBC-bestanden toe
pt: Não adicionar ligações a &páginas no índice em ficheiros CBC
zh_tw: 對 CBC 檔案不加入到目錄頁的連結(&P)

source: &Number of colors:
fr: &Nombre de couleurs :
it: &Numero di colori:
nl: &Aantal kleuren:
pt: &Número de cores:
zh_tw: 顏色數(&N):

source: Override image si&ze:
fr: Forcer la &taille de l’image :
it: Ridime&nsiona immagine:
nl: Overschrijf afbeeldingsgro&otte:
pt: Sobrepor &tamanho da imagem:
zh_tw: 覆蓋圖片大小：

source: Disable &normalize
fr: Désactiver &normaliser
it: Disabilita la &normalizzazione
nl: Schakel &normalisatie uit
pt: Desativar nor&malizar
zh_tw: 停用標準化(&N)

source: Keep &aspect ratio
fr: Conserver les &proportions
it: Mantieni le &proporzioni
nl: Beeldverhouding bew&aren
pt: Manter &proporção do tamanho
zh_tw: 保持長寬比例(&A)

source: Disable &sharpening
fr: Dé&sactiver l’effet d’accentuation.
it: Disabilita aumento &nitidezza
nl: Uitschakelen &verscherpen
pt: &Desativar nitidez
zh_tw: 停用銳化(&S)

source: Disable &trimming
fr: Désac&tiver le découpage
it: Disabilita la rifila&tura
nl: Uitschakelen &bijsnijden
pt: Desativar &recorte
zh_tw: 停用截短(&T)

source: &Wide
fr: &Large
it: &Larghezza
nl: &Breed
pt: &Largo
zh_tw: 寬模式(&W)

source: &Landscape
fr: &Paysage
it: &Orizzontale
nl: &Liggend
pt: &Paisagem
zh_tw: 橫向(&L)

source: &Right to left
fr: De &droite à gauche
it: &Da destra a sinistra
nl: &Rechts naar links
pt: &Direita para a esquerda
zh_tw: 由右至左(&R)

source: Don't so&rt
fr: Ne pas &trier
it: Non ord&inare
nl: Niet so&rteren
pt: Não o&rdenar
zh_tw: 不要排序(&R)

source: De&speckle
fr: &Flou
it: S&macchia
nl: Ont&spikkel
pt: Limpar &irregularidades
zh_tw: 去除斑點(&S)

source: O&utput format:
fr: Format de s&ortie :
it: Formato di o&utput:
nl: U&itvoer bestandstype:
pt: Formato de destin&o:
zh_tw: 輸出格式：

source: Do not insert a Table of Contents at the beginning of the book
fr: Ne pas insérer une Table des Matières au début du livre.
it: Non inserire un indice all'inizio del libro
nl: Geen inhoudsopgave invoegen aan het begin van het boek
pt: Não inserir um índice no início do livro.
zh_tw: 不要在書本的開頭插入目錄

source: Line &un-wrapping factor:
fr: Facte&ur de redéfinition des lignes :
it: Fattore di d&isimballaggio della linea:
nl: Lijn &uitpak factor:
pt: Fator de eliminação de &quebras de linha:
zh_tw: 不換列係數(&U)：

source: No &images
fr: Pas d’&images
it: Nessuna &immagine
nl: Geen &images
pt: Sem &imagens
zh_tw: 不使用圖片(&I)

source: Ignore &WMF images in the RTF file
fr: Ignorer les images &WMF dans le fichier RTF
it: Ignora immagini &WMF nel file RTF
nl: Negeer &WMF afbeeldingen in het RTF-bestand
pt: Ignorar imagens &WMF no ficheiro RTF
zh_tw: 忽略 RTF 文件中的 WMF 圖像(&W)

source: Do not try to autodetect a &cover from images in the document
fr: Ne pas essayer de détecter automatiquement une &couverture à partir des images dans le document
it: Non provare a rilevare automaticamente una &cover dalle immagini del documento.
nl: Probeer niet automatisch een &omslag te vinden op basis van afbeeldingen in het document
pt: Não tentar detetar automaticamente uma &capa das imagens no documento
zh_tw: 不要嘗試從文件中的影像自動偵測封面(&C)

source: Do not add a page after every &endnote
fr: Ne pas insérer de page après chaque not&e de fin
it: Non aggiungere una pagina dopo ogni fine nota
nl: Voeg geen pagina toe na elke &eindnoot
pt: Não adicionar página após cada &nota final
zh_tw: 不要在每個尾註後加入一頁(&E)

source: Render &superscripts and subscripts so that they do not affect the line height
fr: Rendu des exposant&s et des indices de manière à ne pas affecter la hauteur de ligne
it: Rendi &apici e pedici in modo che non cambino l'altezza della riga
nl: Pas &superscripts en subscripts aan zodat de regelhoogte niet wordt beïnvloed
pt: Representar &sobrescritos e subscritos para que não afetem a altura da linha
zh_tw: 繪製上標和下標，使它們不影響行高(&S)

source: Para&graph style:
fr: Style de para&graphe :
it: Stile paragrafo:
nl: Para&graaf stijl:
pt: Estilo do para&grafo:
zh_tw: 段落樣式：

source: Forma&tting style:
fr: Style de forma&tage :
it: Stile formattazione:
nl: Opma&akstijl:
pt: Estilo de forma&tação:
zh_tw: 格式化樣式：

source: Preserve &spaces
fr: Conserver les &espaces
it: Mantieni gli &spazi
nl: Behoud &spaties
pt: Preservar &espaços
zh_tw: 保留空格(&S)

source: Remove &indents at the beginning of lines
fr: Supprimer les &indentations en début de ligne
it: Rimuovi i &rientri all'inizio delle righe
nl: Verwijder &inspringingen aan het begin van regels
pt: &Remover indentação do início das linhas
zh_tw: 移除列開頭的縮排

source: Allowed Markdown extensions:
fr: Permettre les extensions Markdown :
it: Estensioni di Markdown permesse:
nl: Toegestane Markdown extensies:
pt: Extensões Markdown permitidas:
zh_tw: 允許的 Markdown 擴充：

source: Do not &split on page breaks
fr: Ne pas &diviser sur les sauts de page
it: Non &dividere alle interruzioni di pagina
nl: Niet &splitsen bij nieuwe pagina
pt: Não dividir nas &quebras de página
zh_tw: 不要在分頁處分割(&S)

source: No default &cover
fr: Pas de &couverture par défaut
it: Nessuna &copertina predefinita
nl: Geen standaard &omslagafbeelding
pt: Sem &capa predefinida
zh_tw: 沒有預設封面(&C)

source: &Flatten EPUB file structure
fr: &Aplatir la structure du fichier EPUB
it: Struttura file EPUB &lineare
nl: Maak EPUB-bestandsstructuur vlak (intern bestands&formaat)
pt: Ni&velar a estrutura de ficheiros EPUB
zh_tw: 扁平化 EPUB 檔案結構

source: No &SVG cover
fr: Pas de couverture &SVG
it: Nessuna copertina &SVG
nl: Geen &SVG-omslag
pt: Sem capa &SVG
zh_tw: 不用 &SVG 封面

source: Preserve cover &aspect ratio
fr: Conserver les &proportions de la couverture
it: Mantieni le &proporzioni della copertina
nl: Behoud beeldverhouding van de omsl&ag
pt: Preservar proporção de &tamanho da capa
zh_tw: 保留封面長寬比(&A)

source: Insert inline &Table of Contents
fr: Insérer la &table des Matières intégrée
it: Inse&risci l'indice in linea
nl: Invoegen van inline Inhoudsopgave (&ToC)
pt: Inserir índice &incorporado
zh_tw: 插入行內目錄(&T)

source: Put inserted Table of Contents at the &end of the book
fr: Mettre la Table des Matières insérée à la &fin du livre
it: Posiziona l'indic&e inserito alla fine del libro
nl: Zet de ingevoegde inhoudsopgave aan het &einde van het boek
pt: Colocar o índice inserido no &final do livro
zh_tw: 在書本最後插入目錄

source: &Title for inserted ToC:
fr: &Titre de la Table des Matières insérée :
it: &Titolo per l'indice inserito
nl: &Titel voor de ingevoegde ToC:
pt: &Título para o índice inserido:
zh_tw: 插入目錄的標題(&T):

source: Split files &larger than:
fr: Scinder les fichiers plus &grands que :
it: Dividi i documenti più &grandi di:
nl: Sp&lits bestanden groter dan:
pt: Dividir ficheiros &maiores do que:
zh_tw: 分割大於此項的檔案(&L):

source: EP&UB version:
fr: Version de l'EP&UB :
it: Versione EP&UB:
nl: EP&UB versie:
pt: Versão EP&UB:
zh_tw: EP&UB 版本：

source: Paper si&ze:
fr: Taille du &papier :
it: Dimensioni &pagina:
nl: Papier &formaat:
pt: &Tamanho da página:
zh_tw: 紙張大小(&Z):

source: &Custom size:
fr: &Taille personnalisée :
it: Dimensione &personalizzata:
nl: &Aangepaste omvang:
pt: Tamanho &personalizado:
zh_tw: 自訂大小(&C):

source: Page &left margin
fr: Marge &gauche de la page
it: Margine &sinistro della pagina
nl: Linker marge
pt: Margem &esquerda da página
zh_tw: 頁面左邊界(&L)

source: Page &top margin
fr: Marge &supérieure de la page
it: Margine &superiore della pagina
nl: Boven-marge
pt: &Margem superior da página
zh_tw: 頁面頂端邊界(&T)

source: Page &right margin
fr: Marge &droite de la page
it: Margine &destro della pagina
nl: Rechter marge
pt: Margem &direita da página
zh_tw: 頁面右邊界(&R)

source: Page &bottom margin
fr: Marge &inférieure de la page
it: Margine &inferiore della pagina
nl: Onder-marge
pt: &Margem inferior da página
zh_tw: 頁面底部邊界(&B)

source: Do not insert the &Table of Contents as a page at the start of the document
fr: Ne pas insérer la &Table des Matières en tant que page au début du document
it: Non inserire l'&indice come pagina all'inizio del documento
nl: Voeg geen inhoudsopgave als pagina toe aan het begin van het document
pt: Não inserir &índice como página no início do documento
zh_tw: 不要在文件開頭插入目錄作為頁面(&T)

source: Do not insert &cover as image at start of document
fr: N'insère pas de &couverture comme image au début du document
it: Non inserire la &copertina come immagine all'inizio del documento.
nl: Voeg &omslag niet toe als afbeelding bij het begin van het document
pt: Não inserir &capa como imagem no início do documento
zh_tw: 不要在文件開頭插入封面作為圖片(&C)

source: Preserve the aspect ratio of the image inserted as cover
fr: Préserver le ratio d'aspect de l'image insérée comme couverture
it: Mantieni la proporzione dell'immagine inserita come copertina
nl: Hoogte-breedteverhouding van de omslagafbeelding bewaren
pt: Preservar a proporção largura/altura da imagem inserida como capa
zh_tw: 保留插入為封面的圖片的長寬比

source: Sec&tionize:
fr: Sec&tionner :
it: Seziona
nl: Koppeling:
pt: Se&ccionar:
zh_tw: 分節(&T)：

source: &Genre:
it: &Genere:
pt: &Género:
zh_tw: 類別(&G)：

source: Enable &auto-rotation of wide images
fr: Autoriser la rotation &automatique des images larges
it: Abilita rotazione &automatica delle immagini larghe
nl: Inschakelen &automatisch draaien van brede afbeeldingen
pt: Ativar a &rotação automática de imagens largas
zh_tw: 啟用寬圖片自動旋轉(&A)

source: &Wordspace:
fr: &Espace entre les mots :
it: &Spazio tra le parole:
nl: &Woordruimte:
pt: &Espaço entre palavras:
zh_tw: 字距(&W)

source: Minim&um para. indent:
fr: Indentation m&inimale des para. :
it: Rientro minimo parag.:
nl: Min &inspring paragraaf:
pt: &Indentação mín. do parágrafo:
zh_tw: 最小段落縮排：

source: Render &tables as images
fr: Convertir les &tableaux en images
it: Trasforma le &tabelle in immagini
nl: &Tabellen als afbeelding weergeven
pt: Processar &tabelas como imagens
zh_tw: 將表格繪製為圖片(&T)

source: Text size multiplier for text in rendered tables:
fr: Multiplicateur de la taille du texte dans les tableaux convertis :
it: Moltiplicatore della grandezza del testo per la presentazione di tabelle:
nl: Vergrotingsfactor voor tekst in getekende tabellen:
pt: Multiplicador do tamanho do texto nas tabelas sintetizadas:
zh_tw: 在繪製出的表格中文字要乘上的倍數：

source: Add &header
fr: Ajouter un &en-tête
it: Aggiungi &intestazione
nl: &Header toevoegen
pt: Adicionar &cabeçalho
zh_tw: 加入頁首(&H)

source: Header &separation:
fr: &Séparateur d’en-tête :
it: &Spazio dall'intestazione:
nl: &Scheiding voor header:
pt: &Separação de cabeçalho:
zh_tw: 頁首分隔(&S):

source: Header &format:
fr: &Format de l’en-tête :
it: &Formato dell'intestazione:
nl: &Opmaak voor header:
pt: &Formato do cabeçalho:
zh_tw: 頁首格式(&F):

source: Serif fon&t family:
fr: Famille de police Seri&f :
it: Famiglia fon&t Serif:
nl: Schreef letter&type:
pt: Família de &tipos de letra Serif:
zh_tw: 襯線字型族系：

source: Sans-serif font fami&ly:
fr: Fami&lle de police Sans-serif :
it: Fami&glia font Sans-serif:
nl: Schreefloze letter&type:
pt: &Família de tipos de letra Sans-serif:
zh_tw: 無襯線字型族系：

source: &Monospace font family:
fr: Famille de police &Monospace :
it: Famiglia di caratteri &monospace:
nl: &Monospace lettertype familie:
pt: Família de tipos de letra &Monospace:
zh_tw: 等寬字體(&M):

source: Do not add &Table of Contents to book
fr: Ne pas ajouter de &Table des Matières au livre
it: Non aggiungere l'&indice al libro
nl: Voeg geen &Inhoudsopgave aan het boek toe
pt: Não inserir &índice no livro
zh_tw: 不要在書本中加入目錄(&T)

source: &Title for Table of Contents:
fr: &Titre de la Table des Matières :
it: &Titolo per l'indice:
nl: &Titel voor inhoudsopgave:
pt: &Título para o índice:
zh_tw: 目錄頁的標題(&T):

source: Put generated Table of Contents at &start of book instead of end
fr: Insérer la Table des Matières générée au &début du livre plutôt qu’à la fin
it: Po&siziona l'indice generato all'inizio del libro anziché alla fine
nl: Gegenereerde inhoudsopgave aan het begin van het boek toevoegen in plaat&s van aan het einde
pt: Colocar o índice gerado no &início do livro em vez de no final
zh_tw: 將產生的目錄置於書本開頭而非結尾處(&S)

source: Ignore &margins
fr: Ignorer les &marges
it: Ignora i &margini
nl: Negeer &marges
pt: Ignorar &margens
zh_tw: 忽略邊緣(&M)

source: Use author &sort for author
fr: Utiliser le &tri par auteur pour auteur
it: U&sa l'ordinamento autore come autore
nl: Gebruik &sorteerauteur als auteur
pt: U&sar Autor alfabetado em Autor
zh_tw: 以作者進行排序(&S)

source: Do not convert all images to &JPEG (may result in images not working in older viewers)
fr: Ne convertit pas toutes les images au format &JPEG (peut occasionner des problèmes d'affichage sur d'anciennes liseuses)
it: Non convertire tutte le immagini in &JPEG (potrebbe causare problemi con le immagini in visualizzatori datati)
nl: Niet alle afbeeldingen omzetten naar JPEG (kan problemen opleveren in oudere viewers).
pt: Não converter todas as imagens para &JPEG (pode fazer com que visualizadores antigos não consigam ler as imagens)
zh_tw: 不要將所有影像轉換為 &JPEG (可能會讓部分影像無法在舊閱讀器中顯示)

source: Disable &compression of the file contents
fr: Désactiver la &compression du contenu du fichier
it: Disabilita la &compressione del contenuto dei file.
nl: Uitschakelen &compressie van de inhoud van het bestand
pt: Desativar a &compressão do conteúdo do ficheiro
zh_tw: 停用檔案內容的壓縮(&C)

source: MOBI fi&le type:
fr: T&ype de fichier MOBI :
it: Tipo fi&le MOBI:
nl: MOBI be&standstype:
pt: Ficheiro &tipo MOBI:
zh_tw: MOBI 檔案類型：

source: Personal Doc tag:
fr: Étiquette pour les Documents personnels :
it: Tag Documenti Personali:
nl: Label voor persoonlijk document:
pt: Etiqueta de doc. pessoal:
zh_tw: 個人文檔標籤：

source: Enable &sharing of book content via Facebook, etc. WARNING: Disables last read syncing
fr: Activer le partage du contenu des livre&s via Facebook, etc. ATTENTION : désactive la synchronisation du dernier livre lu
it: Abilita la &condivisione del contenuto del libro tramite Facebook, ecc. ATTENZIONE: disabilita la sincronizzazione dell'ultima lettura
nl: Inschakelen en delen van boekinhoud via Facebook, etc. WAARSCHUWING: Schakelt synchronisatie van de laatste lezing uit
pt: Permitir &partilhar conteúdo do livro via Facebook, etc. ATENÇÃO: Irá desativar a sincronização da última página lida
zh_tw: 啟用透過 Facebook 分享書本內容等。警告：會停用上次閱讀同步(&S)

source: Forma&t:
it: Forma&to:
nl: Opmaa&k:
pt: Forma&to:
zh_tw: 格式(&T)：

source: O&utput encoding:
fr: Enc&odage de sortie :
it: Codifica o&utput:
nl: U&itvoer codering:
pt: &Codificação de saída
zh_tw: 輸出編碼：

source: &Inline TOC
fr: TdM &intégrée
it: &Indice nel testo
nl: &Inline inhoudsopgave
pt: Índice &incorporado
zh_tw: 行內目錄頁(&I)

source: &Use the paper size set in output profile
fr: &Utiliser la taille de papier définie dans le profil de sortie
it: &Usa la dimensione del foglio impostata nel profilo di output
nl: &Use het papier formaat als gezet in uitvoerprofiel
pt: &Usar o tamanho de página definido no perfil de saída
zh_tw: 使用輸出設定檔中設定的紙張大小(&U)

source: &Paper size:
fr: Taille du &papier :
it: Dimensioni &pagina:
nl: &Paper formaat:
pt: &Tamanho de página:
zh_tw: 紙張大小：

source: Custom size unit:
fr: Unité de taille personnalisée :
it: Unità di dimensione personalizzata:
nl: Aangepaste maateenheid:
pt: Unidade do tamanho personalizado:
zh_tw: 自訂大小單位：

source: Preserve &aspect ratio of cover
fr: Conserver les &proportions de la couverture
it: Mantieni le &proporzioni della copertina
nl: &Beeldverhouding omslag behouden
pt: Preserv&ar proporção largura/altura da capa
zh_tw: 保留封面長寬比(&A)

source: Add page &numbers to the bottom of every page
fr: Ajoute le &numéro de page à chaque fin de page
it: Aggiungi i numeri di pagina in fondo ad ogni pagina
nl: Voeg pagina &nummers toe aan de onderkant van iedere pagina
pt: Adicionar &números de página no final de cada página
zh_tw: 每一頁的底部加入頁碼(&N)

source: &Break long words at the end of lines
fr: &Interrompre les longs mots à la fin des lignes
it: &Interrompi parole lunghe alla fine delle linee
nl: &Breek lange woorden aan het einde van regels
pt: &Quebrar palavras longas no final das linhas
zh_tw: 斷開列尾的長文字(&B)

source: Add a printable &Table of Contents at the end
fr: Ajouter une &Table des Matières imprimable à la fin
it: Aggiungi un indice s&tampabile alla fine
nl: Voeg een afdrukbare &inhoudsopgave toe aan het einde
pt: &Adicionar um índice imprimível no fim
zh_tw: 在末端加入可列印的目錄(&T)

source: &Title for ToC:
fr: &Titre de la TdM
it: &Titolo per l'indice
nl: &Titel voor ToC:
pt: &Título do índice:
zh_tw: 目錄的標題(&T)：

source: Serif famil&y:
fr: Famille de police &Serif :
it: Famigl&ia Serif:
pt: Família &Serif:
zh_tw: 襯線字族：

source: Sans fami&ly:
fr: Famille &Sans :
it: Fami&glia Sans
pt: Famí&lia Sans:
zh_tw: 無襯線字族：

source: &Monospace family:
fr: Famille &Monospace :
it: Famiglia &monospace:
nl: Niet-proportionele familie (&Monospace):
pt: Família &monospace:
zh_tw: 等寬字型族系(&M):

source: S&tandard font:
fr: Police s&tandard :
it: Carattere sta&ndard:
nl: S&tandaardlettertype:
pt: Tipo de letra &normal:
zh_tw: 標準字型(&T):

source: Default font si&ze:
fr: Taille de la police par défaut :
it: Dimensione prede&finita dei caratteri:
nl: Standaard letter&grootte:
pt: &Tamanho de letra definido:
zh_tw: 預設字型大小(&Z):

source: Page number &map:
fr: Affectation des nu&méros de page :
it: Ri&mappa numero pagina:
nl: Paginanummer:
pt: &Mapa do número de página:
zh_tw: 頁碼 &map:

source: Use page margins from the &document being converted
fr: Utiliser les marges spécifiées dans le &document source
it: Usa margini delle pagine dal &documento in conversione
nl: Gebruik paginamarges van het &document dat wordt geconverteerd
pt: Usar margens de páginas do &documento a ser convertido
zh_tw: 使用被轉換的文件的頁面邊界(&D)

source: Odd/even offset
fr: Décalage Pair/Impair
it: Scostamento pari/dispari
nl: Oneven / even compensatie
pt: Espelhamento ímpar/par
zh_tw: 奇数/偶数 偏移

source: &Header template:
fr: &Modèle d'en-tête :
it: Modello &Intestazione:
nl: &Koptekst sjabloon:
pt: &Modelo de cabeçalho:
zh_tw: 頁眉模板(&H):

source: &Footer template:
fr: &Modèle de pied de page :
it: Modello &Piè di pagina
nl: &Voettekst sjabloon:
pt: &Modelo de rodapé:
zh_tw: 頁腳模板(&F):

source: Do not &reduce image size and depth
fr: Ne pas &réduire la taille de l’image et sa profondeur
it: Non &ridurre la dimensione e la profondità dell'immagine
nl: Niet &verkleinen afbeeldingsgrootte en diepte
pt: Não &reduzir o tamanho e profundidade das imagens
zh_tw: 不要減少圖片大小與顏色深度

source: &Line ending style:
fr: Style de fin de &ligne :
it: Tipo di interruzione di ri&ga:
nl: Stijl rege&leinde:
pt: Estilo de fim de &linha:
zh_tw: 行結尾樣式(&L):

source: Forma&tting:
fr: Forma&tage :
it: Forma&ttazione:
nl: Opmaa&k:
pt: Forma&tação:
zh_tw: 格式(&T)：

source: Options for plain text output:
fr: Options pour la sortie de texte brut :
it: Opzioni per output solo testo:
nl: Opties voor uitvoer platte tekst:
pt: Opções para saída para texto simples:
zh_tw: 純文字輸出選項：

source: &Maximum line length:
fr: Longueur &maximale de la ligne :
it: Lunghezza di riga &massima:
nl: &Maximale regellengte:
pt: Comprimento &máximo da linha:
zh_tw: 每行最大長度(&M):

source: Force maximum line &length
fr: Forcer la &longueur maximale de ligne
it: Forza &lunghezza massima della linea
nl: Forceer maximale regel &lengte
pt: Forçar comprimento máximo de &linha
zh_tw: 強制最大列長

source: Options for Markdown and TexTile output:
fr: Options pour la sortie de Markdown et TexTile :
it: Opzioni per output Markdown e TexTile
nl: Opties voor MarkDown en TexTile uitvoer::
pt: Opções de saída para Markdown e TexTile:
zh_tw: Markdown 和 TexTile 輸出選項：

source: Do not remove links (<a> tags) before processing
fr: Ne pas supprimer les liens (balises <a>) avant l’exécution
it: Non rimuovere i collegamenti (tag <a>) prima dell'elaborazione
nl: Verwijder links (<a>-labels) niet voor verwerking
pt: Não remover ligações (<a> etiquetas) antes do processamento
zh_tw: 處理之前不要移除連結 (<a> 標籤)

source: Do not remove image &references before processing
fr: Ne pas supprimer les &références image avant l’exécution
it: Non rimuovere i &riferimenti alle immagini prima dell'elaborazione
nl: Geen &verwijzingen naar afbeeldingen verwijderen voorafgaand aan verwerking
pt: Não remover &referências de imagens antes do processamento
zh_tw: 處理之前不要移除圖片參照

source: Keep text &color, when possible
fr: Conserver la &couleur du texte, lorsque c’est possible
it: Mantieni &colore del testo quando possibile
nl: Tekst &kleur behouden, indien mogelijk
pt: Manter &cor do texto, quando possível
zh_tw: 可能的話，保留文字顏色

source: How to handle &CSS
fr: Comment traiter le &CSS
it: Come gestire i &CSS
nl: Hoe &CSS te behandelen
pt: Como gerir &CSS
zh_tw: 如何處理 &CSS

source: Use book title as the filename for the HTML file
fr: Utiliser le titre du livre comme nom de fichier pour le fichier HTML
it: Usa il titolo del libro come nome del file HTML
nl: Gebruik de boektitel als naam voor het HTML-bestand
pt: Usar título do livro como nome para o ficheiro HTML
zh_tw: 使用書名作為 HTML 的檔案名稱

source: Insert &empty line between paragraphs
fr: Insérer une ligne vid&e entre les paragraphes
it: Inserisci riga &vuota tra i paragrafi
nl: Invoegen &leegmaken lijn tussen alinea's
pt: Inserir linha em &branco entre parágrafos
zh_tw: 在段落之間插入空行

source: Don't indent the &first line for each paragraph
fr: Ne pas indenter la &première ligne de chaque paragraphe
it: Non far rientrare la &prima riga di ogni paragrafo
nl: Laat de &eerste regel voor elke alinea niet inspringen
pt: Não indentar a &primeira linha de cada parágrafo
zh_tw: 每個段落的第一行不縮排

source: Hide &chapter name
fr: Masquer les noms de &chapitres
it: Nascondi nome del &capitolo
nl: Verberg &hoofdstuk naam
pt: &Ocultar nome do capítulo
zh_tw: 隱藏章節名稱

source: Optimize for full-&screen mode
fr: Optimi&ser pour le mode plein écran
it: Ottimizza per modalità a &schermo intero
nl: Optimaliseer voor full-&screen modus
pt: &Otimizar visualização para ecrã inteiro
zh_tw: 為全螢幕模式最佳化(&S)

source: Done
fr: Terminé
it: Completato
nl: Klaar
pt: Concluído
zh_tw: 完成

source: control+click
fr: contrôle+clic
nl: control+klik
zh_tw: control+點擊

source: Regex
fr: Expression rationelle
zh_tw: 正則表達式

source: Interface
it: Interfaccia
zh_tw: 介面

source: URL:
zh_tw: 網址：

source: {} min
fr: {} minute
zh_tw: {} 分鐘

source: Serif
nl: Schreef
zh_tw: 襯線

source: Sans-serif
nl: Schreefloos
zh_tw: 無襯線
