Repository: debian-calibre/calibre
Catalog: translations-git/content-server/*.po
Languages: fr, it, nl, pt, zh_tw

source: Deleting local book copy, please wait...
fr: Suppression de la copie locale du livre, merci de patienter...
it: Eliminazione della copia locale del libro. Attendi...
nl: Verwijderen van lokale kopie van boek, even geduld a.u.b....
pt: A eliminar cópia local do livro. Por favor aguarde...
zh_tw: 正在刪除本機書籍副本，請稍候...

source: Failed to delete book
fr: Échec de la suppression du livre
it: Impossibile eliminare il libro
nl: Verwijderen van boek mislukt
pt: Erro ao eliminar livro
zh_tw: 無法刪除書本

source: Failed to delete book from local storage, click "Show details" for more information.
fr: Impossible de supprimer le livre du stockage local, cliquez sur "Afficher les détails" pour plus d'information.
it: Impossibile eliminare il libro dall'archivio locale. Fai clic su "Mostra dettagli" per ulteriori informazioni.
nl: Verwijderen van boek van de lokale opslag mislukt, klik op 'Toon details' voor meer informatie.
pt: Não foi possível apagar livro do armazenamento local, clique em "Mostrar detalhes" para mais informações.
zh_tw: 無法從本機儲存空間刪除這本書，請點選 「顯示詳細資料」查看更多資訊。

source: Syncing last read position and annotations
fr: Synchronisation de la dernière position de lecture et des annotations
it: Sto sincronizzando l'ultima posizione di lettura e le annotazioni
nl: Laatste gelezen positie en annotaties synchroniseren
pt: Sincronizar última posição lida e anotações
zh_tw: 正在同步上次閱讀位置和註解

source: Downloading data from server, please wait...
fr: Téléchargement des données du serveur, veuillez patienter...
it: Scaricamento dati dal server, attendere prego...
nl: Gegevens downloaden van de server, even geduld ...
pt: A descarregar dados do servidor. Por favor, aguarde...
zh_tw: 正在從伺服器下載資料，請稍候…

source: Failed to fetch sync data
fr: Échec lors de la récupération des données synchronisées
it: Fallito il recupero dei dati sincronizzati
nl: Ophalen van de sync gegevens is mislukt
pt: Falha ao obter aos dados sincronizados
zh_tw: 無法接收同步資料

source: You must setup user accounts and login to use the sync functionality
fr: Vous devez paramétrer les comptes utilisateurs et vous connecter pour utiliser la fonctionnalité de synchronisation
it: Imposta account utente e fai il login per usare le funzionalità di sincronizzazione
nl: U moet gebruikersaccounts instellen en inloggen om de synchronisatie functionaliteit te gebruiken
pt: Tem de configurar contas de utilizador e autenticar-se antes de poder usar a funcionalidade de sincronização
zh_tw: 您必須設定使用者帳號並登入以使用同步功能

source: Failed to download sync data from server, click "Show details" for more information.
fr: Le téléchargement des données de synchronisation du serveur n'a pas réussi, cliquez sur "Afficher les détails" pour plus d'informations.
it: Impossibile scaricare i dati di sincronizzazione dal server, fai clic su "Mostra dettagli" per maggiori informazioni.
nl: Downloaden van sync gegevens van de server mislukt, klik op "Details weergeven" voor meer informatie.
pt: Falha ao descarregar dados de sincronização do servidor. Carregue em "Mostrar detalhes" para mais informações.
zh_tw: 從伺服器下載同步資料失敗，請點選 「顯示詳細資料」查看更多資訊。

source: Sync
it: Sincronizza
pt: Sincronizar
zh_tw: 同步

source: Get last read position and annotations from the server
fr: Obtenir la dernière position de lecture et les annotations à partir du serveur
it: Ottieni l'ultima posizione di lettura e le annotazioni dal server
nl: Haal laatst gelezen positie en aantekeningen van server
pt: Obter última posição de leitura e anotações do servidor
zh_tw: 從伺服器獲得上次閱讀位置和註解

source: Delete
fr: Supprimer
it: Elimina
nl: Verwijderen
pt: Apagar
zh_tw: 刪除

source: Delete this book from local storage
fr: Supprimer ce livre du stockage local
it: Elimina questo libro dalla memoria locale
nl: Verwijder dit boek uit de lokale opslag
pt: Apagar este livro da pasta local
zh_tw: 從本機儲存空間刪除此書

source: Reload
fr: Recharger
it: Ricarica
nl: Vernieuwen
pt: Recarregar
zh_tw: 重新載入

source: Reload this book from the {}
fr: Recharger ce livre à partir depuis votre {}
it: Ricarica questo libro dal {}
nl: Laad het boek opnieuw van de {}
pt: Recarregar este livro de {}
zh_tw: 從 {} 重新載入這本書

source: computer
fr: ordinateur
pt: computador
zh_tw: 電腦

source: server
fr: serveur
pt: servidor
zh_tw: 伺服器

source: Back
fr: Recule
it: Indietro
nl: Terug
pt: Voltar
zh_tw: 向後

source: Go back
fr: Reculer
it: Torna indietro
nl: Ga terug
pt: Voltar
zh_tw: 返回

source: Forward
fr: Avance
it: Avanti
nl: Volgende
pt: Avançar
zh_tw: 向前

source: Go forward
fr: Avancer
it: Vai avanti
nl: Ga vooruit
pt: Avançar
zh_tw: 前进

source: Open book
fr: Ouvrir le livre
it: Apri libro
nl: Open boek
pt: Abrir livro
zh_tw: 開啟書本

source: Open a book
fr: Ouvrir un livre
it: Apri un libro
nl: Open een boek
pt: Abrir livro
zh_tw: 開啟書本

source: Bookmarks
fr: Signets
it: Segnalibri
nl: Bladwijzers
pt: Marcadores
zh_tw: 書籤

source: Browse all bookmarks
fr: Parcourir tous les favoris
it: Naviga tra tutti i segnalibri
nl: Bekijk alle bladwijzers
pt: Navegar em todos os marcadores
zh_tw: 瀏覽全部的書籤

source: Highlights
fr: Mises en évidence
it: Evidenziazioni
nl: Markeringen
pt: Realces
zh_tw: 醒目提示

source: Browse all highlights
fr: Parcourir toutes les mises en évidence
it: Esplora tutti le evidenziazioni
nl: Blader door alle markeringen
pt: Navegar todos os realces
zh_tw: 瀏覽所有醒目提示

source: Table of Contents
fr: Table des Matières
it: Indice
nl: Inhoudsopgave
pt: Índice
zh_tw: 目錄

source: Browse the Table of Contents
fr: Parcourir la Table des Matières
it: Visualizza l'Indice
nl: Bekijk de Inhoudstabel
pt: Navegar no índice
zh_tw: 瀏覽目錄

source: Reference mode
fr: Mode référence
it: Modalità riferimento
nl: Referentiemodus
pt: Modo de referências
zh_tw: 參考模式

source: Toggle the Reference mode
fr: Activer le mode référence
it: Attiva/disattiva la modalità Riferimento
nl: Wissel de Referentie-stand
pt: Alternar o modo de referências
zh_tw: 切換參考模式

source: Search for text in this book
fr: Rechercher après du texte dans ce livre
it: Cerca testo in questo libro
nl: Zoek naar tekst in dit boek
pt: Pesquisar neste livro por texto
zh_tw: 搜尋此書本中的文字

source: Go to
fr: Aller à
it: Vai a
nl: Ga naar
pt: Ir para
zh_tw: 移動到

source: Go to a specific location in the book
fr: Aller à un emplacement spécifique dans le livre
it: Vai a una collocazione specifica del libro
nl: Ga naar een bepaalde plek in het boek
pt: Ir para um local específico no livro
zh_tw: 前往書籍的指定位置

source: Font size
fr: Taille de police
it: Dimensione carattere
nl: Tekengrootte
pt: Tamanho da letra
zh_tw: 字體大小

source: Change text size
fr: Changer la taille du texte
it: Cambia dimensione del testo
nl: Lettergrootte wijzigen
pt: Mudar tamanho do texto
zh_tw: 更改文字大小

source: Preferences
fr: Préférences
it: Preferenze
nl: Voorkeuren
pt: Preferências
zh_tw: 偏好設定

source: Configure the E-book viewer
fr: Configurer la Visionneuse de livre numérique
it: Configura il lettore E-book
nl: Configureer de E-bookviewer
pt: Configurar o visualizador de ebooks
zh_tw: 設定電子書閱讀器

source: Home
fr: Accueil
it: Pagina iniziale
nl: Startpagina
pt: Página principal
zh_tw: 首頁

source: Return to the home page
fr: Retourner à la page d'accueil
it: Ritorna alla pagina principale
nl: Terug naar de hoofdpagina
pt: Voltar à página de entrada
zh_tw: 回到首頁

source: Library
fr: Bibliothèque
it: Biblioteca
nl: Bibliotheek
pt: Biblioteca
zh_tw: 書庫

source: Return to the library page
fr: Retour à la page bibliothèque
it: Torna alla pagina della biblioteca
nl: Ga terug naar de bibliotheekpagina
pt: Voltar à página da biblioteca
zh_tw: 回到書庫頁面

source: Exit full screen
fr: Sortir du mode plein écran
it: Esci da schermo intero
nl: Sluit volledig scherm
pt: Sair do ecrã inteiro
zh_tw: 退出全螢幕

source: Enter full screen
fr: Entrer en mode plein écran
it: Schermo intero
nl: Open volledig scherm
pt: Abrir em ecrã inteiro
zh_tw: 進入全螢幕

source: Toggle full screen mode
fr: Basculer en mode plein écran
it: Attiva/disattiva schermo intero
nl: Schakel de modus Volledig scherm in
pt: Alternar modo de ecrã inteiro
zh_tw: 切換全螢幕模式

source: Print
fr: Imprimer
it: Stampa
nl: Afdrukken
pt: Imprimir
zh_tw: 列印

source: Print book to PDF
fr: Imprimer le livre au format PDF
it: Stampa libro in PDF
nl: Afdrukken naar PDF
pt: Imprimir livro para PDF
zh_tw: 將書籍列印為 PDF

source: Stop auto scroll
fr: Arrêt du défilement automatique
it: Ferma auto scorrimento
nl: Stop automatisch bladeren
pt: Parar rolamento automático
zh_tw: 停止自動捲動

source: Auto scroll
fr: Défilement automatique
it: Auto scorrimento
nl: Automatisch bladeren
pt: Rolamento automático
zh_tw: 自動捲動

source: Toggle auto-scrolling
fr: Basculer vers le défilement automatique
it: Attiva/disattiva auto scorrimento
nl: Schakel automatisch bladeren in
pt: Alternar rolamento automático
zh_tw: 切換自動捲動

source: Read aloud
fr: Lire à voix haute
it: Leggi ad alta voce
nl: Lees hardop
pt: Ler em voz alta
zh_tw: 朗讀

source: Read the book aloud
fr: Lire le livre à voix haute
it: Leggi il libro ad alta voce
nl: Lees het boek hardop
pt: Ler livro em voz alta
zh_tw: 大聲朗讀這本書

source: Lookup/search word
fr: Consulter/rechercher un mot
it: Ricerca parole
nl: Kijk/zoek woord
pt: Termo a pesquisar/consultar
zh_tw: 查詢/搜尋單字

source: Lookup or search for the currently selected word
fr: Consulter ou rechercher le mot actuellement sélectionné
it: Ricerca parola attualmente selezionata
nl: Bekijk of zoek naar het huidige geselecteerde woord
pt: Consultar ou procurar a palavra atualmente selecionada
zh_tw: 查詢或搜尋目前選取的單字

source: Copy link
fr: Copier le lien
it: Copia link
nl: Kopieer link
pt: Copiar hiperligação
zh_tw: 複製連結

source: Copy the current link
fr: Copier le lien en cours
it: Copia il link attuale
nl: Kopieer de huidige link
pt: Copiar a ligação atual
zh_tw: 複製目前的連結

source: View image
fr: Voir l'image
it: Visualizza immagine
nl: Bekijk afbeelding
pt: Ver imagem
zh_tw: 檢視圖片

source: View the current image
fr: Voir l'image en cours
it: Visualizza l'immagine attuale
nl: Bekijk de huidige afbeelding
pt: Ver a imagem atual
zh_tw: 檢視目前的圖片

source: Copy image
fr: Copier l'image
it: Copia immagine
nl: Kopieer afbeelding
pt: Copiar imagem
zh_tw: 複製圖片

source: Copy the current image
fr: Copier l'image en cours
it: Copia immagine attuale
nl: Kopieer de huidige afbeelding
pt: Copiar a imagem atual
zh_tw: 複製目前的圖片

source: Inspector
fr: Inspecteur
it: Ispettore
nl: Inspecteren
pt: Inspetor
zh_tw: 元素查看器

source: Show the content inspector
fr: Afficher l'inspecteur de contenu
it: Mostra l'ispettore del contenuto
nl: Toon de inhoudscontrole
pt: Mostrar o inspetor de conteúdo
zh_tw: 顯示內容查看器

source: Reset interface
fr: Réinitialiser l'interface
it: Ripristina interfaccia
pt: Repor interface
zh_tw: 重設介面

source: Reset E-book viewer panels, toolbars and scrollbars to defaults
fr: Réinitialiser les panneaux, les barres d'outils et les barres de défilement de la Visionneuse de livre numérique aux valeurs par défaut
it: Ripristina i pannelli, le barre degli strumenti e le barre di scorrimento del lettore E-book ai valori predefiniti
nl: Reset e-bookviewerpanelen, werkbalken en schuifbalken naar de standaardwaarden
pt: Repor, para os padrões, os painéis do visualizador de ebooks, barras de ferramentas e barras de rolagem
zh_tw: 将E-book查看面板、工具栏和滚动条重置为默认值

source: Are you sure you want to reset the viewer interface to its default appearance?
fr: Êtes-vous sûr de vouloir réinitialiser l'interface de visualisation à son apparence par défaut ?
it: Sei sicuro di voler ripristinare l'interfaccia del lettore al suo aspetto predefinito?
nl: Weet u zeker dat u de viewer interface naar z'n standaard weergave wilt terug zetten?
pt: Tem certeza que deseja repor a interface do visualizador para a sua aparência padrão?
zh_tw: 你确定要将阅读器界面重设为默认样式吗？

source: Quit
fr: Quitter
it: Esci
nl: Afsluiten
pt: Sair
zh_tw: 結束

source: Close the E-book viewer
fr: Fermer la Visionneuse de livre numérique
it: Chiudi il lettore E-book
nl: Sluit de e-bookviewer
pt: Fechar o visualizador de ebooks
zh_tw: 關閉電子書閱讀器

source: Close the viewer controls
fr: Fermer les contrôles de la visionneuse
it: Nascondi i controlli del lettore
nl: Sluit de viewer bediening
pt: Fechar controlos do visualizador
zh_tw: 关闭阅读器控件

source: Help
fr: Aide
it: Aiuto
nl: Hulp
pt: Ajuda
zh_tw: 說明

source: Lookup: {}
fr: Recherche : {}
it: Ricerca: {}
nl: Opzoeken: {}
pt: Limitador de pesquisa: {}
zh_tw: 查詢：{}

source: Are you sure you want to reload this book?
fr: Êtes-vous sûr de vouloir recharger ce livre ?
it: Sei sicuro di voler ricaricare questo libro?
nl: Weet u zeker dat u dit boek wilt herladen?
pt: Tem a certeza de querer recarregar este livro?
zh_tw: 您確定要重新載入此書本嗎？

source: Reload book
fr: Recharger le livre
it: Ricarica libro
nl: Boek herladen
pt: Recarregar livro
zh_tw: 重新載入書本

source: Go to…
fr: Aller à...
it: Vai a...
nl: Ga naar...
pt: Ir para...
zh_tw: 移至…

source: Edit the metadata for this book in the library
fr: Modifier les métadonnées pour ce livre dans la bibliothèque
it: Modifica i metadati di questo libro nella biblioteca
nl: Bewerk metadata voor dit boek in de bibliotheek
pt: Editar metadados deste livro na biblioteca
zh_tw: 编辑书库中书籍的元数据

source: Path:
fr: Chemin :
it: Percorso:
nl: Pad:
pt: Caminho:
zh_tw: 路徑：

source: Click to open the folder the book is in
fr: Cliquer pour ouvrir le dossier dans lequel se trouve le livre
it: Fai clic per aprire la cartella in cui si trova il libro
nl: Klik om de map te openen waar het boek in is
pt: Clique para abrir a pasta onde está o livro
zh_tw: 点击以打开书籍所在的文件夹

source: Go to location, position or reference…
fr: Aller à l'emplacement, la position ou la référence...
it: Vai a collocazione, posizione o riferimento…
nl: Ga naar locatie, positie of voorkeur...
pt: Ir para localização, posição ou referência...
zh_tw: 转到位置或参考…

source: Bookmark
fr: Signet
it: Segnalibro
nl: Bladwijzer
pt: Marcador
zh_tw: 書籤

source: Do you want to permanently delete this bookmark?
fr: Êtes-vous sûr de vouloir supprimer définitivement ce signet ?
it: Vuoi eliminare definitivamente questo segnalibro?
nl: Wilt u deze bladwijzer definitief verwijderen?
pt: Deseja apagar de forma permanente este marcador?
zh_tw: 您要永久刪除這個書籤嗎？

source: Enter new title for bookmark:
fr: Entrer un nouveau titre pour le signet :
it: Inserisci un nuovo titolo per il segnalibro:
nl: Geef nieuwe titel voor bladwijzer:
pt: Introduzir o novo título para o marcador:
zh_tw: 编辑书签标题

source: Remove this bookmark
fr: Supprimer ce signet
it: Rimuovi questo segnalibro
nl: Deze bladwijzer verwijderen
pt: Remover este marcador
zh_tw: 移除這個書籤

source: Edit this bookmark
fr: Éditer ce signet
it: Modifica questo segnalibro
nl: Deze bladwijzer bewerken
pt: Editar este marcador
zh_tw: 編輯這個書籤

source: Enter title for bookmark:
fr: Entrer un titre pour le signet :
it: Digita il titolo per il segnalibro:
nl: Geef titel voor bladwijzer:
pt: Introduzir o título para o marcador
zh_tw: 編輯書籤標題：

source: New bookmark
fr: Nouveau signet
it: Nuovo segnalibro
nl: Nieuwe bladwijzer
pt: Novo marcador
zh_tw: 新書籤

source: Welcome to the <b>calibre E-book viewer</b>!
fr: Bienvenue dans la <b>visionneuse de livre numérique calibre</b> !
it: Benvenuto nel <b>lettore E-book di calibre</b>!
nl: Welkom bij de <b>calibre E-bookviewer</b>!
pt: Bem-vindo ao <b>visualizador de ebooks do Calibre</b>!
zh_tw: 歡迎使用 <b>calibre 電子書檢視器</b>！

source: Use the <b>PageUp/PageDn</b> or <b>Arrow keys</b> to turn pages
fr: Utilisez les touches <b>Pagehaut/Pagebas</b> ou <b>Flèches </b> pour tourner les pages
it: Usa i tasti <b>PagSu/PagGiù</b> o le <b>frecce</b> per girare pagina
nl: Gebruik de <b>PageUp/PageDn</b> of <b>Pijl toetsen</b> om de pagina's om te slaan
pt: Use as teclas <b>Página para cima/Página para baixo</b> ou as teclas de <b>Setas</b> para virar páginas
zh_tw: 使用 <b>PageUp/PageDn</b> 或<b>方向鍵</b>來翻頁

source: Press the <b>Esc</b> key or <b>{}</b> or <b>tap on the top third</b> of the text area to show the viewer controls
fr: Appuyer sur la touche <b>Echap</b>, <b>cliquer {}</b> ou <b>tapoter sur le tiers supérieur</b> de la zone de texte pour afficher les commandes de la visionneuse
it: Premi <b>Esc</b> o <b>{}</b> o <b>tocca sul primo terzo</b> dell'area di testo per mostrare i controlli di visualizzazione
nl: Druk op de <b>Esc</b> toets of <b>{}</b> of <b>tik op het bovenste derde deel</b> van het tekstgebied om de bedieningselementen van de lezer weer te geven
pt: Premir tecla <b>Esc</b> ou <b>{}</b> ou <b>toque no terço superior</b> da área de texto para mostrar os controlos do visualizador
zh_tw: 按 <b>Esc</b> 鍵或 <b>{}</b> 或 <b>點擊文字區域的上三分之一</b>來顯示閱讀器控制介面

source: right click
fr: clic droit
it: clic destro
nl: klik rechts
pt: Clique direito
zh_tw: 按右鍵

source: Press any key to continue…
fr: Appuyez sur n'importe quelle touche pour continuer...
it: Premi un tasto per continuare...
nl: Gebruik een willekeurige toets om verder te gaan...
pt: Prima uma tecla qualquer para continuar...
zh_tw: 按任意鍵繼續…

source: Tap to turn back
fr: Tapoter pour revenir en arrière
it: Tocca per tornare indietro
nl: Tik om terug te gaan
pt: Toque no ecrã para voltar atrás
zh_tw: 點擊以向後翻頁

source: Tap to turn page
fr: Tapoter pour tourner la page
it: Tocca per voltare pagina
nl: Tik om de pagina om te draaien
pt: Toque no ecrã para virar a página
zh_tw: 點擊以翻頁

source: Tap (or right click) for controls
fr: Tap (ou clic droit) pour les contrôles
it: Tocca (o clic destro) per i controlli
nl: Tik (of rechtsklikken) voor de controleknoppen
pt: Toque (ou clique direito) para ver controlos
zh_tw: 點擊（或按右鍵）來顯示控制介面

source: Bootstrapping book reader...
fr: Amorçage du lecteur de livre....
it: Carico il lettore di libri...
nl: Lezer aan het opzetten
pt: Inicialização do leitor de livros...
zh_tw: 正在啟動書本閱讀器...

source: Not a calibre library book
fr: Ce n'est pas un livre de bibliothèque calibre
it: Il libro non è parte della biblioteca di calibre
nl: Geen calibre bibliotheekboek
pt: Não é um livro de biblioteca Calibre
zh_tw: 不是 calibre 書庫的書本

source: This book is not a part of a calibre library, so no calibre:// URL for it exists.
fr: Ce livre ne fait pas partie d'une bibliothèque calibre, donc il n'existe pas d'URL calibre:// pour lui.
it: Questo libro non fa parte di una biblioteca di calibre, perciò non possiede alcun URL calibre://
nl: Dit boek maakt geen deel uit van een calibre-bibliotheek, dus er bestaat geen calibre:// URL voor.
pt: Este livro não faz parte de uma biblioteca Calibre, por isso não existe um URL calibre:// para ele.
zh_tw: 此书不属于calibre library,无法跳转到calibre:// URL.

source: The text: <i>{}</i> is present on this page but not visible
fr: Le texte : <i>{}</i> est présent sur cette page mais non visible
it: Il testo: <i>{}</i> è presente nella pagina ma non è visibile
nl: De tekst: <i>{}</i> is aanwezig op deze pagina maar niet zichtbaar
pt: O texto: <i>{}</i> está presente nesta página mas não é visível
zh_tw: 文字：<i>{}</i> 存在於這一頁，但是不可見

source: There was an error processing the book
fr: Une erreur est survenue durant l'exécution du livre
it: Si è verificato un errore durante l'elaborazione del libro
nl: Er heeft een fout plaatsgevonden tijdens het verwerken van het boek
pt: Ocorreu um erro ao processar o livro
zh_tw: 處理這本書時發生錯誤

source: Unknown error
fr: Erreur inconnue
it: Errore sconosciuto
nl: Onbekende fout
pt: Erro desconhecido
zh_tw: 不明的錯誤

source: No auto scroll in paged mode
fr: Pas de défilement automatique en mode page
it: L'auto scorrimento non è possibile in modalità Pagine
nl: Geen automatisch bladeren in paginamodus
pt: Sem rolamento automático no modo paginado
zh_tw: 頁面模式沒有自動捲動

source: Switch to flow mode (Viewer preferences->Page layout) to enable auto scrolling
fr: Passez en mode continu (Préférences du visualiseur->Mise en page) pour activer le défilement automatique
it: Passa alla modalità Flusso (Preferenze lettore->Impaginazione) per abilitare l'auto scorrimento
nl: Schakel naar de stroommodus (Lezer-voorkeuren-> Pagina-indeling) om automatisch bladeren in te schakelen
pt: Alternar para o modo fluido (Preferências do visualizador-> Visual da página) para ativar o rolamento automático
zh_tw: 切換到直流模式（閱讀器偏好設定->頁面配置）來啟用自動捲動

source: In flow mode
fr: En mode continu
it: In modalità Flusso
nl: In stroom modus
pt: Em modo fuido
zh_tw: 在直流模式

source: Cannot change number of pages per screen in flow mode, switch to paged mode first.
fr: Impossible de changer le nombre de pages par écran en mode continu, passez d'abord en mode page.
it: Impossibile cambiare il numero di pagine per schermata in modalità Flusso, passa prima alla modalità Pagine.
nl: Kan het aantal pagina's per scherm niet wijzigen in de stroommodus, schakel eerst naar de paginamodus.
pt: Não foi possível alterar o número de páginas por ecrã no modo fluido. Mude primeiro para o modo paginado.
zh_tw: 無法在直流模式變更每個螢幕的頁數，請先切換到頁面模式。

source: Loading next section from <i>{title}</i>, please wait…
fr: Chargement de la section suivante à partir de <i>{title}</i>, veuillez patienter....
it: Caricamento sezione successiva da <i>{title}</i>, attendere…
nl: Laden volgende sectie van <i>{title} </i>, even wachten a.u.b...
pt: A carregar a próxima seção de <i>{title}</i>. Por favor, aguarde…
zh_tw: 正在從 <i>{title}</i> 載入下一個章節，請稍候…

source: Invalid book
fr: Livre non valide
it: Libro non valido
nl: Ongeldig boek
pt: Livro inválido
zh_tw: 无效的书籍

source: This book is empty, with no items in the spine
fr: Ce livre est vide, sans aucun élément dans la structure organisationnelle
it: Questo libro è vuoto, non ha elementi nel dorso
nl: Dit boek is leeg, geen items in de spine
pt: Este livro está vazio, sem itens na lombada
zh_tw: 这本书籍是空的，书脊里没有任何项目

source: Destination does not exist
fr: La destination n'existe pas
it: La destinazione non esiste
nl: Bestemming bestaat niet
pt: O destino não existe
zh_tw: 目的不存在

source: The file {} does not exist in this book
fr: Le fichier {} n'existe pas dans ce livre
it: Il file {} non esiste in questo libro
nl: Het bestand {} bestaat niet in dit boek
pt: O ficheiro {} não existe neste livro
zh_tw: 檔案 {} 在這本書中不存在

source: Unknown book
fr: Livre inconnu
it: Libro sconosciuto
nl: Onbekend boek
pt: Livro desconhecido
zh_tw: 未知書本

source: No clipboard access
fr: Pas d'accès au presse-papiers
it: Nessun accesso agli appunti
nl: Geen toegang tot het klembord
pt: Sem acesso à área de transferência
zh_tw: 沒有剪貼簿存取權限

source: Your browser requires you to access the Content server over an HTTPS connection to be able to copy to clipboard.
fr: Votre navigateur exige que vous accédiez au serveur de contenu via une connexion HTTPS pour pouvoir copier dans le presse-papiers.
it: Il tuo browser richiede che tu acceda al server dei contenuti con una connessione HTTPS per poter copiare negli appunti.
nl: Uw browser vereist dat u toegang hebt tot de inhoudsserver via een HTTPS-verbinding om naar het klembord te kunnen kopiëren.
pt: O seu navegador Web requer que você aceda ao servidor de conteúdos através de uma ligação segura HTTPS para poder copiar para a área de transferência.
zh_tw: 您的瀏覽器需要透過 HTTPS 連線存取內容伺服器才能複製到剪貼簿。

source: Could not copy to clipboard
fr: Impossible de copier dans le presse-papiers
it: Copia negli appunti fallita
nl: Kon niet naar klembord kopiëren
pt: Não foi possível copiar para a área de transferência
zh_tw: 無法複製到剪貼簿

source: No permission to write to clipboard
fr: Pas de permission d'écrire dans le presse-papiers
it: Manca il permesso di scrittura negli appunti
nl: Geen toestemming om naar het klembord te schrijven
pt: Sem permissões para escrever na área de transferência
zh_tw: 沒有寫入剪貼簿的權限

source: Book id #{}
fr: Id # du livre {}
it: Id libro #{}
nl: Boek id #{}
pt: ID do livro #{}
zh_tw: 書本 id #{}

source: book
fr: livre
it: Libro
nl: boek
pt: livro
zh_tw: 書本

source: Could not open {}. {}
fr: Impossible d'ouvrir {}. {}
it: Impossibile aprire {}. {}
nl: Kan {}. {} niet openen
pt: Não foi possível abrir {}. {}
zh_tw: 無法開啟 {}。{}

source: Go back to:
fr: Revenir à :
it: Torna a:
nl: Ga terug naar:
pt: Voltar para:
zh_tw: 返回到：
