Repository: debian-calibre/calibre
Catalog: translations-git/content-server/*.po
Languages: fr, it, nl, pt, zh_tw

source: Edit metadata for {}
fr: Modifier les métadonnées pour {}
it: Modifica metadati di {}
nl: Metadata bewerken voor {}
pt: Editar metadados de {}
zh_tw: 編輯 {} 的詮釋資料

source: Edit metadata
fr: Editer les métadonnées
it: Modifica metadati
nl: Metadata bewerken
pt: Editar metadados
zh_tw: 編輯詮釋資料

source: Loading books from the calibre library, please wait...
fr: Chargement de livres à partir de la bibliothèque calibre, veuillez patienter...
it: Caricamento dei libri dalla libreria di Calibre, attendere prego...
nl: Boeken laden van de calibre bibliotheek, even geduld aub...
pt: A carregar livros da biblioteca Calibre. Por favor, aguarde...
zh_tw: 正在從 calibre 書庫中載入書本，請稍候…

source: Restore default settings
fr: Restaurer les paramètres par défaut
it: Ripristina le impostazioni predefinite
nl: Standaardinstellingen herstellen
pt: Repor para configurações predefinidas
zh_tw: 回復預設值

source: A grid of book covers
fr: Une grille des couvertures de livre
it: Una griglia di copertine
nl: Een rooster met omslagen
pt: Grelha de capas dos livros
zh_tw: 格狀排列書本

source: Permission denied
fr: Accès refusé
it: Permesso negato
nl: Toegang geweigerd
pt: Permissão negada
zh_tw: 權限不足

source: No search query specified
fr: Aucune requête de recherche n'a été soumise
it: Nessuna query di ricerca specificata
nl: Er is geen zoekopdracht gespecificeerd
pt: Nenhum termo de pesquisa especificado
zh_tw: 未指定搜索词条

source: Do the search
fr: Fait la recherche
it: Effettua la ricerca
nl: Opzoeken
pt: Efetuar pesquisa
zh_tw: 進行搜尋

source: Search for books
fr: Rechercher des livres
it: Ricerca libri
nl: Naar boeken zoeken
pt: Pesquisar livros
zh_tw: 搜尋書本

source: Enter words to search for
fr: Entrez les mots à rechercher
it: Inserisci parole da cercare
nl: Woorden om naar te zoeken invoeren
pt: Inserir termos a pesquisar
zh_tw: 輸入要搜尋的單字

source: With this option searching for words will also match on any related words (supported in several languages). For example, in the English language: {0} matches {1} and {2} as well
it: Con questa opzione la ricerca di parole corrisponderà anche a qualsiasi parola correlata (supportata in diverse lingue). Ad esempio, in lingua inglese: {0} corrisponde anche a {1} e {2}
pt: Com esta opção, a pesquisa de palavras também fará correspondências com quaisquer palavras relacionadas (suportado por diversos idiomas). Por exemplo, no idioma inglês: {0} corresponderá com {1} e também com {2}.

source: Re-index all books in this library
fr: Réindexer tous les livres de cette bibliothèque
it: Reindicizza tutti i libri di questa biblioteca, libreria
nl: Herindexeer alle boeken in deze bibliotheek
pt: Reindexar todos os livros desta biblioteca
zh_tw: 重建書庫中所有書本的索引

source: You are not authorized to view this site
fr: Vous n'êtes pas autorisé à visualiser ce site
it: Non sei autorizzato a visualizzare questo sito
nl: U bent niet geautoriseerd om deze site te bekijken
pt: Não está autorizado a ver este sítio
zh_tw: 您無權查看此網站

source: You are using a browser that does not have the iframe srcdoc attribute. This is not supported. Use a better browser such as <b>Google Chrome</b> or <b>Mozilla Firefox</b>, instead. You can also use the simplified <a href="mobile">/mobile</a> interface if you do not have access to a modern browser.
fr: Vous utilisez un navigateur qui n'a pas l'attribut iframe srcdoc. Ceci n'est pas pris en charge. Utiliser un meilleur navigateur tel que <b>Google Chrome</b> ou <b>Mozilla Firefox</b>, à la place. Vous pouvez aussi utiliser l'interface simplifiée <a href="mobile">/mobile</a> si vous n'avez pas accès à un navigateur récent.
it: Il tuo browser non ha l'attributo iframe srcdoc. Questo attributo non è supportato. Utilizza un altro browser come <b>Google Chrome</b> oppure <b>Mozilla Firefox</b>. Puoi utilizzare anche l'interfaccia semplificata <a href=*mobile*>/mobile</a> se non hai accesso a browser moderni.
nl: U gebruikt een browser die het iframe srcdoc-kenmerk niet heeft. Dit wordt niet ondersteund. Gebruik in plaats daarvan een betere browser, zoals <b>Google Chrome</b> of <b>Mozilla Firefox</b>. U kunt ook de vereenvoudigde <a href="mobile">/mobile</a> interface gebruiken als u geen toegang heeft tot een moderne browser.
pt: Está a usar um browser que não respeita o atributo iframe srcdoc. Tal não é suportado. Use um browser melhor, como o <b>Google Chrome</b> ou o <b>Mozilla Firefox</b>. Pode também utilizar a interface simplificada <a href="mobile">/mobile</a> se não tem acesso a um browser moderno.
zh_tw: 您正在使用沒有 iframe srcdoc 屬性的瀏覽器。這不被支援。請改用較好的瀏覽器，例如 <b>Google Chrome</b> 或 <b>Mozilla Firefox</b>。如果您無法使用現代的瀏覽器，您也可以使用簡化的 <a href="mobile">/mobile</a> 介面。

source: Could not get more books
fr: Impossible d'obtenir plus de livres
it: Impossibile ottenere altri libri
nl: Kon niet meer boeken ophalen
pt: Não foi possível obter mais livros
zh_tw: 無法得到更多書本

source: Show more books
fr: Montrer plus de livres
it: Mostra altri libri
nl: Laat meer boeken zien
pt: Mostrar mais livros
zh_tw: 顯示更多書本

source: Fetching metadata for more books, please wait
fr: Récupération des métadonnées pour plus de livres, veuillez patienter
it: Raccolta metadati per ulteriori libri, attendi...
nl: Metadata voor meer boeken ophalen, een moment geduld
pt: A obter metadados para mais livros, por favor, aguarde
zh_tw: 正在取得更多書本的詮釋資料，請稍候

source: Showing Virtual library: {}
fr: Afficher la Bibliothèque virtuelle : {}
it: Mostrando la libreria Virtuale: {}
nl: Virtuele bibliotheek tonen: {}
pt: Mostrando a biblioteca virtual:{}
zh_tw: 顯示虛擬書庫： {}

source: Show all books in library
fr: Afficher tous les livres dans la bibiliothèque
it: Mostra tutti i libri nella libreria
nl: Alle boeken in de bibliotheek weergeven
pt: Mostrar todos os livros na biblioteca
zh_tw: 顯示書庫中全部的書本

source: Showing books matching:
fr: Montrer les livres correspondants :
it: Libri corrispondenti:
nl: Alle boeken weergeven die overeenkomen met:
pt: Mostrar livros que correspondam:
zh_tw: 顯示符合的書本:

source: (total matches: {})
fr: (total des correspondances : {})
it: (numero di risultati: {})
nl: (Alle overeenkomsten: {})
pt: (total de correspondências: {})
zh_tw: （所有符合：{}）

source: Clear search
fr: Effacer la recherche
it: Cancella la ricerca
nl: Wis zoekopdracht
pt: Limpar pesquisa
zh_tw: 清除搜尋內容

source: No books matching:
fr: Aucun livre ne correspond :
it: Nessun libro trovato:
nl: Geen boeken komen overeen met:
pt: Nenhum livro correspondente:
zh_tw: 沒有符合的書本:

source: Sort books
fr: Trier les livres
it: Ordina i libri
nl: Sorteer boeken
pt: Ordenar livros
zh_tw: 書本排序

source: More actions
fr: Actions supplémentaires
it: Altre azioni
nl: Meer acties
pt: Mais ações
zh_tw: 更多操作

source: No books found
fr: Aucuns livres trouvés
it: Nessun libro trovato
nl: Geen boeken gevonden
pt: Nenhum livro encontrado
zh_tw: 找不到書本

source: Username/password required, retrying...
fr: Nom d'utilisateur/mot de passe requis, nouvel essai...
it: Sono richiesti Username/Password, riprova...
nl: Gebruikersnaam / wachtwoord vereist, opnieuw proberen ...
pt: É necessário um nome de utilizador/senha. A tentar novamente...
zh_tw: 需要使用者名稱/密碼，正在重試...

source: Failed to load books from calibre library, with error:
fr: Échec du chargement des livres à partir de la bibliothèque calibre, erreur :
it: Impossibile caricare i libri dalla libreria di Calibre, con errore:
nl: Het laden van de boeken uit de calibre bibliotheek is mislukt, met fout:
pt: Falha ao carregar livros da biblioteca Calibre, com o erro:
zh_tw: 無法從 calibre 書庫中載入更多書本，錯誤為：

source: Go back to the home page
fr: Revenir à la page d'accueil
it: Ritorna alla pagina principale
nl: Ga terug naar de hoofdpagina
pt: Voltar à página de entrada
zh_tw: 回到首頁

source: Total number of books: {}
fr: Nombre total de livres : {}
it: Numero totale dei libri: {}
nl: Totaal aantal boeken:{}
pt: Número total de livros: {}
zh_tw: 總共書本數量：{}

source: Loading books from the {} calibre library, please wait...
fr: Chargement de livres à partir de la bibliothèque calibre {}, veuillez patienter...
it: Caricamento dei libri dalla {} libreria di Calibre in corso, attendere prego
nl: Boeken laden van de {} calibre bibliotheek, even geduld aub...
pt: A carregar livros da biblioteca Calibre: {}. Por favor, aguarde...
zh_tw: 正在從 {} calibre 書庫中載入書本，請稍候…

source: Sort books by…
fr: Trier les livres par...
it: Ordina i libri per...
nl: Boeken sorteren op...
pt: Ordenar livros por...
zh_tw: 按… 排序書本

source: Reverse current sort order
fr: Inverser l'ordre de tri actuel
it: Inverti l'ordine attuale
nl: Huidige volgorde omkeren
pt: Reverter a ordenação atual
zh_tw: 反向目前的排序順序

source: Change how the list of books is sorted
fr: Changer la manière dont la liste des livres est triée
it: Modifica l'ordinamento dei libri
nl: Verander hoe de lijst met boeken is gesorteerd
pt: Alterar o modo de ordenação da lista de livros
zh_tw: 變更書本的排列方式

source: Choose Virtual library…
fr: Choisir une Bibliothèque virtuelle...
it: Scegli la libreria Virtuale...
nl: Kies virtuele bibliotheek...
pt: Escolher biblioteca virtual
zh_tw: 選擇虛擬書庫…

source: Choose a Virtual library to browse from the list below
fr: Choisir une Bibliothèque virtuelle à partir de la liste ci-dessous
it: Scegli una libreria Virtuale da visualizzare dalla lista seguente
nl: Kies een virtuele bibliotheek in onderstaande lijst
pt: Escolher, da lista abaixo, uma biblioteca virtual a navegar
zh_tw: 從清單中選擇一個要瀏覽的虛擬書庫

source: Choose book list mode…
fr: Choisir le mode liste de livres...
it: Scegli il modo di visualizzazione della lista dei libri...
nl: Kies boekenlijst modus...
pt: Escolher modo de listagem de livros
zh_tw: 選擇書本清單模式…

source: Cover grid
fr: Grille de couvertures
it: Griglia delle copertine
nl: Omslagenrooster
pt: Grelha de capas
zh_tw: 封面窗格

source: Detailed list
fr: Liste détaillée
it: Elenco dettagliato
nl: Gedetailleerde lijst
pt: Lista detalhada
zh_tw: 詳細清單

source: Custom list
fr: Liste personnalisée
it: Elenco personalizzato
nl: Aangepaste lijst
pt: Lista personalizada
zh_tw: 自訂清單

source: Choose a display mode for the list of books from below
fr: Ci-dessous, choisir un mode d'affichage pour la liste de livres
it: Scegli un modo di visualizzazione dei libri dalla lista seguente
nl: Kies een weergave modus voor de boekenlijst uit onderstaande
pt: Escolha abaixo um modo de visualização para a lista de livros
zh_tw: 從下面選擇一個書本清單的顯示模式

source: More actions…
fr: Actions supplémentaires...
it: Altre azioni...
nl: Meer acties...
pt: Mais ações...
zh_tw: 更多動作…

source: Book list mode
fr: Livres en mode liste
it: Modalità della lista dei libri
nl: Boekenlijstmodus
pt: Modo de lista de livros
zh_tw: 書本清單模式

source: Change how the list of books is displayed
fr: Changer la manière dont la liste des livres est affichée
it: Mostra come la lista dei libri viene mostrata
nl: Verander hoe de lijst met boeken wordt weergegeven
pt: Altera o modo como a lista de livros é exibida
zh_tw: 變更書本清單的顯示方式

source: A random book
fr: Un livre au hasard
it: Un libro a caso
nl: Willekeurig boek
pt: Um livro ao acaso
zh_tw: 隨機抽選書本

source: Choose a random book from the library
fr: Choisir un livre au hasard de la bibliothèque
it: Scegli un libro a caso dalla libreria
nl: Kies een willekeurig boek uit de bibliotheek
pt: Escolher aleatoriamente um livro da biblioteca
zh_tw: 從書庫隨機選一本書

source: Choose Virtual library
fr: Choisir une Bibliothèque virtuelle
it: Scegli la libreria Virtuale
nl: Kies virtuele bibliotheek
pt: Escolher biblioteca virtual
zh_tw: 選擇虛擬書庫

source: Browse books in a Virtual library
fr: Parcourir les livres dans une Bibliothèque virtuelle
it: Sfoglia i libri nella libreria Virtuale
nl: Bekijk boeken in een virtuele bibliotheek
pt: Navegar em livros de uma biblioteca virtual
zh_tw: 在虛擬書庫中瀏覽書本

source: A list with thumbnails and some book details
fr: Une liste avec des vignettes et certains détails du livre
it: Una elenco con miniature e qualche dettaglio del libro
nl: Een lijst van boeken in postzegelformaat met bijbehorende gegevens
pt: Uma lista com miniaturas e alguns detalhes dos livros
zh_tw: 一個帶有縮略圖和一些圖書詳情的清單

source: What would you like to do with the {} format?
fr: Que voudriez-vous faire avec le format {} ?
it: Cosa vorresti fare con il formato {}?
nl: Wat zou u willen doen met het {} formaat?
pt: O que pretende fazer com o formato {}?
zh_tw: 你想對 {} 格式做什麼？

source: Read
fr: Lire
it: Leggi
nl: Lezen
pt: Ler
zh_tw: 閱讀

source: File size: {}
fr: Taille de fichier : {}
it: Dimensioni file: {}
nl: Bestandgrootte: {}
pt: Tamanho do ficheiro: {}
zh_tw: 檔案大小：{}

source: Click to see books with {0}: {1}
fr: Cliquer pour voir les livres avec {0} : {1}
it: Fai clic per vedere i libri con {0}: {1}
nl: Klik hier om te zien welke boeken {0}: {1} bevatten
pt: Clique para ver livros com {0}: {1}
zh_tw: 點選以 {0}：{1} 來開啟書本

source: Click to open
pt: Clicar para abrir

source: Read or download this book in the {} format
fr: Lire ou télécharger ce livre au format {}
it: Leggi o scarica il libro in formato {}
nl: Dit boek lezen of afhalen in het {} formaat
pt: Ler ou descarregar este livro no formato {}
zh_tw: 以 {} 格式閱讀或下載書本

source: Click to see books with language: {}
fr: Cliquer pour voir les livres en langue : {}
it: Fai clic per vedere il libro con il linguaggio: {}
nl: Klik om boeken te zien in de taal: {}
pt: Clique para ver livros com o idioma: {}
zh_tw: 點選以使用「{}」語言來閱讀書本

source: {0} of <a>{1}</a>
fr: {0} de <a>{1}</a>
it: {0} di <a>{1}</a>
nl: {0} van <a>{1}</a>
pt: {0} de <a>{1}</a>
zh_tw: {0} / <a>{1}</a>

source: No book found
fr: Pas de livre trouvé
it: Nessun libro trovato
nl: Geen boek gevonden
pt: Nenhum livro encontrado
zh_tw: 沒找到任何書本

source: {} by {} Click to read
fr: {} par {} Cliquer pour lire
it: {} di {} Fai clic per leggere
nl: {} door {} Klik om te lezen
pt: {} por {} Clicar para ler
zh_tw: {} 由 {} 點擊以閱讀

source: Previous book [Ctrl+Left]
fr: Livre précédent (Ctrl + Gauche)
it: Libro precedente [Ctrl+Sinistra]
nl: Vorig boek [Ctrl+Left]
pt: Livro anterior [Ctrl+Esquerda]
zh_tw: 上一本書 [Ctrl+Left]

source: Next book [Ctrl+Right]
fr: Livre suivant (Ctrl + Droite)
it: Libro successivo [Ctrl+Destra]
nl: Volgend boek [Ctrl+Right]
pt: Livro seguinte [Ctrl+Direita]
zh_tw: 下一本書本[Ctrl+Right]

source: Read this book [V]
fr: Lire ce livre [V]
it: Leggi questo libro [V]
nl: Dit boek lezen [V]
pt: Ler este livro [V]
zh_tw: 閱讀這本書本[V]

source: Download this book in the {0} format ({1})
fr: Télécharger ce livre au format {0} ({1})
it: Scarica questo libro nel formato {0} ({1})
nl: Download dit boek in het {0} formaat ({1})
pt: Descarregar este livro no formato {0} - ({1})
zh_tw: 以 {0} 格式下載書本 ({1})

source: Convert this book to another format [C]
fr: Convertir ce livre dans un autre format [C]
it: Converti questo libro in un altro formato [C]
nl: Dit boek naar een ander formaat converteren [C]
pt: Converter este livro para outro formato [C]
zh_tw: 轉換這本書本成另一種格式[C]

source: Edit the metadata for this book [E]
fr: Modifier les métadonnées de ce livre [E]
it: Modifica i metadati di questo libro [E]
nl: De metadata voor dit boek bewerken [E]
pt: Editar os metadados deste livro [E]
zh_tw: 編輯這本書本的詮釋資料[E]

source: Delete this book
fr: Supprimer ce livre
it: Elimina questo libro
nl: Verwijder dit boek
pt: Eliminar este livro
zh_tw: 刪除此書本

source: Show a random book
fr: Afficher un livre au hasard
it: Mostra un libro a caso
nl: Laat een willekeurig boek zien
pt: Exibir um livro ao acaso
zh_tw: 隨機顯示一本書本

source: Could not fetch metadata for book
fr: Impossible de récupérer les métadonnées pour le livre
it: Impossibile raccogliere metadati per il libro
nl: Kon de metadata van het boek niet ophalen
pt: Não foi possível obter metadados para o livro
zh_tw: 無法取得書本的詮釋資料

source: Fetching metadata for the book, please wait
fr: Récupération des métadonnées pour le livre, veuillez patienter
it: Raccolta metadati per il libro, attendi...
nl: Metadata van het boek ophalen, een moment geduld
pt: A obter dados para o livro, por favor, aguarde
zh_tw: 正在取得書本的詮釋資料，請稍候

source: Show important metadata
fr: Afficher les métadonnées importantes
it: Mostra i metadati importanti
nl: Toon belangrijke metadata
pt: Mostrar metadados importantes
zh_tw: 顯示重要的詮釋資料

source: Show only the important metadata fields in the book details
fr: Afficher uniquement les champs de métadonnées importants dans les détails du livre
it: Mostra solo i metadati importanti nei dettagli del libro
nl: Toon enkel de belangrijkste metadata velden in de boekgegevens
pt: Mostrar apenas os campos de metadados importantes nos detalhes do livro
zh_tw: 只在書本詳細資料顯示重要的詮釋資料

source: Show all metadata
fr: Afficher toutes les métadonnées
it: Mostra tutti i metadati
nl: Toon alle metadata
pt: Mostrar todos os metadados
zh_tw: 顯示全部的詮釋資料

source: Show all metadata fields in the book details
fr: Afficher tous les champs de métadonnées dans les détails du livre
it: Mostra tutti i metadati nei dettagli del libro
nl: Toon alle metadata in de boekdetails
pt: Mostrar todos os campos de metadados nos detalhes do livro
zh_tw: 在書本詳細資料顯示全部的詮釋資料

source: Search for this author or book on various websites
fr: Rechercher cet auteur ou ce livre sur différents sites web
it: Cerca questo autore o libro in diversi siti
nl: Zoek deze auteur of dit boek op verschillende websites
pt: Pesquisar por este autor ou livro em vários sítios Web
zh_tw: 在多個網站搜尋這個作者或書本

source: Copy to library
fr: Copier dans la bibliothèque
it: Copia nella biblioteca
nl: Naar bibliotheek kopiëren
pt: Copiar para a biblioteca
zh_tw: 複製到書庫

source: Copy or move this book to another calibre library
fr: Copier ou déplacer ce livre vers une autre bibliothèque calibre
it: Copia o sposta questo libro in un'altra biblioteca di calibre
nl: Kopieer of verplaats dit boek naar een andere calibre bibliotheek
pt: Copiar ou mover este livro para outra biblioteca Calibre
zh_tw: 複製或移動此書到另一個 calibre 書庫

source: Wikipedia
pt: Wikipédia
zh_tw: 維基百科

source: Search for the author <i>{}</i> at:
fr: Rechercher l'auteur <i>{}</i> sur :
it: Cerca l'autore <i>{}</i> su:
nl: Zoek de auteur <i>{}</i> bij:
pt: Procurar autor <i>{}</i> em:
zh_tw: 以作者名:<i>{}</I>搜尋於:

source: Search for the book <i>{}</i> at:
fr: Rechercher le livre <i>{}</i> sur :
it: Cerca il libro <i>{}</i> su:
nl: Zoek het boek <i>{}</i> bij:
pt: Procurar livro <i>{}</i> em:
zh_tw: 以書名:<i>{}</I>搜尋於:

source: Failed to copy book
fr: Échec lors de la copie du livre
it: Impossibile copiare il libro
nl: Kan boek niet kopiëren
pt: Falha ao copiar livro
zh_tw: 無法複製書本

source: Failed to copy the book "{}". Click "Show details" for more information.
fr: Échec lors de la copie du livre "{}". Cliquer sur "Afficher les détails" pour plus d’information.
it: Impossibile copiare il libro "{}". Fai clic su "Mostra dettagli" per ulteriori informazioni.
nl: Fout bij kopiëren boek"{}". Klik op "Toon details" voor meer informatie.
pt: Não foi possível copiar o livro "{}". Carregue em "Mostrar detalhes" para mais informações.
zh_tw: 無法複製書本「{}」。請點選 「顯示詳細資料」 查看更多資訊。

source: Failed to copy the book "{}" because of an invalid response from calibre
fr: Échec lors de la copie du livre "{}", en raison d'une réponse non valide de calibre
it: Impossibile copiare il libro "{}" a causa di una risposta non valida di Calibre
nl: Fout bij kopiëren boek"{}" door een ongeldig antwoord van calibre
pt: Não foi possível copiar o livro "{}" devido a uma resposta inválida por parte do Calibre
zh_tw: 無法複製書本「{}」，因為從 calibre 傳來無效的回應

source: Book already exists
fr: Le livre existe déjà
it: Il libro esiste già
nl: Boek bestaat al
pt: O livro já existe
zh_tw: 書本已存在

source: Could not copy as a book with the same title and authors already exists in the {} library
fr: Impossible de copier vu qu'un livre avec le même titre et auteur(s) existe déjà dans la bibliothèque {}.
it: Impossibile copiare un libro con titolo e autore già esistenti nella biblioteca {}
nl: Kon niet kopiëren als een boek met dezelfde titel en de auteurs al bestaan in de bibliotheek {}
pt: Não foi possível efetuar a cópia porque já existe um livro com o mesmo título e autores na biblioteca {}
zh_tw: 無法複製，因為具有相同書名和作者的書本已存在於 {} 書庫

source: Book merged
fr: Livre fusionné
it: Libro unito
nl: Boek samengevoegd
pt: Livro fundido
zh_tw: 書本已合併

source: The files from the book were merged into a book with the same title and authors in the {} library
fr: Les fichiers du livres ont été fusionnés dans un livre avec le même titre et auteur(s) dans la bibliothèque {}
it: I file sono stati uniti in un libro con lo stesso titolo e autori nella biblioteca {}
nl: De bestanden uit het boek zijn samengevoegd in een boek met dezelfde titel en auteurs in de bibliotheek {}
pt: Os ficheiros do livro foram fundidos num livro com o mesmo título e autores na biblioteca {}
zh_tw: 書本中的檔案被合併到 {} 書庫中具有相同書名和作者的書本

source: Contacting calibre to copy book, please wait...
fr: Contact avec calibre pour la copie du livre, veuillez patienter....
it: Sto contattando Calibre per copiare il libro, attendi...
nl: Contact opnemen met calibre om boek te kopiëren, even geduld...
pt: A contactar o Calibre para copiar o livro, por favor aguarde...
zh_tw: 正在和 calibre 連線以複製書本，請稍候...

source: Copy book to "{target_library_name}"
fr: Copier le livre vers "{target_library_name}"
it: Copiare il libro su "{target_library_name}"
nl: Boek kopiëren naar "{target_library_name}"
pt: Copiar livro para "{target_library_name}"
zh_tw: 複製書本到「{target_library_name}」

source: Copying: {}
fr: Copie : {}
it: Copia: {}
nl: Kopiëren: {}
pt: A copiar: {}
zh_tw: 正在複製：{}

source: If there are already existing books in "{}" with the same title and authors, how would you like to handle them?
fr: S'il existe déjà des livres dans "{}" avec le même titre et les mêmes auteurs, comment aimeriez-vous les traiter ?
it: Come vuoi gestire i libri se questi sono già presenti in "{}" con lo stesso titolo e lo stesso autore?
nl: Als er al bestaande boeken in '{}' met dezelfde titel en auteurs staan, hoe zou u deze dan willen behandelen?
pt: Se já existirem livros em "{}" com o mesmo título e autores, como pretende que eles sejam processados?
zh_tw: 如果在「{}」已經存在具有相同標題和作者的書籍，您想要如何處理？

source: Copy anyway
fr: Copier quand même
it: Copia comunque
nl: Kopieer hoe dan ook
pt: Copiar mesmo assim
zh_tw: 仍要複製

source: Do not copy
fr: Ne pas copier
it: Non copiare
nl: Niet kopiëren
pt: Não copiar
zh_tw: 不複製

source: Merge into existing books, overwriting existing files
fr: Fusionner dans les livres existants, en écrasant les fichiers existants
it: Unire in libri già presenti sovrascrive i file esistenti.
nl: Samenvoegen in bestaande boeken en bestaande bestanden overschrijven
pt: Fundir nos livros existentes, sobrepondo os ficheiros existentes
zh_tw: 合併到已存在的書本，複寫已存在的檔案

source: Merge into existing books, keeping existing files
fr: Fusionner dans les livres existants, en conservant les fichiers existants
it: Unire in libri già presenti mantiene i file esistenti.
nl: Samenvoegen in bestaande boeken, bestaande bestanden behouden
pt: Fundir nos livros existentes, mantendo os ficheiros existentes
zh_tw: 合併到已存在的書本，包留已存在的檔案

source: Merge into existing books, putting conflicting files into a new book record
fr: Fusionner dans des livres existants, en mettant les fichiers conflictuels dans un nouveau livre
it: Unire in libri già presenti mette i file in conflitto dentro un nuovo record
nl: Samenvoegen in bestaande boeken en conflicterende bestanden in een nieuw boekrecord plaatsen
pt: Fundir em livros existentes, colocando os ficheiros em conflito num novo registo de livro
zh_tw: 合併到已存在的書本，將衝突的檔案放到新的書本紀錄

source: Move
fr: Déplacer
it: Sposta
nl: Verplaatsen
pt: Mover
zh_tw: 移動
