Repository: debian-calibre/calibre
Catalog: translations-git/content-server/*.po
Languages: fr, it, nl, pt, zh_tw

source: Book list
fr: Liste de livre
it: Lista dei libri
nl: Boekenlijst
pt: Lista de livros
zh_tw: 書本清單

source: Book details
fr: Détails du livre
it: Dettagli del libro
nl: Boekgegevens
pt: Detalhes do livro
zh_tw: 書本詳細資料

source: Downloading {0} for offline reading, please wait...
fr: Téléchargement {0} pour une lecture hors ligne, veuillez patienter...
it: Scaricamento {0} per la lettura offline, attendere...
nl: Downloaden van {0} voor offline lezen, wacht alstublieft...
pt: A descarregar {0} para leitura off-line, por favor, aguarde...
zh_tw: 正在下載 {0} 以便離線閱讀，請稍候...

source: Downloading book manifest...
fr: Téléchargement du manifeste du livre...
it: Scaricando il manifesto del libro...
nl: Boek manifest downloaden...
pt: A descarregar manifesto do livro...
zh_tw: 正在下載書籍資訊清單...

source: Could not copy image
fr: Impossible de copier l'image
it: Copia dell'immagine non riuscita
nl: Kan afbeelding niet kopiëren
pt: Não foi possível copiar a imagem
zh_tw: 無法複製圖片

source: Cannot read books
fr: Impossible de lire des livres
it: Impossibile leggere i libri
nl: Kan geen boeken lezen
pt: Não é possível ler livros
zh_tw: 無法閱讀書本

source: Could not initialize database
fr: Impossible d'initialiser la base de données
it: Impossibile inizializzare il database
nl: Kan de gegevensbank niet initialiseren
pt: Não foi possível inicializar a base de dados
zh_tw: 無法初始化資料庫

source: Failed to initialize IndexedDB
fr: Échec lors de l'initialisation de IndexedDB
it: Impossibile inizializzare l'IndexedDB
nl: Initialiseren van IndexedDB is mislukt
pt: Falha na inicialização do IndexedDB
zh_tw: 無法初始化 IndexedDB

source: Book id #
fr: Id # du livre
it: Id libro #
nl: Boek id #
pt: ID do livro #
zh_tw: 書本 id #

source: Cannot read book
fr: Impossible de lire le livre
it: Impossibile leggere il libro
nl: Kan boek niet lezen
pt: Não foi possível ler o livro
zh_tw: 無法閱讀這本書

source: Failed to load book manifest
fr: Échec lors du chargement du manifeste du livre
it: Caricamento del manifesto del libro non riuscito
nl: Boek manifest downloaden mislukt
pt: Não foi possível carregar o manifesto do livro
zh_tw: 無法載入書籍資訊清單

source: The book manifest failed to load, click "Show details" for more information.
fr: Échec lors du chargement du manifeste du livre, cliquez sur "Afficher les détails" pour plus d'informations.
it: Impossibile caricare il manifesto del libro, fai clic su "Mostra dettagli" per maggiori informazioni.
nl: Boek manifest laden mislukt, klik op "Toon details" voor meer informatie.
pt: Falha ao carregar o manifesto do livro. Carregue em "Mostrar detalhes" para mais informações.
zh_tw: 無法載入書本的清單檔案（manifest ），點選「顯示詳細資料」查看更多資訊

source: The manifest for {title} is not valid
fr: Le manifeste pour {title} n'est pas valide
it: Il manifesto per {title} non è valido
nl: Het manifest voor {title} is niet geldig
pt: O manifesto de {title} não é válido
zh_tw: {title} 的資訊清單無效

source: calibre upgraded!
fr: calibre a été mis à niveau !
it: Calibre aggiornato!
nl: calibre is geüpgraded!
pt: Calibre atualizado!
zh_tw: calibre 升級成功！

source: A newer version of calibre is available, please click the Reload button in your browser.
fr: Une version plus récente de calibre est disponible, veuillez cliquer le bouton d'actualisation de votre navigateur.
it: È disponibile una versione più recente di calibre, fai clic sul pulsante Ricarica del tuo browser.
nl: Er is een nieuwere versie van calibre beschikbaar, klik op de knop Opnieuw laden in uw browser.
pt: Está disponível uma versão mais recente do Calibre, por favor, clique em Recarregar no seu navegador.
zh_tw: 有新版本的 calibre 可用，請在瀏覽器點擊重新載入按鈕。

source: Failed to prepare book for reading
fr: Échec lors de la préparation du livre pour la lecture
it: Impossibile preparare il libro per la lettura
nl: Het voorbereiden van het boek om te lezen is mislukt
pt: Não foi possível preparar o livro para leitura
zh_tw: 書本閱讀準備失敗

source: Preparation of book for reading was aborted because it took too long
fr: La préparation du livre pour la lecture a été annulée car elle prend trop de temps
it: La preparazione del libro per la lettura è stata annullata siccome stava impiegando troppo tempo
nl: Voorbereiding boek om te lezen afgebroken omdat het te lang duurde
pt: A preparação do livro para leitura foi abortada por ter demorado tempo demais.
zh_tw: 書本閱讀準備已中止，因為耗時太久

source: There was an error processing the book, click "Show details" for more information
fr: Il y a eu une erreur lors du traitement du livre, cliquez "Afficher les détails" pour plus d'informations.
it: Si sono verificati degli errori durante l'elaborazione del libro. Fai clic su "Mostra dettagli" per ulteriori informazioni
nl: Er was een fout tijdens het verwerken van het boek. Klik op "Toon Details" voor meer informatie
pt: Foi encontrado um erro ao processar o livro. Carregue em "Mostrar detalhes" para mais informações.
zh_tw: 處理書籍時發生錯誤，請點選 「顯示詳細資料」查看更多資訊

source: Book is queued for processing on the server...
fr: Le livre est en file de traitement sur le serveur...
it: Il libro è stato accodato per l'elaborazione sul server...
nl: Boek is in de wachtrij gezet om verwerkt te worden op de server...
pt: O livro está colocado em fila de espera para processamento no servidor...
zh_tw: 已將書本排入佇列以在伺服器上處理...

source: Book is being prepared for reading on the server...
fr: Le livre est en cours de traitement pour la lecture sur le serveur...
it: Il libro è in preparazione per la lettura sul server...
nl: Boek wordt voorbereid om om gelezen te worden op de server...
pt: O livro está a ser preparado para leitura no servidor...
zh_tw: 正在準備書本以在伺服器上閱讀...

source: Downloaded {}, saving to disk. This may take a few seconds...
fr: {} téléchargé , en cours de sauvegarde sur le disque. Ceci peut prendre quelques secondes...
it: {} scaricato, salvataggio su disco. Potrebbe richiedere alcuni secondi...
nl: Gedownload {}, opslaan op schijf. Dit kan een paar seconden duren...
pt: Descarregado {} e a ser guardado no disco. Isto pode levar alguns segundos...
zh_tw: 已下载{}，正在保存到磁盘，将花费一些时间……

source: Downloaded {0}, {1} left
fr: Téléchargé {0}, {1} laissé
it: Scaricato {0}, {1} rimasto
nl: Downloaden van {0} klaar, {1} te gaan
pt: Descarregado {0}, {1} restante
zh_tw: 已下載 {0}，剩餘 {1}

source: Could not download book
fr: Impossible de télécharger le livre
it: Impossibile scaricare libro
nl: Kon boek niet downloaden
pt: Não foi possível descarregar o livro
zh_tw: 無法下載書本

source: Failed to download some book data, click "Show details" for more information
fr: Échec de téléchargement de données liées au livre, cliquez sur "Afficher Détails" pour plus d'informations.
it: Scaricamento di alcuni dati del libro non riuscito, fai clic "Mostra dettagli" per maggiori informazioni
nl: Afhalen sommige boekgegevens mislukt, klik 'Toon details' voor meer informatie
pt: Não foi possível descarregar alguns dados do livro, Carregue em "Mostrar detalhes" para mais informações
zh_tw: 下載一些書籍資料失敗，請點選 「顯示詳細資料」查看更多資訊

source: Failed to load MathJax manifest
fr: Échec lors du chargement du manifeste MathJax
it: Impossibile caricare il manifesto MathJax
nl: MathJax manifest laden mislukt
pt: Falha ao carregar o manifesto MathJax
zh_tw: 無法載入 MathJax 資訊清單

source: The MathJax manifest failed to load, click "Show details" for more information.
fr: Échec lors du chargement du manifeste MathJax, cliquez sur "Afficher les détails" pour plus d'informations.
it: Impossibile caricare il manifest di MathJax, fai clic su "Mostra dettagli" per maggiori informazioni.
nl: MathJax manifest laden mislukt, klik op "Toon details" voor meer informatie.
pt: O manifesto MathJax falhou ao ser carregado. Clique em "Mostrar detalhes" para mais informações.
zh_tw: 無法載入 MathJax 清單檔案，請點選 「顯示詳細資料」查看更多資訊

source: The MathJax manifest is not valid
fr: Le manifeste MathJax n'est pas valide
it: Il manifesto MathJax non è valido
nl: Het MathJax manifest ongeldig
pt: O manifesto MathJax não é válido
zh_tw: MathJax 資訊清單無效

source: Downloading MathJax to render mathematics in this book...
fr: Téléchargement de MathJax pour afficher les mathématiques dans ce livre...
it: Scaricamento di MathJax per l'iterpretazione dei caratteri matematici di questo libro...
nl: MathJax aan het downloaden om wiskunde in dit boek te laten zien...
pt: Descarregando o MathJax para representar a matemática contida neste livro...
zh_tw: 正在下載 MathJax 以繪製書本中的數學...

source: Could not download MathJax
fr: Impossible de télécharger MathJax
it: Impossibile scaricare MathJax
nl: Kon MathJax niet downloaden
pt: Não foi possível descarregar o MathJax
zh_tw: 無法下載 MathJax

source: Failed to download some MathJax data, click "Show details" for more information
fr: Échec lors du téléchargement de certaines données MathJax, cliquez sur "Afficher Détails" pour plus d'informations.
it: Lo scaricamento di alcuni dati di MathJax non è riuscito. Fai clic su "Mostra dettagli" per ulteriori informazioni
nl: Kon sommige MathJax gegevens niet downloaden, klik op 'Toon details' voor meer informatie
pt: Falha ao descarregar alguns dados do MathJax. Clique "Mostrar detalhes" para mais informações
zh_tw: 無法下載一些 MathJax 資料，請點選 「顯示詳細資料」查看更多資訊

source: No speech support
fr: Pas de prise en charge de Text-to-Speech
it: Supporto per la sintesi vocale assente
nl: Geen spraakondersteuning
pt: Sem suporte a fala
zh_tw: 不支援語音功能

source: Your browser does not have support for Text-to-Speech
fr: Votre navigateur ne prend pas en charge le Text-to-Speech
it: Il tuo browser non supporta il Text-to-Speech
nl: Uw browser ondersteunt geen tekst-naar-spraak
pt: O seu navegador não tem suporte de Texto-para-Fala
zh_tw: 你的浏览器不支持文本语音转换

source: Copy to clipboard
fr: Copier dans le presse-papier
it: Copia negli appunti
nl: Naar klembord kopiëren
pt: Copiar para a área de transferência
zh_tw: 複製到剪貼簿

source: Lookup/search selected word
fr: Consulter/rechercher le mot sélectionné
it: Ricerca/definisci la parola selezionata
nl: Kijk/zoek geselecteerd woord
pt: Pesquisar/consultar palavra selecionada
zh_tw: 查詢/搜尋選取的單字

source: Quick highlight in current style
fr: Mise en évidence rapide dans le style actuel
it: Evidenziazione veloce nello stile corrente
nl: Snel markeren in huidige stijl
pt: Realce rápido no estilo atual
zh_tw: 在目前的樣式快速醒目提示

source: Highlight selection
fr: Mettre en évidence la sélection
it: Evidenzia selezione
nl: Markeer selectie
pt: Realçar seleção
zh_tw: 醒目提示選取範圍

source: Search for selection in the book
fr: Rechercher la sélection dans le livre
it: Cerca selezione nel libro
nl: Zoek naar selectie in het boek
pt: Pesquisar no livro pela seleção
zh_tw: 在書籍中搜尋選取範圍

source: Create a bookmark
fr: Créer un signet
it: Crea un segnalibro
nl: Maak een bladwijzer
pt: Criar um marcador
zh_tw: 建立書籤

source: Search for selection on the net
fr: Rechercher la sélection sur internet
it: Cerca selezione su Internet
nl: Zoek naar selectie op het net
pt: Pesquisar na Web pela seleção
zh_tw: 在網路上搜尋選取範圍

source: Remove this highlight
fr: Supprimer cette mise en évidence
it: Rimuovi questa evidenziazione
nl: Verwijder deze markering
pt: Remover este realce
zh_tw: 移除醒目提示

source: [Delete or D]
fr: [Supprimer ou D]
it: [Canc o D]
nl: [Verwijderen of D]
pt: [Apagar ou D]
zh_tw: [Delete 或 D]

source: Copy a citation to this text
fr: Copier une citation vers ce texte
it: Copia una citazione a questo testo
nl: Kopieer het citaat van deze tekst
pt: Copiar citação para este texto
zh_tw: 复制指向这段话的引文

source: Highlight using: {name}{sc}
fr: Mettre en évidence en utilisant : {name}{sc}
it: Evidenzia usando: {name}{sc}
nl: Markeren met: {name}{sc}
pt: Realçar usando: {name}{sc}
zh_tw: 高亮条件：{name}{sc}

source: Highlight text missing
fr: Mettre en évidence le texte manquant
it: Testo evidenziazione mancante
nl: Markeer tekst ontbreekt
pt: Realce de texto em falta
zh_tw: 醒目提示文字遺失

source: The text associated with this highlight could not be found in the book. This can happen if the book was modified. This highlight will be automatically removed.
fr: Le texte associé à cette mise en évidence n'a pas pu être trouvé dans le livre. Cela peut arriver si le livre a été modifié. Cette mise en évidence sera automatiquement supprimée.
it: Il testo associato a questa evidenziazione non è stato trovato nel libro. Questo può succedere se il libro è stato modificato. Questa evidenziazione sarà rimossa automaticamente.
nl: De tekst die bij deze markering hoort, is niet in het boek gevonden. Dit kan gebeuren als het boek is gewijzigd. Deze markering wordt automatisch verwijderd.
pt: O texto associado a este realce não foi encontrado no livro. Isto pode acontecer caso o livro tenha sido modificado. Este realce será automaticamente removido.
zh_tw: 在书中找不到与此突出显示相关的文本。如果图书被修改，就会出现这种情况。此突出显示将被自动删除。

source: The notes for this highlight have been copied to the clipboard.
fr: Les notes relatives à cette mise en évidence ont été copiées dans le presse-papiers.
it: Le note per questa evidenziazione sono state copiate negli appunti.
nl: De notities voor deze markering zijn naar het klembord gekopieerd.
pt: As notas deste realce foram copiadas para a área de transferência.
zh_tw: 这个突出显示的笔记已经复制到剪贴板。

source: Copy notes to clipboard
fr: Copier les notes dans le presse-papiers
it: Copia note negli appunti
nl: Kopieer notities naar het klembord
pt: Copiar notas para a área de transferência
zh_tw: 複製筆記到剪貼簿

source: Too little text
fr: Texte trop court
it: Troppo poco testo
nl: Te weinig tekst
pt: Texto demasiado curto
zh_tw: 太少文字

source: Cannot search as too little text is selected. You must select at least two characters.
fr: Impossible d'effectuer une recherche car le texte sélectionné est trop court. Vous devez sélectionner au moins deux caractères.
it: Impossibile cercare con così poco testo selezionato. Devi selezionare almeno due caratteri.
nl: Kan niet zoeken wegens te weinig tekst geselecteerd. U moet tenminste twee karakters selecteren.
pt: Não é possível pesquisar porque foi selecionado muito pouco texto. Deve selecionar pelo menos dois caracteres.
zh_tw: 无法搜索，因为选中的文字太少。必须至少选中 2 个字符。

source: Are you sure you want to delete this highlight permanently?
fr: Êtes-vous certain(e) de vouloir supprimer les mises en évidence définitivement ?
it: Sei sicuro di voler eliminare definitivamente questa evidenziazione?
nl: Weet u zeker dat u deze markering permanent wilt verwijderen?
pt: Tem a certeza de que pretende apagar este realce?
zh_tw: 您確定要永久刪除這個醒目提示嗎？

source: Highlighting failed
fr: Échec de la mise en évidence
it: Evidenziazione non riuscita
nl: Markeren is mislukt
pt: Falha ao realçar
zh_tw: 醒目提示失敗

source: Failed to apply highlighting, try adjusting extent of highlight
fr: Échec à appliquer la mise en évidence, essayez d'ajuster l'étendue de la mise en évidence
it: Impossibile applicare l'evidenziazione, prova a cambiarne la lunghezza
nl: Kan markering niet toepassen, probeer de mate van markering aan te passen
pt: Falha ao aplicar o realce. Tente ajustar a extensão do realce.
zh_tw: 無法套用醒目提醒，請嘗試調整醒目提示的範圍

source: Loading text from the book failed.
fr: Le chargement du texte du livre a échoué.
it: Impossibile caricare il testo dal libro.
nl: Laden tekst uit boek mislukt.
pt: O carregamento de texto do livro falhou.
zh_tw: 无法从书籍中读取文本。

source: Connecting to database storing the local copy of the book failed in the worker thread.
fr: La connexion à la base de données stockant la copie locale du livre a échoué dans le processus de travail.
it: La connessione al database che conserva la copia locale del libro è fallita nel processo di lavoro.
nl: Verbinden met database om lokale kopie boek op te slaan mislukt in werker thread.
pt: A ligação com a base de dados que armazena a cópia local do livro falhou no processo de trabalho.
zh_tw: 工作线程尝试连接储存本地书籍副本的数据库时失败

source: There was an unhandled error while searching.
fr: Il y a eu une erreur non gérée pendant la recherche.
it: Si è verificato un errore non gestito durante la ricerca.
nl: Onbehandelde fout tijdens het zoeken.
pt: Ocorreu um erro não gerido ao pesquisar.
zh_tw: 搜索时出现未处理的错误

source: Search in book
fr: Rechercher dans le livre
it: Cerca nel libro
nl: Zoek in boek
pt: Pesquisar no livro
zh_tw: 在書本中搜尋

source: Search type:
fr: Type de recherche :
it: Tipo di ricerca:
nl: Zoektype:
pt: Tipo de pesquisa:
zh_tw: 搜索类型：

source: Contains
fr: Contient
it: Contiene
nl: Bevat
pt: Contém
zh_tw: 包含

source: Whole words
fr: Mots entiers
it: Parole intere
nl: Volledige woorden
pt: Palavras inteiras
zh_tw: 整個單字

source: Type of search: Contains: Search for the entered text anywhere Whole words: Search for whole words that equal the entered text Regex: Interpret the entered text as a regular expression
fr: Type de recherche : Contient : Rechercher le texte saisi n'importe où Mots entiers : Rechercher les mots entiers qui correspondent au texte saisi Regex : interprète le texte saisi comme une expression régulière.
it: Tipo di ricerca: Contiene: Cerca il testo inserito dappertutto Parole intere: Cerca parole intere che corrispondono al testo inserito Regex: Interpreta il testo inserito come un'espressione regolare
nl: Type zoeken: Bevat: Zoek overal voor de ingevoerde tekst Volledige woorden: Zoek volledige woorden gelijk aan de ingevoerde tekst Regex: Interpreteer de ingevoerde tekst als een reguliere expressie
pt: Tipo de pesquisa: Contém: Pesquisa pelo texto inserido em qualquer lugar Palavras inteiras: Pesquisa palavras inteiras que são iguais ao texto inserido Regex: Interpreta o texto como uma expressão regular
zh_tw: 搜索类型： 包含：在各处搜索输入的文本 完全匹配：精确搜索与输入字词完全相等的位置 正则：将输入内容作为正则表达式解析

source: Case sensitive
fr: Respecter la casse
it: Distingui le maiuscole
nl: Hoofdletter-afhankelijk
pt: Sensível a maiusculização
zh_tw: 区分大小写

source: Return
fr: Renvoie
it: Torna indietro
nl: Enter
pt: Voltar
zh_tw: 返回

source: Go back to where you were before searching
fr: Retournez à l'endroit où vous étiez avant les recherches
it: Torna a dove ti trovavi prima della ricerca
nl: Ga terug naar waar u was voor het zoeken
pt: Voltar para onde estava antes da pesquisa
zh_tw: 回到你在搜索之前所在的地方

source: Searching, please wait…
fr: Recherche en cours, veuillez patienter...
it: Ricerca in corso, attendere...
nl: Zoeken, even geduld aub...
pt: A pesquisar, por favor, aguarde...
zh_tw: 检索中，请稍候……

source: Could not search
fr: Impossible de rechercher
it: Impossibile cercare
nl: Kon niet zoeken
pt: Não foi possível pesquisar
zh_tw: 無法搜尋

source: No matching results found
fr: Aucun résultat n'a été trouvé
it: Nessun risultato corrispondente trovato
nl: Geen overeenstemmende resultaten gevonden
pt: Nenhum resultado correspondente encontrado
zh_tw: 无匹配结果

source: Click to show/hide the results in this chapter
fr: Cliquer pour afficher/masquer les résultats dans ce chapitre
it: Fai clic per mostrare/nascondere i risultati in questo capitolo
nl: Klik om resultaten in dit hoofdstuk te tonen/verbergen
pt: Carregue para mostrar/ocultar os resultados neste capítulo
zh_tw: 点击显示/隐藏本章中的结果

source: Search result not found
fr: Résultat de la recherche non trouvé
it: Risultato di ricerca non trovato
nl: Zoekresultaat niet gevonden
pt: O resultado da pesquisa não foi encontrado
zh_tw: 未找到搜索结果

source: This search result matches text that is hidden in the book and cannot be displayed
fr: Ce résultat de recherche correspond à un texte qui est caché dans le livre et ne peut être affiché
it: Questo risultato di ricerca corrisponde a del testo che è nascosto nel libro e non può essere mostrato
nl: Dit zoekresultaat stemt overeen met tekst verborgen in het boek en kan niet getoond worden
pt: Este resultado de pesquisa corresponde a um texto que está oculto no livro e não pode ser exibido
zh_tw: 搜索结果隐藏在书籍中，无法显示。

source: No links found. Press Esc to close
fr: Pas de liens trouvés. Appuyer Echap pour fermer
it: Nessun link trovato. Premi Esc per chiudere
nl: Geen links gevonden. Druk op Esc om te sluiten
pt: Nenhuma hiperligação encontrada. Premir Esc para fechar
zh_tw: 未找到链接。按Esc关闭

source: Next section
fr: Section suivante
it: Prossima sezione
nl: Volgende paragraaf
pt: Próxima secção
zh_tw: 下一節

source: Previous section
fr: Section précédente
it: Sezione precedente
nl: Vorige paragraaf
pt: Secção anterior
zh_tw: 上一節

source: Book start
fr: Début du livre
it: Inizio del libro
nl: Begin boek
pt: Início do livro
zh_tw: 書籍開頭

source: Book end
fr: Fin du livre
it: Fine del libro
nl: Einde boek
pt: Fim do livro
zh_tw: 書籍結尾

source: Metadata
fr: Métadonnées
it: Metadati
pt: Metadados
zh_tw: 詮釋資料

source: Details about this book
fr: Détails de ce livre
it: Informazioni sul libro
nl: Details van dit boek
pt: Detalhes sobre este livro
zh_tw: 書籍的詳細資料

source: Book page in library
fr: Page de livre dans la bibliothèque
it: Pagina del libro nella biblioteca
nl: Boekpagina in de bibliotheek
pt: Página do livro na biblioteca
zh_tw: 書庫中的書籍頁面

source: The page for this book in the calibre library
fr: La page de ce livre dans la bibliothèque calibre
it: La pagina di questo libro nella biblioteca di calibre
nl: De pagina voor dit boek in de calibre bibliotheek
pt: A página deste livro na biblioteca Calibre
zh_tw: 在 calibre 書庫中的這本書的頁面

source: Location
fr: Emplacement
it: Collocazione
nl: Locatie
pt: Localização
zh_tw: 位置

source: Current location:
fr: Emplacement actuel :
it: Collocazione corrente:
nl: Huidige locatie:
pt: Localização atual:
zh_tw: 目前位置：

source: No such location
fr: Cet emplacement n'existe pas
it: Nessuna collocazione corrispondente
nl: Geen dergelijke locatie
pt: Não existe este local
zh_tw: 沒有這個位置

source: No location {} found
fr: Aucun emplacement {} trouvé
it: Nessuna collocazione {} trovata
nl: Geen locatie {} gevonden
pt: Nenhuma localização {} encontrada
zh_tw: 找不到位置 {}

source: No such reference
fr: Aucune référence de ce genre
it: Riferimento non trovato
nl: Verwijzing bestaat niet
pt: Não existe essa referência
zh_tw: 沒有這個參考

source: No reference {} found
fr: Aucune référence {} trouvée
it: Riferimento {} non trovato
nl: Geen verwijzing {} gevonden
pt: Nenhuma referência {} encontrada
zh_tw: 沒有找到參考 {}

source: Current position: {}
fr: Position actuelle : {}
it: Posizione Attuale: {}
nl: Huidige positie {}
pt: Posição atual: {}
zh_tw: 目前位置：{}

source: Type the position, location or reference below. For a reference type ref: followed by the reference:
fr: Taper la position, l'emplacement ou la référence ci-dessous. Pour une référence de type ref: suivi de la référence :
it: Inserisci la posizione, la collocazione o il riferimento qui sotto. Per un riferimento inserisci ref: seguito dal riferimento:
nl: Typ de positie, locatie of verwijzing hieronder. Voor een verwijzing typ ref: gevolgd door de verwijzing:
pt: Digite abaixo a posição, localização ou referência. Para uma referência digite ref: seguido da referência
zh_tw: 在下面键入位置、位置或引用。对于参考类型ref：后跟参考：

source: Not a valid book position
fr: Position non valide du livre
it: Posizione del libro non valida
nl: Geen correcte positie in boek
pt: Não é uma posição de livro válida
zh_tw: 不是有效的書籍位置

source: {} is not a valid book position
fr: {} n'est pas une position valide du livre
it: {} non è una posizione dl libro valida
nl: {} is geen valide positie in boek
pt: {} não é uma posição de livro válida
zh_tw: {} 不是有效的書籍位置

source: Go to:
fr: Aller à :
it: Vai a:
nl: Ga naar:
pt: Ir para:
zh_tw: 前往：

source: Go
fr: Lancer
it: Vai
nl: Gaan
pt: Avançar
zh_tw: 前往

source: URL for this position:
fr: URL de cet emplacement :
it: URL per questa posizione:
nl: URL voor deze positie:
pt: URL para esta posição:
zh_tw: 当前位置URL
