Repository: debian-calibre/calibre
Catalog: translations-git/content-server/*.po
Languages: fr, it, nl, pt, zh_tw

source: Time to read book
fr: Temps restant pour lire le livre
it: Tempo alla fine del libro
nl: Tijd om het boek te lezen
pt: Tempo para ler o livro
zh_tw: 書籍閱讀時間

source: Time to read chapter
fr: Temps restant pour lire le chapitre
it: Tempo alla fine del capitolo
nl: Tijd om hoofdstuk te lezen
pt: Tempo para ler o capítulo
zh_tw: 章節閱讀時間

source: Time to read chapter and book
fr: Temps restant pour lire le chapitre et le livre
it: Tempo alla fine del capitolo e del libro
nl: Tijd om hoofdstuk en boek te lezen
pt: Tempo para ler o capítulo e o livro
zh_tw: 章節和書籍閱讀時間

source: Position in book
fr: Position dans le livre
it: Posizione nel libro
nl: Positie in boek
pt: Posição no livro
zh_tw: 書本中的位置

source: Position in chapter
fr: Position dans le chapitre
it: Posizione nel capitolo
nl: Positie in hoofdstuk
pt: Posição no capítulo
zh_tw: 章節中的位置

source: Pages in chapter
fr: Pages dans le chapitre
it: Pagine nel capitolo
nl: Pagina's in hoofdstuk
pt: Páginas no capítulo
zh_tw: 本章的頁數

source: Left
fr: Gauche
it: Sinistra
nl: Links
pt: Esquerda
zh_tw: 左

source: Middle
fr: Milieu
it: Centro
nl: Midden
pt: Centro
zh_tw: 中

source: Right
fr: Droite
it: Destra
nl: Rechts
pt: Direita
zh_tw: 右

source: Top
fr: Haut
it: Sopra
nl: Bovenaan
pt: Topo
zh_tw: 上

source: Bottom
fr: Bas
it: Sotto
nl: Onderaan
pt: Fundo
zh_tw: 下

source: Header
fr: En-tête
it: Intestazione
nl: Koptekst
pt: Cabeçalho
zh_tw: 頁首

source: Footer
fr: Pied de page
it: Piè di pagina
nl: Voettekst
pt: Rodapé
zh_tw: 頁尾

source: Left margin
fr: Marge gauche
it: Margine sinistro
nl: Linkermarge
pt: Margem esquerda
zh_tw: 左邊界

source: Right margin
fr: Marge droite
it: Margine destro
nl: Rechtermarge
pt: Margem direita
zh_tw: 右邊界

source: Controls footer
fr: Pied de page des contrôles
it: Barra inferiore dei controlli
nl: Controls voettekst
pt: Rodapé do ecrã de controlos
zh_tw: 控制页脚

source: almost done
fr: presque terminé
it: quasi finito
nl: bijna klaar
pt: quase concluído
zh_tw: 快完成了

source: {} hour
fr: {} heure
it: {} ora
nl: {} uur
pt: {} hora
zh_tw: {} 小時

source: {} h {} mins
fr: {} h {} minutes
it: {} ore {} minuti
nl: {} h {} minuten
pt: {} h. {} min.
zh_tw: {} 小時 {} 分鐘

source: Untitled
fr: Sans titre
it: Senza titolo
nl: Geen titel
pt: Sem título
zh_tw: 無標題

source: {0} of {1}
fr: {0} de {1}
it: {0} di {1}
nl: {0} van {1}
pt: {0} de {1}

source: Calculating...
fr: Calcul en cours...
it: Sto calcolando...
nl: Berekenen...
pt: A calcular...
zh_tw: 計算中…

source: The username of a Content server user that you want all annotations synced with. Use the special value * to sync with anonymous users
fr: Le nom d'utilisateur d'un utilisateur du serveur de contenu avec lequel vous voulez que toutes les annotations soient synchronisées. Utilisez la valeur spéciale * pour la synchronisation avec les utilisateurs anonymes
it: Il nome utente di un utente del server dei contenuti con cui vuoi sincronizzare tutte le annotazioni. Usa il valore speciale * per sincronizzare con utenti anonimi
nl: Gebruikersnaam van een Content server gebruiker waarmee u alle annotaties wil syncen. Gebruik de joker * om met anonieme gebruikers te syncen
pt: O nome de utilizador de um utilizador do servidor de conteúdos com o qual deseja que todas as anotações sejam sincronizadas. Use o valor especial * para sincronizar com utilizadores anónimos
zh_tw: 要与所有批注同步的内容服务器用户的用户名。使用特殊值*与匿名用户同步

source: Sync bookmarks/highlights with Content server user:
fr: Synchroniser les signets/mises en évidence avec l'utilisateur du Serveur de contenu :
it: Sincronizza segnalibri/evidenziazioni con un utente del server dei contenuti:
nl: Sync bladwijzers/highlights met Content server gebruiker:
pt: Sincronizar marcadores/realces com o utilizador do servidor de conteúdos:
zh_tw: 與內容伺服器使用者同步書籤/醒目提醒：

source: Remember last used window size and position
fr: Se souvenir de la taille et de la position de la dernière fenêtre utilisée
it: Ricorda posizione e dimensione della finestra dell'ultimo utilizzo
nl: Onthoudt laatste vensterformaat en -positie
pt: Recordar a última posição e tamanho da janela
zh_tw: 記住上次使用的視窗大小與位置

source: Show a toolbar with the most useful actions
fr: Afficher une barre d'outils avec les actions les plus utiles
it: Mostra una barra degli strumenti con le azioni più utili
nl: Toon werkbalk met de meest gebruikte activiteiten
pt: Exibir uma barra de ferramentas com as ações mais úteis
zh_tw: 顯示具有最有用的動作的工具列

source: Customize toolbar
fr: Personnaliser la barre d'outils
it: Personalizza barra degli strumenti
nl: Werkbalk aanpassen
pt: Personalizar barra de ferramentas
zh_tw: 自訂工具列

source: Keep the toolbar in full screen mode (needs restart)
fr: Conserver la barre d'outils en mode plein écran (redémarrage nécessaire)
it: Visualizza la barra degli strumenti anche a schermo intero (necessario riavvio)
nl: Werkbalk blijft zichtbaar in volledig scherm modus (herstart noodzakelijk)
pt: Mostrar barra de ferramentas no modo de ecrã inteiro (implica reiniciar)
zh_tw: 在全螢幕模式中保留工具列（需要重新啟動）

source: Remember current page when quitting
fr: Se souvenir de la page en cours après la fermeture
it: Ricorda la pagina corrente all'uscita
nl: Onthoudt huidige pagina bij afsluiten
pt: Memorizar página atual ao sair
zh_tw: 結束時記住目前的頁面

source: Restore open panels such as Table of Contents, Search, etc. on restart
fr: Restaurer les panneaux ouverts tels que la table des matières, la recherche, etc. au redémarrage
it: Ripristina i pannelli aperti come Indice, Cerca, ecc. al riavvio
nl: Herstel open panelen zoals Inhoudstabel, Zoeken, enz. bij opnieuw starten
pt: Ao reiniciar, restaurar painéis abertos, tais como Índice, Pesquisa, etc.
zh_tw: 在下次打开时恢复打开的目录、搜索等面板

source: Keep a copy of annotations/bookmarks in the e-book file, for easy sharing
fr: Garder une copie des favoris/signets de la page dans le fichier du livre numérique, pour un partage facile.
it: Tieni una copia delle annotazioni/segnalibri nel file dell'ebook, per una semplice condivisione
nl: Bewaar een kopie van annotaties/bladwijzers in het e-boekbestand, zodat u ze eenvoudig kunt delen
pt: Manter uma cópia das anotações/marcadores de página no ficheiro do livro para facilitar a partilha
zh_tw: 在電子書檔案中保留註解/書籤的副本，以便分享

source: Allow only a single instance of the viewer (needs restart)
fr: N'autoriser qu'une seule instance de la visionneuse (redémarrage nécessaire)
it: Permetti solo una singola istanza del lettore (necessario riavvio)
nl: Sta slechts één exemplaar van de lezer toe (opnieuw opstarten)
pt: Permitir apenas uma instância do visualizador (implica reiniciar)
zh_tw: 只允許單一閱讀器實體（需要重新啟動）

source: Hide mouse-over tooltips in the book text
fr: Masquer les infobulles au survol de la souris dans le texte du livre
it: Nascondi i suggerimenti al passaggio del mouse nel testo del libro
nl: Verberg muis-over gebruikerstips in de boektekst
pt: Ocultar dicas, de sobreposição de rato, no texto do livro
zh_tw: 在书籍文本中隐藏工具提示

source: Auto hide the mouse cursor when unused for a few seconds
fr: Masquer automatiquement le curseur de la souris lorsqu'il n'est pas utilisé pendant quelques secondes
it: Nascondi automaticamente il cursore del mouse se inutilizzato per qualche secondo
nl: Verberg muiscursor automatisch indien enkele seconden niet gebruikt
pt: Ocultar automaticamente o cursor do rato quando não for usado por alguns segundos
zh_tw: 閒置幾秒鐘後，自動隱藏滑鼠游標

source: Cannot remove
fr: Impossible d’effacer
it: Impossibile rimuovere
nl: Kan niet verwijderen
pt: Não é possível remover
zh_tw: 無法移除

source: Cannot remove a builtin color scheme
fr: Impossible de supprimer un schéma de couleur intégré
it: Impossibile rimuovere lo schema colore integrato
nl: Kan het ingesloten kleurenschema niet verwijderen
pt: Não pode remover um esquema de cores predefinido
zh_tw: 無法移除內置配色方案

source: Invalid color
fr: Couleur invalide
it: Colore non valido
nl: Ongeldige kleur
pt: Cor não válida
zh_tw: 無效的顏色

source: The color {} is not a valid color
fr: La couleur {} n'est pas une couleur valide
it: Il colore {} non è un colore valido
nl: De kleur {} is niet een geldige kleur
pt: A cor {} não é uma cor válida
zh_tw: {} 不是有效的顏色

source: Name not specified
fr: Nom non spécifié
it: Nome non specificato
nl: Naam ontbreekt
pt: Nome não especificado
zh_tw: 未指定名稱

source: You must specify a name for the color scheme
fr: Vous devez spécifier un nom pour votre schéma de couleur
it: Devi specificare un nome per lo schema colore
nl: Geef een naam voor het kleurenschema
pt: Deve especificar um nome para o esquema de cores
zh_tw: 必須為配色方案指定名稱

source: Choose a color scheme below
fr: Choisissez un schéma de couleur ci-dessous
it: Scegli tra le seguenti combinazioni di colori
nl: Kies hieronder een kleurenschema
pt: Escolher um esquema de cor
zh_tw: 選擇下面的配色方案

source: Override all book colors:
fr: Remplacer toutes les couleurs du livre :
it: Sovrascrivi tutti i colori del libro:
nl: Alle boekkleuren overschrijven:
pt: Sobrepor a todas as cores do livro
zh_tw: 覆蓋所有書籍顏色：

source: Never
fr: Jamais
it: Mai
nl: Nooit
pt: Nunca
zh_tw: 永不

source: In dark mode
fr: En mode nuit
it: Con tema scuro
nl: In donkere modus
pt: No modo escuro
zh_tw: 在暗色模式

source: Always
fr: Toujours
it: Sempre
nl: Altijd
pt: Sempre
zh_tw: 永遠

source: New scheme
fr: Nouveau schéma
it: Nuovo schema
nl: Nieuw schema
pt: Novo esquema
zh_tw: 新增配色方案

source: Edit scheme
fr: Éditer le schéma
it: Modifica schema
nl: Wijzig schema
pt: Editar esquema
zh_tw: 編輯配色方案

source: Remove scheme
fr: Supprimer le schéma
it: Rimuovere schema
nl: Verwijder schema
pt: Remover esquema
zh_tw: 移除配色方案

source: Default
fr: Par défaut
it: Predefinito
nl: Standaard
pt: Predefinição
zh_tw: 預設值

source: Custom
fr: Personnalisé
it: Personalizzato
nl: Aangepast
pt: Personalizar
zh_tw: 自訂

source: Background
fr: Arrière-plan
it: Sfondo
nl: Achtergrond
pt: Fundo
zh_tw: 背景

source: Foreground
fr: Avant-plan
it: Primo piano
nl: Voorgrond
pt: Frente
zh_tw: 前景

source: Background:
fr: Arrière plan :
it: Sfondo:
nl: Achtergrond:
pt: Fundo:
zh_tw: 背景：

source: Foreground:
fr: Avant plan :
it: Colore di primo piano:
nl: Voorgrond:
pt: Primeiro plano:
zh_tw: 前景：

source: Link:
fr: Lien :
nl: Koppeling:
pt: Ligação:
zh_tw: 連結：

source: Top margin:
fr: Marge supérieure :
it: Margine superiore:
nl: Bovenmarge:
pt: Margem superior:
zh_tw: 頂端邊界：

source: Bottom margin:
fr: Marge inférieure :
it: Margine inferiore:
nl: Ondermarge:
pt: Margem inferior:
zh_tw: 底部邊界：

source: Left margin:
fr: Marge gauche :
it: Margine sinistro:
nl: Linkermarge:
pt: Margem esquerda:
zh_tw: 左邊界：

source: Right margin:
fr: Marge droite :
it: Margine destro:
nl: Rechtermarge:
pt: Margem direita:
zh_tw: 右邊界：

source: Configure book reader
fr: Configurer le lecteur de livre
it: Configura il lettore libri
nl: Configureer e-reader
pt: Configurar leitor de livros
zh_tw: 設定書本閱讀器

source: Colors
fr: Couleurs
it: Colori
nl: Kleuren
pt: Cores
zh_tw: 顏色

source: Colors of the page and text
fr: Couleurs de la page et du texte
it: Colori della pagina e del testo
nl: Kleuren van pagina en tekst
pt: Cores da página e do texto
zh_tw: 頁面和文字顏色

source: Page layout
fr: Disposition de la page
it: Impaginazione
nl: Pagina opmaak
pt: Visual de página
zh_tw: 頁面配置

source: Page margins and number of pages per screen
fr: Marges de page et nombre de pages par écran
it: Margini di pagina e numero di pagine per schermata
nl: Marge pagina en aantal pagina's per scherm
pt: Margens e número de páginas por ecrã
zh_tw: 頁面邊界和每個螢幕的頁數

source: Styles
it: Stili
nl: Stijlen
pt: Estilos
zh_tw: 樣式

source: Style rules for text and background image
fr: Règles de style pour le texte et l'image de fond
it: Regole di stile per testo e immagine di sfondo
nl: Stijl gaat voor tekst en achtergrond afbeelding
pt: Regras de estilo para o texto e imagem de fundo
zh_tw: 文字和背景圖片的樣式規則

source: Headers and footers
fr: En-têtes et pieds de page
it: Intestazioni e piè di pagina
nl: Kop- en voetteksten
pt: Cabeçalhos e rodapés
zh_tw: 頁首與頁尾

source: Customize the headers and footers
fr: Personnaliser les en-têtes et pieds de page
it: Personalizza intestazioni e piè di pagina
nl: Aanpassen van de kop- en voetteksten
pt: Personalizar cabeçalhos e rodapés
zh_tw: 自訂頁首與頁尾

source: Scrolling behavior
fr: Comportement du défilement
it: Scorrimento
nl: Gedrag bij scrollen
pt: Comportamento do rolamento
zh_tw: 捲動行為

source: Control how the viewer scrolls
fr: Contrôle le défilement de la visionneuse
it: Controlla le impostazioni di scorrimento del lettore
nl: Bepaal hoe de lezer bladert
pt: Controlar o rolamento do visualizador
zh_tw: 控制閱讀器如何捲動

source: Selection behavior
fr: Comportement de la sélection
it: Selezione
nl: Gedragsselectie
pt: Seleção do comportamento
zh_tw: 選取行為

source: Control how the viewer selects text
fr: Contrôler la façon dont la visionneuse sélectionne le texte
it: Decidi come il lettore seleziona il testo
nl: Bepaal hoe de viewer tekst selecteert
pt: Controlar o modo como o visualizador seleciona texto
zh_tw: 控制閱讀器如何選取文字

source: Keyboard shortcuts
fr: Raccourcis clavier
it: Scorciatoie da tastiera
nl: Toetsenbord sneltoetsen
pt: Atalhos de teclado
zh_tw: 鍵盤快捷鍵

source: Customize the keyboard shortcuts
fr: Personnaliser les raccourcis clavier
it: Personalizza le scorciatoie da tastiera
nl: Pas de sneltoetsen aan
pt: Personalizar atalhos de teclado
zh_tw: 自訂鍵盤快速鍵

source: Fonts
fr: Polices
it: Caratteri
nl: Lettertypen
pt: Fontes
zh_tw: 字型

source: Font choices
fr: Choix des polices
it: Scelta dei caratteri
nl: Lettertype keuzes
pt: Seleção de fontes
zh_tw: 字型選擇

source: Miscellaneous
fr: Divers
it: Varie
nl: Diversen
pt: Diversos
zh_tw: 雜項

source: Window size, last read position, toolbar, etc.
fr: Taille de la fenêtre, dernière position de lecture, barre d'outils, etc.
it: Dimensione finestra, ultima posizione di lettura, barra degli strumenti, ecc.
nl: Venstergrootte, laatste leespositie, werkbalk, enz.
pt: Tamanho da janela, última posição de leitura, barra de ferramentas, etc.
zh_tw: 視窗大小、上次閱讀位置、工具列等等

source: Change the page margins (in pixels) below
fr: Changer les marges de page (en pixels) ci-dessous
it: Cambia i margini di pagina (in pixel) di seguito
nl: Wijzig de pagina marge (in pixels) onder
pt: Alterar as margens de página (em píxeis)
zh_tw: 在下面變更頁面邊界（以像素為單位）

source: Top:
fr: Haut :
it: Sopra:
nl: Boven:
pt: Superior:
zh_tw: 上：

source: Bottom:
fr: Bas :
it: Sotto:
nl: Onder:
pt: Inferior:
zh_tw: 下：

source: Left:
fr: Gauche :
it: Sinistra:
nl: Links:
pt: Esquerda:
zh_tw: 左：

source: Right:
fr: Droite :
it: Destra:
nl: Rechts:
pt: Direita:
zh_tw: 右：

source: Choose the page layout mode. In paged mode, the text is split up into individual pages, as in a paper book. In flow mode text is presented as one long scrolling page, as in web browsers.
fr: Choisissez le mode de mise en page. En mode page, le texte est divisé en pages individuelles, comme dans un livre papier, En mode continu le texte est présenté comme une longue page déroulante, comme dans les navigateurs web.
it: Scegli la modalità di visualizzazione della pagina. In modalità Pagine, il testo è diviso in pagine separate, come in un libro di carta. In modalità Flusso, il testo è presentato come un'unica lunga pagina, come in un browser Web.
nl: Kies voor de pagina modus. In de pagina mode zal de tekst opgesplitst zijn in individuele pagina's net als bij een normaal papierenboek. In de boekrol modus zal de tekst als een lange pagina worden getoond, vergelijkbaar met web browser pagina's.
pt: Escolha o modo de visual da página. No modo paginado, o texto é dividido em páginas individuais, como num livro de papel. No modo fluido, o texto é apresentado como uma página de rolagem longa, como nos navegadores web.
zh_tw: 選擇頁面配置模式。在頁面模式，文字會被分割到各個頁面，如同紙本書。在直流模式，文字會以長的捲動頁面呈現，如同網路瀏覽器。

source: Paged mode
fr: Mode page
it: modalità Pagine
nl: Pagina modus
pt: Modo paginado
zh_tw: 頁面模式

source: Flow mode
fr: Mode continu
it: Modalità Flusso
nl: Boekrol modus
pt: Modo fluido
zh_tw: 直流模式

source: In paged mode, control the number of pages per screen. A setting of zero means the number of pages is set based on the screen size.
fr: En mode page, contrôler le nombre de pages par écran. Un paramétrage à zéro signifie que le nombre de page est basé sur la taille de l'écran.
it: In modalità Pagine, controlla il numero di pagine per schermata. Un valore di zero significa che il numero di pagine viene stabilito in base alla dimensione dello schermo.
nl: In pagina modus, beheer het aantal pagina's per scherm. Een waarde van 0 betekent dat het aantal pagina's wordt gebaseerd op de schermgrootte.
pt: No modo paginado, controle o número de páginas por ecrã. Uma configuração de zero significa que o número de páginas é definido com base no tamanho do ecrã.
zh_tw: 在頁面模式，控制每個螢幕的頁數。設定 0 代表頁數會依據螢幕大小設定。

source: Portrait:
it: Verticale:
nl: Staand:
pt: Retrato:
zh_tw: 纵向：

source: Landscape:
fr: Paysage :
it: Orizzontale:
nl: Liggend:
pt: Paisagem:
zh_tw: 横向：

source: Change the maximum screen area (in pixels) used to display text. A value of zero means that all available screen area is used. Current window width is {0} and height is {1} pixels.
fr: Changer l'aire maximale de l'écran (en pixels) utilisée pour afficher le texte. Une valeur de zéro signifie que toute l'aire d'écran disponible est utilisée. La largeur actuelle de la fenêtre est {0} et la hauteur est {1} pixels.
it: Cambia l'area massima dello schermo (in pixel) usata per mostrare il testo. Un valore di zero indica che tutta l'area disponibile dello schermo è utilizzata. La larghezza attuale della finestra è di {0} e l'altezza è di {1} pixel.
nl: Wijzig het maximale schermgebied (in pixels) in gebruik om tekst weer te geven. De waarde nul betekent dat het totale schermgebied wordt gebruikt. Huidige vensterbreedte is {0} en hoogte is {1} pixels.
pt: Alterar a área máxima do ecrã (em píxeis) usada para exibir o texto. Um valor zero significa que será usada toda a área de ecrã disponível. Atualmente a janela tem de largura {0} e altura {1} píxeis.
zh_tw: 變更用於顯示文字的最大螢幕區域（以像素為單位）。0 代表使用所有可用的螢幕區域。目前的視窗寬度是 {0}，高度是 {1} 像素。

source: Width:
fr: Largeur :
it: Larghezza:
nl: Breedte:
pt: Largura:
zh_tw: 宽度：

source: Height:
fr: Hauteur :
it: Altezza:
nl: Hoogte:
pt: Altura:
zh_tw: 高度：

source: Preserve cover aspect ratio
fr: Préserver le rapport d'aspect de la couverture
it: Mantieni le proporzioni della copertina
nl: Bewaar de beeldverhouding van de omslag
pt: Preservar proporção do tamanho da capa
zh_tw: 保留封面長寬比

source: When opening a book enter fullscreen:
fr: A l'ouverture d'un livre, passer en plein écran :
it: All'apertura di un libro passa a schermo intero:
nl: Bij openen boek naar volledig scherm:
pt: Ao abrir um livro, entrar em ecrã inteiro:
zh_tw: 打开书籍时全屏显示：

source: Auto
fr: Automatique
pt: Automático
zh_tw: 自动

source: Add a new shortcut
fr: Ajouter un nouveau raccourci
it: Aggiungi una nuova scorciatoia
nl: Voeg een nieuwe sneltoets toe
pt: Adicionar um novo atalho
zh_tw: 加入新的快捷鍵

source: Press the key combination to use as a shortcut
fr: Appuyer sur la combinaison de touches à utiliser comme raccourci clavier
it: Premi la combinazione di tasti da usare come scorciatoia
nl: Druk op de toetsencombinatie om als sneltoets te gebruiken
pt: Pressione a combinação de teclas a usar como atalho
zh_tw: 按下按鍵組合來作為快捷鍵

source: Existing shortcuts:
fr: Raccourcis existants :
it: Scorciatoie da tastiera esistenti:
nl: Bestaande sneltoetsen:
pt: Atalhos existentes:
zh_tw: 已存在的快捷鍵：

source: Search for shortcut
fr: Rechercher un raccourci
it: Cerca una scorciatoia
nl: Zoek naar snelkoppeling
pt: Pesquisar por atalho
zh_tw: 按名称查找键盘快捷键

source: Restore defaults
fr: Restaurer les valeurs par défaut
it: Ripristina predefiniti
nl: Herstel standaard instellingen
pt: Repor predefinições
zh_tw: 還原為預設值

source: Control how scrolling works in paged mode
fr: Contrôler le fonctionnement du défilement en mode pagination
it: Controlla come funziona lo scorrimento in modalità Pagine
nl: Bepaal hoe scrollen werkt in gepagineerde modus
pt: Controlar modo de funcionamento do rolamento no modo paginado
zh_tw: 控制在頁面模式中捲動如何運作

source: Mouse wheel scrolls by screen fulls instead of pages
fr: La molette de la souris fait défiler les pages par écrans pleins au lieu de les faire défiler
it: La rotellina del mouse cambia l'intera schermata invece delle singole pagine
nl: Muiswiel scrolt per volledig scherm i.p.v. per pagina
pt: Roda do rato rola por ecrã em vez de páginas
zh_tw: 滑鼠滾輪捲動整個螢幕，而不是頁面

source: Clicking on the margins scrolls by screen fulls instead of pages
fr: Cliquer sur les marges fait défiler par plein écran au lieu de pages
it: Il clic sui margini cambia l'intera schermata invece delle singole pagine
nl: Bij klikken in de marges scrolt u per volledig scherm i.p.v. per pagina
pt: Clicar nas margens faz rolar por ecrã em vez de por páginas
zh_tw: 點擊邊界捲動整個螢幕，而不是頁面

source: Tapping scrolls by screen fulls instead of pages
fr: Défilement par pleins écrans au lieu de pages
it: Il tocco cambia l'intera schermata invece delle singole pagine
nl: Tikken scrolt per volledig scherm i.p.v. per pagina
pt: Clicar faz rolar por ecrã em vez de por páginas
zh_tw: 點擊捲動整個螢幕，而不是頁面

source: Pixel scroll threshold:
fr: Seuil de défilement des pixels :
it: Soglia di scorrimento in pixel:
nl: Pixel scroll drempel:
pt: Limite de rolagem de píxeis:
zh_tw: 像素滚动阈值：

source: When using a touchpad or mouse wheel that produces scroll events in pixels, set the number of pixels before a page turn is triggered
fr: Lorsque vous utilisez un pavé tactile ou une molette de souris qui produit des événements de défilement en pixels, définissez le nombre de pixels avant qu'un tour de page ne soit déclenché
it: Usando un touchpad una o rotellina del mouse che inviano ordini di scorrimento in pixel, imposta il numero di pixel necessario per voltare la pagina
nl: Bij gebruik muiswiel of touchpad dat scroll events in pixels maakt, stel aantal pixels in voor pagina omdraaien wordt geactiveerd
pt: Ao usar um touchpad ou roda do rato que produza eventos de rolagem em píxeis, determina o número de píxeis antes de acionar a rolagem de página
zh_tw: 使用以像素为单位生成滚动事件的触摸板或鼠标滚轮时，请设置触发翻页之前的像素数

source: Control how smooth scrolling works in flow mode
fr: Contrôler la fluidité du défilement en mode continu
it: Controlla come funziona lo scorrimento fluido in modalità Flusso
nl: Bepaal hoe soepel bladeren werkt in de flowmodus
pt: Controlar funcionamento do rolamento suave no modo fluido
zh_tw: 控制在直流模式中平滑捲動如何運作

source: Stop at internal file boundaries when smooth scrolling by holding down the scroll key
fr: Arrêt aux limites internes du fichier lors d'un défilement continu en maintenant la touche de défilement enfoncée
it: Con lo scorrimento fluido attivo, ferma ai limiti interni dei file tenendo premuto il tasto Bloc Scorr
nl: Stop bij interne bestandsgrenzen tijdens vloeiend bladeren door de bladertoets ingedrukt te houden
pt: Parar nos limites internos do ficheiro durante o rolamento suave ao manter carregada a tecla de rolamento
zh_tw: 當按住捲動按鍵平滑捲動時，停在內部檔案界限

source: Smooth scrolling speed in lines/sec:
fr: Vitesse de défilement régulière en lignes/sec :
it: Velocità dello scorrimento fluido in linee/sec:
nl: Vloeiende bladersnelheid in lijnen / sec:
pt: Velocidade do rolamento suave em linhas/seg.
zh_tw: 平滑捲動速度，以列/秒為單位：

source: Auto scrolling speed in lines/sec:
fr: Vitesse de défilement automatique en lignes/seconde :
it: Velocità dell'auto scorrimento in linee/sec:
nl: Automatische bladersnelheid in lijnen / sec:
pt: Velocidade do rolamento automático em linhas/seg.:
zh_tw: 自動捲動速度，以列/秒為單位：
