Repository: debian-calibre/calibre
Catalog: translations-git/content-server/*.po
Languages: fr, it, nl, pt, zh_tw

source: A comma-separated list of categories in which items containing periods are displayed in the Tag browser trees. For example, if this box contains 'tags' then tags of the form 'Mystery.English' and 'Mystery.Thriller' will be displayed with English and Thriller both under 'Mystery'. If 'tags' is not in this box, then the tags will be displayed each on their own line.
fr: Une liste de catégories séparée par des virgules dans laquelle les articles contenant des points sont affichés dans l'arborescence du Navigateur d'étiquettes. Par exemple, si ce champ contient "étiquettes" alors les étiquettes de la forme 'Mystère.Anglais' et 'Mystère.Suspense' seront affichées avec Anglais et Suspense toutes deux sous 'Mystère'. Si 'étiquettes' n'est pas dans ce champ, alors les étiquettes seront affichées chacune sur leur propre ligne.
it: Una lista di categorie separata da virgola in cui gli articoli contenenti punti vengono mostrate nell'albero dell'etichette del browser. Per esempio, se una casella contiene 'etichette' allora le etichette della forma 'Mistero.Inglese' e 'Mistero.Thriller' saranno mostrate con Inglese e Thriller entrambe sotto Mistero. Se le 'etichette' non sono in questa casella, allora saranno mostrate ognuna nella propria riga.
nl: Een komma gescheiden lijst met categorieën die waarden bevat waar een punt in voorkomt, worden weergegeven in de Tag browser boomstructuur. Bijvoorbeeld, als dit vak 'labels' bevat, dan zullen de labels van het formulier 'Mystery.English' en 'Mystery.Thriller' als English en Thriller getoond worden onder 'Mystery'. Als het vak geen 'labels' bevat, dan zullen de labels elk op hun eigen regel getoond worden.
pt: Uma lista de categorias, separadas por vírgulas, nas quais os itens que contenham pontos são exibidos nas árvores do navegador de conteúdos. Por exemplo, se esta caixa contiver 'tags' então as etiquetas na forma "Mistério.Inglês" e "Mistério.Suspense" serão exibidas com as palavras Inglês e Suspense por baixo de "Mistério". Se esta caixa não contiver 'tags' então as etiquetas serão mostradas cada uma na sua própria linha.
zh_tw: 标签浏览器树中显示包含句点的项目的类别的逗号分隔列表。例如，如果此框包含“标签”，则“Mystery.English”和“Mystery.Thriller”形式的标签将在“Mystery”下显示English和Thriller。如果“标签”不在此框中，则标签将以每行显示。

source: Hide empty categories (columns)
fr: Cacher les catégories vides (colonnes)
it: Nascondi categorie (colonne) vuote
nl: Verberg lege categorieën (kolommen)
pt: Ocultar categorias vazias (colunas)
zh_tw: 隱藏空分類（欄）

source: When checked, calibre will automatically hide any category (a column, custom or standard) that has no items to show. For example, some categories might not have values when using Virtual libraries. Checking this box will cause these empty categories to be hidden.
fr: Quand cette case est cochée, calibre cachera automatiquement toute catégorie (une colonne, personnalisée ou standard) qui n'a pas d'éléments à afficher Par exemple, certaines catégories pourraient ne pas avoir de valeurs en utilisant les Bibliothèques virtuelles. Cocher cette case entraînera que ces catégories vides seront cachées.
it: Quando selezionato, calibre nasconderà automaticamente ogni categoria (una colonna, predefinita o personalizzata) che non abbia elementi da mostrare. Per esempio, alcune categorie potrebbero non avere valori all'interno di Biblioteche virtuali. Selezionare questa casella nasconderà queste categorie vuote.
nl: Indien aangevinkt, verbergt calibre automatisch elke categorie (een kolom, aangepast of standaard) die geen items toont. Sommige categorieën hebben bijvoorbeeld mogelijk geen waarden bij het gebruik van virtuele bibliotheken. Als u dit vakje aanvinkt, worden deze lege categorieën verborgen.
pt: Se marcado, o Calibre irá automaticamente ocultar qualquer categoria (uma coluna, seja personalizada ou padrão) que não tenha itens para mostrar. Por exemplo, algumas categorias podem não ter valores quando se usam bibliotecas virtuais. Marcar esta caixa fará com que estas categorias vazias sejam escondidas.
zh_tw: 选中此选项后，校准将自动隐藏任何类别（列、自定义或标准），而不显示任何项。例如，有些类别在使用虚拟库时可能没有值。选中此框将导致隐藏这些空类别。

source: Configure Tag browser
fr: Configurer le Navigateur d’étiquettes
it: Configura il Navigatore dei Tag
nl: Configureer de label verkenner
pt: Configurar o navegador de conteúdos
zh_tw: 設定標籤瀏覽器

source: Read {}
fr: Lire {}
it: Leggi {}
nl: Lezen {}
pt: Ler {}
zh_tw: 閱讀 {}

source: Download {}
fr: Télécharger {}
it: Scarica {}
pt: Descarregar {}
zh_tw: 下載 {}

source: Failed to convert
fr: Échec de la conversion
it: Impossibile convertire
nl: Omzetten mislukt
pt: Falha ao converter
zh_tw: 無法轉換

source: Could not convert {}. Click "Show details" for more information
fr: Impossible de convertir {}. Cliquez sur "Afficher les détails" pour plus d'informations.
it: Impossibile convertire {}. Fai clic su "Mostra dettagli" per maggiori informazioni
nl: Converteren niet gelukt {}. Kies "Toon details" voor meer informatie
pt: Não foi possível converter {}. Carregue em "Mostrar detalhes" para mais informações.
zh_tw: 無法轉換 {}。請點選「顯示詳細資料」查看更多資訊。

source: Conversion failed!
fr: La conversion a échoué !
it: Conversione fallita!
nl: Omzetten mislukt!
pt: A conversão falhou!
zh_tw: 轉換失敗！

source: Error details below...
fr: Détails de l'erreur ci-dessous...
it: Dettagli errore di seguito...
nl: Foutmeldingen hieronder…
pt: Detalhes de erro abaixo...
zh_tw: 詳細錯誤資訊如下...

source: Conversion of {} was taking too long, and has been aborted
fr: La conversion de {} prenait trop de temps et a été annulée
it: La conversione di {} stava impiegando troppo tempo, ed è stata interrotta.
nl: Omzetten van {} duurde te lang en is daarom afgebroken
pt: A tarefa de conversão {} estava a levar demasiado tempo pelo que foi abortada.
zh_tw: {} 轉換過久，並且已經中止。

source: Conversion log
fr: Journal de conversion
it: Resoconto della conversione
nl: Converteren logboek
pt: Registo de conversão
zh_tw: 轉換日誌

source: Converting, please wait…
fr: Conversion en cours, veuillez patienter...
it: Conversione in corso, attendi...
nl: Bezig met omzetten, een ogenblik wachten alstublieft…
pt: A converter, por favor, aguarde...
zh_tw: 轉換中，請稍候…

source: Conversion progress can sometimes stall for a few minutes when converting complex books, that is normal.
fr: La progression de la conversion peut parfois s'arrêter pendant quelques minutes lors de la conversion de livres complexes, c'est normal.
it: L'avanzamento della conversione può a volte bloccarsi per alcuni minuti durante la conversione di libri complessi, questo è normale.
nl: Conversie voortgang kan trager gaan bij het converteren van complexe boeken; dat is normaal.
pt: O progresso da conversão pode, às vezes, parar por alguns minutos ao converter livros complexos, o que é normal.
zh_tw: 轉換複雜的書本時，轉換進度有時會停滯幾分鐘，這是正常的。

source: Click the close button in the top left corner to abort the conversion.
fr: Cliquez sur le bouton de fermeture dans le coin supérieur gauche pour annuler la conversion.
it: Fai clic sul pulsante di chiusura in alto a sinistra per interrompere la conversione
nl: Klik op de sluitknop linksboven om het converteren te stoppen.
pt: Clique no botão Fechar, no canto superior esquerdo, para cancelar a conversão.
zh_tw: 點選左上角的關閉按鈕以停止轉換。

source: Input format:
fr: Format d’entrée :
it: Formato input:
nl: Invoer bestandstype:
pt: Formato de origem:
zh_tw: 輸入格式：

source: Output format:
fr: Format de sortie :
it: Formato output:
nl: Uitvoer bestandstype:
pt: Formato de destino:
zh_tw: 輸出格式：

source: Start conversion
fr: Démarrer la conversion
it: Inizia la conversione
nl: Start converteren
pt: Iniciar conversão
zh_tw: 開始轉換

source: To change the settings for this conversion, click on one of the option groups below:
fr: Pour modifier les paramètres de cette conversion, cliquez sur l'un des groupes d'options ci-dessous :
it: Per cambiare le impostazioni di conversione, Fai clic su uno dei gruppi di opzioni qui sotto:
nl: Om de instellingen voor deze conversie te veranderen, kies één van de onderstaande opties:
pt: Para alterar as configurações desta conversão, carregue num dos grupos de opções abaixo:
zh_tw: 要變更這次轉換的設定，請點擊下方其中一個選項群組：

source: Heuristic processing
fr: Traitement heuristique
it: Elaborazione euristica
nl: Heuristische verwerking
pt: Processamento heurístico
zh_tw: 探索程式

source: Look & feel
fr: Apparence et présentation
it: Aspetto
nl: Uitstraling & gevoel
pt: Aparência
zh_tw: 外觀

source: Page setup
fr: Mise en page
it: Impostazioni pagina
nl: Pagina opmaak
pt: Configuração de página
zh_tw: 頁面設定

source: Search & replace
fr: Rechercher & remplacer
it: Cerca e sostituisci
nl: Zoeken & vervangen
pt: Pesquisar e substituir
zh_tw: 搜尋及取代

source: Structure detection
fr: Détection de la structure
it: Rilevazione struttura
nl: Structuur detectie
pt: Deteção de estrutura
zh_tw: 結構偵測

source: {} input
fr: Entrée {}
nl: {} Invoer
pt: {} entrada
zh_tw: {} 輸入

source: {} output
fr: Sortie {}
nl: {} Uitvoer
pt: {} destino
zh_tw: {} 輸出

source: Configuring {} settings
fr: Configurer les paramètres {}
it: Configurazione {} impostazioni
nl: Instellen {} instelwaarden
pt: A configurar {} definições
zh_tw: 正在設定 {} 設定

source: Failed to load conversion data from calibre, with error:
fr: Échec du chargement des données de conversion depuis calibre, avec erreur :
it: Impossibile caricare i dati di conversione da calibre, con errore:
nl: Fout bij laden conversiegegevens van calibre, foutmelding:
pt: Falha ao carregar os dados de conversão do Calibre, com o erro:
zh_tw: 無法從 calibre 中載入轉換資料，錯誤為：

source: Convert: {}
fr: Convertir : {}
it: Converti: {}
nl: Converteren {}
pt: Converter: {}
zh_tw: 轉換：{}

source: Loading conversion data, please wait...
fr: Chargement des données de conversion, veuillez patienter…
it: Caricamento dati di conversione, attendere...
nl: Laden conversiegegevens, een ogenblik geduld...
pt: A carregar dados de conversão, por favor, aguarde ...
zh_tw: 正在載入轉換資料，請稍候…

source: Convert book
fr: Convertir des livres
it: Converti libro
nl: Converteer boek
pt: Converter livro
zh_tw: 轉換書本

source: &Fonts
fr: &Polices
it: &Caratteri
nl: &Lettertypes
pt: &Tipos de letra
zh_tw: 字型(&F)

source: &Disable font size rescaling
fr: &Désactiver le redimensionnement de la taille de police
it: &Disattiva il ridimensionamento dei caratteri
nl: &Deactiveer lettergrootteherschaling
pt: &Desativar reescalonamento do tamanho do tipo de letra
zh_tw: 停用字型大小縮放(&D)

source: Base font si&ze:
fr: Taille de la poli&ce de base :
it: Dimen&sioni carattere di base
nl: Basis letter&grootte:
pt: Tamanho ba&se do tipo de letra:
zh_tw: 基礎字型大小(&Z):

source: Font size &key:
fr: &Clé pour la taille de la police :
it: Grandezza caratteri &chiave:
nl: &Sleutel voor lettergrootte:
pt: C&have do tamanho do tipo de letra:
zh_tw: 字型大小設定鍵(&K):

source: Minim&um line height:
fr: Haute&ur de ligne minimale :
it: Altezza min&ima riga:
nl: Minima&le regelhoogte:
pt: &Altura de linha mínima:
zh_tw: 最小行高(&U):

source: Line hei&ght:
fr: &Hauteur de ligne :
it: Alt&ezza linea:
nl: Regel hoo&gte:
pt: &Altura da linha:
zh_tw: 行高(&G)：

source: Embed font fami&ly:
fr: Fami&lle de polices intégrée :
it: Integra la fami&glia di caratteri:
nl: Voeg l&ettertype familie toe:
pt: &Incorporar família da letra:
zh_tw: 內嵌字體(&L):

source: &Embed all fonts in document
fr: &Intégrer toutes les polices dans le document
it: Int&egra tutti i caratteri nel documento
nl: &Alle lettertypes insluiten in document
pt: &Incorporar todos os tipos de letra no documento
zh_tw: 嵌入所有文件中的字型(&E)

source: &Subset all embedded fonts
fr: &Sous-ensemble de toutes les polices incorporées
it: &Riduci tutti i caratteri integrati
nl: Alle ingesloten lettertypen &uitdunnen
pt: &Segmentar todos os tipos de letra incorporados
zh_tw: 所有內嵌字型使用子集(&S)

source: Keep &ligatures
fr: Conserver les &ligatures
it: Mantieni &legami
nl: &Ligaturen behouden
pt: Manter &ligatura
zh_tw: 保留連字(&L)

source: Te&xt
fr: Te&xte
it: Tes&to
pt: Te&xto
zh_tw: 文字(&X)

source: I&nput character encoding:
fr: E&ncodage des caractères d'entrée :
it: Codifica caratteri in i&ngresso
nl: Tekencodering van &invoer:
pt: &Codificação de caracteres de origem:
zh_tw: 輸入字元編碼(&N)：

source: Text &justification:
fr: &Justification du texte :
it: &Giustificazione del testo:
nl: Tekst &uitlijning:
pt: &Alinhamento do texto:
zh_tw: 文字左右對齊(&J):

source: Left align
fr: Aligner à gauche
it: Allineamento a sinistra
nl: Links uitlijnen
pt: Alinhar à esquerda
zh_tw: 靠左對齊

source: Justify text
fr: Justifier le texte
it: Testo giustificato
nl: Tekst uitvullen
pt: Justificar texto
zh_tw: 左右對齊文字

source: Smarten &punctuation
fr: Améliorer la &ponctuation
it: &Punteggiatura migliorata
nl: Inter&punctie verbeteren
pt: &Pontuação inteligente
zh_tw: 智慧型標點符號(&P)

source: &Unsmarten punctuation
fr: Simplifier la ponct&uation
it: P&unteggiatura semplice
nl: Slimme interpunctie &uitschakelen
pt: Desfazer pont&uação inteligente
zh_tw: &取消自动标点符号

source: &Transliterate Unicode characters to ASCII
fr: &Translittérer les caractères Unicode en ASCII
it: &Trasforma i caratteri Unicode in caratteri ASCII
nl: Zet Unicode&tekens naar ASCII om
pt: &Transliterar caracteres Unicode para ASCII
zh_tw: 將 Unicode 字元轉為 ASCII 音譯 (&T)

source: Lay&out
fr: A&gencement
it: Asp&etto
pt: &Visual
zh_tw: 配置(&O)

source: Remove &spacing between paragraphs
fr: &Supprimer l’interligne entre les paragraphes
it: Rimuovi gli spa&zi tra i paragrafi
nl: Verwijder witruimte&s tussen alinea's
pt: Remover &espaçamento entre parágrafos
zh_tw: 移除段落間距(&S)

source: I&ndent size:
fr: Taille de l'inde&ntation :
it: Dimensioni r&ientro:
nl: Omvang i&nspringen:
pt: Tamanho do ava&nço
zh_tw: 縮排大小(&N):

source: Insert &blank line between paragraphs
fr: Insérer une ligne &blanche entre les paragraphes
it: Inserisci &blank righe vuote tra i paragrafi
nl: &Blanco regel tussen paragrafen toevoegen
pt: Inserir linha em &branco entre parágrafos
zh_tw: 在段落之間插入空白行(&B)

source: &Line size:
fr: &Taille de la ligne :
it: Dimensione &Line:
nl: Rege&l grootte:
pt: &Tamanho da linha:
zh_tw: 行距(&L):

source: &Linearize tables
fr: &Transformer les tableaux en texte
it: &Linearizza le tabelle
nl: Tabellen naar rege&ls omzetten
pt: &Linearizar as tabelas
zh_tw: 表格直線化(&L)

source: St&yling
fr: Est&hétique
it: St&ilizzazione
nl: Vorm&geving
pt: &Estilo
zh_tw: 樣式(&Y)

source: Filter style information
fr: Filtrer l'information de style
it: Filtra informazioni di stile
nl: Filter stijl informatie
pt: Filtrar informação do estilo
zh_tw: 篩選器樣式資訊

source: <b>Heuristic processing</b> means that calibre will scan your book for common patterns and fix them. As the name implies, this involves guesswork, which means that it could end up worsening the result of a conversion, if calibre guesses wrong. Therefore, it is disabled by default. Often, if a conversion does not turn out as you expect, turning on heuristics can improve matters. Read more about the various heuristic processing options in the <a href="%s">User Manual</a>.
fr: <b>Traitement heuristique</b> signifie que calibre va sonder votre livre à la recherche de schémas communs et va les arranger. Comme son nom l’indique, un traitement heuristique implique de se baser sur des suppositions, ce qui peut entraîner au final un résultat pire que l'original, si calibre a fait une erreur d'analyse. C'est pourquoi cette option est désactivée par défaut. Le plus souvent, si le résultat d'une conversion n'a pas produit ce que vous en attendiez, activer le traitement heuristique peut alors améliorer le résultat. Vous pouvez en apprendre davantage sur les divers processus du traitement heuristique dans le <a href="%s">Manuel utilisateur</a>.
it: <b>Elaborazione euristica</b> significa che calibre effettuerà una scansione dei libri per rilevare modelli comuni e li sistemerà. Come indica il nome, questo processo si basa su un'elaborazione automatica che potrebbe persino peggiorare il risultato finale di una conversione. Per questo è disabilitato in modo predefinito. Spesso, se una conversione non risulta precisa, attivare questa opzione potrebbe migliorare la situazione. Maggiori informazioni sulle opzioni dell'elaborazione euristica si trovano nel <a href="%s">Manuale utente</a>.
nl: <b>Heuristische verwerking</b> betekend dat calibre uw boek zal doorzoeken op veelvoorkomende patronen en deze repareren. Zoals de neem aangeeft, omvat dit giswerk, wat inhoudt dat het de omzetting kan verslechteren, als calibre verkeert kiest. Daarom is het standaard uitgeschakeld. Vaak, als een omzetting niet voltooid zoals verwacht, kan heuristische verwerking aanzetten, het resultaat verbeteren. Lees meer over de diverse heuristische verwerkingsopties in de <a href="%s">handleiding</a>.
pt: <b>Processamento heurístico</b> significa que o Calibre irá procurar no seu livro padrões comuns e corrigi-los. Como o nome indica, isto envolve trabalho de estimativa, o que significa que pode piorar o resultado da conversão caso o Calibre faça cálculos errados. Por isso está desativado por predefinição. Se a conversão não ficar como espera, ativar o processamento heurístico pode melhorar os resultados. Leia mais sobre as várias opções de processamento heurístico no <a href="%s">Manual do utilizador</a>
zh_tw: 探索式處理意思就是指calibre將會掃描你的書本的通用格式，並且修正他們。就如其名，這項處理涉及猜測，也就是如果calibre搞錯了，可能會讓轉換出來的結果更加糟糕，所以預設是關閉的。通常，如果轉換結果不如你預期，把選項打開，可以改善情況。請到<a href="%s">使用者手冊</a>了解更多關於探索式處理的選項。

source: Enable &heuristic processing
fr: Activer le traitement &heuristique
it: Abilita l'elaborazione &euristica
nl: Gebruik &heuristische verwerking
pt: Ativar &processamento heurístico
zh_tw: 啟用探索式處理

source: Unwrap lines
fr: Redéfinir les lignes
it: Ricongiungi righe
nl: Verwijderen harde regeleinden
pt: Desembrulhar linhas
zh_tw: 不換列

source: Line &un-wrap factor:
fr: Facte&ur de redéfinition des lignes :
it: Fattore di &rimozione linea:
nl: Lijn & un-wrap factor:
pt: Fator de eliminação de &quebras de linha:
zh_tw: 不換列係數(&U)：

source: Detect and markup unformatted chapter headings and sub headings
fr: Détecter et mettre en forme les titres de chapitre et les sous-titres sans mise en forme
it: Rileva e marca titoli e sottotitoli non formattati dei capitoli
nl: Detecteer en formatteer ongeformatteerde titels van (sub)hoofdstukken
pt: Detetar e codificar títulos e subtítulos de capítulos não formatados
zh_tw: 偵測並標記未格式化的章節標題與副標題

source: Renumber sequences of <h1> or <h2> tags to prevent splitting
fr: Renuméroter les séquences de balises <h1> ou <h2> afin de prévenir la division
it: Rinumera sequenze di tag <h1> o <h2> per evitare di spezzare il testo
nl: Hernummer opeenvolgende <h1>- en <h2>-labels om splitsing te voorkomen
pt: Renumerar sequências de etiquetas <h1> ou <h2> para evitar separação
zh_tw: 對<h1>或<h2>標籤進行重新編號以避免編號混亂

source: Delete blank lines between paragraphs
fr: Supprimer les lignes blanches entre les paragraphes
it: Elimina le righe vuote tra paragrafi
nl: Verwijder blanco regels tussen alinea's
pt: Apagar linhas em branco entre parágrafos
zh_tw: 刪除段落間的空白列

source: Ensure scene breaks are consistently formatted
fr: Garantir une mise en forme cohérente des séparations entre deux scènes
it: Assicura che i marcatori di interruzione di scena siano sempre formattati
nl: Zorg ervoor dat regeleinden tussen scenes er overal hetzelfde uitzien
pt: Assegurar que as quebras de cena são formatadas de forma consistente
zh_tw: 確保場景中斷持續有格式化

source: Rep&lace soft scene breaks:
fr: Rem&placer les symboles de séparation entre deux scènes :
it: Sost&ituisci i salti di scena semplici:
nl: Ver&vang zachte returns:
pt: &Substituir quebras suaves de cena:
zh_tw: 取代小節分隔符(&L)：

source: Remove unnecessary hyphens
fr: Enlever les traits d’union superflus
it: Rimuovi trattini superflui
nl: Verwijder overbodige liggende streepjes
pt: Remover hífenes desnecessários
zh_tw: 移除不必要的連字符

source: Italicize common words and patterns
fr: Mettre en italique les mots et les schémas usuels
it: Applica il corsivo alle parole comuni e agli schemi
nl: Veel voorkomende woorden en patronen cursiveren
pt: Colocar em itálico palavras comuns e padrões
zh_tw: 將一般文字與圖案斜體化

source: Replace entity indents with CSS indents
fr: Remplacer les mises en retrait par des retraits CSS
it: Sostituisci i rientri delle entità con i rientri del CSS
nl: Inspringen vervangen door CSS-inspringen
pt: Substituir entidades de indentação por indentação CSS
zh_tw: 將實體縮排以 CSS 縮排取代

source: Left page margin
fr: Marge de gauche
it: Margini sinistro
nl: Linker paginamarge
pt: Margem esquerda da página
zh_tw: 左頁面邊界

source: Top page margin
fr: Marge supérieure
it: Margine superiore
nl: Top paginamarge
pt: Margem superior da página
zh_tw: 頂端頁面邊界

source: Right page margin
fr: Marge de droite
it: Margine destro
nl: Rechter paginamarge
pt: Margem direita da página
zh_tw: 右頁面邊界

source: Bottom page margin
fr: Marge inférieure
it: Margine inferiore
nl: Onder paginamarge
pt: Margem inferior da página
zh_tw: 底部頁面邊界

source: &Input profile:
fr: Profil d’&Entrée :
it: Personalizzazione &input:
nl: &Invoerprofiel:
pt: Perfil de or&igem:
zh_tw: 輸入設定檔(&I):

source: &Output profile:
fr: Profil de &Sortie :
it: Personalizzazione &output:
nl: Uitvoerpr&ofiel:
pt: Perfil de destin&o:
zh_tw: 輸出設定檔(&O):

source: Detect chapters at
fr: Détecter les chapitres sur
it: Rileva capitoli in
nl: Detecteer hoofdstukken op
pt: Detetar capítulos em
zh_tw: 偵測章節於

source: Chap&ter mark:
fr: Marque de chapitre :
it: Marcatura Capi&tolo
nl: Hoofd&stukmarkering:
pt: &Marca de capítulo:
zh_tw: 章節標記(&T)：

source: Remove first &image
fr: Supprimer la première &image
it: Rimuovi la prima &immagine
nl: Verwijder eerste afbeeld&ing
pt: Remover a primeira &imagem
zh_tw: 移除首張圖片(&I)

source: Remove &fake margins
fr: Supprimer les &fausses marges
it: Rimuovi i &falsi margini
nl: Verwijder &valse marges
pt: Remover margens &falsas
zh_tw: 移除假的邊界(&F)

source: Insert metadata at start of book
fr: Insérer les métadonnées au début du livre
it: Inserisci metadati all'inizio del libro
nl: Voeg metadata in aan het begin van het boek
pt: Inserir metadados no início do livro
zh_tw: 在書本開頭插入詮釋資料

source: Insert page breaks before
fr: Insérer les sauts de page avant
it: Inserisci interruzione di pagina prima
nl: Voeg pagina-einde in voor
pt: Inserir quebras de página antes
zh_tw: 在此之前插入分頁符號

source: Start reading at
fr: Commencez la lecture à
it: Inizia a leggere a
nl: Begin lezen op
pt: Começar a ler em
zh_tw: 開始閱讀於

source: &Force use of auto-generated Table of Contents
fr: &Forcer l’utilisation d’une Table des Matières auto-générée
it: &Forza l'uso dell'indice generato automaticamente
nl: Gebruik van automatisch aangemaakte inhoudsopgave &forceren
pt: &Forçar a utilização de índices gerados automaticamente
zh_tw: 強制使用自動產生的目錄頁(&F)

source: Do not add &detected chapters to the Table of Contents
fr: Ne pas ajouter les chapitres &détectés à la Table des Matières
it: N&on aggiungere all'indice i capitoli rilevati
nl: Geen ge&detecteerde hoofdstukken toevoegen aan de inhoudsopgave
pt: Não adicionar os capítulos &detetados ao índice
zh_tw: 不要將偵測到的章節加入目錄頁(&D)

source: Allow &duplicate links when creating the Table of Contents
fr: Autoriser les liens &dupliqués lors de la création de la Table des Matières
it: Consenti collegamenti &duplicati in fase di creazione dell'indice
nl: &Dubbele koppelingen toestaan bij het aanmaken van de inhoudsopgave
pt: Permitir &duplicar ligações ao criar um novo índice
zh_tw: 建立目錄頁時允許重複的連結(&D)

source: Number of &links to add to Table of Contents:
fr: Nombre de &liens à ajouter à la Table des Matières :
it: Numero di &links da aggiungere alla Tavola dei Contenuti:
nl: Aantal &links toe te voegen aan de inhoudsopgave:
pt: Número de &atalhos a adicionar ao índice:
zh_tw: 加入目錄頁的連結數：

source: Chapter &threshold:
fr: Seuil de &chapitre :
it: &Limiti del capitolo:
nl: Drempel aan&tal hoofdstukken:
pt: &Limite de capítulos:
zh_tw: 章節範圍：

source: TOC &filter:
fr: &Filtre TDM :
it: &Filtro TOC:
pt: &Filtro do índice:
zh_tw: 目錄篩選條件：
