Repository: debian-calibre/calibre
Catalog: translations-git/content-server/*.po
Languages: fr, it, nl, pt, zh_tw

source: Monospace
it: Spaziatura fissa
nl: Niet-proportioneel
zh_tw: 等寬

source: Original
it: Originale
nl: Origineel
zh_tw: 原始

source: Google Books
fr: Google Livres
it: Google Libri
nl: Google Boeken
zh_tw: Google 圖書

source: Normal
it: Normale
nl: Standaard
zh_tw: 一般

source: Cache
zh_tw: 快取

source: This highlight overlaps existing highlights. Creating it will cause notes in the existing highlights to be lost. Create it anyway?
fr: Cette mise en évidence chevauche des mises en évidence existantes. Sa création entraînera la perte de notes dans les mises en évidence existantes. La créer quand même ?
nl: Dit markering overlapt bestaande markeringen. Als u doorgaat, gaan notities in de bestaande markeringen verloren. Toch maken?
