Repository: debian-calibre/calibre
Catalog: translations-git/content-server/*.po
Languages: fr, it, nl, pt, zh_tw

source: There are no other calibre libraries available to copy the book to
fr: Il n'y a pas d'autres bibliothèques de calibre disponibles pour y copier le livre
it: Non ci sono altre librerie di calibre in cui copiare il libro
nl: Er zijn geen andere calibre bibliotheken beschikbaar om het boek naar te kopiëren
pt: Não estão disponíveis outras bibliotecas Calibre para onde copiar os livros
zh_tw: 沒有其他 calibre 書庫可複製書本

source: Choose the library to copy to below
fr: Choisissez ci-dessous la bibliothèque vers laquelle copier ci-dessous
it: Scegli la libreria da copiare sotto
nl: Kies de bibliotheek om naar hieronder te kopiëren
pt: Escolher a biblioteca para onde copiar
zh_tw: 選擇要複製到下方的書庫

source: Continue reading…
fr: Continuer la lecture...
it: Continua la lettura...
nl: Lees verder...
pt: Continuar a ler...
zh_tw: 繼續閱讀...

source: Browse all downloaded books…
fr: Parcourir tous les livres téléchargés...
it: Sfoglia tutti i libri scaricati
nl: Doorblader alle afgehaalde boeken...
pt: Navegar em todos os livros descarregados…
zh_tw: 瀏覽全部已下載的書本…

source: Change password for: {}
fr: Changer le mot de passe pour : {}
it: Cambia password per: {}
nl: Wijzig wachtwoord voor: {}
pt: Alterar senha de: {}
zh_tw: 變更密碼：{}

source: Current password:
fr: Mot de passe actuel :
it: Password attuale:
nl: Huidig wachtwoord:
pt: Senha atual:
zh_tw: 目前的密碼：

source: New password:
fr: Nouveau mot de passe :
it: Nuova password:
nl: Nieuw wachtwoord:
pt: Nova senha:
zh_tw: 新的密碼:

source: New password again:
fr: Entrer le nouveau mot de passe à nouveau :
it: Ripeti nuova password:
nl: Nieuw wachtwoord nogmaals:
pt: Repetir nova senha:
zh_tw: 再次輸入新的密碼:

source: Password successfully changed, you will be asked for the new password the next time the browser has to contact the calibre server.
fr: Mot de passe modifié avec succès, le nouveau mot de passe vous sera demandé la prochaine fois que le navigateur aura à contacter le serveur calibre.
it: La password è stata modificata con successo: quando il browser contatterà il server di calibre la prossima volta verrà richiesta la nuova password.
nl: Wachtwoord succesvol gewijzigd. U zal gevraagd worden om het nieuwe wachtwoord bij een volgend verzoek aan de calibre Server.
pt: A senha foi alterada com sucesso. Ser-lhe-á perguntado pela nova senha da próxima vez que o navegador tiver de contactar o servidor do Calibre.
zh_tw: 密碼已修改成功，您在下次向 caliber 連線時請輸入新的密碼

source: Failed to change password, with error: {}
fr: Échec lors du changement de mot de passe, erreur : {}
it: Impossibile cambiare la password per questo errore: {}
nl: Wijzigen van wachtwoord mislukt, met fout: {}
pt: Não foi possível alterar a senha. Erro: {}
zh_tw: 發生錯誤{}，無法變更密碼

source: The two new passwords do not match
fr: Les deux nouveaux mots de passe ne correspondent pas
it: Le due password nuove non coincidono
nl: De twee nieuwe wachtwoorden stemmen niet overeen
pt: As duas novas senhas não coincidem
zh_tw: 兩個密碼並不一致

source: Empty passwords are not allowed
fr: Les mots de passe vident ne sont pas permis
it: Non sono ammesse password vuote
nl: Lege velden als wachtwoord zijn niet toegestaan
pt: Não são permitidas senhas vazias
zh_tw: 不允許使用空白的密碼

source: Contacting server, please wait...
fr: Communication avec le serveur, merci de patienter
it: Contatto del server in corso. Attendere...
nl: Even geduld aub, contact opnemen met de server...
pt: A contactar o servidor. Por favor aguarde...
zh_tw: 正在和伺服器連線中，請稍候...

source: Logged in as {}
fr: Connecté en tant que {}
it: Autenticato come {}
nl: Aangemeld als {}
pt: Autenticado como {}
zh_tw: 已經以 {} 登入了

source: You are logged in as the user <b>{}</b>. To log in as a different user, you will have to restart the browser.
fr: Vous êtes connecté en tant qu'utilisateur <b>{}</b>. Pour se connecter avec un utilisateur différent, vous aurez à redémarrer le navigateur.
it: Sei autenticato come utente <b>{}</b>. Per autenticarti come un utente diverso, devi riavviare il browser.
nl: U bent aangemeld als gebruiker 1{}1. Gelieve uw browser te herstarten om aan te melden als een andere gebruiker.
pt: Está autenticado como utilizador <b>{}</b>. Para se autenticar como um utilizador diferente, tem de reiniciar o browser.
zh_tw: 目前登入的使用者為<b>{}</b>。如想切換帳戶，請重新啟動瀏覽器

source: Change password
fr: Changer le mot de passe
it: Cambia password
nl: Wijzig wachtwoord
pt: Alterar senha
zh_tw: 修改密碼

source: Choose the calibre library to browse…
fr: Choisir la bibliothèque calibre à parcourir...
it: Scegli la libreria Calibre da sfogliare...
nl: Kies de calibre bibliotheek om te bladeren...
pt: Escolha a biblioteca a navegar...
zh_tw: 選擇要瀏覽的 calibre 書庫...

source: Choose style
fr: Choisir le style
it: Scegli lo stile
nl: Kies stijl
pt: Escolha o estilo
zh_tw: 選擇風格

source: Choose the block style you would like to use
fr: Choisissez le bloc de style que vous souhaitez utiliser
it: Scegli il blocco di stili che ti piacerebbe utilizzare
nl: Kies de blokstijl die u wilt gebruiken
pt: Escolha o estilo do bloco que quer usar
zh_tw: 選擇您想用的區塊風格

source: Quote
fr: Citation
it: Virgolette
nl: Citaat
pt: Citação:
zh_tw: 引號

source: Name (optional):
fr: Nom (facultatif) :
it: Nome (opzionale):
nl: Naam: (Optioneel):
pt: Nome (opcional):
zh_tw: 名稱（可選）：

source: Remove formatting
fr: Effacer la mise en forme
it: Rimuovi la formattazione
nl: Opmaak verwijderen
pt: Remover formatação
zh_tw: 移除格式

source: Undo
fr: Annuler
it: Annulla
nl: Ongedaan maken
pt: Desfazer
zh_tw: 復原

source: Redo
fr: Rétablir
it: Rifai
nl: Herdoen
pt: Refazer
zh_tw: 取消復原

source: Bold
fr: Gras
it: Grassetto
nl: Vet
pt: Negrito
zh_tw: 粗體

source: Italic
fr: Italique
it: Corsivo
nl: Cursief
pt: Itálico
zh_tw: 斜體

source: Strikethrough
fr: Barré
it: Barrato
nl: Doorstreept
pt: Riscado
zh_tw: 刪除線

source: Superscript
fr: Exposant
it: Apice
nl: Superschrift
pt: Sobrescrito
zh_tw: 上標

source: Subscript
fr: Indice
it: Pedice
nl: Onderschrift
pt: Subscrito
zh_tw: 下標

source: Insert separator
fr: Insérer un séparateur
it: Inserisci separatore
nl: Scheidingsteken invoegen
pt: Inserir separador
zh_tw: 插入分割符

source: Style the selected text block
fr: Appliquer le style au bloc de texte sélectionné
it: stile del blocco di testo selezionato
nl: Styleer gelselecteerd tekstblok
pt: Aplicar estilo ao bloco de texto selecionado
zh_tw: 選取的文字區塊樣式

source: Unordered list
fr: Liste non ordonnée
it: Elenco puntato
nl: Ongeordende lijst
pt: Lista não ordenada
zh_tw: 無序清單

source: Ordered list
fr: Liste numérotée
it: Elenco numerato
nl: Geordende lijst
pt: Lista ordenada
zh_tw: 有序清單

source: Increase indentation
fr: Augmenter l’indentation
it: Aumenta indentazione
nl: Inspringen vergroten
pt: Aumentar indentação
zh_tw: 增加縮排

source: Decrease indentation
fr: Diminuer l’indentation
it: Diminuisci indentazione
nl: Inspringen verkleinen
pt: Diminuir indentação
zh_tw: 減少縮排

source: Align left
fr: Aligner à gauche
it: Allinea a sinistra
nl: Links uitlijnen
pt: Alinhar à esquerda
zh_tw: 靠左對齊

source: Align justified
fr: Justifier
it: Giustificato
nl: Regels even lang maken
pt: Justificado
zh_tw: 左右對齊

source: Align center
fr: Centrer
it: Allinea al centro
nl: Centreren
pt: Alinhar ao centro
zh_tw: 置中對齊

source: Align right
fr: Aligner à droite
it: Allinea a destra
nl: Rechts uitlijnen
pt: Alinhar à direita
zh_tw: 靠右對齊

source: Insert a link or linked image
fr: Insérer un lien ou une image liée
it: Inserisci un link o immagine
nl: Voeg een link of gekoppelde afbeelding in
pt: Insira uma hiperligação ou uma imagem hiperligada
zh_tw: 插入一個超連結或是圖片連結

source: Insert a link
fr: Insérer un lien
it: Inserisci un link
nl: Voeg een link in
pt: Inserir ligação
zh_tw: 插入一個連結

source: Enter the link URL and optionally the link name
fr: Entrez l'URL du lien et éventuellement le nom du lien
it: Inserisci il link all'URL e opzionalmente il nome del link
nl: Voer de link-URL in en eventueel de link-naam
pt: Introduza o URL da hiperligação e opcionalmente o nome da hiperligação
zh_tw: 輸入超連結和可選填的連結名稱

source: Insert an image
fr: Insérer une image
it: Inserisci un'immagine
nl: Voeg een afbeelding in
pt: Inserir imagem
zh_tw: 插入圖片

source: Enter the image URL and optionally the image name
fr: Entrez l'URL de l'image et éventuellement le nom de l'image
it: Inserisci l'URL dell'immagine e opzionalmente il nome dell'immagine
nl: Voer de afbeeldings-URL in en eventueel de afbeeldingsnaam
pt: Introduza o URL da imagem e opcionalmente o nome da imagem
zh_tw: 輸入圖片連結和可選填的圖片名稱

source: Change the text color
fr: Changer la couleur du texte
it: Cambia il colore del testo
nl: Verander de tekstkleur
pt: Alterar a cor do texto
zh_tw: 更改文字顏色

source: Choose text color
fr: Sélectionner la couleur du texte
it: Scegli il colore del testo
nl: Kies tekst kleur
pt: Escolher cor do texto
zh_tw: 選擇文字顏色

source: Choose the color below
fr: Choisir la couleur ci-dessous
it: Scegli tra i seguenti colori
nl: Kies de kleur hieronder
pt: Escolha a cor abaixo
zh_tw: 選擇下面的顏色

source: Change the highlight color
fr: Modifier la couleur de surbrillance
it: Cambia il colore dell'evidenziatore
nl: Verander de markeerkleur
pt: Alterar cor de destaque
zh_tw: 更改醒目提示顏色

source: Choose highlight color
fr: Choisir la couleur de surbrillance
it: Scegli il colore dell'evidenziatore
nl: Kies markeerkleur
pt: Escolher cor de destaque
zh_tw: 選擇醒目提示顏色

source: Loading comments editor...
fr: Chargement de l'éditeur de commentaires...
it: Sto caricando i commenti dell'editore...
nl: Opmerkingen-editor laden ...
pt: A carregar o editor de comentários...
zh_tw: 載入評論編輯器中...

source: This will remove the downloaded book from local storage. Are you sure?
fr: Cela permettra de supprimer le livre téléchargé du stockage local. Êtes-vous certain·e ?
it: Questa azione rimuoverà il libro scaricato dalla memoria locale. Sei sicuro?
nl: Hiermee wordt het gedownloade boek verwijderd uit de lokale opslag. Weet u het zeker?
pt: Isto removerá o livro descarregado da sua pasta local. Pretende mesmo continuar?
zh_tw: 這會從本機儲存空間移除所有 {} 個已下載的書籍。您確定嗎？

source: Deleting one book, please wait...
fr: Suppression d'un livre, merci de patienter...
it: Sto eliminando un libro, attendi per favore...
nl: Een boek verwijderen, even geduld ...
pt: A eliminar livro, por favor, aguarde....
zh_tw: 正在刪除 {} 本書籍，請稍候...

source: What would you like to do with this book?
fr: Que voudriez-vous faire avec ce livre ?
it: Cosa vorresti fare con questo libro?
nl: Wat wil u te doen met dit boek?
pt: O que quer fazer com este livro?
zh_tw: 你想對這本書做什麼？

source: No downloaded books present
fr: Aucun livres téléchargés présents
it: Nessun libro scaricato presente
nl: Geen afgehaalde boeken aanwezig
pt: Não existem livros transferidos
zh_tw: 當前沒有已下載書本

source: Database not initialized
fr: La base de données n'est pas initialisée
it: Database non inizializzato
nl: Gegevensbank niet geïnitialiseerd
pt: Base de dados não inicializada
zh_tw: 資料庫並未初始化

source: Downloaded books
fr: Livres téléchargés
it: Libri scaricati
nl: Afgehaalde boeken
pt: Livros transferidos
zh_tw: 已下載書本

source: Delete all downloaded books
fr: Supprimer tous les livres téléchargés
it: Elimina tutti i libri scaricati
nl: Verwijder alle afgehaalde boeken
pt: Eliminar todos os livros descarregados
zh_tw: 刪除所有已下載的書籍

source: Loading downloaded books from local storage, please wait...
fr: Chargement des livres téléchargés depuis le stockage local, merci de patienter...
it: Carico i libri scaricati dalla memoria locale, attendi per favore...
nl: Gedownloade boeken laden vanuit lokale opslag, even geduld...
pt: A carregar livros transferidos do armazenamento. Por favor, aguarde...
zh_tw: 正在從本機儲存空間載入已下載的書籍，請稍候...

source: Donate to support calibre development
fr: Faire une donation pour supporter le développement de calibre
it: Donazione per supportare lo sviluppo di calibre
nl: Doneer om calibre ontwikkelingen te ondersteunen
pt: Fazer um donativo para apoiar o desenvolvimento do Calibre
zh_tw: 贊助 caliber 的開發

source: Search contains smart quotes
fr: La recherche contient des guillemets intelligents
it: La ricerca contiene virgolette intelligenti
nl: Zoekopdracht bevat smart quotes
pt: Pesquisa contém citações inteligentes
zh_tw: 包含智慧型引號的搜尋

source: The search expression {} contains smart quotes. By default, Apple inserts smart quotes instead of normal quotes when tapping the quote button. This will prevent the search from working, if you intended to use normal quotes. You can type normal quotes by long-tapping the quotes button. Do you want to keep the smart quotes or replace them with normal quotes?
fr: L’expression de recherche {} contient des guillemets intelligents. Par défaut, Apple insère des guillemets intelligents à la place des guillemets normaux lorsque l'on appuie le bouton guillemets. Ceci empêchera la recherche de fonctionner, si vous aviez prévu d'utiliser des guillemets normaux. Vous pouvez entrer des guillemets normaux en faisant un appui long sur le bouton guillemets. Voulez-vous garder les guillemets intelligents ou les remplacer par des guillemets normaux ?
it: L'espressione di ricerca {} contiene riferimenti intelligenti. Per impostazione predefinita Apple inserisce le virgolette intelligenti con il pulsante "virgolette", questo impedirà il corretto funzionamento della ricerca se intendevi utilizzare quelle normali . Puoi digitare le virgolette normali con una pressione prolungata del tasto "virgolette". Vuoi mantenere le virgolette intelligenti oppure vuoi sostituirle con quelle normali?
nl: De zoekopdracht {} bevat smart quotes. Standaard voegt Apple smart quotes in plaats van normale quotes toe wanneer de quote knop wordt geklikt. Wanneer u van plan was om normale quotes te gebruiken, mislukt de zoekopdracht. U kan normale quotes toevoegen door lang op de quotes knop te klikken. Wilt u de smart quotes behouden, of wilt u ze vervangen door normale quotes?
pt: A expressão de pesquisa {} contém aspas inteligentes. Por definição, a Apple insere aspas inteligentes, em vez de aspas normais, ao clicar no botão de aspas. Isto impedirá que a pesquisa funcione caso você pretenda usar aspas normais. Pode digitar as aspas normais com um clique prolongado no botão de aspas. Quer manter as citações inteligentes ou substituí-las por aspas normais?
zh_tw: 搜尋運算式 {} 包含了智慧型引號。通常在您按輸入引號時，蘋果的裝置會自動加入智慧型引號，而不是一般的引號。如果您使用一般的引號，這將會導致搜尋功能無法使用。您可透過長按引號鍵來使用一般的引號。請問是要繼續使用智慧型引號，還是改為一般引號呢？

source: Replace
fr: Remplacer
it: Sostituisci
nl: Vervang
pt: Substituir
zh_tw: 取代

source: Keep
fr: Garder
it: Conserva
nl: Bewaar
pt: Manter
zh_tw: 保留

source: Count:
fr: Nombre :
it: Conteggio:
nl: Aantal:
pt: Contagem:
zh_tw: 計數：

source: Rating: {:.1f}
fr: Note : {:.1f}
it: Valutazione: {:.1f}
nl: Beoordeling: {:.1f}
pt: Avaliação: {:.1f}
zh_tw: 評分：{:.1f}

source: Search for books based on this category (a search term will be added to the search field)
fr: Recherche de livres basés sur cette catégorie (un terme de recherche sera ajouté dans le champ de recherche)
it: Cerca libri in base a questa categoria (un termine verrà aggiunto al campo di ricerca)
nl: Zoeken naar boeken op basis van deze categorie (er wordt een zoekterm toegevoegd aan het zoekveld)
pt: Pesquisar livros com base nesta categoria (um termo de pesquisa será adicionado ao campo de pesquisa)
zh_tw: 按類別搜尋書本（搜索表達式將會被加入到搜尋欄位中）

source: Books matching this category
fr: Livres correspondants à cette catégorie
it: Libri che rientrano in questa categoria
nl: Boeken die overeenstemmen met deze categorie
pt: Livros correspondentes a esta categoria
zh_tw: 符合這個分類的書本

source: Books that do not match this category
fr: Livres qui ne correspondent pas à cette catégorie
it: Libri che non rientrano in questa categoria
nl: Boeken die niet overeenstemmen met deze categorie
pt: Livros que não correspondam a esta categoria
zh_tw: 不符合這個分類的書本

source: Books that match this category and all sub-categories
fr: Livres qui correspondent à cette catégorie et à toutes les sous-catégories
it: Libri che rientrano in questa categoria e in tutte le sotto-categorie
nl: Boeken die overeenstemmen met deze categorie en alle sub-categoriën
pt: Livros que correspondam a esta categoria e todas as subcategorias
zh_tw: 符合這個分類與子類別的書本

source: Books that do not match this category or any of its sub-categories
fr: Livres qui ne correspondent pas à cette catégorie ou à aucune de ses sous-catégories
it: Libri che non rientrano in questa categoria o in alcuna sotto-categoria
nl: Boeken die niet overeenstemmen met deze categorie en alle sub-categoriën
pt: Livros que não correspondam a esta categoria ou qualquer uma das suas subcategorias
zh_tw: 不符合這個分類與子類別的書本

source: Add to the search expression with:
fr: Ajouter à l'expression de recherche avec :
it: Aggiungi all'espressione di ricerca con:
nl: Zoekopdracht aanvullen met:
pt: Adicionar à expressão de pesquisa com:
zh_tw: 請加入到搜尋運算式：

source: Number of books in this category: {}
fr: Nombre de livres dans cette catégorie : {}
it: Numero di libri in questa categoria: {}
nl: Aantal boeken in deze categorie: {}
pt: Número de livros nesta categoria: {}
zh_tw: 該類別中的書本數量：{}

source: Average rating for books in this category: {:.1f}
fr: Notation moyenne pour les livres dans cette catégorie : {.1f}
it: Valutazione media per i libri in questa categoria: {:.1f}
nl: Gemiddelde beoordeling van boeken in deze categorie: {:.1f}
pt: Avaliação média dos livros nesta categoria: {:.1f}
zh_tw: 該類別中書本的平均評分：{:.1f}

source: Failed to load Tag browser data
fr: Échec lors du chargement des données du Navigateur d'étiquettes
it: Impossibile caricare i dati del browser Tag
nl: Laden van tag browser gegevens is mislukt
pt: Falha ao carregar dados do navegador de conteúdos
zh_tw: 無法加載標籤瀏覽器數據

source: Enter the search query
fr: Entrer la requête de recherche
it: Digita la ricerca
nl: Vul een zoekopdracht in
pt: Insira o termo de pesquisa
zh_tw: 請輸入搜尋文字

source: Fetching data for the Tag browser, please wait
fr: Collecte des données pour le Navigateur d'étiquettes, veuillez patienter…
it: Recupero i dati del Navigatore dei Tag, attendi per favore
nl: Ophalen van tag browser gegevens, even geduld
pt: A obter dados do navegador de conteúdos, aguarde um pouco.
zh_tw: 正在擷取瀏覽器的標記資料，請稍候

source: Sort tags by
fr: Trier les étiquettes par
it: Ordina tag per
nl: Labels sorteren op
pt: Ordenar etiquetas por
zh_tw: 依標籤排序

source: Name
fr: Nom
it: Nome
nl: Naam
pt: Nome
zh_tw: 名稱

source: Popularity (number of books)
fr: Popularité (nombre de livres)
it: Popolarità (numero di libri)
nl: Populariteit (Aantal boeken)
pt: Popularidade (número de livros)
zh_tw: 熱門度（書本數量）

source: Average rating
fr: Note moyenne
it: Valutazione media
nl: Gemiddelde waardering
pt: Avaliação média
zh_tw: 平均評分

source: Change how the tags/authors/etc. are sorted in the "Tag browser"
fr: Changer la manière dont les étiquettes/auteurs/etc. sont triés dans le Navigateur d’étiquettes
it: Cambia l'ordinamento di tag/autori/ecc. nel "Navigatore dei Tag"
nl: Wijzig hoe labels/auteurs/etc gesorteerd worden in de "label verkenner" / "Tag Browser"
pt: Alterar a forma como as etiquetas/autores/etc são ordenadas no navegador de conteúdos
zh_tw: 更改標籤、作者等如何被標籤瀏覽器排序

source: Category partitioning method
fr: Méthode de division des catégories
it: Metodo di suddivisione categorie
nl: Categorie partitioneringsmethode
pt: Método de particionamento de categorias
zh_tw: 類別分割方法

source: First Letter
fr: Première lettre
it: Iniziale
nl: Eerste letter
pt: Primeira letra
zh_tw: 第一個字母

source: Disable
fr: Désactiver
it: Disabilita
nl: Uitschakelen
pt: Desativar
zh_tw: 停用

source: Partition
it: Stessa dimensione
nl: Onderdeel
pt: Partição
zh_tw: 分區

source: Choose how Tag browser subcategories are displayed when there are more items than the limit. Select by first letter to see an A, B, C list. Choose partitioned to have a list of fixed-sized groups. Set to disabled if you never want subcategories.
fr: Choisir comment les sous-catégories du Navigateur d’étiquettes sont affichés quand il y a plus d’articles que la limite. Sélectionnez par la première lettre pour visualiser une liste A, B, C. Choisir partitionné pour avoir une liste de groupes de taille fixe. Sélectionnez désactiver si vous ne voulez jamais de sous-catégories.
it: Scegli come le sottocategorie del Navigatore dei tag sono mostrate quando ci sono più elementi del limite impostato. Seleziona In base all'iniziale per vedere una lista A, B, C. Scegli Con la stessa dimensione per avere una lista di gruppi a dimensione fissa. Scegli Disabilitato se non vuoi mai vedere le sottocategorie.
nl: Kies hoe subcategorieën van de Tag-browser worden weergegeven als er meer items zijn dan de limiet. Selecteer bij eerste letter om een A, B, C lijst te zien. Kies opgedeeld voor een lijst van groepen met een vaste grootte. Als u nooit subcategorieën wilt, kies dan uitgeschakeld.
pt: Modo como serão exibidas as subcategorias do navegador de conteúdos quando tiver mais itens que o limite. Pela primeira letra = lista A, B, C. Particionado = lista de grupos com tamanho fixo. Desativado = sem subcategorias.
zh_tw: 選擇在項目超過一定數量時如何顯示標籤瀏覽器中的子分類。選擇「第一個字母」以檢視按第一個字母 A, B, C… 排序的清單。選擇「分組」以檢視分為多個固定大小的組的清單。設為「停用」在您不想要顯示子分類時。

source: Collapse when more items than
fr: Minimiser quand il y a plus d’éléments que
it: Contrai quando ci sono più articoli
nl: Inklappen wanneer meer items dan
pt: Contrair quando tiver mais itens do que
zh_tw: 當項目多於指定數量時進行折疊

source: If a "Tag browser" category has more than this number of items, it is divided up into subcategories. If the partition method is set to disable, this value is ignored.
fr: Si une catégorie "Navigateur d’étiquettes" possède plus d’éléments que cette valeur, elle est divisée en sous-catégories. Si la méthode de partition est paramétrée sur désactivée, cette valeur est ignorée.
it: Se una categoria del browser dei tag ha più di questo numero di articoli, viene suddivisa in sottocategorie. Se il metodo di suddivisione è impostato come disattivato, il valore viene ignorato.
nl: Indien de "Tag browser" of label verkenner meer dan dit aantal items heeft, dan zal het opgedeeld worden in subcategorieën. Als de partitie methode is ingesteld als 'uitgeschakeld', dan wordt deze waarde genegeerd.
pt: Se uma categoria do navegador de conteúdos tiver mais itens do que este número, será dividida em subcategorias. Se o método de particionamento estiver desativado, este valor será ignorado.
zh_tw: 如果標籤瀏覽器中分類的項目超過這個數量，則將其分爲子分類。若分組方法設定為禁用，則忽略此值。

source: Categories not to partition
fr: Catégories à ne pas diviser
it: Categorie da non suddividere
nl: Niet te verdelen categorieën
pt: Categorias a não particionar
zh_tw: 不分組的分類名稱
