Repository: debian-calibre/calibre
Catalog: translations-git/content-server/*.po
Languages: fr, it, nl, pt, zh_tw

source: Seconds to pause before auto-scrolling past internal file boundaries:
fr: Secondes de pause avant le défilement automatique au-delà des limites internes du fichier :
it: Secondi di pausa dell'auto scorrimento prima di passare i limiti interni dei file:
nl: Seconden om te pauzeren alvorens automatisch voorbij interne bestandsgrenzen te bladeren:
pt: Segundos de pausa antes do rolamento automático ir para além dos limites internos do ficheiro:
zh_tw: 自動捲動經過內部檔案界限前，要暫停的秒數：

source: Use negative values to not auto-scroll past internal file boundaries
fr: Utilisez des valeurs négatives pour ne pas faire défiler automatiquement les limites internes du fichier
it: Usa valori negativi per non scorrere automaticamente oltre i i limiti interni dei file
nl: Gebruik negatieve waarden om niet automatisch voorbij interne bestandsgrenzen te bladeren
pt: Usar valores negativos para que o rolamento automático não passe os limites internos do ficheiro:
zh_tw: 如果不要自動捲動經過內部檔案界限，請使用負值

source: Show a scrollbar
fr: Afficher une barre de défilement
it: Mostra una barra di scorrimento
nl: Toon het keuzevenster
pt: Mostrar barra de rolamento
zh_tw: 顯示捲軸

source: Invert the page turn tap areas
fr: Inverser les zones de rotation de la page
it: Inverti le aree di tocco usate per voltare pagina
nl: Wissel de pagina draaizones om
pt: Inverter as áreas de toque para mudança de página
zh_tw: 对调翻页点按位置

source: Have tapping on the left side turn the page forward and the right side backwards
fr: Faire tourner la page vers l'avant en tapant sur le côté gauche et vers l'arrière en tapant sur le côté droit.
it: Fai in modo che toccare sul lato sinistro faccia passare alla pagina successiva e sul lato destro a quella precedente
nl: Laat tikken links de pagina vooruit bladeren and rechts achteruit
pt: Toques no lado esquerdo avançam a página e no lado direito recuam a página.
zh_tw: 点左边下一页，点右边上一页

source: Change image
fr: Changer l'image
it: Cambia immagine
nl: Wijzig afbeelding
pt: Alterar imagem
zh_tw: 變更圖片

source: Clear image
fr: Supprimer l'image
it: Rimuovi l'immagine
nl: Verwijder afbeelding
pt: Limpar imagem
zh_tw: 清除圖片

source: Image URL
fr: URL de l'image
it: URL dell'immagine
nl: Afbeelding URL
pt: URL da imagem
zh_tw: 圖片 URL

source: Background image style
fr: Style de l'image de fond
it: Stile dell'immagine di sfondo
nl: Achtergrondafbeelding stijl
pt: Estilo da imagem de fundo
zh_tw: 背景圖片樣式

source: Scaled
fr: Mise à l'échelle
it: Adatta
nl: Overlappend
pt: Dimensionado
zh_tw: 縮放

source: Tiled
fr: Mosaïque
it: Piastrelle
nl: Getegeld
pt: Lado a lado
zh_tw: 並排

source: Background image fade (%)
fr: Fondu de l'image d'arrière-plan (%)
it: Trasparenza immagine di sfondo (%)
nl: Achtergrondafbeelding vervagen (%)
pt: Desbotamento da imagem de fundo (%)
zh_tw: 背景圖片淡化 (%)

source: Fading of the background image is done by blending it with the background color
fr: Le fondu de l'image de fond se fait en la mélangeant avec la couleur de fond
it: La trasparenza dell'immagine di sfondo è ottenuta fondendo l'immagine con il colore dello sfondo
nl: Het vervagen van de achtergrondafbeelding wordt gedaan door het te mengen met de achtergrondkleur
pt: O desvanecimento da imagem de fundo é feito misturando-a à cor de fundo
zh_tw: 背景圖片淡化會把它與背景顏色混合

source: Choose a background image to display behind the book text
fr: Choisir une image de fond à afficher derrière le texte du livre
it: Scegli un'immagine da mostrare come sfondo dietro al testo del libro
nl: Kies een achtergrondafbeelding om achter de boektekst weer te geven
pt: Escolher uma imagem de fundo a exibir atrás do texto do livro
zh_tw: 選擇要在書籍文字後顯示的背景圖片

source: A CSS style sheet that can be used to control the look and feel of the text. For examples, click
fr: Une feuille de style CSS qui peut être utilisée pour contrôler l'apparence du texte. Pour des exemples, cliquez sur
it: Un foglio di stile CSS che può essere usato per controllare l'aspetto del testo. Per esempi, fai clic
nl: Een CSS-stijlpagina die kan worden gebruikt om aanzien van de tekst te regelen. Voor voorbeelden, klik
pt: Uma folha de estilos CSS que pode ser usada para controlar a aparência do texto no visualizador. Para exemplos, clique
zh_tw: 用來控制書籍外觀與感覺的 CSS 樣式表。如果您需要範例，請點選

source: here.
fr: ici.
it: qui.
nl: hier.
pt: aqui.
zh_tw: 這裡。

source: Examples of user style sheets
fr: Exemples de feuilles de style utilisateur
it: Esempi di fogli di stile dell'utente
nl: Voorbeelden van gebruikers stijl-sheets
pt: Exemplos de folhas de estilo do utilizador
zh_tw: 使用者樣式表的範例

source: Note that you can use the selectors body.calibre-viewer-paginated and body.calibre-viewer-scrolling to target the Paged and Flow modes. Similarly, use body.calibre-viewer-light-colors and body.calibre-viewer-dark-colors to target light and dark color schemes.
fr: Notez que vous pouvez utiliser les sélecteurs body.calibre-viewer-paginated et body.calibre-viewer-scrolling pour sélectionner les modes Paginé et Continu. De même, utilisez les couleurs claires et les couleurs foncées de body.calibre-viewer pour cibler les combinaisons de couleurs claires et foncées.
it: Nota che puoi utilizzare i selettori body.calibre-viewer-paginated e body.calibre-viewer-scrolling per discriminare tra le modalità Pagine e Flusso. In modo simile, usa body.calibre-viewer-light-colors e body.calibre-viewer-dark-colors per distinguere tra tema chiaro e tema scuro.
nl: Merk op dat u de selectors body.calibre-viewer-paginated en body.calibre-viewer-scrolling kunt gebruiken om de Paged en Flow-modi te kiezen. Gebruik op dezelfde manier body.calibre-viewer-light-colors en body.calibre-viewer-dark-colors om lichte en donkere kleurenschema's te kiezen.
pt: Note que pode usar os seletores body.calibre-viewer-paginated e body.calibre-viewer-scrolling para direcionar aos modos Paginado e Fluido. Da mesma forma, use body.calibre-viewer-light-colors e body.calibre-viewer-dark-colors para direcionar a esquemas de cores claras e escuras.
zh_tw: 请注意，您可以使用选择器 body.calibre-viewer-paginated 和 body.calibre-viewer-scrolling 以确定分页和流式模式。类似地，使用 body.calibre-viewer-light-colors 和 body.calibre-viewer-dark-colors 来确定浅色和深色方案。

source: Up
fr: Vers le haut
it: Su
nl: Omhoog
pt: Para cima
zh_tw: 上

source: Down
fr: Vers le bas
it: Giù
nl: Omlaag
pt: Para baixo
zh_tw: 向下

source: Show a popup bar with common actions next to selected text
fr: Afficher une barre instantanée avec des actions communes à côté du texte sélectionné
it: Mostra una barra a comparsa con azioni comuni vicino al testo selezionato
nl: Toon een pop-up balk met gebruikelijke acties naast de geselecteerde tekst
pt: Mostrar uma barra flutuante, com as ações mais comuns, junto ao texto selecionado.
zh_tw: 在所选文本旁边显示带有常用操作的弹出栏

source: URL to query when searching the internet
fr: URL à consulter lors d'une recherche sur Internet
it: URL da utilizzare per la ricerca su Internet
nl: URL om te bevragen tijdens internet zoeken
pt: URL a consultar quando pesquisar na Internet
zh_tw: 在網路上搜尋時，要查詢的網址

source: The {q} in the URL is replaced by the selected text
fr: Le {q} de l'URL est remplacé par le texte sélectionné
it: La {q} nell'URL è sostituita dal testo selezionato
nl: De {q} in de URL is vervangen door de geselecteerde tekst
pt: O {q} no URL é substituído pelo texto selecionado
zh_tw: 網址中的 {q} 會被選取的文字取代

source: Customize which actions are shown in the selection popup bar
fr: Personnaliser quelles actions sont affichées dans la barre de sélection instantanée
it: Personalizza le azioni che sono mostrate nella barra a comparsa
nl: Aanpassen welke acties getoond worden in de selectie pop-up balk
pt: Personalizar as ações a serem mostradas na barra flutuante de seleção
zh_tw: 自定义选择弹出栏中显示的操作

source: Current actions
fr: Actions en cours
it: Azioni correnti
nl: Huidige acties
pt: Ações atuais
zh_tw: 目前的動作

source: Available actions
fr: Actions disponibles
it: Azioni disponibili
nl: Beschikbare acties
pt: Ações disponíveis
zh_tw: 可用的動作

source: Quick highlight actions
fr: Actions de mise en évidence rapide
it: Evidenziazioni veloci
nl: Snelle highlight acties
pt: Ações de realce rápido
zh_tw: 快速醒目提示動作

source: Choose highlight styles that will have dedicated buttons in the selection bar to create highlights with a single click
fr: Choisir les styles de mise en évidence avec des boutons dédiés dans la barre de sélection pour créer des mises en évidence d'un simple clic
it: Scegli gli stili di evidenziazione che avranno un pulsante dedicato nella barra di selezione per creare evidenziazioni con un solo clic
nl: Kies highlight stijlen die eigen knoppen zullen hebben in de selectie balk om highlights te creëren met één enkele klik
pt: Escolher os estilos de realces que terão botões dedicados na barra de seleção, permitindo criar realces com um único clique
zh_tw: 选择将在选择栏中具有专用按钮的高亮显示样式，只需单击一次即可创建高亮显示

source: — Choose a font —
fr: — Choisir une police —
it: — Scegli un carattere —
nl: - Kies een lettertype -
pt: — Escolher tipo de letra —
zh_tw: — 選擇字型 —

source: Choose fonts to use for un-styled text:
fr: Choisir les polices à utiliser pour le texte non stylisé :
it: Scegli i caratteri da utilizzare per testi senza uno stile:
nl: Kies lettertype voor een stijlloze tekst:
pt: Escolher tipos de letra a utilizar em texto sem estilos:
zh_tw: 選擇未設定樣式的文字要使用的字型：

source: Serif family
fr: Famille Serif
it: Famiglia serif
nl: Serif familie
pt: Família Serif
zh_tw: 襯線字型家族

source: Sans-serif family
fr: Famille Sans-serif
it: Famiglia sans-serif
nl: Sans-serif familie
pt: Família Sans-serif
zh_tw: 無襯線字型家族

source: Monospace family
fr: Famille Monospace
it: Famiglia monospazio
nl: Niet-proportionele familie
pt: Família monospace
zh_tw: 等寬字型家族

source: Standard font
fr: Police standard
it: Carattere predefinito
nl: Standaard lettertype
pt: Tipo de letra normal
zh_tw: 標準字型

source: Zoom related settings
fr: Paramètres liés au zoom
it: Impostazioni di zoom
nl: Zoom gerelateerde instellingen
pt: Configurações do Zoom
zh_tw: 縮放相關設定

source: Zoom step size (%)
fr: Taille du pas de zoom (%)
it: Differenza tra i livelli di zoom (%)
nl: Zoom stapgrootte (%)
pt: Tamanho dos níveis de zoom
zh_tw: 縮放步幅(%)

source: Minimum font size (px)
fr: Taille minimale de la police (px)
it: Grandezza minima del carattere (px)
nl: Minimale lettergrootte (px)
pt: Tamanho mínimo do tipo de letra (px)
zh_tw: 最小字型大小 (px)

source: The library restriction for the current user is invalid: {}
fr: La restriction de bibliothèque pour l'utilisateur actuel est invalide : {}
it: La restrizione della libreria per l'utente corrente non è valida: {}
nl: De bibliotheekbeperking voor de huidige gebruiker is ongeldig: {}
pt: A restrição de biblioteca para o utilizador atual é inválida: {}
zh_tw: 書庫的規定對當前的用戶無效：{}

source: Deleting {0} from library, please wait...
fr: Suppression de {0} de la bibliothèque, veuillez patienter...
it: Eliminazione di {0} libri dalla libreria, attendere prego...
nl: Bezit met {0} uit de bibliotheek te verwijderen, wachten aub...
pt: A eliminar {0} da biblioteca, por favor aguarde...
zh_tw: 正在從書庫刪除 {0} ，請稍候…

source: Failed to delete {0}, with error:
fr: Échec lors de la suppression de {0}, avec erreur :
it: Impossibile eliminare {0}, errore:
nl: Verwijderen van {0} mislukt met fout:
pt: Falha ao eliminar {0}, com o erro:
zh_tw: 無法刪除書本 {0}，錯誤為：

source: This will <b>permanently delete</b> <i>{0}</i> from your calibre library. Are you sure?
fr: Ceci <b>supprimera défintivement</b> <i>{0}</i> de votre bibliothèque calibre. Êtes-vous certain ?
it: Questo <b>cancellerà definitivamente</b> <i>{0}</i> dalla tua libreria calibre. Sei sicuro?
nl: Dit zal<i>{0}</i> <b>permanent verwijderen</b> uit uw calibre bibliotheek. Weet u het zeker?
pt: Esta ação <b>apagará para sempre</b> <i>{0}</i> da sua biblioteca Calibre. Tem a certeza de que pretende continuar?
zh_tw: 這將會從您的 calibre 書庫<b>永久刪除</b> <i>{0}</i>，您確定嗎？

source: Delete from?
fr: Supprimer de ?
it: Cancella da?
nl: Verwijderen?
pt: Eliminar de onde?
zh_tw: 從哪裡刪除？

source: {0} is available both in the browser cache for offline reading and in your calibre library. Where do you want to delete it from?
fr: {0} est disponible tant dans votre cache du navigateur pour une lecture hors ligne que dans votre bibliothèque calibre. D'où voulez-vous qu'il soit supprimé ?
it: {0} è disponibile sia nella cache del visualizzatore per la lettura offline , sia nella tua libreria calibre. Da dove lo vuoi eliminare?
nl: {0} is beschikbaar voor offline lezen in de browser cache en in uw calibre bibliotheek. Waar wilt u het verwijderen?
pt: {0} está disponível quer na cache do browser, para leitura offline, quer na sua biblioteca Calibre. De que local o pretende apagar?
zh_tw: {0} 可以同時在您的瀏覽器快取中以供離線閱讀，也可以在 calibre 書庫中。您要刪除哪個？

source: Library and cache
fr: Bibliothèque et cache
it: Libreria e cache
nl: Bibliotheek en cache
pt: Biblioteca e Cache
zh_tw: 書庫與快取

source: A customizable list (see Preferences->Sharing over the net->Book list template)
fr: Une liste personnalisable (Voir Préférences->Partager sur le net->Modèle de listes de livres)
it: Un elenco personalizzabile (vedi Preferenze->Condivisione via rete-> Modello elenco dei libri)
nl: Een aanpasbare lijst (zie Voorkeuren-> Delen over het net-> Boekenlijst sjabloon)
pt: Uma lista personalizável (veja Preferências->Partilhar na rede->Modelo da lista de livros)
zh_tw: 可自訂化的清單（請參見 偏好設定 -> 在網路上分享 -> 書本清單範本）

source: <b>{title}</b> by {authors}
fr: <b>{title}</b> par {authors}
it: <b>{title}</b> di {authors}
nl: <b>{title}</b>door {authors}
pt: <b>{title}</b> por {authors}
zh_tw: <b>{title}</b>作者:{authors}

source: {series_index} of <i>{series}</i>
fr: {series_index} de <i>{series}</i>
nl: {series_index} van <i>{series}</i>
pt: {series_index} de <i>{series}</i>
zh_tw: {series_index} / <i>{series}</i>

source: Date: {timestamp}
it: Data: {timestamp}
nl: Datum: {timestamp}
pt: Data: {timestamp}
zh_tw: 日期：{timestamp}

source: Published: {pubdate}
fr: Publié : {pubdate}
it: Pubblicato:{pubdate}
nl: Gepubliseerd: {pubdate}
pt: Publicação: {pubdate}
zh_tw: 出版日期: {pubdate}

source: Publisher: {publisher}
fr: Éditeur : {publisher}
it: Editore: {publisher}
nl: Uitgever: {publisher}
pt: Editora: {publisher}
zh_tw: 出版社: {publisher}

source: by
fr: par
it: di
nl: door
pt: por
zh_tw: 由

source: {} by {}
fr: {} par {}
it: {} di {}
nl: {} door {}
pt: {} por {}
zh_tw: {} 由 {}

source: Added successfully
fr: Ajouté avec succès
it: Aggiunto con successo
nl: Succesvol toegevoegd
pt: Adicionado com sucesso
zh_tw: 新增成功

source: Open
fr: Ouvrir
it: Apri
nl: Openen
pt: Abrir
zh_tw: 開啟

source: A book with the title "{0}" already exists in the library.
fr: Un livre avec le titre "{0}" existe déjà dans la bibliothèque.
it: Nella libreria esiste già un libro con il titolo "{0}".
nl: Een boek met de titel "{0}" is al in de bibliotheek opgenomen.
pt: Já existe na biblioteca um livro com o título "{0}".
zh_tw: 書庫中已存在名為「{0}」的書了

source: Add anyway
fr: Ajouter quand même
it: Aggiungi comunque
nl: Toch toevoegen
pt: Adicionar mesmo assim
zh_tw: 還是加入

source: {0} by {1}
fr: {0} par {1}
it: {0} di {1}
nl: {0} bij {1}
pt: {0} por {1}
zh_tw: {0} 由 {1}

source: The book you are trying to add is:
fr: Le livre que vous essayez d'ajouter est :
it: Il libro che stai provando ad aggiungere è:
nl: Het boek wat u wilt toevoegen is:
pt: O livro que está a tentar adicionar é:
zh_tw: 您試圖加入的書本是：

source: . Books already in the library with that title are:
fr: Les livres déjà dans la bibliothèque avec ce titre sont :
it: . I libri già presenti nella biblioteca con quel titolo sono:
nl: . Boeken al in uw bibliotheek met die titel zijn:
pt: . Livros já na biblioteca com esse título são:
zh_tw: 。書本已存在於書庫，書名是：

source: You are not allowed to make changes to the library
fr: Vous n'êtes pas autorisé à apporter des changements à la bibliothèque
it: Non hai il permesso di effettuare modifiche alla libreria
nl: Het is u niet toegestaan de bibliotheek te wijzigen
pt: Não tem permissões para efetuar alterações à biblioteca
zh_tw: 您並未被允許在書庫進行變動

source: You must be logged in to make changes to the library
fr: Vous devez être identifié pour apporter des changements à la bibliothèque
it: Per eseguire modifiche alla libreria bisogna essere registrati
nl: U moet ingelogd zijn om wijzigingen in de bibliotheek te kunnen maken
pt: Tem de se autenticar para efetuar alterações à biblioteca
zh_tw: 請登入才能對書庫進行變動

source: Failed to upload the file: {}
fr: Échec du téléversement du fichier : {}
it: Impossibile caricare il file: {}
nl: Uploaden van het bestand mislukt: {}
pt: Falha ao carregar o ficheiro: {}
zh_tw: 檔案上傳失敗：{}

source: Add books
fr: Ajouter des livres
it: Aggiungi libri
nl: Boeken toevoegen
pt: Adicionar livros
zh_tw: 加入書本

source: Contacting server, please wait
fr: Communication avec le serveur, merci de patienter
it: Sto contattando il server, per favore attendere
nl: Contact opnemen met de server, even geduld
pt: A contactar o servidor, por favor aguarde
zh_tw: 正在和伺服器連線中，請稍候

source: Edit the "{}" below
fr: Éditer le "{}" ci-dessous
it: Modificare "{}" qui sotto
nl: Bewerk de "{}" hieronder
pt: Editar o "{}" abaixo
zh_tw: 在下方編輯「{}」

source: Tap to add:
fr: Appuyez pour ajouter :
it: Tocca per aggiungere:
nl: Tik om toe te voegen:
pt: Toque para adicionar:
zh_tw: 點選以新增：

source: Tap to remove:
fr: Appuyer pour retirer :
it: Tocca per rimuovere:
nl: Tik om te verwijderen:
pt: Toque para remover:
zh_tw: 點選以移除：

source: Failed to download items for completion, with error:
fr: Échec lors du téléchargement des éléments pour la réalisation, avec erreur :
it: Mancato download degli elementi per il completamento, con errore:
nl: Kan items niet downloaden om te voltooien, met foutmelding:
pt: Falha ao descarregar itens para completamento, com o erro:
zh_tw: 无法完整下载条目，错误：

source: Edit the "{0}" below. Multiple items can be separated by "{1}".
fr: Éditer le "{0}" ci-dessous. Plusieurs éléments peuvent être séparés par "{1}".
it: Modifica il "{0}" sotto. Oggetti multipli possono essere separati da "{1}".
nl: Bewerk hieronder de "{0}". Meerdere items kunnen worden gescheiden met "{1}".
pt: Editar o "{0}" abaixo. Itens múltiplos podem ser separados por "{1}".
zh_tw: 在下方編輯「{0}」。多個項目可用「{1}」分隔。

source: Edit the "{0}" below.
fr: Éditer le "{0}" ci-dessous.
it: Modifica il "{0}" sotto.
nl: Bewerk hieronder de "{0}".
pt: Editar o "{0}" abaixo.
zh_tw: 在下方編輯「{0}」。

source: Loading all {}...
fr: Chargement de tous les {}...
it: Carica tutti {}...
nl: Alles laden {} ...
pt: A carregar tudo: {}...
zh_tw: 正在載入所有 {}...

source: Number:
fr: Numéro :
it: Numero:
nl: Nummer:
pt: Número:
zh_tw: 編號：

source: Edit the "{}" below.
fr: Éditer le "{}" ci-dessous.
it: Carica il "{}" sotto.
nl: Bewerk hieronder de "{}".
pt: Editar o "{}" abaixo.
zh_tw: 在下方編輯「{}」。

source: Today
fr: Aujourd'hui
it: Oggi
nl: Vandaag
pt: Hoje
zh_tw: 今天

source: Type:
it: Digita:
pt: Tipo:
zh_tw: 類型：

source: Value:
fr: Valeur :
it: Valore:
nl: Waarde:
pt: Valor:
zh_tw: 數值：

source: Add identifier
fr: Ajouter l'identifiant
it: Aggiungi identificatore
nl: Voeg identificeerder toe
pt: Adicionar identificador
zh_tw: 新增書號

source: Unrated
fr: Non noté
it: Senza valutazione
nl: Niet gewaardeerd
pt: Sem avaliação
zh_tw: 未評分

source: Choose the "{}" below
fr: Choisir le "{}" ci-dessous
it: Scegli il "{}" sotto
nl: Kies hieronder de "{}"
pt: Escolher o "{}" abaixo.
zh_tw: 在下方選擇「{}」

source: Blank
fr: Vide
it: Vuoto
nl: Blanco
pt: Vazio
zh_tw: 空白

source: Change the cover by <a>selecting the cover image</a> or drag and drop of the cover image here.
fr: Changez la couverture en <a>sélectionnant l'image de couverture</a> ou faite un glisser et déposer de l'image de couverture ici .
it: Cambia la copertina da <a>selezionare l'immagine di copertina</a> oppure trascina qui l'immagine di copertina.
nl: Wijzig de omslag door <a>selecteer de omslagafbeelding</a> of sleep de omslagafbeelding hierheen.
pt: Mude a capa através da <a>seleção da imagem de capa</a> ou arraste e solte uma imagem de capa para aqui
zh_tw: 透過<a>選取封面圖片</a>來變更封面，或者拖放封面圖片至此。

source: Remove existing cover
fr: Supprimer la couverture exizstante
it: Rimuovi copertina esistente
nl: Verwijder huidige omslag
pt: Remover capa existente
zh_tw: 移除已存在的封面

source: Add a format by <a>selecting the book file</a> or drag and drop of the book file here.
fr: Ajouter un format en <a>sélectionnant le fichier</a> ou glisser et déposer le fichier ici.
it: Aggiungi formato da <a>seleziona il file del libro</a> oppure trascina qui il file del libro.
nl: Voeg een opmaak toe door <a>een boekbestand te selecteren </a> of sleep het boek hierheen.
pt: Adicione um formato por <a>seleção do ficheiro de livro</a> ou arraste e solte o ficheiro de livro para aqui
zh_tw: 透過<a>選取書本檔案</a>來加入格式，或者拖放書本檔案至此。

source: Remove {}
fr: Supprimer {}
it: Rimuovi {}
nl: Verwijder {}
pt: Remover {}
zh_tw: 移除 {}

source: {0} of <i>{1}</i>
fr: {0} de <i>{1}</i>
it: {0} di <i>{1}</i>
nl: {0} van <i>{1}</i>
pt: {0} de <i>{1}</i>
zh_tw: {0} / <i>{1}</i>

source: Cover
fr: Couverture
it: Copertina
nl: Omslag
pt: Capa
zh_tw: 封面

source: Failed to update metadata on server
fr: Échec de la mise à jour des métadonnées sur le serveur
it: Impossibile aggiornare i metadati sul server
nl: Het is niet gelukt om metadata op de server bij te werken
pt: Falha ao atualizar os metadados no servidor
zh_tw: 無法從伺服器更新詮釋資料

source: Updating metadata for the book: {} failed.
fr: Mettre à jour les métadonnées pour le livre : {} échoué.
it: Aggiornamento metadati del libro: {} fallito.
nl: Metadata voor het boek bijwerken: {} mislukt.
pt: Atualização de metadados de livros: {} com falhas.
zh_tw: 更新書本：{} 的詮釋資料失敗。

source: Could not update metadata for book
fr: Impossible de mettre à jour les métadonnées du livre
it: Impossibile aggiornare i metadati per il libro
nl: Kan metadata voor boek niet bijwerken
pt: Não foi possível atualizar os metadados do livro
zh_tw: 無法更新書本的詮釋資料

source: Server returned an invalid response
fr: Le serveur renvoie une réponse invalide
it: Il server ha restituito una risposta non valida
nl: Server gaf een ongeldig antwoord
pt: O servidor devolveu uma resposta inválida
zh_tw: 伺服器返回無效回應

source: Uploading changes to server, please wait...
fr: Téléchargement des modifications sur le serveur, merci de patienter...
it: Caricamento delle modifiche sul server, attendere prego...
nl: Uploaden van wijzigingen naar server, even geduld aub ...
pt: A carregar as alterações para o servidor, por favor aguarde...
zh_tw: 正在上傳變更到伺服器，請稍候…

source: Apply changes
fr: Appliquer les modifications
it: Applica le modifiche
nl: Wijzigingen toepassen
pt: Aplicar alterações
zh_tw: 儲存變更

source: Tap any field below to edit it
fr: Touchez n'importe quel champ ci-dessous pour le modifier
it: Tocca un campo qui sotto per modificarlo
nl: Tik op een willekeurig veld hieronder om het te bewerken
pt: Toque em qualquer campo abaixo para o editar
zh_tw: 點擊下方的任何欄位來編輯

source: Are you sure
fr: Êtes-vous sûr?
it: Sei sicuro
nl: Weet u zeker
pt: Tem a certeza
zh_tw: 您確定

source: Any changes you have made will be discarded. Do you wish to discard all changes?
fr: Toutes les modifications que vous avez apportées seront supprimées. Souhaitez-vous supprimer toutes les modifications ?
it: Se hai effettuato dei cambiamenti, questi saranno persi. Vuoi annullare tutti i cambiamenti?
nl: Al uw veranderingen zullen verworpen worden. Wilt u alle veranderingen verwerpen?
pt: Quaisquer alterações que tenha efetuado serão eliminadas. Tem a certeza de que deseja eliminar todas as alterações?
zh_tw: 即将放弃所有更改，确定吗？

source: Failed to read metadata for book
fr: Impossible de lire les métadonnées d'un livre
it: Impossibile leggere i metadati del libro
nl: Kan metadata voor boek niet lezen
pt: Falha ao ler os metadados do livro
zh_tw: 無法讀取書籍詮釋資料
