Repository: debian-calibre/calibre
Catalog: translations-git/manual/*/catalogs.po
Languages: ja, nl

source: Creating AZW3 • EPUB • MOBI catalogs
ja: AZW3 • EPUB • MOBI のカタログを作成
nl: Creëren van AZW3 • EPUB • MOBI-catalogi

source: calibre's Create catalog feature enables you to create a catalog of your library in a variety of formats. This help file describes cataloging options when generating a catalog in AZW3, EPUB and MOBI formats.
ja: calibre のカタログ作成機能を使えば、ライブラリのカタログをさまざまな形式で作成できます。このヘルプでは、カタログを AZW3, EPUB および MOBI 形式で作成するときのカタログオプションについて説明します。
nl: calibre's Maak catalogus functie laat u een catalogus van uw bibliotheek in verschillende formaten creëren. Deze documentatie beschrijft de opties bij het genereren van een catalogus in AZW3 , EPUB en MOBI formaten.

source: Selecting books to catalog
ja: カタログ化する本を選択
nl: Selecteer boeken voor de catalogus

source: If you want *all* of your library cataloged, remove any search or filtering criteria in the main window. With a single book selected, all books in your library will be candidates for inclusion in the generated catalog. Individual books may be excluded by various criteria; see the :ref:`excluded_genres` section below for more information.
ja: ライブラリの *すべて* をカタログ化したい場合、メインウィンドウの中の検索や絞り込み条件はすべて削除してください。ある一冊の本を選択すると、ライブラリ内のすべての本がカタログ化の候補となります。個々の本はさまざまな基準により除外されることがあります。:ref:`excluded_genres` の章を参照してください。
nl: Als u heel uw bibliotheek gecatalogeerd wilt, verwijder alle zoek- of filtercriteria in het hoofdvenster. Met één boek geselecteerd, zullen alle boeken in uw bibliotheek kandidaat zijn voor opname in de gegenereerde catalogus . Individuele boeken kunt u uitsluiten door verschillende criteria; zie: ref:` Uitgesloten_genres` hieronder voor meer informatie.

source: If you want only *some* of your library cataloged, you have two options:
ja: ライブラリの *一部だけ* をカタログ化したい場合、方法は 2 つあります:
nl: Als u slechts *een deel* van uw bibliotheek wil catalogeren, hebt u twee opties:

source: Create a multiple selection of the books you want cataloged. With more than one book selected in calibre's main window, only the selected books will be cataloged.
ja: カタログ化したい本を複数選択します。calibre のメインウィンドウで複数の本が選択されている場合、選択した本だけがカタログ化されます。
nl: Maak een selectie van de boeken die u wilt catalogeren. Met meer dan één boek geselecteerd in calibres hoofdvenster, worden alleen de geselecteerde boeken gecatalogeerd .

source: Use the Search field or the Tag browser to filter the displayed books. Only the displayed books will be cataloged.
ja: 検索フィールドまたはタグブラウザを使って表示する本を絞り込みます。表示されている本だけがカタログ化されます。
nl: Gebruik het Zoekveld of Tag Browser om de weergegeven boeken te filteren. Alleen de weergegeven boeken worden gecatalogeerd.

source: To begin catalog generation, select the menu item :guilabel:`Convert books > Create a catalog of the books in your calibre library`. You may also add a :guilabel:`Create catalog` button to a toolbar in :guilabel:`Preferences > Interface > Toolbars & menus` for easier access to the Generate catalog dialog.
ja: カタログの生成を始めるには、メニュー項目の :guilabel:`本を変換 > calibre ライブラリの本からカタログを作成` を選択します。:guilabel:`環境設定 > インタフェース > ツールバー & メニュー` でツールバーに :guilabel:`カタログ作成` ボタンを追加してカタログ作成ダイアログを簡単にアクセスできるようにすることも可能です。
nl: Om catalogus generatie te starten, selecteer menu-item :guilabel:`Omzetten boeken > Creër catalogus van de boeken in uw calibre bibliotheek`. U kunt ook een :guilabel:`Maak catalogus` knop aan een werkbalk toevoegen in :guilabel:`Voorkeuren> Interface > Werkbalken & menu's` voor vlottere toegang tot de catalogus genereren dialoog.

source: Catalog options
ja: カタログオプション
nl: Opties voor catalogus

source: In :guilabel:`Catalog options`, select **AZW3, EPUB or MOBI** as the Catalog format. In the :guilabel:`Catalog title` field, provide a name that will be used for the generated catalog. If a catalog of the same name and format already exists, it will be replaced with the newly-generated catalog.
ja: :guilabel:`カタログオプション` ではカタログ形式として **AZW3, EPUB または MOBI** を選択します。:guilabel:`カタログタイトル` フィールドには生成されたカタログで使用する名前を与えます。同じ名前で同じ形式のカタログがすでに存在している場合、新しく生成されたカタログで置き換えられます。
nl: In :guilabel:`Catalog options` , selecteer **AZW3, EPUB en MOBI** als Cataloog formaat. In het :guilabel:`Cataloog titel` vul de naam in die u wenst voor de gegenereerde catalogus . Als een catalogus van dezelfde naam en formaat bestaat, wordt deze vervangen door de nieuw gegenereerde catalogus.

source: Catalog: send to device automatically option
ja: カタログ: デバイスに自動で送信オプション
nl: Catalogus: stuur automatisch naar toestel optie

source: Enabling :guilabel:`Send catalog to device automatically` will download the generated catalog to a connected device upon completion.
ja: :guilabel:`デバイスにカタログを自動的に送信` を有効にすると、生成したカタログを作成完了時に接続されているダウンロードします。
nl: Activeren van :guilabel:`Stuur catalogus automatisch naar apparaat` zal de gegenereerde catalogus downloaden naar een verbonden toestel na voltooiing.

source: Included sections
ja: 含まれるセクション
nl: Inbegrepen afdelingen

source: Included sections in catalog
ja: カタログに含まれるセクション
nl: Afdelingen inbegrepen in catalogus

source: Sections enabled by a checkmark will be included in the generated catalog:
ja: チェックマークで有効にされたセクションが生成するカタログに含まれます:
nl: Aangevinkte onderdelen worden toegevoegd in de genereerde catalogus:

source: :guilabel:`Authors` - all books, sorted by author, presented in a list format. Non-series books are listed before series books.
ja: :guilabel:`著者` - すべての本が、著者名順に並べ替えられてリスト形式で表示されます。シリーズでない本はシリーズの本の前に表示されます。
nl: :guilabel:`Auteurs` - alle boeken, gesorteerd op auteur, getoond in een lijst. Losse boeken worden getoond boven boekenreeksen.

source: :guilabel:`Titles` - all books, sorted by title, presented in a list format.
ja: :guilabel:`タイトル` - すべての本が、タイトル順に並べ替えられてリスト形式で表示されます。
nl: :guilabel:`Titels` - alle boeken, gesorteerd op titel, getoond in een lijst formaat.

source: :guilabel:`Series` - all books that are part of a series, sorted by series, presented in a list format.
ja: :guilabel:`シリーズ` - シリーズ化されている本が、シリーズごとに並べ替えられてリスト形式で表示されます。
nl: :guilabel:`Reeksen` - alle boeken uit een reeks, gesorteerd op reeks, getoond in een lijst.

source: :guilabel:`Genres` - individual genres presented in a list, sorted by Author and Series.
ja: :guilabel:`ジャンル` - リストの中にある個々のジャンルが、著者とシリーズで並べ替えられます。
nl: :guilabel:`Genres` - individuele genres getoond in een lijst, gesorteerd op Auteur en Reeks.

source: :guilabel:`Recently Added` - all books, sorted in reverse chronological order. List includes books added in the last 30 days, then a month-by-month listing of added books.
ja: :guilabel:`最近追加された本` - すべての本が、新しい順に並べ替えられます。リストには過去 30 日以内に追加された本、次いで月ごとに追加された本が含まれます。
nl: :guilabel:`Nieuw toegevoegd` - alle boeken, gesorteerd in omgekeerde tijdsvolgorde. Lijst bevat boeken toegevoegd in de afgelopen 30 dagen, dan een maand-voor-maand overzicht van toegevoegde boeken.

source: :guilabel:`Descriptions` - detailed description page for each book, including a cover thumbnail and comments. Sorted by author, with non-series books listed before series books.
ja: :guilabel:`説明` - 本ごとの詳細な説明ページ。表紙のサムネイルとコメントを含みます。著者名で並べ替えられ、シリーズでない本はシリーズの本の前に置かれます。
nl: :guilabel:`Beschrijvingen` - gedetailleerde beschrijving van elk boek inclusief omslag-miniatuur en commentaren. Gesorteerd op auteur met losse boeken boven de boeken in reeksen.

source: Prefixes
ja: プレフィックス
nl: Voorvoegsels

source: Prefix rules
ja: プレフィックスルール
nl: Voorvoegsel regels

source: Prefix rules allow you to add a prefix to book listings when certain criteria are met. For example, you might want to mark books you've read with a checkmark, or books on your wishlist with an X.
ja: プレフィックスルールを使用すると、特定の基準が魅されたときに本のリストにプレフィックスを追加することができます。たとえば既読の本にチェックマークをつけたり、ウィッシュリストの本に X をつけたりしたくなることがあるかもしれません。
nl: Met voorvoegsel-regels kunt u een voorvoegsel toevoegen aan boekenlijsten als aan bepaalde criteria is voldaan. Bv u wilt gelezen boeken markeren met een vinkje of boeken op uw wensenlijst met een X.

source: The checkbox in the first column enables the rule. :guilabel:`Name` is a rule name that you provide. :guilabel:`Field` is either :guilabel:`Tags` or a custom column from your library. :guilabel:`Value` is the content of :guilabel:`Field` to match. When a prefix rule is satisfied, the book will be marked with the selected :guilabel:`Prefix`.
ja: 最初の列のチェックボックスでルールを有効にします。:guilabel:`名前` 与えられたルール名です。:guilabel:`フィールド` は :guilabel:`タグ` またはライブラリのカスタム列です。:guilabel:`値` は一致する :guilabel:`フィールド` の内容です。プレフィックスルールが満たされると、本は選択した :guilabel:`プレフィックス` でマークされます。
nl: Het aankruisvakje in de eerste kolom activeert de regel. :guilabel:`Naam` is een regelnaam die u geeft. :guilabel:`Veld` is ofwel :guilabel:`Tags` of een aangepaste kolom uit uw bibliotheek. :guilabel:`Waarde` is de overeenkomende inhoud van :guilabel:`Veld`. Als een voorvoegsel-regel is vervuld, wordt het boek gemarkeerd met het geselecteerde :guilabel:`Voorvoegsel`.

source: Three prefix rules have been specified in the example above:
ja: 上の例では 3 つのプレフィックスルールが指定されています:
nl: Drie voorvoegsel-regels zijn in het bovenstaande voorbeeld gespecificeerd:

source: :guilabel:`Read book` specifies that a book with any date in a custom column named :guilabel:`Last read` will be prefixed with a checkmark symbol.
ja: :guilabel:`Read book` (読んだ本) は、:guilabel:`Last read` (最後に読んだ) と名前のついたカスタム列に何か日付が入っている本にチェックマーク記号のプレフィックスをつけるよう指定しています。
nl: :guilabel:`Boek gelezen` geeft aan dat een boek met willekeurige datum in een aangepaste kolom genaamd :guilabel:`Laatst gelezen` een vinkje als voorvoegsel krijgt.

source: :guilabel:`Wishlist` item specifies that any book with a :guilabel:`Wishlist` tag will be prefixed with an X symbol.
ja: :guilabel:`Wishlist` (ウィッシュリスト) のは、guilabel:`Wishlist` タグのついた本に X 記号のプレフィックスをつけるよう指定しています。
nl: :guilabel:`Wenslijst` item geeft aan dat elk boek met een :guilabel:`Wensenlijst` tag een X krijgt als voorvoegsel.

source: :guilabel:`Library` books specifies that any book with a value of True (or Yes) in a custom column :guilabel:`Available in Library` will be prefixed with a double arrow symbol.
ja: :guilabel:`Library books` は、カスタム列 :guilabel:`Available in Library` の値が True (または Yes) の本に二重矢印記号のプリフィックスをつけるよう指定しています。
nl: :guilabel:`Bibliotheek` boeken geeft aan dat elk boek met een waarde Waar (of Ja) in een aangepaste kolom :guilabel:`Beschikbaar in Bibliotheek` dubbele pijltjes als voorvoegsel krijgt .

source: The first matching rule supplies the prefix. Disabled or incomplete rules are ignored.
ja: 最初に一致したルールがプレフィックスを提供します。無効に設定されてるルール、または不完全なルールは無視されます。
nl: De eerste overeenkomende regel levert het voorvoegsel. Uitgeschakelde of incomplete regels worden genegeerd.

source: Excluded books
ja: 除外する本
nl: Uitgesloten boeken

source: Excluded books in catalog
ja: カタログで除外する本
nl: Afdelingen uitgesloten van catalogus

source: Exclusion rules allow you to specify books that will not be cataloged.
ja: 除外ルールを使用すると、カタログ化しない本を指定できます。
nl: Uitsluiting-regels bepalen welke boeken niet gecatalogiseerd worden.

source: The checkbox in the first column enables the rule. :guilabel:`Name` is a rule name that you provide. :guilabel:`Field` is either :guilabel:`Tags` or a custom column in your library. :guilabel:`Value` is the content of :guilabel:`Field` to match. When an exclusion rule is satisfied, the book will be excluded from the generated catalog.
ja: 最初の列のチェックボックスでルールを有効にします。:guilabel:`名前` 与えられたルール名です。:guilabel:`フィールド` は :guilabel:`タグ` またはライブラリのカスタム列です。:guilabel:`値` は一致する :guilabel:`フィールド` の内容です。除外ルールが満たされると、その本は生成されるカタログから除外されます。
nl: Het vakje in de eerste kolom schakelt de regel in. :guilabel:`Naam` is een regelnaam die u opgeeft. :guilabel:`Veld` is ofwel :guilabel:`Tags` of een aangepaste kolom in uw bibliotheek. :guilabel:`Waarde` komt overeen met de inhoud van :guilabel:`Veld`. Wanneer aan een uitsluiting-regel is voldaan, wordt het boek uitgesloten van de gegenereerde catalogus.

source: Two exclusion rules have been specified in the example above:
ja: 上の例では 2 つの除外ルールが指定されています:
nl: Twee uitsluiting-regels zijn in het bovenstaande voorbeeld gespecificeerd:

source: The :guilabel:`Catalogs` rule specifies that any book with a :guilabel:`Catalog` tag will be excluded from the generated catalog.
ja: :guilabel:`Catalogs` ルールは、:guilabel:`Catalog` タグのついた本を生成するカタログから除外するよう指定しています。
nl: De :guilabel:`Catalogi` regel geeft aan dat elk boek met een :guilabel:`Catalogus` tag zal worden uitgesloten van de gegenereerde catalogus.

source: The :guilabel:`Archived` Books rule specifies that any book with a value of :guilabel:`Archived` in the custom column :guilabel:`Status` will be excluded from the generated catalog.
ja: :guilabel:`Archived Books` ルールは、カスタム列 :guilabel:`Status` の値が :guilabel:`Archived` の本を生成されるカタログから除外するよう指定しています。
nl: De :guilabel:`Gearchiveerd` boeken regel geeft aan dat alle boeken met een waarde van :guilabel:`Gearchiveerd` in de aangepaste kolom :guilabel:`Status` worden uitgesloten van de gegenereerde catalogus.

source: All rules are evaluated for every book. Disabled or incomplete rules are ignored.
ja: すべてのルールはすべの本に対して評価されます。無効に設定されているルール、または不完全なルールは無視されます。
nl: Alle regels worden geëvalueerd voor elk boek. Uitgeschakelde of onvolledige regels worden genegeerd.

source: Excluded genres
ja: 除外するジャンル
nl: Uitgesloten genres

source: Excluded genres in catalog
ja: カタログで除外するジャンル
nl: Genres uitgesloten van catalogus

source: When the catalog is generated, tags in your database are used as genres. For example, you may use the tags ``Fiction`` and ``Nonfiction``. These tags become genres in the generated catalog, with books listed under their respective genre lists based on their assigned tags. A book will be listed in every genre section for which it has a corresponding tag.
ja: カタログが生成されるとき、データベース中のタグがジャンルとして使用されます。たとえばタグ ``Fiction`` および ``Nonfiction`` を使用できます。こうしたタグは生成されたカタログ内でジャンルとなり、割り当てられたタグに基づいてそれぞれのジャンルのリストに本が載せられます。本は、関連付けられたタグを持つジャンルのセクションすべてに載せられます。
nl: Wanneer de catalogus is gegenereerd worden labels in uw gegevensbank gebruikt als genres. Bijvoorbeeld gebruikt u de labels "Fictie"en "Nonfictie". Deze labels worden genres in de gegenereerde catalogus met boeken opgevoerd onder hun betreffende genre gebaseerd op hun toegewezen labels. Een boek wordt opgevoerd in iedere genre-sectie waarvoor het een betreffende tag heeft.

source: You may be using certain tags for other purposes, perhaps a + to indicate a read book, or a bracketed tag like ``[Amazon Freebie]`` to indicate a book's source. The :guilabel:`Excluded genres` regex allows you to specify tags that you don't want used as genres in the generated catalog. The default exclusion regex pattern ``\[.+\]\+`` excludes any tags of the form ``[tag]``, as well as excluding ``+``, the default tag for read books, from being used as genres in the generated catalog.
ja: あるタグを別の用途に使用している場合もあるでしょう。たとえば読んだ本を示す + や、``[Amazon Freebie]`` のように本の出典を示すためにタグをカッコで囲んだりするかもしれません。:guilabel:`除外するジャンル` の正規表現を使うと、生成されるカタログの中でジャンルとして扱いたくないタグを指定することができます。デフォルトの除外正規表現パターン ``\[.+\]\+`` は `[タグ]`` の形式のタグ、および 既読を表すデフォルトのタグである ``+`` タグを、生成されるカタログでジャンルとして使用されるものから除外します。
nl: U kunt bepaalde tags ook gebruiken voor andere doeleinden zoals een + om een gelezen boek aan te geven of een vierkante haakjes tag zoals ``[Amazon Freebie]`` voor de bron. Met de :guilabel:`Uitgesloten genres` regex kunt u tags opgeven die u niet wilt als genres in de gegenereerde catalogus. Het standaard regex uitsluiting patroon ``\[.+\]\+`` sluit alle tags uit in de form ``[tag]`` evenals ``+``, standaard tag voor gelezen boeken, van het gebruik als genres in de gegenereerde catalogus.

source: You can also use an exact tag name in a regex. For example, ``[Amazon Freebie]`` or ``[Project Gutenberg]``. If you want to list multiple exact tags for exclusion, put a pipe (vertical bar) character between them: ``[Amazon Freebie]|[Project Gutenberg]``.
ja: 正規表現の中でタグ名そのものを使用することもできます。たとえば ``[Amazon Freebie]`` や ``[Project Gutenberg]`` です。もし複数のタグ名を除外の一覧に設定したい場合には、次のようにパイプ (縦線) 文字を間にはさんでください: ``[Amazon Freebie]|[Project Gutenberg]``
nl: U kunt ook een exacte tag-naam gebruiken in een regex. Bijvoorbeeld ``[Amazon Freebie]`` of ``[Project Gutenberg]``. Indien u meerdere extacte labels voor uitsluiting wilt opgeven zet u een verticale streep ertussen: ``[Amazon Freebie]|[Project Gutenberg]``.

source: :guilabel:`Results of regex` shows you which tags will be excluded when the catalog is built, based on the tags in your database and the regex pattern you enter. The results are updated as you modify the regex pattern.
ja: :guilabel:`正規表現の結果` には、データベース中のタグと入力した正規表現に基づいて、カタログ作成時にどのタグが除外されるかを示します。正規表現を変更すると、結果が更新されます。
nl: :guilabel:`Regex-resultaten` toont welke labels worden uitgesloten wanneer de catalogus is gemaakt, gebaseerd op de labels in uw database en de regex-patronen die u invoert. De resultaten worden bijgewerkt als u de regex wijzigt.

source: Other options
ja: その他のオプション
nl: Overige opties

source: Other options for catalog
ja: カタログのその他のオプション
nl: Andere opties voor catalogus

source: :guilabel:`Catalog cover` specifies whether to generate a new cover or use an existing cover. It is possible to create a custom cover for your catalogs - see :ref:`custom_catalog_covers` for more information. If you have created a custom cover that you want to reuse, select :guilabel:`Use existing cover`. Otherwise, select :guilabel:`Generate new cover`.
ja: :guilabel:`カタログの表紙` には、新しい表紙を生成するのか既存の表紙を使用するのかを指定します。カタログの表紙をカスタムで作成することが可能です。詳しくは :ref:`custom_catalog_covers` を参照してください。作成したカスタムな表紙を再利用したい場合には、:guilabel:`既存の表紙を使用` を選択します。そうでなければ :guilabel:`新しい表紙を生成` を選択してください。
nl: :guilabel:`Catalogus cover` bepaalt of er een nieuwe cover wordt gegenereerd of een bestaande gebruikt. Het is mogelijk een aangepaste cover voor uw catalogus te creëren - kijk op :ref:`aangepaste_catalogus_covers` voor meer informatie. Als u een gecreëerde cover terug wilt gebruiken, selecteer :guilabel:`Gebruik bestaande cover`. Selecteer anders :guilabel:`Genereer nieuwe cover`.

source: :guilabel:`Extra Description note` specifies a custom column's contents to be inserted into the Description page, next to the cover thumbnail. For example, you might want to display the date you last read a book using a :guilabel:`Last Read` custom column. For advanced use of the Description note feature, see `this post in the calibre forum <https://www.mobileread.com/forums/showpost.php?p=1335767&postcount=395>`_.
ja: :guilabel:`追加の概要` には、表紙のサムネイルの横にある説明ページに挿入されるカスタム列の内容を指定します。たとえば、カスタム列 :guilabel:`Last Read` を使って最後に本を読んだ日付を表示したい場合があります。さらに高度な追加の概要機能の使い方については `calibre フォーラムのこの投稿 <https://www.mobileread.com/forums/showpost.php?p=1335767&postcount=395>`_ を参照してください。
nl: :guilabel:`Extra Beschrijving notitie` specificeert het invoegen van aangepaste kolom inhoud in de pagina Beschrijving, naast de miniatuur cover. Bv. u wilt de datum tonen wanneer u een boek voor het laatst gelezen hebt met een :guilabel:`Laatst gelezen` aangepaste kolom. Voor geavanceerd gebruik van de Beschrijving notitie functie, lees `dit bericht in het calibre forum <http://www.mobileread.com/forums/showpost.php?p=1335767&postcount=395>`_.

source: :guilabel:`Thumb width` specifies a width preference for cover thumbnails included with Descriptions pages. Thumbnails are cached to improve performance. To experiment with different widths, try generating a catalog with just a few books until you've determined your preferred width, then generate your full catalog. The first time a catalog is generated with a new thumbnail width, performance will be slower, but subsequent builds of the catalog will take advantage of the thumbnail cache.
ja: :guilabel:`サムネイル幅` には、説明ページに含まれる表紙サムネイルの幅を指定します。異なる幅を試すには、気に入った幅がわかるまで数冊の本だけのカタログを生成してみて、それから完全なカタログを生成してください。新しいサムネイル幅で最初にカタログが生成されるときにはパフォーマンスが低下しますが、その後に続けてカタログを作るときにはサムネイルのキャッシュを利用します。
nl: :guilabel:`Miniatuur breedte` specificeert de voorkeursbreedte voor omslag-miniaturen in de pagina Beschrijving. Miniaturen worden gecached om de snelheid te verbeteren. Bij experimenteren met verschillende breedtes, probeer een catalogus met maar een paar boeken totdat u de gewenste breedte heeft, genereer dan uw volledige catalogus. Het eerste genereren van een catalogus met een nieuwe miniatuurbreedte zal trager zijn maar de volgende uitvoeringen van de catalogus hebben voordeel van de miniaturencache.

source: :guilabel:`Merge with comments` specifies a custom column whose content will be non-destructively merged with the comments metadata during catalog generation. For example, you might have a custom column :guilabel:`Author bio` that you'd like to append to the comments metadata. You can choose to insert the custom column contents *before or after* the comments section, and optionally separate the appended content with a horizontal rule separator. Eligible custom column types include ``text, comments, and composite``.
ja: :guilabel:`コメントと統合` では、カタログ生成時にコメント書誌と非破壊的に内容を統合するカスタム列を指定します。たとえば、:guilabel:`Author bio` というカスタム列をコメント書誌に追加したい場合があります。カスタム列の内容を挿入する位置をコメントセクションの *前 または 後* を指定することができます。またオプションで追加した内容を水平ルールセパレータで区切ることもできます。使用できるカスタム列のタイプには ``テキスト, コメント, および複合`` が含まれます。
nl: :guilabel:`Samenvoegen met commentaar` specificeert een aangepaste kolom wiens inhoud niet-destructief samengevoegd wordt met de commentaar metadata tijdens catalogusgeneratie. Bv. u hebt een aangepaste kolom :guilabel:`Auteur bio` die u wilt toevoegen aan de commentaar metadata. U kan kiezen om de inhoud van de aangepaste kolom *voor of na* de commentaar sectie te plaatsen, en optioneel de toegevoegde inhoud afscheiden met een horizontale streep. Mogelijke kolomtypes zijn ``tekst, commentaar en samengesteld``.

source: Custom catalog covers
ja: カスタムなカタログの表紙
nl: Aangepaste catalogus omslagen

source: |cc| With the `Generate Cover plugin <https://www.mobileread.com/forums/showthread.php?t=124219>`_ installed, you can create custom covers for your catalog. To install the plugin, go to :guilabel:`Preferences > Advanced > Plugins > Get new plugins`.
ja: |cc| `Generate Cover plugin <https://www.mobileread.com/forums/showthread.php?t=124219>`_ をインストールすると、カタログのカスタム表紙を作成できます。プラグインをインストールするには、:guilabel:`環境設定 > 高度な設定 > プラグイン > 新しいプラグインを取得` へ行きます。
nl: |cc| Met de `Generate Cover plugin <https://www.mobileread.com/forums/showthread.php?t=124219>`_ geïnstalleerd, kun je aa,gepaste covers toevoegen aan je catalogus. Om de plugin te installeren, ga naar :guilabel:`Preferences > Advanced > Plugins > Get new plugins`.

source: Additional help resources
ja: その他のヘルプリソース
nl: Extra hulpbronnen

source: For more information on calibre's Catalog feature, see the MobileRead forum sticky `Creating Catalogs - Start here <https://www.mobileread.com/forums/showthread.php?t=118556>`_, where you can find information on how to customize the catalog templates, and how to submit a bug report.
ja: calibre のカタログ機能の詳細については、MobileRead フォーラムのスティッキー `Creating Catalogs - Start here <https://www.mobileread.com/forums/showthread.php?t=118556>`_ を参照してください。そこにカタログテンプレートのカスタマイズ方法とバグ報告の仕方が載っています。
nl: Voor meer informatie over calibres catalogus functionaliteit, bezoek het MobileRead forum sticky `Creating Catalogs - Start here <https://www.mobileread.com/forums/showthread.php?t=118556>`_, waar u informatie kunt vinden hoe een catalogus template aan te passen aan uw wensen, en hoe u een bug report op te stellen.

source: To ask questions or discuss calibre's Catalog feature with other users, visit the MobileRead forum `Library Management <https://www.mobileread.com/forums/forumdisplay.php?f=236>`_.
ja: calibre のカタログ機能について他のユーザに質問したり議論するには、MobileRead フォーラム `Library Management <https://www.mobileread.com/forums/forumdisplay.php?f=236>`_ にアクセスしてください。
nl: Voor vragen of om calibres Catalogus eigenschap te bespreken met anderen, bezoek het MobileRead forum `Library Management <https://www.mobileread.com/forums/forumdisplay.php?f=236>`_.
