Repository: debian-calibre/calibre
Catalog: translations-git/manual/*/regexp_quick_reference.po
Languages: ja, ru

source: Quick reference for regexp syntax
ja: 正規表現の構文のクイックリファレンス
ru: Краткая справка о синтаксисе регулярных выражений

source: This checklist summarizes the most commonly used/hard to remember parts of the regexp engine available in most parts of calibre.
ja: このチェックリストには、calibre のほとんどのパーツで利用可能な正規表現エンジンのうち、最も一般的に利用される/覚えにくいものをまとめてあります。
ru: В этот список помещены наиболее используемые / трудные для запоминания части движка регулярных выражений, доступные в calibre почти везде.

source: Contents
ja: 目次
ru: Содержание

source: Character classes
ja: 文字クラス
ru: Классы символов

source: Character classes are useful to represent different groups of characters, succinctly.
ja: 文字クラスは異なる文字グループを簡潔に表現するのに役立ちます。
ru: Классы символов полезны для краткого представления различных групп символов.

source: Examples:
ja: 例:
ru: Примеры:

source: **Representation**
ja: **表現**
ru: **Обозначение**

source: **Class**
ja: **クラス**
ru: **Класс**

source: ``[a-z]``
ru: ``[а-я]``

source: Lowercase letters. Does not include characters with accent mark and ligatures
ja: 小文字。アクセント記号や合字を含むことはできません
ru: Строчные буквы. Не включает символы с ударением и лигатурами.

source: ``[a-z0-9]``
ru: ``[а-я0-9]``

source: Lowercase letters from a to z or numbers from 0 to 9
ja: 小文字の英字 a から z もしくは数字 0 から 9
ru: Строчные буквы от а до я а также цифры от 0 до 9.

source: ``[A-Za-z-]``
ru: ``[А-Яа-я-]``

source: Uppercase or lowercase letters, or a dash. To include the dash in a class, you must put it at the beginning or at the end so as not to confuse it with the hyphen that specifies a range of characters
ja: 大文字、小文字、ダッシュ。クラスにダッシュを含めるには、文字の範囲を指定するハイフンと混合させないように、先頭または後尾でダッシュを入れる必要があります。
ru: Заглавные, строчные буквы, а также тире. Чтобы включить тире в классе, вы должны поместить его в начале или в конце, чтобы не путать его с дефисом, который обозначает диапазон символов.

source: Any character except a digit. The caret (^) placed at the beginning of the class excludes the characters of the class (complemented class)
ja: 10進数字を除いた任意の文字。クラスの先頭に (^) を置くと、そのクラス (補完クラス) の文字を除外します
ru: Любые символы, кроме цифр. Каретка (^), помещенная в начале класса, исключает символы класса (дополненный класс).

source: ``[[a-z]--[aeiouy]]``
ru: ``[[a-z]--[aeiouy]]`` ``[[а-я]--[аеёиоуыэюя]]``

source: The lowercase consonants. A class can be included in a class. The characters ``--`` exclude what follows them
ja: 小文字の子音。クラスはクラスに含めることが可能です。``--`` は、それに続くものを除外します
ru: Строчные согласные. Класс может быть включен в класс. Символы ``--`` исключают то, что следует за ними

source: All letters (including foreign accented characters). Abbreviated classes can be used inside a class
ja: すべての文字 (外国のアクセント文字を含む)。クラス内で文字クラスの略記法を使用できます。
ru: Все буквы (включая иностранные акцентированные символы). Сокращенные классы могут использоваться внутри класса

source: Example::
ja: 例::
ru: Пример::

source: Shorthand character classes
ja: 文字クラスの略記法
ru: Сокращенные классы символов

source: A digit (same as ``[0-9]``)
ja: 10 進数字 (``[0-9]` と同等)
ru: Цифра (то же, что и ``[0-9]``)

source: Any non-numeric character (same as ``[^0-9]``)
ja: 非 10 進数字 (``[^0-9]`` と同等)
ru: Любой нецифовой символ (то же, что и ``[^0-9]``)

source: An alphanumeric character (``[a-zA-Z0-9]``) including characters with accent mark and ligatures
ja: 単語構成文字 (``[a-zA-Z0-9]``) アクセント記号や合字を含む
ru: Буквенно-цифровой символ (``[a-zA-Z0-9]``), включая символы с меткой ударения и лигатуры

source: Any “non-word” character
ja: 非単語構成文字
ru: Любой “non-word” («несловесный») символ

source: Space, non-breaking space, tab, return line
ja: スペース、ノンブレーキングスペース、タブ、改行などの空白文字
ru: Space (пробел), non-breaking space (неразрывный пробел), tab (табуляция), return line (обратная строка)

source: Any “non-whitespace” character
ja: 非空白文字
ru: Любой символ «без пробелов»

source: Any character except newline. Use the “dot all” checkbox or the ``(?s)`` regexp modifier to include the newline character.
ja: 改行を除いた任意の文字。改行文字を含めるには「すべてドット」のチェックボックスを使用するか、正規表現修飾子 ``(?s)`` を使用してください。
ru: Любой символ кроме новой строки. Используйте флажок «dot all» или модификатор regexp ``(?s)``, чтобы включить символ новой строки.

source: The quantifiers
ja: 量指定子
ru: Квантификаторы

source: **Quantifier**
ja: **量指定子**
ru: **Квантификатор**

source: **Number of occurrences of the expression preceding the quantifier**
ja: **量指定子の前に置かれる式の出現回数**
ru: **Количество вхождений выражения, предшествующего квантификатору**

source: 0 or 1 occurrence of the expression. Same as ``{0,1}``
ja: expression の 0 回または 1 回の出現。``{0,1}`` と同等
ru: 0 или 1 повторение регулярного выражения. Эквивалентно ``{0,1}``.

source: 1 or more occurrences of the expression. Same as ``{1,}``
ja: expression の 1 回以上の出現。``{1,}`` と同等
ru: Одно или более повторение регулярного выражения. Эквивалентно ``{1,}``.

source: 0, 1 or more occurrences of the expression. Same as ``{0,}``
ja: expression の 0 回以上の出現。``{0,}`` と同等
ru: Любое - 0, 1 или более - количество повторений регулярного выражения. Эквивалентно ``{0,}``.

source: Exactly n occurrences of the expression
ja: expression のちょうど n 回の出現
ru: Ровно n повторений регулярного выражения.

source: Number of occurrences between the minimum and maximum values included
ja: 出現の回数が min 以上 max 以下
ru: Количество повторений регулярного выражения, не менее min раз и не более max раз.

source: Number of occurrences between the minimum value included and the infinite
ja: 出現の回数が min 以上
ru: Не менее min повторений регулярного выражения.

source: Number of occurrences between 0 and the maximum value included
ja: 出現の回数が 0 以上 max 以下
ru: Количество вхождений между 0 и включенным максимальным значением

source: Greed
ja: 貪欲
ru: Жадность

source: By default, with quantifiers, the regular expression engine is greedy: it extends the selection as much as possible. This often causes surprises, at first. ``?`` follows a quantifier to make it lazy. Avoid putting two in the same expression, the result can be unpredictable.
ja: デフォルトでは、量指定子を使用したときに、正規表現エンジンは貪欲です。つまり選択範囲を可能な限り広げます。最初のうちは、しばしばびっくりするような結果になります。量指定子の後ろに ``?`` をつけると、怠惰になります。同じ式の中に 2 つを同時に入れることは避けてください。予測できない結果となる可能性があります。
ru: По умолчанию в квантификаторах механизм регулярных выражений является жадным: он максимально расширяет выбор. Поначалу это часто вызывает сюрпризы. ``? `` следует за квантификатором, чтобы сделать его ленивым. Старайтесь не ставить два в одном выражении, результат может быть непредсказуемым.

source: Beware of nesting quantifiers, for example, the pattern ``(a*)*``, as it exponentially increases processing time.
ja: 量指定子を入れ子にしないよう気を付けてください。たとえばパターン ``(a*)*`` のような使い方をすると、処理時間が指数関数的に増加してしまいます。
ru: Остерегайтесь вложенных квантификаторов, например, шаблона ``(a*)*``, поскольку он экспоненциально увеличивает время обработки.

source: Alternation
ja: 選択子
ru: Перечисление

source: The ``|`` character in a regular expression is a logical ``OR``. It means that either the preceding or the following expression can match.
ja: 正規表現の中の ``|`` 文字は、論理 ``OR`` です。これは前の式または後ろの式のいずれかがマッチすればよいという意味になります。
ru: Символ ``|`` в регулярном выражении соответствует логическому ``ИЛИ`` (``OR``). Т. е. могут совпадать либо предыдущее, либо последующее выражения.

source: Exclusion
ja: 除外
ru: Исключение

source: Method 1
ja: 方法 1
ru: Метод 1

source: ``pattern_to_exclude(*SKIP)(*FAIL)|pattern_to_select``
ru: ``шаблон_исключения(*SKIP)(*FAIL)|шаблон_для_поиска``

source: Example:
ja: 例:
ru: Пример:

source: selects Blabla, in the strings Blabla or "Blabla or Blabla", but not in "Blabla".
ja: これは Blabla または "Blabla or Blabla" の文字列中の Blabla を選択しますが、"Blabla" では選択しません。
ru: выбирает Blabla, в строках Blabla или «Blabla или Blabla», но не в «Blabla».

source: Method 2
ja: 方法 2
ru: Метод 2

source: ``pattern_to_exclude\K|(pattern_to_select)``
ru: ``шаблон_для_исключения\K|(шаблон_для_отбора)``

source: Anchors
ja: アンカー
ru: Якоря

source: An anchor is a way to match a logical location in a string, rather than a character. The most useful anchors for text processing are:
ja: アンカーは、文字ではなく、文字列の論理的な位置にマッチさせる方法です。テキスト処理に最も役立つアンカーは次のものです:
ru: Якорь - это способ сопоставления логического расположения в строке, а не символа. Наиболее полезными якорями для обработки текста являются:

source: Designates a word boundary, i.e. a transition from space to non-space character. For example, you can use ``\bsurd`` to match ``the surd`` but not ``absurd``.
ja: 単語の区切り、すなわち空白から非空白への遷移。たとえば ``\bsurd`` は ``the surd`` にマッチしますが ``absurd`` にはマッチしません。
ru: Обозначает границу слова, то есть переход от пробела к непропробельному символу. Например, вы можете использовать ``\bsurd`` для сопоставления с ``surd``, но не ``absurd``.

source: Matches the start of a line (in multi-line mode, which is the default)
ja: 行の先頭にマッチ (複数行モードの場合。デフォルトは複数行モード)
ru: Соответствует началу строки (в многострочном режиме, который используется по умолчанию)

source: Matches the end of a line (in multi-line mode, which is the default)
ja: 行の末尾にマッチ (複数行モードの場合。デフォルトは複数行モード)
ru: Соответствует концу строки (в многострочном режиме, который используется по умолчанию)

source: Resets the start position of the selection to its position in the pattern. Some regexp engines (but not calibre) do not allow lookbehind of variable length, especially with quantifiers. When you can use ``\K`` with these engines, it also allows you to get rid of this limit by writing the equivalent of a positive lookbehind of variable length.
ja: 選択範囲の開始位置をパターン内のその位置にリセットします。一部の正規表現エンジンでは (ただし calibre は違います) 特に量指定子を指定した場合に、可変長の後読みが許されていません。このようなエンジンで ``\K`` が利用できる場合には、可変長の肯定後読みと同等のものを書くことによってこの制限を取り除けます。
ru: Сбрасывает начальную позицию выделения в его позицию в шаблоне. Некоторые движки регулярных выражений (но не calibre) не позволяют просматривать данные переменной длины, особенно с квантификаторами. Когда вы можете использовать ``\K`` с этими движками, это также позволяет вам избавиться от этого предела, написав эквивалент положительного взгляда позади длины переменной.

source: Groups
ja: グループ
ru: Группы

source: ``(expression)``
ru: ``(выражение)``

source: Capturing group, which stores the selection and can be recalled later in the *search* or *replace* patterns with ``\n``, where ``n`` is the sequence number of the capturing group (starting at 1 in reading order)
ja: グループをキャプチャします。グループには選択範囲が格納され、後で *検索* や *置換* のパターンとして ``\n`` で参照できます。n はキャプチャしたグループの連番 (1 から順に読込み順) です
ru: Группа захвата, которая хранит выбор и может быть вызвана позже в шаблонах *search* или *replace* на ``\n``, где `` n`` - порядковый номер группы захвата (начиная с 1 в порядке чтения)

source: ``(?:expression)``
ru: ``(?:выражение)``

source: Group that does not capture the selection
ja: 選択範囲をキャプチャしないグループ化
ru: Группа, которая не захватывает выбор

source: Atomic Group: As soon as the expression is satisfied, the regexp engine passes, and if the rest of the pattern fails, it will not backtrack to try other combinations with the expression. Atomic groups do not capture.
ja: アトミックグループ: expression が満足したら即座に正規表現エンジンが処理を抜け、もし残りのパターンが失敗した場合には、その expression の他の組み合わせを試すためのバックトラッキングを行いません。
ru: Атомная группа: как только выражение удовлетворено, обработчик регулярных выражений проходит, и если остальная часть шаблона завершится неудачно, он не будет возвращаться, чтобы попробовать другие комбинации с выражением. Атомные группы не захватывают.

source: Branch reset group: the branches of the alternations included in the expression share the same group numbers
ja: ブランチリセットグループ: expression に含まれる代替のブランチが同じグループ番号を共有します
ru: Группа сброса ветвей: ветви чередований, включенные в выражение, имеют одинаковые номера групп

source: Group named “name”. The selection can be recalled later in the *search* pattern by ``(?P=name)`` and in the *replace* by ``\g<name>``. Two different groups can use the same name.
ja: “name” という名前のグループ。選択範囲は後で *検索* パターンからは ``(?P=name)`` として、 *置換* では ``\g<name>`` として呼び出すことができます。2 つの別のグループが同じ名前を使用できます。
ru: Группа под названием «имя». Выбор может быть вызван позже в шаблоне *search* с помощью ``(?P=name)`` и в *replace* на ``\g<name>``. Две разные группы могут использовать одно и то же имя.

source: Lookarounds
ja: 前後読み
ru: Взгляды по сторонам

source: **Lookaround**
ja: **前後読み**
ru: **Взгляд по сторонам**

source: **Meaning**
ja: **意味**
ru: **Смысл**

source: Positive lookahead (to be placed after the selection)
ja: 肯定先読み (選択部分の前の位置)
ru: Позитивный lookahead (взгляд вперёд) (будет размещен после выделения)

source: Negative lookahead (to be placed after the selection)
ja: 否定先読み (選択部分の後ろの位置)
ru: Негативный lookahead (взгляд вперёд) (ставится после выделения)

source: Positive lookbehind (to be placed before the selection)
ja: 肯定後読み (選択部分の後ろの位置)
ru: Позитивный lookbehind (взгляд назад) (ставится перед выделением)

source: Negative lookbehind (to be placed before the selection)
ja: 否定後読み (選択部分の前の位置)
ru: Негативный lookbehind (взгляд назад) (ставится перед выделением)

source: Lookaheads and lookbehinds do not consume characters, they are zero length and do not capture. They are atomic groups: as soon as the assertion is satisfied, the regexp engine passes, and if the rest of the pattern fails, it will not backtrack inside the lookaround to try other combinations.
ja: 先読みと後読みは文字を消費せず、長さゼロでキャプチャされません。どちらもアトミックグループです。条件が満たされると即座に正規表現エンジンは処理を抜け、もし残りのパターンが失敗した場合には、その他の組み合わせを試すためのバックトラッキングを行いません。
ru: Lookaheads (взгляды вперед) и lookbehinds (взгляды назад) не потребляют символы, они имеют нулевую длину и не захватывают. Они являются атомарными группами: как только утверждение выполнено, движок регулярных выражений проходит, и если не удастся остальная часть шаблона, он не будет возвращаться в обход, чтобы попробовать другие комбинации.

source: When looking for multiple matches in a string, at the starting position of each match attempt, a lookbehind can inspect the characters before the current position. Therefore, on the string 123, the pattern ``(?<=\d)\d`` (a digit preceded by a digit) should, in theory, select 2 and 3. On the other hand, ``\d\K\d`` can only select 2, because the starting position after the first selection is immediately before 3, and there are not enough digits for a second match. Similarly, ``\d(\d)`` only captures 2. In calibre's regexp engine practice, the positive lookbehind behaves in the same way, and selects only 2, contrary to theory.
ja: 文字列の中で複数のマッチを検索するとき、それぞれのマッチを試行する最初の位置で、後読みは現在の位置の前にある文字を検査できます。したがって 123 という文字列で、``(?<=\d)\d`` というパターン (前に数字がついている数字) は、理論的には 2 と 3 を選択するはずです。一方、``\d\K\d`` は 2 しか選択できません。なぜなら最初の選択の後の開始位置は 3 の直前であり、2 番目のマッチに十分な長さの数字がないためです。同様に、``\d(\d)`` は 2 しかキャプチャしません。calibre の正規表現エンジンのやり方では、肯定後読みも同じように動作し、理論に反して 2 しか選択しません。
ru: При поиске нескольких совпадений в строке, в начальной позиции каждой попытки сопоставления, взгляд назад может проверять символы перед текущей позицией. Поэтому в строке 123 шаблон ``(?<=\D)\d`` (цифра, перед которой стоит цифра) должен теоретически выбрать 2 и 3. С другой стороны, ``\d\K\d`` может выбрать только 2, потому что начальная позиция после первого выбора находится непосредственно перед 3, и для второго совпадения недостаточно цифр. Точно так же ``\d(\d)`` только захватывает 2. В практике движка регулярных выражений calibre положительный взгляд назад (positive lookbehind) ведёт себя таким же образом и выбирает только 2, вопреки теории.

source: Groups can be placed inside lookarounds, but capture is rarely useful. Nevertheless, if it is useful, it will be necessary to be very careful in the use of a quantifier in a lookbehind: the greed associated with the absence of backtracking can give a surprising capture. For this reason, use ``\K`` rather than a positive lookbehind when you have a quantifier (or worse, several) in a capturing group of the positive lookbehind.
ja: 前後読みの内側にグループを配置することも可能ですが、キャプチャが役に立つことは滅多にありません。それでももし有用である場合には、後読みの中での量指定子の使用にはとても慎重になるべきです。バックトラックがないことに関連付けられた貪欲さは、びっくりするようなキャプチャをもたらすことがあります。このような理由から、肯定後読みのキャプチャグループの中に量指定子がある場合には、肯定後読みではなく ``\K`` を使用してください。
ru: Группы могут быть помещены в lookarounds (взгляды по сторонам), но захват редко полезен. Тем не менее, если это будет полезно, необходимо будет быть очень осторожным при использовании квантификатора во взгляде назад: жадность, связанная с отсутствием обратного отслеживания, может дать неожиданный захват. По этой причине, используйте ``\K``, а не положительный взгляд назад (positive lookbehind), когда у вас есть квантификатор (или, что еще хуже, несколько) в группе захвата положительного взгляда назад (positive lookbehind).

source: Example of negative lookahead:
ja: 否定先読みの例:
ru: Пример негативного взгляда вперёд:

source: Placed at the end of the pattern prevents to select within a tag or a style embedded in the file.
ja: パターンの最後に配置すると、ファイルに埋めこまれたタグやスタイルの中で選択できなくなります。
ru: Помещенный в конец шаблона препятствует выделению внутри тега или стиля, встроенного в файл.

source: Whenever possible, it is always better to "anchor" the lookarounds, to reduce the number of steps necessary to obtain the result.
ja: 可能な限り、結果を得るのに必要なステップ数を減らすために、後読みを「アンカー」する方がよいでしょう。
ru: Когда бы ни было возможно, всегда лучше «закрепить» обходные пути, чтобы уменьшить количество шагов, необходимых для получения результата.

source: Recursion
ja: 再帰
ru: Рекурсия

source: Recursion of the entire pattern
ja: パターン全体の再帰
ru: Рекурсия всего шаблона

source: Recursion of the only pattern of the numbered capturing group, here group 1
ja: 番号で指定されたキャプチャグループのパターンのみの再帰。ここではグループ 1
ru: Рекурсия единственного шаблона нумерованной группы захвата, здесь группа 1

source: Recursion is calling oneself. This is useful for balanced queries, such as quoted strings, which can contain embedded quoted strings. Thus, if during the processing of a string between double quotation marks, we encounter the beginning of a new string between double quotation marks, well we know how to do, and we call ourselves. Then we have a pattern like::
ja: 再帰とは自分自身を呼び出すことです。これは均衡のあるクエリで役に立ちます。たとえば引用符で囲まれた文字列を埋めこむことのできる引用符つきの文字列などです。このように、二重引用符に囲まれた文字列の処理中に、二重引用符で囲まれた新しい文字列に当たってしまったとき、どうすればよいかもうお分かりでしょうが、自分自身を呼び出すのです。そうするとこのようなパターンになります::
ru: Рекурсия вызывает себя. Это полезно для сбалансированных запросов, таких как строки в кавычках, которые могут содержать встроенные строки в кавычках. Таким образом, если во время обработки строки между двойными кавычками мы сталкиваемся с началом новой строки между двойными кавычками, мы хорошо знаем, как это сделать, и мы вызываем себя. Тогда у нас есть шаблон, вроде::

source: To select a string between double quotation marks without stopping on an embedded string::
ja: 二重引用符で囲まれた文字列を、その中に埋めこまれた文字列で止まらずに選択するには、次のようにします::
ru: Чтобы выбрать строку между двойными кавычками, не останавливаясь на встроенной строке::

source: This template can also be used to modify pairs of tags that can be embedded, such as ``<div>`` tags.
ja: このテンプレートは、入れ子にできる一組みのタグ、たとえば `<div>`` タグの変更にも使用できます。
ru: Этот шаблон также можно использовать для изменения пар тегов, которые могут быть встроены, таких как теги ``<div>``.

source: Special characters
ja: 特殊文字
ru: Специальные символы

source: **Character**
ja: **文字**
ru: **Символ**

source: tabulation
ja: タブ文字
ru: табуляция

source: line break
ja: 改行
ru: Разрыв строки

source: (breakable) space
ja: (改行可能な) 空白文字
ru: (разрываемый) пробел

source: no-break space
ja: ノーブレークスペース
ru: неразрываемый пробел

source: Meta-characters
ja: メタ文字
ru: Мета-символы

source: Meta-characters are those that have a special meaning for the regexp engine. Of these, twelve must be preceded by an escape character, the backslash (``\``), to lose their special meaning and become a regular character again::
ja: メタ文字は、正規表現エンジンにとって特別な意味を持つ文字です。このうち次の 12 個の文字は、特殊文字として使用せずに通常の文字として扱うためには前にエスケープ文字、すなわちバックスラッシュ (``\``) をつける必要があります。
ru: Мета-символы - это те, которые имеют особое значение для движка регулярных выражений. Из них двенадцати должен предшествовать escape-символ, обратная косая черта (``\``), чтобы потерять свое особое значение и снова стать обычным символом::

source: Seven other meta-characters do not need to be preceded by a backslash (but can be without any other consequence)::
ja: 残りの 7 個の特殊文字はバックスラッシュを前に付ける必要はありません (ただし、つけないと結果が変わる可能性があります)
ru: Семи другим метасимволам не обязательно должен предшествовать обратный слеш (но он может быть без каких-либо других последствий):

source: Special characters lose their status if they are used inside a class (between brackets ``[]``). The closing bracket and the dash have a special status in a class. Outside the class, the dash is a simple literal, the closing bracket remains a meta-character.
ja: 特殊文字はクラス内 (角カッコ ``[]`` の内側) では特殊文字ではなくなります。閉じカッコとダッシュはクラス内で特殊文字となります。クラスの外側では、ダッシュは単なる文字となりますが、閉じカッコはメタ文字のままです。
ru: Специальные символы теряют свой статус, если они используются внутри класса (между скобками ``[]``). Закрывающая скобка и тире имеют особый статус в классе. Вне класса тире - это простой литерал, закрывающая скобка остается метасимволом.

source: The slash (/) and the number sign (or hash character) (#) are not meta-characters, they don’t need to be escaped.
ja: スラッシュ (/) および 番号記号 (またはハッシュ文字) (#) はメタ文字ではないため、エスケープする必要はありません。
ru: Косая черта (/) и знак числа (или хэш-символ) (#) не являются метасимволами, их не нужно экранировать.

source: In some tools, like regex101.com with the Python engine, double quotes have the special status of separator, and must be escaped, or the options changed. This is not the case in the editor of calibre.
ja: Python エンジンを搭載した regex101.com のような一部のツールでは、二重引用符は特別な意味を持つ区切り文字のため、エスケープするかオプションを変更する必要があります。calibre のエディタでは、その必要はありません。
ru: В некоторых инструментах, таких как regex101.com с движком Python, двойные кавычки имеют специальный статус разделителя и должны быть экранированы, либо параметры изменены. Это не так в редакторе calibre.

source: Modes
ja: モード
ru: Режимы

source: Causes the dot (``.``) to match newline characters as well
ja: ドット (``.``) に改行文字もマッチさせます
ru: Заставляет точку (``.``) совпадать с символами новой строки

source: Makes the ``^`` and ``$`` anchors match the start and end of lines instead of the start and end of the entire string.
ja: ``^`` および ``$`` アンカーを文字列全体の先頭と末尾ではなく、行の先頭と末尾にマッチさせます。
ru: Заставляет якоря ``^`` и ``$`` соответствовать началу и концу строк вместо начала и конца всей строки.
