Repository: debian-calibre/calibre
Catalog: translations-git/manual/*/typesetting_math.po
Languages: cs, ja, pt_br, sv

source: Typesetting mathematics in e-books
cs: Sazba matematiky v e-knihách
ja: 電子書籍での数式の組版
pt_br: Tipografia matemática em e-books
sv: Matematiktypsättning i e-böcker

source: The calibre E-book viewer has the ability to display mathematics embedded in e-books (EPUB and HTML files). You can typeset the mathematics directly with TeX or MathML or AsciiMath. The calibre E-book viewer uses the excellent `MathJax <https://www.mathjax.org>`_ library to do this. This is a brief tutorial on creating e-books with mathematics in them that work well with the calibre E-book viewer.
cs: Prohlížeč e-knih Calibre má schopnost zobrazit matematiku vloženou do e-knih (soubory EPUB a HTML). Můžete sázet matematiku přímo pomocí TeX, MathML nebo AsciiMath. Prohlížeč e-knih Calibre k tomuto používá vynikající knihovnu `MathJax <https://www.mathjax.org>`_. Toto je stručný kurz vytváření e-knih s matematikou, které fungují dobře s Prohlížečem e-knih Calibre.
ja: calibre の電子書籍ビューアは、電子書籍 (EPUB および HTML ファイル) に埋め込まれた数式を表示する機能を備えています。TeX や MathML や AsciiMath を使って数式を直接組むことができます。calibre の電子書籍ビューアは数式を表示するのに優れた `MathJax <https://www.mathjax.org>` ライブラリを使用しています。これは、数式を含む電子書籍を calibre 電子書籍ビューアでうまく動作するよう作成するための簡単なチュートリアルです。
pt_br: O visualizador de livros digitais Calibre tem a capacidade de reproduzir formulas que estejam presentes em livros digitais (ficheiros EPUB e HTML). É possível inserir formulas diretamente utilizando programas como TeX, MathML ou AsciiMath. O visualizador de livros digitais Calibre usa o afamado `MathJax <https://www.mathjax.org>`_ library para este fim. Isto é um tutorial rápido de como criar livros digitais que contenham formulas matemáticas para que funcionem bem com o visualizador de livros digitais Calibre.
sv: calibres e-bokvisare har förmågan att visa matematik inbäddad i e-böcker (EPUB- och HTML-filer). Du kan skriva matematiken direkt med TeX eller MathML eller AsciiMath. calibres e-bokvisare använder det utmärkta biblioteket `MathJax <https://www.mathjax.org>`_ för att göra detta. Det här är en kort handledning om hur du skapar e-böcker med matematik i dem som fungerar bra med calibres e-bokvisare.

source: A simple HTML file with mathematics
cs: Zjednodušený soubor HTML s matematikou
ja: 数式を含む単純な HTML ファイル
pt_br: Um arquivo HTML simples com matemáticas
sv: En enkel HTML-fil med matematik

source: You can write mathematics inline inside a simple HTML file and the calibre E-book viewer will render it into properly typeset mathematics. In the example below, we use TeX notation for mathematics. You will see that you can use normal TeX commands, with the small caveat that ampersands and less than and greater than signs have to be written as &amp; &lt; and &gt; respectively.
cs: Můžete zapsat matematiku vloženou uvnitř souboru zjednodušeného HTML a Prohlížeč e-knih Calibre ji vykreslí se správnou sazbou matematiky. V příkladu níže používáme pro matematiku zápis TeX. Uvidíte, že můžete použít normální příkazy TeX, s malým upozorněním, že ampersandy a znaky menší než a větší než musí být zapsány jako &amp; &lt; a &gt; v uvedeném pořadí.
ja: 数式をインラインで簡単な HTML ファイルの中に書くと、calibre の電子書籍ビューアはそれを適切に組版された数式としてレンダリングします。以下の例では、数学に TeX 表記を使用しています。通常の TeX コマンドを使用できますが、アンパサンド、小なり記号、大なり記号はそれぞれ &amp; &lt; &gt; として記述する必要があるので注意してください。
pt_br: É possível escrever matemática embutida dentro de um arquivo *HTML* simples e o visualizador de E-book do *Calibre* irá renderizá-lo em uma matemática adequadamente tipada. No exemplo abaixo, usamos a notação *TeX* para matemática. Você verá que pode usar comandos *TeX* normais, com a pequena ressalva de que os sinais & comercial e menor e maior devem ser escritos como ``&amp;``, ``&lt;`` e ``&gt;`` respectivamente.
sv: Du kan skriva matematikindrag inuti i en enkel HTML-fil och calibres e-bokvisare återger den till korrekt inställd matematik. I exemplet nedan använder vi TeX-notering för matematik. Du kommer att se att du kan använda normala TeX-kommandon, med den lilla varningen att et-tecken och mindre än- och större än-tecken måste skrivas som &amp; &lt; och &gt; respektive.

source: The first step is to tell calibre that this will contains mathematics. You do this by adding the following snippet of code to the <head> section of the HTML file::
cs: První krok je říct Calibre, že toto bude obsahovat matematiku. To uděláte přidáním následujícího fragmentu kódu do oddílu <head> souboru HTML::
ja: 最初のステップは、calibre に、数式が含まれていると伝えることです。これを行うには、次のコードスニペットを HTML ファイルの <head> セクションに追加してください::
pt_br: O primeiro passo é dizer ao Calibre que conterá conteúdo matemático. Isto é conseguido ao adicionar o trecho de código seguinte à secção <head> do ficheiro HTML::
sv: Det första steget är att berätta för calibre att detta kommer att innehålla matematik. Det gör du genom att lägga till följande kodurval i avsnittet <head> av HTML-filen::

source: That's it, now you can type mathematics just as you would in a .tex file. For example, here are Lorentz's equations::
cs: To je vše, nyní můžete psát matematiku, jak byste to udělali v souboru .tex. Například zde jsou Lorentzovy rovnice::
ja: これで、.tex ファイルと同じように数式を入力できるようになりました。たとえば、ローレンツの方程式は次のとおりです::
pt_br: É isso, agora é possível digitar matemática da mesma forma que faria em um arquivo ``.tex``. Por exemplo, aqui estão as equações de *Lorentz*::
sv: Det var det, nu kan du skriva matematik på samma sätt som i en .tex fil. Till exempel här är Lorentz ekvationer::

source: This snippet looks like the following screen shot in the calibre E-book viewer.
cs: Tento fragment vypadá jako následující snímek obrazovky v Prohlížeči e-knih Calibre.
ja: このスニペットは、次のスクリーンショットのように calibre 電子書籍ビューアで表示されます。
pt_br: Este trecho se parece com a seguinte captura de tela no visualizador de E-book do *Calibre*.
sv: Detta kodavsnitt liknar följande skärmbild i calibres e-bokvisare.

source: :guilabel:`The Lorenz Equations`
cs: :guilabel:`Lorentzovy rovnice`
ja: :guilabel:`ローレンツの方程式`
sv: :guilabel:`Lorenz ekvationer`

source: The complete HTML file, with more equations and inline mathematics is reproduced below. You can convert this HTML file to EPUB in calibre to end up with an e-book you can distribute easily to other people.
cs: Kompletní soubor HTML s více rovnicemi a vloženou matematikou je reprodukován níže. Tento soubor HTML můžete převést do EPUB v Calibre, abyste získali e-knihu, kterou můžete snadno distribuovat ostatním lidem.
ja: より多くの方程式とインライン数式を含む完全な HTML ファイルを以下に再現します。この HTML ファイルを calibre で EPUB に変換すれば、電子書籍として他の人々に簡単に配布できるようになります。
pt_br: O arquivo *HTML* completo, com mais equações e matemática embutida, é reproduzido abaixo. É possível converter este arquivo *HTML* em *EPUB* no *Calibre* para acabar com um e-book que você pode distribuir facilmente para outras pessoas.
sv: Den kompletta HTML-filen med flera ekvationer och indragsmatematik återges nedan. Du kan konvertera den här HTML filen till EPUB in calibre för att hamna en e-bok som du kan dela ut lätt till andra människor.

source: Here is the generated EPUB file: `mathjax.epub <_static/mathjax.epub>`_.
cs: Zde je vygenerovaný soubor EPUB: `mathjax.epub <_static/mathjax.epub>`_.
ja: 生成された EPUB ファイル: `mathjax.epub <_static/mathjax.epub>`_
pt_br: Aqui está o arquivo *EPUB* gerado: `mathjax.epub <_static/mathjax.epub>`_.
sv: Här är en skapad EPUB-fil: `mathjax.epub <_static/mathjax.epub>`_.

source: More information
cs: Více informací
ja: 詳しい情報
pt_br: Mais informações
sv: Mer information

source: Since the calibre E-book viewer uses the MathJax library to render mathematics, the best place to find out more about mathematics in e-books and get help is the `MathJax website <https://www.mathjax.org>`_.
cs: Protože Prohlížeč e-knih Calibre používá pro vykreslení matematiky knihovnu MathJax, nejlepší místo pro zjištění více o matematice v e-knihách a získání nápovědy je `Webová stránka MathJax <https://www.mathjax.org>`_.
ja: calibre の電子書籍ビューアは MathJax ライブラリを使用して数式をレンダリングします。したがって電子書籍での数式についてもっと知りたい場合は `MathJax ウェブサイト<https://www.mathjax.org>`_ が最も役に立つでしょう。
pt_br: Uma vez que o visualizador de ebooks do calibre usa a biblioteca MathJax para renderizar texto matemático, o melhor lugar para conseguir mais informação sobre como incluir texto matemático em ebooks e conseguir ajuda é o `sítio web do MathJax <https://www.mathjax.org>`_.
sv: Eftersom calibres e-bokvisare använder MathJax-biblioteket för att återge matematik, är det bästa stället att ta reda på mer om matematik i e-böcker och få hjälp på `MathJax-webbplatsen <https://www.mathjax.org>`_.
