Repository: debian-calibre/calibre
Catalog: translations/manual/*/catalogs.po
Languages: ar, gl, ru, sv, ta, zh_cn

source: :guilabel:`Library` books specifies that any book with a value of True (or Yes) in a custom column :guilabel:`Available in Library` will be prefixed with a double arrow symbol.
ar: :guilabel:`كتب المكتبة` تحدد أن أي كتاب بقيمة True (أو نعم) في عمود مخصص :guilabel:`متاح في المكتبة` سيتم إلحاق رمز سهم مزدوج به.
gl: :guilabel:`Library` books especifica que calquera libro cun valor de Verdadero (ou Si) nunha columna personalizada :guilabel:`Dispoñible na Biblioteca` terá como prefixo un símbolo de dobre frecha.
ru: :guilabel:`Library` указывает, что любая книга со значением True (или Yes) в настраиваемом столбце :guilabel:`Available in Library' будет иметь префикс с двойным символом стрелки.
sv: :guilabel:`Bibliotek`-böcker anger att alla böcker med ett sant (eller Ja) värde i en anpassad kolumn :guilabel:`Finns i biblioteket` kommer att prefixas med en dubbelpilsymbol.
zh_cn: “书库” 图书指定自定义列“书库中的可用图书”中值为True(或是)的任何图书都将带有双箭头符号前缀。

source: The first matching rule supplies the prefix. Disabled or incomplete rules are ignored.
ar: القاعدة المطابقة الأولى توفر البادئة. يتم تجاهل القواعد المعطلة أو غير المكتملة.
gl: A primeira regra de coincidencia proporciona o prefixo. Ignoranse as regras desactivadas ou incompletas.
ru: Первое правило соответствия содержит префикс. Отключенные или неполные правила игнорируются.
sv: Den första matchnings regeln tillhandahåller prefixet. Inaktiverad eller ofullständig regel ignoreras.
ta: முதல் பொருந்தக்கூடிய விதி முன்னொட்டை வழங்குகிறது. முடக்கப்பட்ட அல்லது முழுமையற்ற விதிகள் புறக்கணிக்கப்படுகின்றன.
zh_cn: 第一个匹配规则提供前缀。已禁用或不完整的规则将被忽略。

source: Excluded books
ar: الكتب المستبعدة
gl: Libros excluídos
ru: Исключены книги
sv: Exkluderade böcker
ta: விலக்கப்பட்ட புத்தகங்கள்
zh_cn: 排除书籍

source: Excluded books in catalog
ar: الكتب المستبعدة في الفهرس
gl: Libros excluídos no catálogo
sv: Exkluderade böcker i katalogen
ta: பட்டியலில் விலக்கப்பட்ட புத்தகங்கள்
zh_cn: 目录中排除的图书

source: Exclusion rules allow you to specify books that will not be cataloged.
ar: تسمح لك قواعد الاستبعاد بتحديد الكتب التي لن يتم فهرستها.
gl: As regras de exclusión permítenche especificar libros que non serán catalogados.
ru: Правила исключения позволяют вам указывать книги, которые не будут каталогизированы.
sv: Uteslutningsregler tillåter dig specificera böcker som inte ska katalogiseras.
ta: விலக்கு விதிகள் பட்டியலிடப்படாத புத்தகங்களைக் குறிப்பிட உங்களை அனுமதிக்கின்றன.
zh_cn: 排除规则允许您指定不会编目的图书。

source: The checkbox in the first column enables the rule. :guilabel:`Name` is a rule name that you provide. :guilabel:`Field` is either :guilabel:`Tags` or a custom column in your library. :guilabel:`Value` is the content of :guilabel:`Field` to match. When an exclusion rule is satisfied, the book will be excluded from the generated catalog.
ar: مربع الاختيار في العمود الأول يمكّن القاعدة. :guilabel:`الاسم` هو اسم قاعدة تقوم بتوفيره. :guilabel:`الحقل` هو إما :guilabel:`الوسوم` أو عمود مخصص في مكتبتك. :guilabel:`القيمة` هي محتوى :guilabel:`الحقل` للمطابقة. عندما يتم استيفاء قاعدة استبعاد، سيتم استبعاد الكتاب من الفهرس الذي تم إنشاؤه.
gl: A caixa de verificación da primeira columna activa a regra. :guilabel:`Nome` é un nome de regra que proporcionas. :guilabel:`Field` é ou ben :guilabel:`Etiquetas` ou unha columna personalizada na túa biblioteca. :guilabel:`Valor` é o contido de :guilabel:`Field` para coincidir. Cando se cumpra unha regra de exclusión, o libro quedará excluído do catálogo xerado.
ru: Флажок в первом столбце разрешает это правило. :guilabel:`Name` - это имя правила, которое вы предоставляете. :guilabel:`Field`или :guilabel:`Tags`, или пользовательский столбец в вашей библиотеке. :guilabel:`Value` - содержимое :guilabel:`Field` для соответствия. Когда правило исключения будет выполнено, книга будет исключена из сгенерированного каталога.
sv: En kryssruta i första kolumnen aktiverar regeln. :guilabel:`Name` är ett regelnamn du anger. :guilabel:`Fält` är antingen :guilabel:`Tagg` eller en anpassad kolumn i ditt bibliotek. :guilabel:`Värde` är innehållet av :guilabel:`Fält` att passa mot. När en exkluderingsregel är uppfylld, kommer boken exkluderas från skapad katalog.
ta: முதல் நெடுவரிசையில் உள்ள தேர்வுப்பெட்டி விதியை செயல்படுத்துகிறது. : கிலாபெல்: `பெயர்` என்பது நீங்கள் வழங்கும் விதி பெயர். : கிலாபெல்: `புலம்` ஒன்று: கிலாபெல்:` குறிச்சொற்கள்` அல்லது உங்கள் நூலகத்தில் தனிப்பயன் நெடுவரிசை. : கிலாபெல்: `மதிப்பு` என்பது உள்ளடக்கம்: கிலாபெல்:` புலம்` பொருந்த வேண்டும். விலக்கு விதி திருப்தி அடையும்போது, புத்தகம் உருவாக்கப்பட்ட பட்டியலிலிருந்து விலக்கப்படும்.
zh_cn: 第一列中的复选框可启用该规则。“Name”是您提供的规则名称。“Field”可以是“Tags”，也可以是库中的自定义列。“Value”是要匹配的“Field”的内容。当满足排除规则时，图书将从生成的目录中排除。

source: Two exclusion rules have been specified in the example above:
ar: تم تحديد قاعدتي استبعاد في المثال أعلاه:
gl: No exemplo anterior especificáronse dúas regras de exclusión:
ru: В приведенном выше примере были указаны два правила исключения:
sv: Två exkluderingsregler har specificerats i exemplet ovan:
ta: மேலே உள்ள எடுத்துக்காட்டில் இரண்டு விலக்கு விதிகள் குறிப்பிடப்பட்டுள்ளன:
zh_cn: 上面的示例中指定了两个排除规则：

source: The :guilabel:`Catalogs` rule specifies that any book with a :guilabel:`Catalog` tag will be excluded from the generated catalog.
ar: تحدد قاعدة :guilabel:`الفهارس` أن أي كتاب يحمل وسم :guilabel:`فهرس` سيتم استبعاده من الفهرس الذي تم إنشاؤه.
gl: No exemplo anterior especificáronse dúas regras de exclusión:
ru: Правило :guilabel:`Catalogs`указывает, что любая книга с тегом guilabel:`Catalog` будет исключена из сгенерированного каталога.
sv: :guilabel:`Kataloger`-regeln anger att alla böcker med en :guilabel:`Katalog`-tagg kommer att exkluderas från den skapade katalogen.
ta: தி: கிலாபெல்: `பட்டியல்` விதி ஒரு: கிலாபெல்:` பட்டியல்` குறிச்சொல் உருவாக்கப்பட்ட பட்டியலிலிருந்து விலக்கப்படும் என்று குறிப்பிடுகிறது.
zh_cn: “Catalogs”规则指定任何带有“Catalogs”标签的图书都将从生成的目录中排除。

source: The :guilabel:`Archived` Books rule specifies that any book with a value of :guilabel:`Archived` in the custom column :guilabel:`Status` will be excluded from the generated catalog.
ar: تحدد قاعدة :guilabel:`الكتب المؤرشفة` أن أي كتاب بقيمة :guilabel:`مؤرشف` في العمود المخصص :guilabel:`الحالة` سيتم استبعاده من الفهرس الذي تم إنشاؤه.
gl: A regra de :guilabel:`Libros arquivados` especifica que calquera libro cun valor de :guilabel:`Arquivado` na columna personalizada :guilabel:`Estado` será excluído do catálogo xerado.
ru: Правило :guilabel:`Archived` указывает, что любая книга со значением :guilabel:`Archived` в настраиваемом столбце :guilabel:`Status` будет исключена из сгенерированного каталога.
sv: :guilabel:`Arkiverad`-bokregel anger att alla böcker med ett värde av :guilabel:`Arkiverad` i en anpassad kolumn :guilabel:`Status` kommer att exkluderas från den skapade katalogen.
ta: தி: கிலாபெல்: `காப்பகப்படுத்தப்பட்ட` புத்தக விதிகள் எந்தவொரு புத்தகத்தையும் மதிப்புள்ள: கிலாபெல்: தனிப்பயன் நெடுவரிசையில்` காப்பகப்படுத்தப்பட்டவை: கிலாபெல்: `நிலை` உருவாக்கப்பட்ட பட்டியலிலிருந்து விலக்கப்படும் என்று குறிப்பிடுகிறது.
zh_cn: “已存档”图书规则指定自定义列“状态”中值为“已存档”的任何图书都将从生成的目录中排除。

source: All rules are evaluated for every book. Disabled or incomplete rules are ignored.
ar: يتم تقييم جميع القواعد لكل كتاب. يتم تجاهل القواعد المعطلة أو غير المكتملة.
gl: Todas as regras avalíanse para cada libro. Ignoranse as regras desactivadas ou incompletas.
ru: Все правила оцениваются для каждой книги. Отключенные или неполные правила игнорируются.
sv: Alla regel utvärderas för varje bok. Inaktiverad eller inkomplett regel ignoreras.
ta: ஒவ்வொரு புத்தகத்திற்கும் அனைத்து விதிகளும் மதிப்பீடு செய்யப்படுகின்றன. முடக்கப்பட்ட அல்லது முழுமையற்ற விதிகள் புறக்கணிக்கப்படுகின்றன.
zh_cn: 所有规则都会针对每本书进行评估。禁用或不完整的规则将被忽略。

source: Excluded genres
ar: الأنواع المستبعدة
gl: Xéneros excluídos
ru: Исключенные жанры
sv: Exkluderade genrer
ta: விலக்கப்பட்ட வகைகள்
zh_cn: 排除类型

source: Excluded genres in catalog
ar: الأنواع المستبعدة في الفهرس
gl: Xéneros excluídos no catálogo
sv: Exkluderade genrer i katalogen
ta: பட்டியலில் விலக்கப்பட்ட வகைகள்
zh_cn: 目录中排除的流派

source: When the catalog is generated, tags in your database are used as genres. For example, you may use the tags ``Fiction`` and ``Nonfiction``. These tags become genres in the generated catalog, with books listed under their respective genre lists based on their assigned tags. A book will be listed in every genre section for which it has a corresponding tag.
ar: عند إنشاء الفهرس، تُستخدم الوسوم في قاعدة بياناتك كأنواع. على سبيل المثال، قد تستخدم الوسوم ``Fiction`` و ``Nonfiction``. تصبح هذه الوسوم أنواعًا في الفهرس الذي تم إنشاؤه، مع إدراج الكتب ضمن قوائم الأنواع الخاصة بها بناءً على الوسوم المخصصة لها. سيتم إدراج الكتاب في كل قسم نوع لديه وسم مطابق له.
gl: Cando se xera o catálogo, as etiquetas da súa base de datos úsanse como xéneros. Por exemplo, pode usar as etiquetas ``Fiction`` e ``Nonfiction``. Estas etiquetas convértense en xéneros no catálogo xerado, e os libros aparecen nas súas respectivas listas de xéneros en función das etiquetas asignadas. Un libro aparecerá en cada sección de xénero para as que teña unha etiqueta correspondente.
ru: При создании каталога, теги в вашей базе данных - это жанры. Например теги ``Fiction`` и ``Nonfiction`` становятся жанрами в сгенерированном каталоге, с книгами, перечисленными в соответствующих списках жанров, на основе назначенных им тегам. Книга будет указана в каждом жанре, для которого у неё есть соответствующий тег.
sv: När katalogen skapas används taggar i din databas som genrer. Till exempel kan du använda taggarna ``skönlitteratur`` och ``facklitteratur``. Dessa taggar blir genrer i den skapade katalogen med böcker som anges under respektive genrelista baserat på deras tilldelade taggar. En bok kommer att listas i varje genreavsnitt för vilken den har en motsvarande tagg.
ta: பட்டியல் உருவாக்கப்படும் போது, உங்கள் தரவுத்தளத்தில் உள்ள குறிச்சொற்கள் வகைகளாகப் பயன்படுத்தப்படுகின்றன. எடுத்துக்காட்டாக, நீங்கள் `` புனைகதை`` மற்றும் `` புனைகதை`` என்ற குறிச்சொற்களைப் பயன்படுத்தலாம். இந்த குறிச்சொற்கள் உருவாக்கப்பட்ட பட்டியலில் வகைகளாக மாறுகின்றன, புத்தகங்கள் அந்தந்த வகை பட்டியல்களின் கீழ் ஒதுக்கப்பட்ட குறிச்சொற்களின் அடிப்படையில் பட்டியலிடப்பட்டுள்ளன. ஒரு புத்தகம் ஒவ்வொரு வகை பிரிவிலும் பட்டியலிடப்படும், அதற்காக தொடர்புடைய குறிச்சொல் உள்ளது.
zh_cn: 生成目录时，数据库中的标记将用作流派。例如，您可以使用标签“小说”和“非小说”。这些标签成为生成目录中的流派，书籍根据其指定的标签列在各自的流派列表下。一本书将被列在每一个有相应标签的流派部分。

source: You may be using certain tags for other purposes, perhaps a + to indicate a read book, or a bracketed tag like ``[Amazon Freebie]`` to indicate a book's source. The :guilabel:`Excluded genres` regex allows you to specify tags that you don't want used as genres in the generated catalog. The default exclusion regex pattern ``\[.+\]\+`` excludes any tags of the form ``[tag]``, as well as excluding ``+``, the default tag for read books, from being used as genres in the generated catalog.
ar: قد تستخدم بعض الوسوم لأغراض أخرى، ربما علامة + للإشارة إلى كتاب مقروء، أو وسم بين قوسين مثل ``[Amazon Freebie]`` للإشارة إلى مصدر الكتاب. يسمح لك تعبير :guilabel:`الأنواع المستبعدة` بتحديد الوسوم التي لا تريد استخدامها كأنواع في الفهرس الذي تم إنشاؤه. نمط التعبير العادي الافتراضي للاستبعاد ``\[.+\]\+`` يستبعد أي وسوم من الشكل ``[tag]``، بالإضافة إلى استبعاد ``+``، الوسم الافتراضي للكتب المقروءة، من الاستخدام كأنواع في الفهرس الذي تم إنشاؤه.
gl: Podes estar usando determinadas etiquetas para outros fins, quizais un + para indicar un libro lido ou unha etiqueta entre corchetes como ``[Amazon Freebie]`` para indicar a orixe dun libro. A expresión regular :guilabel:`Xéneros excluídos` permítelle especificar etiquetas que non quere usar como xéneros no catálogo xerado. O patrón de expresión regular de exclusión predeterminada ``\[.+\]\+`` exclúe todas as etiquetas da forma ``[etiqueta]``, ademais de excluír ``+``, a etiqueta predeterminada para os libros de lectura. usados ​​como xéneros no catálogo xerado.
ru: Вы можете использовать определенные теги для других целей, возможно, +, чтобы указать читаемую книгу, или тег в скобках, вроде ``[Amazon Freebie]``, чтобы указать источник книги. : guilabel:`Excluded genres ' regex позволяет указать теги, которые вы не хотите использовать в качестве жанров в сгенерированном каталоге. Шаблон регулярного исключения исключений ``\ [.+\] \+`` исключает любые теги формы ``[tag]``, а также исключает ``+``умолчальный тег для чтения книг от использования в качестве жанров в сгенерированном каталоге.
sv: Du kan använda vissa taggar för andra ändamål, kanske ett + för att indikera att en bok lästs, eller en hakparates som ``[Amazon Freebie]`` för att indikera en boks källa. :guilabel:`Exkluderade genrer`-regexet tillåter dig att ange taggar som du inte vill använda som genrer i den skapade katalogen. Standard för exkluderingsregex-mönstret ``\[.+\]\+`` exkluderar alla taggar av formen ``[tagg]``, samt exkluderar ``+``, standard tagg för lästa böcker, från att användas som genrer i den skapade katalogen.
ta: ஒரு புத்தகத்தின் மூலத்தைக் குறிக்க `` [அமேசான் ஃப்ரீபீ] `` போன்ற ஒரு வாசிப்பு புத்தகத்தைக் குறிக்க சில குறிச்சொற்களை அல்லது ஒரு வாசிப்பு புத்தகத்தைக் குறிக்க A + அல்லது ஒரு அடைப்புக்குறி குறிச்சொல். தி: கிலாபெல்: `விலக்கப்பட்ட வகைகள்` ரீஜெக்ஸ் உருவாக்கப்பட்ட பட்டியலில் வகைகளாகப் பயன்படுத்த விரும்பாத குறிச்சொற்களைக் குறிப்பிட உங்களை அனுமதிக்கிறது. இயல்புநிலை விலக்கு ரெஜெக்ஸ் முறை `` \ [. உருவாக்கப்பட்ட பட்டியலில் வகைகளாகப் பயன்படுத்தப்படுகிறது.
zh_cn: 您可能会出于其他目的使用某些标签，也许用 + 来表示已读的书，或者用方括号括起来的标签（例如“[Amazon Freebie]”）来表示书籍的来源。 “排除的流派”正则表达式允许您指定不希望在生成的目录中用作流派的标签。 默认排除正则表达式模式``\[.+\]\+``排除任何形式为``[tag]``的标签，并排除``+``（阅读书籍的默认标签） 在生成的目录中用作流派。

source: You can also use an exact tag name in a regex. For example, ``[Amazon Freebie]`` or ``[Project Gutenberg]``. If you want to list multiple exact tags for exclusion, put a pipe (vertical bar) character between them: ``[Amazon Freebie]|[Project Gutenberg]``.
ar: يمكنك أيضًا استخدام اسم وسم دقيق في تعبير نمطي. على سبيل المثال، ``[Amazon Freebie]`` أو ``[Project Gutenberg]``. إذا كنت تريد إدراج عدة وسوم دقيقة للاستبعاد، ضع حرف أنبوب (خط عمودي) بينها: ``[Amazon Freebie]|[Project Gutenberg]``.
gl: Tamén pode usar un nome de etiqueta exacto nunha expresión regular. Por exemplo, ``[Amazon Freebie]`` ou ``[Project Gutenberg]``. Se queres enumerar varias etiquetas exactas para excluír, pon un carácter (barra vertical) entre elas: ``[Amazon Freebie]|[Project Gutenberg]``.
ru: Вы также можете использовать точное имя тега в регулярном выражении. Например, ``[Amazon Freebie]`` или ``[Project Gutenberg]``. Если вы хотите перечислить несколько точных тегов для исключения, поместите между ними символ трубы (вертикальной полосы): ``[Amazon Freebie]|[Project Gutenberg]``.
sv: Du kan också använda ett exakt namn i regex-uttryck. Till exempel ``[Amazon Freebie]`` eller ``[Project Gutenberg]``. Om du vill lista flera exakta taggar för uteslutning, använd en pip-tecken (vertikalt sträck |) mellan dem: ``[Amazon Freebie]|[Project Gutenberg]``.
ta: நீங்கள் ஒரு ரீஜெக்ஸில் சரியான குறிச்சொல் பெயரையும் பயன்படுத்தலாம். எடுத்துக்காட்டாக, `` [அமேசான் ஃப்ரீபீ] `` அல்லது `` [திட்ட குட்டன்பெர்க்] ``. விலக்குவதற்கு நீங்கள் பல துல்லியமான குறிச்சொற்களை பட்டியலிட விரும்பினால், அவற்றுக்கிடையே ஒரு குழாய் (செங்குத்து பட்டி) தன்மையை வைக்கவும்: `` [அமேசான் ஃப்ரீபீ] | [திட்ட குட்டன்பெர்க்] ``.
zh_cn: 您也可以在正则表达式中使用精确的标记名。例如，“[亚马逊免费赠品]”或“[古腾堡计划]”。如果要列出多个精确的标签以进行排除，请在它们之间放一个竖线（竖线）字符：“[亚马逊免费赠品]|[古腾堡项目]”。

source: :guilabel:`Results of regex` shows you which tags will be excluded when the catalog is built, based on the tags in your database and the regex pattern you enter. The results are updated as you modify the regex pattern.
ar: :guilabel:`نتائج التعبير النمطي` تعرض لك الوسوم التي سيتم استبعادها عند إنشاء الفهرس، بناءً على الوسوم في قاعدة بياناتك ونمط التعبير النمطي الذي تدخله. يتم تحديث النتائج عند تعديل نمط التعبير النمطي.
gl: :guilabel:`Results of regex` móstrache que etiquetas se excluirán cando se crea o catálogo, en función das etiquetas da túa base de datos e do patrón de regex que introduza. Os resultados actualízanse a medida que modificas o patrón regex.
ru: :guilabel:`Results of regex` показывает, какие теги будут исключены при создании каталога, на основе тегов в вашей базе данных и введенного шаблона регулярного выражения. Результаты обновляются при изменении шаблона регулярного выражения.
sv: :guilabel:`Resultat av regex` visar dig vilka taggar som kommer att exkluderas när katalog byggs, baserat på taggar i din databas och regex-mönster som anges. Resultat är uppdateras allt medan du ändrar regex-mönstret.
ta: . நீங்கள் ரீஜெக்ஸ் வடிவத்தை மாற்றியமைக்கும்போது முடிவுகள் புதுப்பிக்கப்படும்.
zh_cn: “正则表达式结果”根据数据库中的标签和您输入的正则表达式模式，显示在构建目录时哪些标签将被排除。当您修改正则表达式模式时，结果会更新。

source: Other options
ar: خيارات أخرى
gl: Outras opcións
ru: Другие настройки
sv: Andra alternativ
ta: பிற விருப்பங்கள்
zh_cn: 其他选项

source: Other options for catalog
ar: خيارات أخرى للفهرس
gl: Outras opcións para o catálogo
sv: Andra alternativ för katalogen
ta: பட்டியலுக்கான பிற விருப்பங்கள்
zh_cn: 目录的其他选项

source: :guilabel:`Catalog cover` specifies whether to generate a new cover or use an existing cover. It is possible to create a custom cover for your catalogs - see :ref:`custom_catalog_covers` for more information. If you have created a custom cover that you want to reuse, select :guilabel:`Use existing cover`. Otherwise, select :guilabel:`Generate new cover`.
ar: :guilabel:`غلاف الفهرس` يحدد ما إذا كان سيتم إنشاء غلاف جديد أو استخدام غلاف موجود. من الممكن إنشاء غلاف مخصص لفهارسك - انظر :ref:`custom_catalog_covers` لمزيد من المعلومات. إذا كنت قد أنشأت غلافًا مخصصًا وتريد إعادة استخدامه، فحدد :guilabel:`استخدام غلاف موجود`. وإلا، فحدد :guilabel:`إنشاء غلاف جديد`.
gl: :guilabel:`Portada do catálogo` especifica se se debe xerar unha nova portada ou usar unha portada existente. É posible crear unha portada personalizada para os seus catálogos; consulte :ref:`custom_catalog_covers` para obter máis información. Se creaches unha portada personalizada que queres reutilizar, selecciona :guilabel:`Usar tapa existente`. En caso contrario, selecciona :guilabel:`Xerar nova portada`.
sv: :guilabel:`Katalogomslag` anger om ett nytt omslag ska skapas eller använda ett befintligt omslag. Det är möjligt att skapa en anpassat omslag för dina kataloger - se :ref:`custom catalog covers` för mer information. Om du har skapat en anpassad omslag som du vill återanvända, väljer du :guilabel:`Använd befintligt omslag`. Annars, välj :guilabel:`Skapa nytt omslag`.
ta: : கிலாபெல்: `அட்டவணை கவர்` ஒரு புதிய அட்டையை உருவாக்க வேண்டுமா அல்லது ஏற்கனவே உள்ள அட்டையைப் பயன்படுத்தலாமா என்பதைக் குறிப்பிடுகிறது. உங்கள் பட்டியல்களுக்கான தனிப்பயன் அட்டையை உருவாக்க முடியும் - மேலும் தகவலுக்கு: குறிப்பு: `custom_catalog_covers`. நீங்கள் மீண்டும் பயன்படுத்த விரும்பும் தனிப்பயன் அட்டையை நீங்கள் உருவாக்கியிருந்தால், தேர்ந்தெடுக்கவும்: கிலாபெல்: `இருக்கும் அட்டையைப் பயன்படுத்துங்கள்`. இல்லையெனில், தேர்ந்தெடுக்கவும்: கிலாபெல்: `புதிய அட்டையை உருவாக்குங்கள்`.
zh_cn: “目录封面”指定是生成新封面还是使用现有封面。可以为您的目录创建自定义封面-有关详细信息，请参阅“custom_catalog_covers”。如果您已经创建了想要重复使用的自定义封面，请选择`使用现有封面`。否则，选择`生成新封面`。

source: :guilabel:`Extra Description note` specifies a custom column's contents to be inserted into the Description page, next to the cover thumbnail. For example, you might want to display the date you last read a book using a :guilabel:`Last Read` custom column. For advanced use of the Description note feature, see `this post in the calibre forum <https://www.mobileread.com/forums/showpost.php?p=1335767&postcount=395>`_.
ar: :guilabel:`ملاحظة وصف إضافية` تحدد محتويات عمود مخصص ليتم إدراجها في صفحة الوصف، بجوار الصورة المصغرة للغلاف. على سبيل المثال، قد ترغب في عرض تاريخ آخر قراءة لكتاب باستخدام عمود مخصص :guilabel:`آخر قراءة`. للاستخدام المتقدم لميزة ملاحظة الوصف، راجع `هذا المنشور في منتدى calibre <https://www.mobileread.com/forums/showpost.php?p=1335767&postcount=395>`_.
gl: :guilabel:`Nota de descrición adicional` especifica o contido dunha columna personalizada que se inserirá na páxina Descrición, xunto á miniatura da portada. Por exemplo, pode querer mostrar a data na que leu un libro por última vez usando unha columna personalizada :guilabel:`Última lectura`. Para un uso avanzado da función de nota de descrición, consulta `esta publicación no foro de calibre <https://www.mobileread.com/forums/showpost.php?p=1335767&postcount=395>`_.
ru: :guilabel:`Extra Description note`указывает содержимое настраиваемого столбца, которое должно быть вставлено на страницу «Описание», рядом с миниатюрой обложки. Например, вы можете отобразить дату, когда вы последний раз читали книгу, используя пользовательский столбец :guilabel:`Last Read`. Для расширенного использования функции Description note см. этот пост на форуме calibre <https://www.mobileread.com/forums/showpost.php?p=1335767&postcount=395>`_.
sv: :guilabel:`Extra beskrivningsanteckning` anger innehållet i en anpassad kolumn som ska infogas i beskrivningssidan, bredvid omslagsminiatyrbilden. Du kanske till exempel vill visa datumet du senast läste en bok med hjälp av en anpassad kolumn :guilabel:`Senaste lästa`. För avancerad användning av beskrivningsanteckningsfunktionen, se `det här inlägget i calibre-forumet <https://www.mobileread.com/forums/showpost.php?p=1335767&postcount=395>`_.
ta: . எடுத்துக்காட்டாக, A: guilabel: `கடைசியாக வாசித்தல்` தனிப்பயன் நெடுவரிசையைப் பயன்படுத்தி நீங்கள் கடைசியாக ஒரு புத்தகத்தைப் படித்த தேதியைக் காட்ட விரும்பலாம். விளக்க குறிப்பு அம்சத்தின் மேம்பட்ட பயன்பாட்டிற்கு, காலிபர் மன்றத்தில் `இந்த இடுகையைப் பார்க்கவும் <https://www.mobileered.com/forums/showpost.php?p=1335767&postcount=395>` _.
zh_cn: “Extra Description Note”指定要插入到封面缩略图旁边的描述页中的自定义列的内容。例如，您可能想要使用“Last Read”自定义列显示上次阅读一本书的日期。有关描述笔记功能的高级用法，请参阅Calibre论坛中的“此帖子<https://www.mobileread.com/forums/showpost.php?p=1335767&postcount=395>”_。
