Repository: debian-calibre/calibre
Catalog: translations/manual/*/catalogs.po
Languages: ar, gl, ru, sv, ta, zh_cn

source: :guilabel:`Thumb width` specifies a width preference for cover thumbnails included with Descriptions pages. Thumbnails are cached to improve performance. To experiment with different widths, try generating a catalog with just a few books until you've determined your preferred width, then generate your full catalog. The first time a catalog is generated with a new thumbnail width, performance will be slower, but subsequent builds of the catalog will take advantage of the thumbnail cache.
ar: :guilabel:`عرض الصورة المصغرة` يحدد تفضيل العرض للصور المصغرة للغلاف المضمنة في صفحات الوصف. يتم تخزين الصور المصغرة مؤقتًا لتحسين الأداء. لتجربة عروض مختلفة، حاول إنشاء فهرس بعدد قليل من الكتب حتى تحدد العرض المفضل لديك، ثم أنشئ فهرسك الكامل. في المرة الأولى التي يتم فيها إنشاء فهرس بعرض صورة مصغرة جديد، سيكون الأداء أبطأ، ولكن الإنشاءات اللاحقة للفهرس ستستفيد من ذاكرة التخزين المؤقت للصور المصغرة.
gl: :guilabel:`Largo do polgar` especifica unha preferencia de ancho para as miniaturas de portada incluídas nas páxinas de Descricións. As miniaturas almacénanse na memoria caché para mellorar o rendemento. Para probar con diferentes anchos, proba a xerar un catálogo con só uns poucos libros ata que determines o teu ancho preferido e, a continuación, xera o teu catálogo completo. A primeira vez que se xere un catálogo cun novo ancho de miniatura, o rendemento será máis lento, pero as compilacións posteriores do catálogo aproveitarán a caché de miniaturas.
ru: :guilabel:`Thumb width`задает предпочтение ширины для эскизов обложки, включенных в страницы описаний. Миниатюры кэшируются для повышения производительности. Чтобы поэкспериментировать с разной шириной, попробуйте создать каталог всего для нескольких книг, пока вы не определите предпочитаемую ширину, а затем сгенерируйте полный каталог. В первый раз, когда каталог создается с новой шириной эскиза, производительность будет медленнее, но последующие сборки этого каталога будут использовать кэш эскизов.
sv: :guilabel:`Miniatyrbildbredd` anger breddpreferens för omslagsminiatyrbilder som inkluderas på beskrivningssidor. Miniatyrbilder är cachade för att förbättra prestanda. För att experimentera med olika bredder, försök att skapa en katalog med bara några få böcker tills du har utrönt vilken som är din föredragna bredd och sedan skapa din fullständiga katalog. Första gången en katalog skapas med en ny miniatyrbildbredd kommer prestanda vara långsammare, men efterföljande byggnader av katalogen kommer utnyttja miniatyrbildcachen.
ta: : கிலாபெல்: `கட்டைவிரல் அகலம்` விளக்கங்கள் பக்கங்களுடன் சேர்க்கப்பட்ட கவர் சிறுபடங்களுக்கான அகல விருப்பத்தை குறிப்பிடுகிறது. செயல்திறனை மேம்படுத்த சிறு உருவங்கள் தற்காலிகமாக சேமிக்கப்படுகின்றன. வெவ்வேறு அகலங்களுடன் பரிசோதனை செய்ய, நீங்கள் விரும்பும் அகலத்தை தீர்மானிக்கும் வரை சில புத்தகங்களுடன் ஒரு பட்டியலை உருவாக்க முயற்சிக்கவும், பின்னர் உங்கள் முழு பட்டியலையும் உருவாக்கவும். முதல் முறையாக ஒரு புதிய சிறு அகலத்துடன் ஒரு பட்டியல் உருவாக்கப்படும் போது, செயல்திறன் மெதுவாக இருக்கும், ஆனால் பட்டியலின் அடுத்தடுத்த கட்டமைப்புகள் சிறுபடம் தற்காலிக சேமிப்பைப் பயன்படுத்திக் கொள்ளும்.
zh_cn: “缩略图宽度”指定描述页面中包含的封面缩略图的宽度首选项。缩略图被缓存以提高性能。要尝试不同的宽度，请尝试生成一个只有几本书的目录，直到您确定了首选宽度，然后生成完整的目录。第一次生成具有新缩略图宽度的目录时，性能会较慢，但后续构建的目录将利用缩略图缓存。

source: :guilabel:`Merge with comments` specifies a custom column whose content will be non-destructively merged with the comments metadata during catalog generation. For example, you might have a custom column :guilabel:`Author bio` that you'd like to append to the comments metadata. You can choose to insert the custom column contents *before or after* the comments section, and optionally separate the appended content with a horizontal rule separator. Eligible custom column types include ``text, comments, and composite``.
ar: :guilabel:`الدمج مع التعليقات` يحدد عمودًا مخصصًا سيتم دمج محتواه بشكل غير مدمر مع بيانات التعليقات الوصفية أثناء إنشاء الفهرس. على سبيل المثال، قد يكون لديك عمود مخصص :guilabel:`سيرة المؤلف` ترغب في إلحاقه ببيانات التعليقات الوصفية. يمكنك اختيار إدراج محتويات العمود المخصص *قبل أو بعد* قسم التعليقات، ويمكنك اختياريًا فصل المحتوى الملحق بفاصل خط أفقي. أنواع الأعمدة المخصصة المؤهلة تشمل ``نص، تعليقات، ومركب``.
gl: :guilabel:`Merge with comments` especifica unha columna personalizada cuxo contido se combinará de forma non destrutiva cos metadatos dos comentarios durante a xeración do catálogo. Por exemplo, pode ter unha columna personalizada :guilabel:`Biografía do autor` que desexa engadir aos metadatos dos comentarios. Podes optar por inserir o contido da columna personalizada *antes ou despois* da sección de comentarios e, opcionalmente, separar o contido anexo cun separador de regras horizontal. Os tipos de columnas personalizadas elixibles inclúen ``texto, comentarios e compostos``.
sv: :guilabel:`Slå samman med kommentarer` anger en anpassad kolumn vars innehåll kommer ovillkorligen slås samman med kommentarmetadata under kataloggenereringen. Du kan till exempel ha en anpassad kolumn :guilabel:`Författarbiografi` som du vill lägga till i kommentarmetadata. Du kan välja att infoga de anpassade kolumninnehållet *före eller efter* kommentarsektionen och eventuellt separera det bifogade innehållet med en horisontell regelavskiljare. Godtagbara anpassade kolumntyper inkluderar ``text, kommentarer och blandningen``.
ta: . எடுத்துக்காட்டாக, உங்களிடம் தனிப்பயன் நெடுவரிசை இருக்கலாம்: கிலாபெல்: `ஆசிரியர் பயோ` நீங்கள் கருத்துகள் மெட்டாடேட்டாவுடன் சேர்க்க விரும்புகிறீர்கள். கருத்துகள் பிரிவுக்கு முன் அல்லது பின் தனிப்பயன் நெடுவரிசை உள்ளடக்கங்களை * செருக நீங்கள் தேர்வு செய்யலாம், மேலும் சேர்க்கப்பட்ட உள்ளடக்கத்தை கிடைமட்ட விதி பிரிப்பான் மூலம் விருப்பமாக பிரிக்கவும். தகுதியான தனிப்பயன் நெடுவரிசை வகைகளில் `` உரை, கருத்துகள் மற்றும் கலப்பு`` அடங்கும்.
zh_cn: `与评论合并`指定自定义列，其内容将在目录生成过程中与评论元数据进行非破坏性合并。例如，您可能有一个自定义列“Author bio”，您希望将其附加到注释元数据中。您可以选择在备注部分*之前或之后*插入自定义列内容，并可以选择使用水平标尺分隔符分隔追加的内容。符合条件的自定义列类型包括“文本、注释和复合”。

source: Custom catalog covers
ar: أغلفة الفهرس المخصصة
gl: Portadas de catálogo personalizados
ru: Настраиваемый каталог обложек
sv: Anpassade katalogomslag
ta: தனிப்பயன் அட்டவணை கவர்கள்
zh_cn: 自定义目录封面

source: |cc| With the `Generate Cover plugin <https://www.mobileread.com/forums/showthread.php?t=124219>`_ installed, you can create custom covers for your catalog. To install the plugin, go to :guilabel:`Preferences > Advanced > Plugins > Get new plugins`.
ar: |cc| مع تثبيت `إضافة إنشاء الغلاف <https://www.mobileread.com/forums/showthread.php?t=124219>`_، يمكنك إنشاء أغلفة مخصصة لفهرسك. لتثبيت الإضافة، انتقل إلى :guilabel:`التفضيلات > متقدم > الإضافات > الحصول على إضافات جديدة`.
gl: |cc| Co `Generate Cover plugin <https://www.mobileread.com/forums/showthread.php?t=124219>`_ instalado, podes crear portadas personalizadas para o teu catálogo. Para instalar o complemento, vai a :guilabel:`Preferencias > Avanzado > Complementos > Obter novos complementos`.
ru: |cc| С установленным плагином `Generate Cover <https://www.mobileread.com/forums/showthread.php?t=124219>`_ вы можете создавать собственные обложки для своего каталога. Чтобы установить плагин, перейдите по ссылке :guilabel:`Настройки > Дополнительно > Плагины > Получить новые плагины`.
sv: |cc| Med `insticksmodulen Generate Cover <https://www.mobileread.com/forums/showthread.php?t=124219>`_ installerad kan du skapa anpassade omslag för din katalog. För att installera insticksmodulen, gå till :guilabel:`Inställningar > Avancerat > Insticksmoduler > Skaffa nya insticksmoduler`.
ta: | சி.சி | கவர் சொருகி <https://www.mobileeread.com/forums/showthread.php?t=124219> `_ நிறுவப்பட்டால், உங்கள் பட்டியலுக்கான தனிப்பயன் அட்டைகளை உருவாக்கலாம். சொருகி நிறுவ, இதற்குச் செல்லவும்: கிலாபெல்: `விருப்பத்தேர்வுகள்> மேம்பட்ட> செருகுநிரல்கள்> புதிய செருகுநிரல்களைப் பெறுங்கள்`.
zh_cn: |cc| 安装“生成封面插件<https://www.mobileread.com/forums/showthread.php?t=124219>“后，您可以为您的目录创建自定义封面。要安装插件，请进入`首选项>高级>插件>获取新插件`。

source: Additional help resources
ar: مصادر مساعدة إضافية
gl: Recursos de axuda adicionais
ru: Дополнительные справочные ресурсы
sv: Ytterligare hjälpresurser
ta: கூடுதல் உதவி வளங்கள்
zh_cn: 其他帮助资源

source: For more information on calibre's Catalog feature, see the MobileRead forum sticky `Creating Catalogs - Start here <https://www.mobileread.com/forums/showthread.php?t=118556>`_, where you can find information on how to customize the catalog templates, and how to submit a bug report.
ar: لمزيد من المعلومات حول ميزة الفهرسة في calibre، راجع الموضوع المثبت في منتدى MobileRead `إنشاء الفهارس - ابدأ من هنا <https://www.mobileread.com/forums/showthread.php?t=118556>`_، حيث يمكنك العثور على معلومات حول كيفية تخصيص قوالب الفهرس، وكيفية إرسال تقرير خطأ.
gl: Para obter máis información sobre a función de catálogo de calibre, consulte o foro de MobileRead `Creando catálogos - Comeza aquí <https://www.mobileread.com/forums/showthread.php?t=118556>`_, onde podes atopar información sobre como para personalizar os modelos do catálogo e como enviar un informe de erros.
ru: Для получения дополнительной информации о функции Каталога в calibre см. форум MobileRead `Creating Catalogs - Start here <https://www.mobileread.com/forums/showthread.php?t=118556>`_, где вы можете найти информацию о том, как настроить шаблоны каталогов и как отправить отчет об ошибке.
sv: För mer information om calibres katalogfunktion, se MobileRead-forumet `Creating Catalogs - Start here <https://www.mobileread.com/forums/showthread.php?t=118556>`_, där du kan hitta information för att anpassa katalogmallarna och hur du skickar in en felanmälan.
ta: காலிபரின் பட்டியல் அம்சத்தைப் பற்றிய கூடுதல் தகவலுக்கு, மொபிலர்ஹெட் மன்றம் ஒட்டும் `பட்டியல்களை உருவாக்குதல் - இங்கே தொடங்கவும் <https://www.mobileered.com/forums/showthread.php?t=118556>` _, அங்கு தகவல்களைக் காணலாம் அட்டவணை வார்ப்புருக்களைத் தனிப்பயனாக்க, மற்றும் பிழை அறிக்கையை எவ்வாறு சமர்ப்பிப்பது.
zh_cn: 有关Calibre的Catalog功能的更多信息，请参见MobileRead论坛粘滞的`创建目录-从这里开始<https://www.mobileread.com/forums/showthread.php?t=118556>`_，您可以在这里找到如何定制目录模板以及如何提交错误报告的信息。

source: To ask questions or discuss calibre's Catalog feature with other users, visit the MobileRead forum `Library Management <https://www.mobileread.com/forums/forumdisplay.php?f=236>`_.
ar: لطرح الأسئلة أو مناقشة ميزة الفهرسة في calibre مع مستخدمين آخرين، قم بزيارة منتدى MobileRead `إدارة المكتبة <https://www.mobileread.com/forums/forumdisplay.php?f=236>`_.
gl: Para facer preguntas ou discutir a función Catálogo de calibre con outros usuarios, visite o foro de MobileRead `Xestión de bibliotecas <https://www.mobileread.com/forums/forumdisplay.php?f=236>`_.
sv: För att ställa frågor eller diskutera calibres katalogfunktion med andra användare, besök MobileRead-forumet `Library Management <https://www.mobileread.com/forums/forumdisplay.php?f=236>`_.
ta: கேள்விகளைக் கேட்க அல்லது பிற பயனர்களுடன் காலிபரின் பட்டியல் அம்சத்தைப் பற்றி விவாதிக்க, மொபிலெர்ஹெட் மன்றத்தைப் பார்வையிடவும் `நூலக மேலாண்மை <https://www.mobileered.com/forums/forumdisplay.php?f=236>` _.
zh_cn: 如需提问或与其他用户讨论Calibre的目录功能，请访问MobileRead论坛`书库管理<https://www.mobileread.com/forums/forumdisplay.php?f=236>`_。

source: cc
ta: சி.சி.

source: To begin catalog generation, select the menu item :guilabel:`Convert books > Create a catalog of the books in your calibre library`. You may also add a :guilabel:`Create Catalog` button to a toolbar in :guilabel:`Preferences > Interface > Toolbars` for easier access to the Generate catalog dialog.
ru: Чтобы начать создание каталога, выберите пункт меню :guilabel: `Конвертировать книги> Создать каталог книг в библиотеке calibre. Вы также можете добавить :guilabel: кнопку «Создать каталог» на панели инструментов в :guilabel: `Настройки`>`Интерфейс` > `Панели инструментов` для упрощения доступа к диалогу Создать каталог.

source: :guilabel:`Catalog cover` specifies whether to generate a new cover or use an existing cover. It is possible to create a custom cover for your catalogs - see :ref:`Custom catalog covers` for more information. If you have created a custom cover that you want to reuse, select :guilabel:`Use existing cover`. Otherwise, select :guilabel:`Generate new cover`.
ru: :guilabel:`Catalog cover` указывает, следует ли создавать новую обложку или использовать существующую обложку. Можно создать пользовательскую обложку для ваших каталогов - см. :ref:`Custom catalog covers` для получения дополнительной информации. Если вы создали пользовательскую обложку, которую хотите повторно использовать, выберите :guilabel:`Использовать существующую обложку`. В противном случае выберите :guilabel: `Сгенерировать новую обложку`.

source: :guilabel:`Merge with Comments` specifies a custom column whose content will be non-destructively merged with the Comments metadata during catalog generation. For example, you might have a custom column :guilabel:`Author bio` that you'd like to append to the Comments metadata. You can choose to insert the custom column contents *before or after* the Comments section, and optionally separate the appended content with a horizontal rule separator. Eligible custom column types include ``text, comments, and composite``.
ru: :guilabel:`Merge with Comments`определяет настраиваемый столбец, содержимое которого будет недеструктивно слито с метаданными комментариев во время генерации каталога. Например, у вас может быть собственный столбец :guilabel:`Author bio`, который вы хотите добавить к метаданным комментариев. Вы можете вставлять содержимое пользовательского столбца *до или после* раздела «Комментарии» и, при необходимости, разделять добавленный контент с помощью правила горизонтального разделителя. Соответствующие настраиваемые типы столбцов включают «текст, комментарии и композит».

source: To ask questions or discuss calibre's Catalog feature with other users, visit the MobileRead forum `Calibre Catalogs <https://www.mobileread.com/forums/forumdisplay.php?f=236>`_.
ru: Чтобы задать вопросы или обсудить функцию Каталога с другими пользователями, посетите форум MobileRead `Caliber Catalogs <https://www.mobileread.com/forums/forumdisplay.php?f=236>`_.
