Repository: debian-calibre/calibre
Catalog: translations/manual/*/catalogs.po
Languages: ar, gl, ru, sv, ta, zh_cn

source: Creating AZW3 • EPUB • MOBI catalogs
ar: إنشاء فهارس AZW3 • EPUB • MOBI
gl: Creación de catálogos AZW3 • EPUB • MOBI
ru: Создание AZW3 • EPUB • MOBI каталогов
sv: Skapa kataloger för AZW3 • EPUB • MOBI
ta: AZW3 • EPUB • MOBI பட்டியல்களை உருவாக்குதல்
zh_cn: 创建AZW3 、 EPUB 、 MOBI目录

source: calibre's Create catalog feature enables you to create a catalog of your library in a variety of formats. This help file describes cataloging options when generating a catalog in AZW3, EPUB and MOBI formats.
ar: تتيح لك ميزة إنشاء فهرس في calibre إنشاء فهرس لمكتبتك بتنسيقات متنوعة. يصف ملف المساعدة هذا خيارات الفهرسة عند إنشاء فهرس بتنسيقات AZW3 و EPUB و MOBI.
gl: A función Crear catálogo de calibre permítelle crear un catálogo da súa biblioteca nunha variedade de formatos. Este ficheiro de axuda describe as opcións de catalogación cando se xera un catálogo en formatos AZW3, EPUB e MOBI.
ru: Функция Создания каталога в Calibre позволяет создать каталог вашей библиотеки в разных форматах.
sv: calibres Skapa katalogfunktioner kan du skapa en katalog över ditt bibliotek i en mängd olika format. Denna hjälpfil beskriver katalogiseringsalternativ när katalog skapas i AZW3-, EPUB- och MOBI-format.
ta: காலிபரின் உருவாக்கு அட்டவணை அம்சம் உங்கள் நூலகத்தின் பட்டியலை பல்வேறு வடிவங்களில் உருவாக்க உங்களுக்கு உதவுகிறது. AZW3, EPUB மற்றும் MOBI வடிவங்களில் ஒரு பட்டியலை உருவாக்கும் போது இந்த உதவி கோப்பு பட்டியலிடும் விருப்பங்களை விவரிக்கிறது.
zh_cn: 创建目录功能让你可以用多种格式去构建你的书库。该帮助文件描述生成AZW3, EPUB和MOBI格式目录时的选项。

source: Selecting books to catalog
ar: اختيار الكتب للفهرسة
gl: Selección de libros para catalogar
ru: Выбор книг для каталогизации
sv: Välja böcker att katalogisera
ta: பட்டியலுக்கு புத்தகங்களைத் தேர்ந்தெடுப்பது
zh_cn: 添加图书到目录

source: If you want *all* of your library cataloged, remove any search or filtering criteria in the main window. With a single book selected, all books in your library will be candidates for inclusion in the generated catalog. Individual books may be excluded by various criteria; see the :ref:`excluded_genres` section below for more information.
ar: إذا كنت تريد فهرسة *جميع* مكتبتك، فأزل أي معايير بحث أو تصفية في النافذة الرئيسية. مع تحديد كتاب واحد، ستكون جميع الكتب في مكتبتك مرشحة للإدراج في الفهرس الذي تم إنشاؤه. يمكن استبعاد الكتب الفردية بمعايير مختلفة؛ راجع قسم :ref:`excluded_genres` أدناه لمزيد من المعلومات.
gl: Se queres catalogar *toda* a túa biblioteca, elimina calquera criterio de busca ou filtrado da xanela principal. Cun só libro seleccionado, todos os libros da túa biblioteca serán candidatos a incluír no catálogo xerado. Os libros individuais poden ser excluídos por varios criterios; consulte a sección :ref:`excluded_genres` a continuación para obter máis información.
ru: Чтобы каталогизировать "всю" библиотеку, удалите все критерии поиска или фильтры в главном окне. Выбрав одну книгу, все книги вашей библиотеки будут выбраны для включения в формируемый каталоге. Отдельные книги могут быть исключены по различным критериям; смотри :ссылка:"исключенные жанры" нижний раздел для получения дополнительной информаци.
sv: Om du vill att *alla* dina bibliotek katalogiseras, ta bort valfri sökning eller filtrera villkor i huvudfönstret. Med en enkelt val bok, kommer alla böcker i ditt bibliotek bli kandidater för inkludering i den skapade katalogen. Individuella böcker kan kommas att exkluderas av diverse orsaker; se :ref:`excluded_genres` sektionen nedan för mer information.
ta: உங்கள் நூலகத்தின் அனைத்து * * ஐ நீங்கள் விரும்பினால், பிரதான சாளரத்தில் ஏதேனும் தேடல் அல்லது வடிகட்டுதல் அளவுகோல்களை அகற்றவும். ஒரு புத்தகத்தைத் தேர்ந்தெடுக்கப்பட்டால், உங்கள் நூலகத்தில் உள்ள அனைத்து புத்தகங்களும் உருவாக்கப்பட்ட பட்டியலில் சேர்ப்பதற்கான வேட்பாளர்களாக இருக்கும். தனிப்பட்ட புத்தகங்கள் பல்வேறு அளவுகோல்களால் விலக்கப்படலாம்; மேலும் தகவலுக்கு கீழே: `விலக்கப்பட்ட_ஜென்ரெஸ் பிரிவு கீழே காண்க.
zh_cn: 如果你需要*所有*书库目录，删除主窗口中的任何搜索或过滤条件。选择一本书后，您书库中的所有图书都将成为包含在生成的目录中的候选图书。个别书籍可能会因各种条件而被排除在外；有关详细信息，请参阅下面的 :ref:`excluded_genres` 部分。

source: If you want only *some* of your library cataloged, you have two options:
ar: إذا كنت تريد فهرسة *بعض* مكتبتك فقط، فلديك خياران:
gl: Se queres catalogar só *algunhas* das túas bibliotecas, tes dúas opcións:
ru: Если Вы хотите каталогизировать только *некоторые* из Ваших библиотек, у Вас есть два варианта:
sv: Om du vill bara att *några* av dina bibliotek katalogiserade, har du två alternativ:
ta: உங்கள் நூலகத்தின் பட்டியலிடப்பட்ட * சில * மட்டுமே நீங்கள் விரும்பினால், உங்களுக்கு இரண்டு விருப்பங்கள் உள்ளன:
zh_cn: 如果只需要*一些*你的书库目录，你有两个选择：

source: Create a multiple selection of the books you want cataloged. With more than one book selected in calibre's main window, only the selected books will be cataloged.
ar: إنشاء تحديد متعدد للكتب التي تريد فهرستها. مع تحديد أكثر من كتاب واحد في نافذة calibre الرئيسية، سيتم فهرسة الكتب المحددة فقط.
gl: Crea unha selección múltiple dos libros que queres catalogar. Con máis dun libro seleccionado na xanela principal de calibre, só se catalogarán os libros seleccionados.
ru: Создать множественный выбор книг, которые вы хотите каталогизировать. При наличие более одной выбранной книги в главном окне Calibre, только выбранные книги будут каталогизированные.
sv: Skapa ett flertal urval av de böcker du vill katalogisera. Med mer än en bok vald i calibres huvudfönster kommer endast de valda böckerna att katalogiseras.
ta: நீங்கள் பட்டியலிட விரும்பும் புத்தகங்களின் பல தேர்வை உருவாக்கவும். காலிபரின் பிரதான சாளரத்தில் ஒன்றுக்கு மேற்பட்ட புத்தகங்கள் தேர்ந்தெடுக்கப்பட்ட நிலையில், தேர்ந்தெடுக்கப்பட்ட புத்தகங்கள் மட்டுமே பட்டியலிடப்படும்.
zh_cn: 选择多本需要创建目录的书籍。如果在 calibre 的主窗口中选择了不止一本书籍，则只会对所选书籍进行创建。

source: Use the Search field or the Tag browser to filter the displayed books. Only the displayed books will be cataloged.
ar: استخدم حقل البحث أو متصفح الوسوم لتصفية الكتب المعروضة. سيتم فهرسة الكتب المعروضة فقط.
gl: Use o campo de busca ou o navegador de etiquetas para filtrar os libros mostrados. Só se catalogarán os libros expostos.
ru: Используйте поле поиска или браузер тегов для фильтрации отображаемых книг. Каталогизируются только отображаемые книги.
sv: Använd sökfält eller taggbläddraren för att filtrera de visade böckerna. Bara de visade böckerna kommer katalogiseras.
ta: காட்டப்படும் புத்தகங்களை வடிகட்ட தேடல் புலம் அல்லது குறிச்சொல் உலாவியைப் பயன்படுத்தவும். காட்டப்படும் புத்தகங்கள் மட்டுமே பட்டியலிடப்படும்.
zh_cn: 使用搜索字段或者标签浏览器来过滤展示的书籍。只使用展示的书籍创建目录。

source: To begin catalog generation, select the menu item :guilabel:`Convert books > Create a catalog of the books in your calibre library`. You may also add a :guilabel:`Create catalog` button to a toolbar in :guilabel:`Preferences > Interface > Toolbars & menus` for easier access to the Generate catalog dialog.
ar: لبدء إنشاء الفهرس، حدد عنصر القائمة :guilabel:`تحويل الكتب >إنشاء فهرس للكتب في مكتبة calibre الخاصة بك`. يمكنك أيضًا إضافة زر :guilabel:`إنشاء فهرس` إلى شريط الأدوات في :guilabel:`التفضيلات > الواجهة > أشرطة الأدوات والقوائم` لسهولة الوصول إلى مربع حوار إنشاء الفهرس.
gl: Para comezar a xeración do catálogo, seleccione o elemento de menú :guilabel:`Converter libros > Crear un catálogo dos libros da súa biblioteca de calibre`. Tamén pode engadir un botón :guilabel:`Crear catálogo` a unha barra de ferramentas en :guilabel:`Preferencias > Interface > Barras de ferramentas e menús` para acceder máis facilmente ao diálogo Xerar catálogo.
sv: För att påbörja kataloggenerering, välj menyalternativet :guilabel:`Konvertera böcker > Skapa en katalog över böckerna i ditt calibre-bibliotek`. Du kan också lägga till en :guilabel:`Skapa katalog`-knapp i verktygsfältet i :guilabel:`Inställningar > Gränssnitt > Verktygsfält & menyer` för att enklare nå dialogrutan för Skapa katalog.
ta: அட்டவணை தலைமுறையைத் தொடங்க, மெனு உருப்படியைத் தேர்ந்தெடுக்கவும்: கிலாபெல்: `புத்தகங்களை மாற்றவும்> உங்கள் காலிபர் நூலகத்தில் உள்ள புத்தகங்களின் பட்டியலை உருவாக்கவும்`. நீங்கள் ஒரு: கிலாபெல்: `ஒரு கருவிப்பட்டியில் பட்டியல்` பொத்தானை உருவாக்குங்கள்: கிலாபெல்: `விருப்பத்தேர்வுகள்> இடைமுகம்> கருவிப்பட்டிகள் மற்றும் மெனுக்கள்` உருவாக்கவும் பட்டியல் உரையாடலை எளிதாக அணுகலாம்.
zh_cn: 要开始生成目录，选择菜单项：guilabel：`转换书籍 > 在您的 calibre 书库中创建书籍目录`。 您还可以将 :guilabel:`创建目录` 按钮添加到 :guilabel:`首选项 > 界面 > 工具栏与菜单` 以便更轻松地访问 创建目录 对话框。

source: Catalog options
ar: خيارات الفهرس
gl: Opcións do catálogo
sv: Katalogalternativ
ta: அட்டவணை விருப்பங்கள்
zh_cn: 书目选项

source: In :guilabel:`Catalog options`, select **AZW3, EPUB or MOBI** as the Catalog format. In the :guilabel:`Catalog title` field, provide a name that will be used for the generated catalog. If a catalog of the same name and format already exists, it will be replaced with the newly-generated catalog.
ar: في :guilabel:`خيارات الفهرس`، حدد **AZW3، EPUB أو MOBI** كتنسيق للفهرس.في حقل :guilabel:`عنوان الفهرس`، قدم اسمًا سيتم استخدامه للفهرس الذي تم إنشاؤه.إذا كان فهرس بنفس الاسم والتنسيق موجودًا بالفعل، فسيتم استبداله بالفهرس الذي تم إنشاؤه حديثًا.
gl: En :guilabel:`Opcións do catálogo`, seleccione **AZW3, EPUB ou MOBI** como formato do catálogo. No campo :guilabel:`Título do catálogo`, proporcione un nome que se utilizará para o catálogo xerado. Se xa existe un catálogo co mesmo nome e formato, substituirase polo catálogo recentemente xerado.
ru: В :guilabel:`Опции каталога`, выберите **AZW3, EPUB или MOBI** в качестве формата Каталога. В поле :guilabel:`Catalog title` укажите имя, которое будет использоваться для сгенерированного каталога. Если каталог с таким же именем и форматом уже существует, он будет заменен вновь созданным каталогом.
sv: I :guilabel:`Katalogalternativ`, välj **AZW3, EPUB eller MOBI** som katalogformatet. I :guilabel:`Katalogtitel` fältet, ge ett namn för att användas för den skapade katalogen. Om en katalog med samma namn och format redan finns, kommer den att ersättas med den nyligen skapade katalogen.
ta: இல்: கிலாபெல்: `அட்டவணை விருப்பங்கள்`, ** AZW3, EPUB அல்லது MOBI ** ஐ பட்டியல் வடிவமாகத் தேர்ந்தெடுக்கவும். இல்: கிலாபெல்: `அட்டவணை தலைப்பு` புலம், உருவாக்கப்பட்ட பட்டியலுக்கு பயன்படுத்தப்படும் பெயரை வழங்கவும். அதே பெயர் மற்றும் வடிவமைப்பின் பட்டியல் ஏற்கனவே இருந்தால், அது புதிதாக உருவாக்கப்பட்ட பட்டியலுடன் மாற்றப்படும்.
zh_cn: 在操作界面“目录选项”中，选择**AZW3、EPUB或MOBI**作为目录格式。在“目录标题”字段中，提供将用于生成目录的名称。如果已经存在具有相同名称和格式的目录，则会将其替换为新生成的目录。

source: Catalog: send to device automatically option
ar: الفهرس: خيار الإرسال إلى الجهاز تلقائيًا
gl: Catálogo: opción de enviar ao dispositivo automaticamente
sv: Katalog: skicka till enhet automatiskt alternativ
ta: பட்டியல்: சாதனத்திற்கு தானாக விருப்பத்திற்கு அனுப்பவும்
zh_cn: 目录：自动发送到设备选项

source: Enabling :guilabel:`Send catalog to device automatically` will download the generated catalog to a connected device upon completion.
ar: سيؤدي تمكين :guilabel:`إرسال الفهرس إلى الجهاز تلقائيًا` إلى تنزيل الفهرس الذي تم إنشاؤه إلى جهاز متصل عند الانتهاء.
gl: Ao activar :guilabel:`Enviar catálogo ao dispositivo automaticamente` descargarase o catálogo xerado nun dispositivo conectado ao finalizar.
ru: Включение :guilabel:`Отправить каталог на устройство автоматически` будет загружать сгенерированный каталог на подключенное устройство по завершении.
sv: Aktivering :guilabel:`Överför katalog till enhet automatiskt` kommer att föra över den skapade katalogen till en ansluten enhet under slutförandet.
ta: செயல்படுத்துதல்: கிலாபெல்: `சாதனத்திற்கு பட்டியலை தானாக அனுப்பவும்` உருவாக்கிய பட்டியலை முடிந்ததும் இணைக்கப்பட்ட சாதனத்திற்கு பதிவிறக்கம் செய்யும்.
zh_cn: 启用选项`自动将目录发送到设备`将在完成后将生成的目录下载到已连接的设备。

source: Included sections
ar: الأقسام المتضمنة
gl: Seccións incluídas
ru: Включенные разделы
sv: Inkluderade avsnitt
ta: பிரிவுகள் சேர்க்கப்பட்டுள்ளன
zh_cn: 包含章节

source: Included sections in catalog
ar: الأقسام المتضمنة في الفهرس
gl: Seccións incluídas no catálogo
sv: Inkluderade avsnitt i katalogen
ta: பட்டியலில் பிரிவுகள் சேர்க்கப்பட்டுள்ளன
zh_cn: 目录中包含的章节

source: Sections enabled by a checkmark will be included in the generated catalog:
ar: سيتم تضمين الأقسام الممكّنة بعلامة اختيار في الفهرس الذي تم إنشاؤه:
gl: As seccións habilitadas mediante unha marca de verificación incluiranse no catálogo xerado:
ru: Разделы, включенные с помощью галочки, будут включены в сгенерированный каталог:
sv: Avsnitt aktiverade med en bock kommer att inkluderas i den skapade katalogen:
ta: செக்மார்க் இயக்கிய பிரிவுகள் உருவாக்கப்பட்ட பட்டியலில் சேர்க்கப்படும்:
zh_cn: 复选标记启用的部分将包括在生成的目录中：

source: :guilabel:`Authors` - all books, sorted by author, presented in a list format. Non-series books are listed before series books.
ar: :guilabel:`المؤلفون` - جميع الكتب، مرتبة حسب المؤلف، معروضة بتنسيق قائمة. تُدرج الكتب غير المتسلسلة قبل الكتب المتسلسلة.
gl: :guilabel:`Autores` - todos os libros, ordenados por autor, presentados nun formato de lista. Os libros que non son de serie aparecen antes que os de serie.
ru: :guilabel:`Authors` - все книги, отсортированные по автору, представлены в виде списка. Книги, не относящиеся к серии, перечислены перед книгами серии.
sv: :guilabel:`Författare` - alla böcker, sorterade efter författare, tillgängliga i ett listformat. Icke-serieböcker listas för serieböcker.
ta: : கிலாபெல்: `ஆசிரியர்கள்` - ஆசிரியரால் வரிசைப்படுத்தப்பட்ட அனைத்து புத்தகங்களும், பட்டியல் வடிவத்தில் வழங்கப்படுகின்றன. தொடர் அல்லாத புத்தகங்கள் தொடர் புத்தகங்களுக்கு முன் பட்டியலிடப்பட்டுள்ளன.
zh_cn: “作者” -按作者排序的所有书籍，以列表格式呈现。非系列书籍列在系列书籍之前。

source: :guilabel:`Titles` - all books, sorted by title, presented in a list format.
ar: :guilabel:`العناوين` - جميع الكتب، مرتبة حسب العنوان، معروضة بتنسيق قائمة.
gl: :guilabel:`Títulos` - todos os libros, ordenados por título, presentados nun formato de lista.
ru: :guilabel:`Titles` - все книги, отсортированные по названию, представлены в виде списка.
sv: :guilabel:`Titlar` - alla böcker, sorterade efter titel, tillgänglig i ett listformat.
ta: : கிலாபெல்: `தலைப்புகள்` - தலைப்பால் வரிசைப்படுத்தப்பட்ட அனைத்து புத்தகங்களும், பட்டியல் வடிவத்தில் வழங்கப்படுகின்றன.
zh_cn: “名称” - 所有图书按书名分类，以列表形式呈现。

source: :guilabel:`Series` - all books that are part of a series, sorted by series, presented in a list format.
ar: :guilabel:`السلاسل` - جميع الكتب التي هي جزء من سلسلة، مرتبة حسب السلسلة، معروضة بتنسيق قائمة.
gl: :guilabel:`Serie`: todos os libros que forman parte dunha serie, ordenados por series, presentados nun formato de lista.
ru: :guilabel:`Series` - все книги, входящие в серию, отсортированные по сериям, представлены в виде списка.
sv: :guilabel:`Serier` - alla böcker som är del av serien, sorterade efter serier, tillgängliga i ett listformat.
ta: : கிலாபெல்: `தொடர்` - தொடரின் ஒரு பகுதியாக இருக்கும் அனைத்து புத்தகங்களும், தொடர்களால் வரிசைப்படுத்தப்பட்டு, பட்டியல் வடிவத்தில் வழங்கப்படுகின்றன.
zh_cn: “系列” - 属于系列的所有图书，按系列排序，以列表形式呈现。

source: :guilabel:`Genres` - individual genres presented in a list, sorted by Author and Series.
ar: :guilabel:`الأنواع` - الأنواع الفردية المعروضة في قائمة، مرتبة حسب المؤلف والسلسلة.
gl: :guilabel:`Xéneros` - xéneros individuais presentados nunha lista, ordenados por Autor e Serie.
ru: :guilabel:`Genres`- отдельные жанры, представленные в списке, отсортированные по автору и серии.
sv: :guilabel:`Genrer` - individuella genrer, tillgängliga i en lista, sorterade efter författare och serie.
ta: : கிலாபெல்: `வகைகள்` - ஒரு பட்டியலில் வழங்கப்பட்ட தனிப்பட்ட வகைகள், ஆசிரியர் மற்றும் தொடர்களால் வரிசைப்படுத்தப்படுகின்றன.
zh_cn: “类型” - 各个图书的流派类型以列表的形式呈现，按作者和系列排序。

source: :guilabel:`Recently Added` - all books, sorted in reverse chronological order. List includes books added in the last 30 days, then a month-by-month listing of added books.
ar: :guilabel:`المضافة مؤخرًا` - جميع الكتب، مرتبة بترتيب زمني عكسي. تتضمن القائمة الكتب المضافة في آخر 30 يومًا، ثم قائمة شهرية بالكتب المضافة.
gl: :guilabel:`Engadido recentemente` - todos os libros, ordenados en orde cronolóxica inversa. A lista inclúe os libros engadidos nos últimos 30 días e, a continuación, unha lista de libros engadidos mes a mes.
ru: :guilabel:`Recently Added`- все книги, отсортированные в обратном хронологическом порядке. Список включает книги, добавленные за последние 30 дней, а затем ежемесячные списки добавленных книг.
sv: :guilabel:`Nyligen tillagda` - alla böcker, sorterade i omvänd kronologisk ordning. Listan innehåller böcker som har lagts till de senaste 30 dagarna, sedan en månad för månad lista över tillagda böcker.
ta: : கிலாபெல்: `சமீபத்தில் சேர்க்கப்பட்டது` - அனைத்து புத்தகங்களும், தலைகீழ் காலவரிசைப்படி வரிசைப்படுத்தப்படுகின்றன. பட்டியலில் கடந்த 30 நாட்களில் சேர்க்கப்பட்ட புத்தகங்கள், பின்னர் கூடுதல் புத்தகங்களின் மாதத்திற்கு ஒரு மாத பட்டியல் அடங்கும்.
zh_cn: “最近添加” - 所有书籍，按时间倒序排列。列表包括最近30天内添加的图书，然后按月列出添加的图书。

source: :guilabel:`Descriptions` - detailed description page for each book, including a cover thumbnail and comments. Sorted by author, with non-series books listed before series books.
ar: :guilabel:`الأوصاف` - صفحة وصف مفصلة لكل كتاب، بما في ذلك صورة مصغرة للغلاف وتعليقات. مرتبة حسب المؤلف، مع إدراج الكتب غير المتسلسلة قبل الكتب المتسلسلة.
gl: :guilabel:`Descricións` - páxina de descrición detallada de cada libro, incluíndo unha miniatura da portada e comentarios. Ordenado por autor, con libros que non son de serie listados antes dos libros de serie.
ru: :guilabel:`Descriptions`- подробная страница описания каждой книги, включая миниатюру обложки и комментарии. Сортировка по автору, с книгами, не относящимися к серии, перечисленными перед книгами серии.
sv: :guilabel:`Beskrivningar` - detaljerad beskrivningssida för varje bok, inkluderar omslagsminiatyrbild och kommentarer. Sorterade per författare, med icke-serieböcker listade före serieböcker.
ta: : கிலாபெல்: `விளக்கங்கள்` - ஒவ்வொரு புத்தகத்திற்கும் விரிவான விளக்கப் பக்கம், ஒரு கவர் சிறுபடம் மற்றும் கருத்துகள் உட்பட. தொடர் புத்தகங்களுக்கு முன் பட்டியலிடப்பட்ட தொடர் அல்லாத புத்தகங்களுடன் ஆசிரியரால் வரிசைப்படுத்தப்பட்டது.
zh_cn: “概述” - 每本书的详细描述页面，包括封面缩略图和评论。按作者排序，非系列书籍列在系列书籍之前。

source: Prefixes
ar: البادئات
gl: Prefixos
ru: Префиксы
sv: Prefix
ta: முன்னொட்டுகள்
zh_cn: 前缀

source: Prefix rules
ar: قواعد البادئات
gl: Regras do prefixo
sv: Prefixregler
ta: முன்னொட்டு விதிகள்
zh_cn: 前缀规则

source: Prefix rules allow you to add a prefix to book listings when certain criteria are met. For example, you might want to mark books you've read with a checkmark, or books on your wishlist with an X.
ar: تسمح لك قواعد البادئات بإضافة بادئة إلى قوائم الكتب عند استيفاء معايير معينة. على سبيل المثال، قد ترغب في تمييز الكتب التي قرأتها بعلامة صح، أو الكتب في قائمة أمنياتك بعلامة X.
gl: As regras de prefixo permítenche engadir un prefixo ás listas de libros cando se cumpren determinados criterios. Por exemplo, é posible que queiras marcar cunha marca de verificación os libros que liches ou os libros da túa lista de desexos cunha X.
ru: Префиксные правила позволяют добавлять префикс в списки книг, при выполнении определенных критериев. Например, вы можете пометить книги, которые вы прочитали, с помощью галочки или книги в своем списке желаний с помощью X.
sv: Med prefixregler kan du lägga till ett prefix i bokförteckningar när vissa kriterier är uppfyllda. Du kanske till exempel vill markera böcker du har läst med en bock eller böcker på din önskelista med ett X.
ta: சில அளவுகோல்கள் பூர்த்தி செய்யப்படும்போது புத்தக பட்டியல்களுக்கு முன்னொட்டைச் சேர்க்க முன்னொட்டு விதிகள் உங்களை அனுமதிக்கின்றன. எடுத்துக்காட்டாக, நீங்கள் ஒரு செக்மார்க் மூலம் நீங்கள் படித்த புத்தகங்களை அல்லது உங்கள் விருப்பப்பட்டியலில் புத்தகங்களை எக்ஸ் உடன் குறிக்க விரும்பலாம்.
zh_cn: 前缀规则允许您在满足特定条件时向预订列表添加前缀。例如，你可能想要用复选标记标记你读过的书，或者用X标记你愿望清单上的书。

source: The checkbox in the first column enables the rule. :guilabel:`Name` is a rule name that you provide. :guilabel:`Field` is either :guilabel:`Tags` or a custom column from your library. :guilabel:`Value` is the content of :guilabel:`Field` to match. When a prefix rule is satisfied, the book will be marked with the selected :guilabel:`Prefix`.
ar: مربع الاختيار في العمود الأول يمكّن القاعدة. :guilabel:`الاسم` هو اسم قاعدة تقوم بتوفيره. :guilabel:`الحقل` هو إما :guilabel:`الوسوم` أو عمود مخصص من مكتبتك. :guilabel:`القيمة` هي محتوى :guilabel:`الحقل` للمطابقة. عندما يتم استيفاء قاعدة بادئة، سيتم تمييز الكتاب بـ :guilabel:`البادئة` المحددة.
gl: A caixa de verificación da primeira columna activa a regra. :guilabel:`Nome` é un nome de regra que proporcionas. :guilabel:`Field` é :guilabel:`Etiquetas` ou unha columna personalizada da túa biblioteca. :guilabel:`Valor` é o contido de :guilabel:`Field` para coincidir. Cando se cumpre unha regra de prefixo, o libro marcarase co :guilabel:`Prefixo` seleccionado.
ru: Флажок в первом столбце разрешает это правило. :guilabel:`Name` - это имя правила, которое вы предоставляете. :guilabel:`Field` или :guilabel:`Tags`, или пользовательский столбец из вашей библиотеки. :guilabel:`Value`- содержимое :guilabel:`Field` для совпадения. При выполнении префиксного правила, книга помечается выбранным :guilabel:`Prefix`.
sv: Kryssrutan i den första kolumnen aktiverar regeln. :guilabel:`Name` är ett regelnamn som du anger. :guilabel:`Field` är antingen :guilabel:`Tags` eller en egen kolumn från ditt bibliotek. :guilabel:`Value` är innehållet i :guilabel:`Field` för att matcha. När en prefixregel är uppfylld, kommer boken vara markerad med vald :guilabel:`Prefix`.
ta: முதல் நெடுவரிசையில் உள்ள தேர்வுப்பெட்டி விதியை செயல்படுத்துகிறது. : கிலாபெல்: `பெயர்` என்பது நீங்கள் வழங்கும் விதி பெயர். : கிலாபெல்: `புலம்` ஒன்று: கிலாபெல்:` குறிச்சொற்கள்` அல்லது உங்கள் நூலகத்திலிருந்து தனிப்பயன் நெடுவரிசை. : கிலாபெல்: `மதிப்பு` என்பது உள்ளடக்கம்: கிலாபெல்:` புலம்` பொருந்த வேண்டும். ஒரு முன்னொட்டு விதி திருப்தி அடையும்போது, புத்தகம் தேர்ந்தெடுக்கப்பட்டவருடன் குறிக்கப்படும்: கிலாபெல்: `முன்னொட்டு`.
zh_cn: 第一列中的复选框将启用该规则。`名称`是您提供的规则名称。“字段”是“标记”或书库中的自定义列。“值”是要匹配的“字段”的内容。当满足前缀规则时，书籍将被标记为选定的“前缀”。

source: Three prefix rules have been specified in the example above:
ar: تم تحديد ثلاث قواعد بادئة في المثال أعلاه:
gl: No exemplo anterior especificáronse tres regras de prefixo:
ru: В приведенном выше примере указаны три правила префикса:
sv: Tre prefixregler har angivits i exemplet ovan:
ta: மேலே உள்ள எடுத்துக்காட்டில் மூன்று முன்னொட்டு விதிகள் குறிப்பிடப்பட்டுள்ளன:
zh_cn: 上面的示例中指定了三个前缀规则：

source: :guilabel:`Read book` specifies that a book with any date in a custom column named :guilabel:`Last read` will be prefixed with a checkmark symbol.
ar: :guilabel:`كتاب مقروء` يحدد أن الكتاب الذي يحتوي على أي تاريخ في عمود مخصص باسم :guilabel:`آخر قراءة` سيتم إلحاق رمز علامة صح به.
gl: :guilabel:`Ler libro` especifica que un libro con calquera data nunha columna personalizada chamada :guilabel:`Última lectura` terá como prefixo un símbolo de marca de verificación.
ru: :guilabel:`Read book` указывает, что книга с любой датой в специальном столбце с именем :guilabel:`Last read` будет иметь префикс с символом галочки.
sv: :guilabel:`Läs bok` anger att en bok med godtyckligt datum i en anpassad kolumn namngiven :guilabel:`Senast läst` kommer att prefixas med en bocksymbol.
zh_cn: “阅读图书”指定在名称为“上次阅读”的自定义列中包含任何日期的书籍将带有复选标记符号作为前缀。

source: :guilabel:`Wishlist` item specifies that any book with a :guilabel:`Wishlist` tag will be prefixed with an X symbol.
ar: :guilabel:`عنصر قائمة الرغبات` يحدد أن أي كتاب يحمل وسم :guilabel:`قائمة الرغبات` سيتم إلحاق رمز X به.
gl: O elemento :guilabel:`Wishlist` especifica que calquera libro cunha etiqueta :guilabel:`Wishlist` terá como prefixo un símbolo X.
ru: :guilabel:`Wishlist`элемент указывает, что любая книга с тегом guilabel:`Wishlist` будет иметь префикс с символом X.
sv: Posten :guilabel:`Önskelistprodukt` anger att alla böcker med en :guilabel:`Önskelistprodukt`-tagg kommer att prefixas men en X-symbol.
zh_cn: “Wishlist”项指定任何带有“Wishllist”标记的书籍都将以X符号为前缀。
