Repository: debian-calibre/calibre
Catalog: translations/manual/*/customize.po
Languages: ms, pt

source: Customizing calibre
ms: Penyesuaian calibre.
pt: Personalizar Calibre

source: calibre has a highly modular design. Various parts of it can be customized. You can learn how to create *recipes* to add new sources of online content to calibre in the Section :ref:`news`. Here, you will learn, first, how to use environment variables and *tweaks* to customize calibre's behavior, and then how to specify your own static resources like icons and templates to override the defaults and finally how to use *plugins* to add functionality to calibre.
ms: calibre mempunyai reka bentuk yang sangat bermodular. Pelbagai bahagiannya boleh disuaikan. Anda boleh ketahui lebih lanjut bagaimana hendak mencipta *resepi* untuk tambah sumber baharu kandungan atas-talian ke dalam calibre dalam Seksyen :ref:`news`. Di sini, anda akan ketahui, bagaimana hendak guna pembolehubah persekitaran dan *tweak* untuk suaikan kelakuan calibre's, kemudian bagaimana hendak nyatakan sumber statik anda sendiri seperti ikon dan templat untuk membatalkan lalai dan akhir sekali bagaimana hendak guna *pemalam* untuk tambah lagi kefungsian calibre.
pt: O calibre tem um design altamente modular. Vários dos seus componentes podem ser personalizados. Pode aprender como criar *receitas* para adicionar novas fontes de conteúdo online ao calibre na Seção :ref:`news`. Aqui, aprenderá, primeiro, como usar variáveis de ambiente e *tweaks* para personalizar o comportamento do calibre, e depois como especificar os seus próprios recursos estáticos tais como ícones e modelos para substituir as escolhas por omissão e, finalmente, como usar *plugins* para adicionar funcionalidade ao calibre.

source: Environment variables
ms: Pembolehubah persekitaran
pt: Variáveis de ambiente

source: ``CALIBRE_CONFIG_DIRECTORY`` - sets the directory where configuration files are stored/read.
ms: ``CALIBRE_CONFIG_DIRECTORY`` - tetapkan direktori yang mana fail konfiguration disimpan/dibaca.
pt: ``CALIBRE_CONFIG_DIRECTORY`` - define o diretório onde os ficheiros de configuração são guardados/lidos.

source: ``CALIBRE_TEMP_DIR`` - sets the temporary directory used by calibre
ms: ``CALIBRE_TEMP_DIR`` - tetapkan direktori sementara yang digunakan oleh calibre
pt: ``CALIBRE_TEMP_DIR`` - define o diretório temporário usado pelo calibre

source: ``CALIBRE_CACHE_DIRECTORY`` - sets the directory calibre uses to cache persistent data between sessions
ms: ``CALIBRE_CACHE_DIRECTORY`` - tetapkan direktori yang mana calibre gunakan untuk cache data tekal diantara sesi
pt: ``CALIBRE_CACHE_DIRECTORY`` - define o diretório que o calibre use para armazenar dados que persistem entre sessões

source: ``CALIBRE_OVERRIDE_DATABASE_PATH`` - allows you to specify the full path to metadata.db. Using this variable you can have metadata.db be in a location other than the library folder. Useful if your library folder is on a networked drive that does not support file locking.
ms: ``CALIBRE_OVERRIDE_DATABASE_PATH`` - membolehkan anda nyatakan laluan penuh ke metadata.db. Dengan menggunakan pembolehubah ini anda boleh pastikan metadata.db berada di lokasi lain selain dari folder pustaka. Berguna jika folder pustaka anda berada pada pemacu rangkaian yang tidak menyokong penguncian fail.
pt: ``CALIBRE_OVERRIDE_DATABASE_PATH`` - permite-lhe especificar o caminho completo para o ficheiro metadata.db. Usar esta variável permite-lhe ter o ficheiro metadata.db numa localização diversa da pasta onde se encontra a biblioteca. Útil se a sua pasta da biblioteca se encontra numa partilha de rede que não tem suporte para acesso exclusivo a ficheiros.

source: ``CALIBRE_DEVELOP_FROM`` - Used to run from a calibre development environment. See :ref:`develop`.
ms: ``CALIBRE_DEVELOP_FROM`` - Digunakan untuk jalankan persekitaran pembangunan calibre. Rujuk :ref:`develop`.
pt: ``CALIBRE_DEVELOP_FROM`` - Usado para executar o calibre a partir de um ambiente de desenvolvimento. Veja :ref:`develop`.

source: ``CALIBRE_OVERRIDE_LANG`` - Used to force the language used by the interface (ISO 639 language code)
ms: ``CALIBRE_OVERRIDE_LANG`` - Digunakan untuk paksa bahasa yang digunakan oleh antaramuka (kod bahasa ISO 639)
pt: ``CALIBRE_OVERRIDE_LANG`` - Utilizado para forçar o idioma em uso pela interface (Código de idioma da norma ISO 639)

source: ``CALIBRE_TEST_TRANSLATION`` - Used to test a translation .po file (should be the path to the .po file)
ms: ``CALIBRE_TEST_TRANSLATION`` - Digunakan untuk menguji fail terjemahan .po (laluan ke fail .po)
pt: ``CALIBRE_TEST_TRANSLATION`` - Usado para testar um ficheiro de tradução .po (deve ser o caminho para o ficheiro .po)

source: ``CALIBRE_NO_NATIVE_FILEDIALOGS`` - Causes calibre to not use native file dialogs for selecting files/directories.
ms: ``CALIBRE_NO_NATIVE_FILEDIALOGS`` - Menyebabkan calibre tidak gunakan dialog fail tabii ketika memilih fail/direktori.
pt: ``CALIBRE_NO_NATIVE_FILEDIALOGS`` - Faz com que o calibre não use os diálogos de ficheiros nativos para selecionar ficheiros/diretórios.

source: ``CALIBRE_NO_NATIVE_MENUBAR`` - Causes calibre to not create a native (global) menu on Ubuntu Unity and similar linux desktop environments. The menu is instead placed inside the window, as is traditional.
ms: ``CALIBRE_NO_NATIVE_MENUBAR`` - Menyebabkan calibre tidak mencipta menu tabii (sejagat) pada Ubuntu Unity dan persekitaran desktop linux yang serupa. Menu akan diletak dalam tetingkap, seperti biasa.
pt: ``CALIBRE_NO_NATIVE_MENUBAR`` - Faz com que o calibre não um menu nativo (global) no Ubuntu Unity ou ambientes de trabalho similares em Linux. O menu é, em vez disso, posicionado dentro da janela, como é habitual.

source: ``CALIBRE_USE_SYSTEM_THEME`` - By default, on Linux, calibre uses its own builtin Qt style. This is to avoid crashes and hangs caused by incompatibilities between the version of Qt calibre is built against and the system Qt. The downside is that calibre may not follow the system look and feel. If you set this environment variable on Linux, it will cause calibre to use the system theme -- beware of crashes and hangs.
ms: ``CALIBRE_USE_SYSTEM_THEME`` - Secara lalai, pada Linux, calibre menggunakan gaya Qt terbina-dalamnya sendiri. Ia bertujuan untuk menghindari kerosakan dan menjadi kaku yang disebabkan oleh ketidakserasian diantara versi Qt calibre dengan versi Qt sistem. Kelemahanya pula, calibre tidak mengikuti penampilan sistem. Jika anda tetapkan pembolehubah persekitaran ini pada Linux, ia akan menyebabkan calibre menggunakan tema sistem - tetapi hati-hati jika berlakunya kerosakan dan menjadi kaku.
pt: ``CALIBRE_USE_SYSTEM_THEME`` - Por omissão, no Linux, o calibre o seu próprio estilo Qt definido internamente. Tal destina-se a evitar que o calibre crashe ou pendure devido a incompatibilidades entre a versão do Qt em que o calibre foi compilado e a versão do Qt existente no sistema onde irá correr. Uma desvantagem é que o calibre pode não seguir o aspeto visual normal do sistema. Se definir esta variável de ambiente no Linux, obrigará o calibre a usar o tema do sistema -- tenha cuidado com a possibilidade de o calibre crashar ou pendurar.

source: ``CALIBRE_SHOW_DEPRECATION_WARNINGS`` - Causes calibre to print deprecation warnings to stdout. Useful for calibre developers.
ms: ``CALIBRE_SHOW_DEPRECATION_WARNINGS`` - Menyebabkan calibre cetak amaran lapuk ke stdout. Berguna untuk pembangun calibre.
pt: ``CALIBRE_SHOW_DEPRECATION_WARNINGS`` - Faz com que o calibre escreva avisos de funcionalidades obsoletas no stdout. Útil para os programadores do calibre.

source: ``CALIBRE_NO_DEFAULT_PROGRAMS`` - Prevent calibre from automatically registering the filetypes it is capable of handling with Windows.
ms: ``CALIBRE_NO_DEFAULT_PROGRAMS`` - Halang calibre daripada mendaftar jenis fail yang boleh dikendali dengan Windows.
pt: ``CALIBRE_NO_DEFAULT_PROGRAMS`` - Evita que o calibre registe automaticamente os tipos de ficheiro que é capaz de manipular quando usado no Windows.

source: ``CALIBRE_USE_DARK_PALETTE`` - Set it to ``1`` to have calibre use dark colors and ``0`` for normal colors (ignored on macOS). On Windows 10 in the absence of this variable, the Windows system preference for dark colors is used.
pt: ``CALIBRE_USE_DARK_PALETTE`` - Defina-o como ``1`` para que o calibre use cores escuras e ``0`` para cores normais (ignorado no macOS). No Windows 10, na ausência desta variável, é usada a preferência de sistema do Windows para cores escuras.

source: ``SYSFS_PATH`` - Use if sysfs is mounted somewhere other than /sys
ms: ``SYSFS_PATH`` - Guna jika sysfs dilekap selain dari /sys
pt: ``SYSFS_PATH`` - A usar se o sysfs está montado noutro local da árvore de ficheiros que não em /sys

source: ``http_proxy``, ``https_proxy`` - Used on Linux to specify an HTTP(S) proxy
pt: ``http_proxy``, ``https_proxy`` - Utilizado em Linux para especificar um proxy HTTP(S)

source: See `How to set environment variables in Windows <https://www.computerhope.com/issues/ch000549.htm>`_. If you are on macOS you can set environment variables by creating the :file:`~/Library/Preferences/calibre/macos-env.txt` and putting the environment variables one per line in it, for example::
pt: Veja `Como definir variáveis de ambiente em Windows <https://www.computerhope.com/issues/ch000549.htm>`_. Se usa macOS pode definir variáveis de ambiente criando o :file:`~/Library/Preferences/calibre/macos-env.txt` e inserindo uma variável de ambiente em cada linha, por exemplo::

source: Tweaks
ms: Pulas
pt: Ajustes

source: Tweaks are small changes that you can specify to control various aspects of calibre's behavior. You can change them by going to Preferences->Advanced->Tweaks. The default values for the tweaks are reproduced below
ms: Tweak adalah perubahan kecil yang mana anda boleh tentukan untuk mengawal pelbagai aspek kelakuan calibre. Pergi ke Keutamaan->Lanjutan->Tweak. Nilai lalai untuk tweaks seperti berikut
pt: Ajustes são pequenas alterações que pode especificar para controlar aspetos vários do comportamento do calibre. Pode mudá-las indo a Preferências->Avançado->Ajustes. Os valores por omissão para os ajustes são reproduzidos abaixo

source: Overriding icons, templates, et cetera
ms: Membatalkan ikon, templat, dan lain-lain
pt: Sobreposição a ícones, temas, etc.

source: calibre has direct support for icon themes, there are several icon themes available for calibre, that you can use by going to :guilabel:`Preferences->Interface->Look & Feel->Change Icon theme`. The icon themes use the same mechanism as described below for overriding static resources.
ms: calibre mempunyai sokongan langsung untuk tema ikon, terdapat beberapa tema ikon tersedia untuk calibre, yang anda boleh guna dengan pergi ke :guilabel:`Keutamaan->Antaramuka->Penampilan->Ubah tema Ikon`. Tema ikon menggunakan mekanisma yang serupa sepertimana yang telah dijelaskan di bawah untuk membatalkan sumber statik.
pt: O calibre tem suporte direto para temas de ícones, havendo vários disponíveis para o calibre, que poderá usar indo a :guilabel:`Preferências->Interface->Look & Feel->Mudar Tema de Ícones`. Os temas de ícones usam o mesmo mecanismo descrito abaixo para efetuar a sobreposição de recursos estáticos.

source: calibre allows you to override the static resources, like icons, JavaScript and templates for the metadata jacket, catalogs, etc. with customized versions that you like. All static resources are stored in the resources sub-folder of the calibre install location. On Windows, this is usually :file:`C:\\Program Files\\Calibre2\\app\\resources`. On macOS, :file:`/Applications/calibre.app/Contents/Resources/resources/`. On Linux, if you are using the binary installer from the calibre website it will be :file:`/opt/calibre/resources`. These paths can change depending on where you choose to install calibre.
pt: O calibre permite-lhe alterar os recursos estáticos, tais como ícones, JavaScript, e modelos para os metadados da sobrecapa, catálogos, etc. com versões personalizadas de que goste. Todos os recursos estáticos estão armazenados na sub-pasta de recursos do diretório de instalação do calibre. No Windows, esta situa-se habitualmente em :file:`C:\\Program Files\\Calibre2\\app\\resources`. No macOS, :file:`/Applications/calibre.app/Contents/Resources/resources/`. No Linux, se usou o binário de instalação retirado do website do calibre, será :file:`/opt/calibre/resources`. Estes caminhos podem mudar dependendo do modo como decide instalar o calibre.

source: You should not change the files in this resources folder, as your changes will get overwritten the next time you update calibre. Instead, go to :guilabel:`Preferences->Advanced->Miscellaneous` and click :guilabel:`Open calibre configuration directory`. In this configuration directory, create a sub-folder called resources and place the files you want to override in it. Place the files in the appropriate sub folders, for example place images in :file:`resources/images`, etc. calibre will automatically use your custom file in preference to the built-in one the next time it is started.
ms: Anda sepatutnya tidak mengubah fail di daklam folder sumber, kerana perubahan yang anda buat akan ditulis-ganti pada kemaskini calibre yang berikutnya. Oleh itu, pergi ke :guilabel:`Keutamaan->Lanjutan->Pelbagai` kemudian klik :guilabel:`Buka direktori konfigurasi calibre`. Di dalam direktori konfigurasi ini, cipta satu sub-folder yang dikenali sebagai resources dan masukkan fail yang anda mahu gantikan di dalamnya. Letak fail di dala folder yang berkenaan, sebagai contoh letak imej di dalam :file:`resources/images`, dan lain-lain dokumen. calibre akan guna secara automatik fail suai anda dalam keutamaan membatalkan fail terbina-dalam pada pembukaan berikunya.
pt: Não deve mudar os ficheiros nesta pasta de recursos, dados que as suas alterações podem ser desfeitas na próxima vez que atualizar o calibre. Em vez disso, vá a :guilabel:`Preferências->Avançadas->Miscelânea` e clique :guilabel:`Abrir diretório de configuração do calibre`. Neste diretório de configuração, crie uma sub-pasta chamada recursos resources e coloque aí os ficheiros que pretende sobrepor. Coloque os ficheiros nas sub-pastas apropriadas, por exemplo coloque as imagens na em :file:`resources/images`, etc. O calibre, na próxima vez que for iniciado, usará automaticamente o seu ficheiro personalizado, preferindo-o ao definido internamente .

source: For example, if you wanted to change the icon for the :guilabel:`Remove books` action, you would first look in the built-in resources folder and see that the relevant file is :file:`resources/images/remove_books.png`. Assuming you have an alternate icon in PNG format called :file:`my_remove_books.png` you would save it in the configuration directory as :file:`resources/images/remove_books.png`. All the icons used by the calibre user interface are in :file:`resources/images` and its sub-folders.
ms: Sebagai contoh, jika anda mahu mengubah ikon untuk tindakan :guilabel:`Buang buku`, anda perlu lihat dahulu folder sumber terbina-dalam dan lihat fail yang berkaitan ialah :file:`resources/images/remove_books.png`. Anggap anda sudah memiliki ikon pengganti dalam format PNG iaitu :file:`my_remove_books.png` yang mana anda mesti menyimpannya dalam direktori konfigurasi sebagai :file:`resources/images/remove_books.png`. Semua ikon yang digunakan oleh antaramuka pengguna calibre berada di dalam :file:`resources/images` dan juga sub-foldernya.
pt: Por exemplo, se pretende mudar o ícone para a opção :guilabel:`Remover livros`, deve primeiro a existência na pasta de recursos pré-definidos do ficheiro relevante, que é o :file:`resources/images/remove_books.png`. Assumindo que tenha um ícone alternativo no formato PNG chamado :file:`my_remove_books.png` deve salvá-lo no diretório de configuração como :file:`resources/images/remove_books.png`. Todos os ícones usados pela interface de utilizador encontram-se em :file:`resources/images` e suas sub-pastas.

source: Creating your own icon theme for calibre
ms: Mencipta tema ikon anda sendiri untuk calibre
pt: Criar o seu próprio tema de ícones para o Calibre

source: If you have created a beautiful set of icons and wish to share them with other calibre users via calibre's builtin icon theme support, you can easily package up your icons into a theme. To do so, go to :guilabel:`Preferences->Miscellaneous->Create icon theme`, select the folder where you have put your icons (usually the :file:`resources/images` folder in the calibre config directory, as described above). Then fill up the theme metadata and click OK. This will result in a ZIP file containing the theme icons. You can upload that to the calibre forum at `Mobileread <https://www.mobileread.com/forums/forumdisplay.php?f=166>`_ and then I will make your theme available via calibre's builtin icon theme system.
ms: JIka anda sudah menghasilkan satu set ikon yang cantik dan mahu kongsikanya dengan lain-lain pengguna calibre melalui sokongan tema ikon terbina-dalam calibre, anda boleh pakejkan ikon anda menjadi sebuah tema. Untuk membuatnya, pergi ke :guilabel:`Keutamaan->Pelbagai->Cipta tema ikon`, kemudian pilih folder yang mengandungi ikon tersebut (biasanya folder :file:`resources/images` di dalam direktori konfig calibre, seperti yang telah djelaskan di atas). Seterusnya isikan maklumat data meta tema dan akhir sekali klik OK. Satu fail zip yang mengandungi ikon tema terhasil. Anda boleh muat naik tema ikon ini ke forum calibre di `Mobileread <https://www.mobileread.com/forums/forumdisplay.php?f=166>`_ dan saya akan jadikan tema anda tersedia melalui sistem tema ikon terbina-dalam calibre.
pt: Se criou um conjunto deslumbrante de ícones e pretende partilhá-lo com outros utilizadores do calibre através do sistema de temas de ícones implementado internamente no calibre, pode facilmente criar um pacote contendo o seu tema de ícones. Para tal, vá a :guilabel:`Preferências->Miscelânea->Criar tema de ícones`, selecione a pasta onde colocou os seus ícones (normalmente na pasta :file:`resources/images` do diretório de configuração do calibre, como acima descrito). Então, preencha os metadados do tema e clique OK. Tal resulta na criação de um ficheiro ZIP que contém o tema de ícones. Pode fazer o upload deste para o forum do calibre no `Mobileread <https://www.mobileread.com/forums/forumdisplay.php?f=166>`_ onde eu disponibilizarei o seu tema através do sistema de temas de ícones implementado internamente no calibre.

source: Customizing calibre with plugins
ms: Menyuaikan calibre dengan pemalam
pt: Personalizar Calibre com plugins

source: calibre has a very modular design. Almost all functionality in calibre comes in the form of plugins. Plugins are used for conversion, for downloading news (though these are called recipes), for various components of the user interface, to connect to different devices, to process files when adding them to calibre and so on. You can get a complete list of all the built-in plugins in calibre by going to :guilabel:`Preferences->Advanced->Plugins`.
ms: calibre mempunyai reka bentuk yang sangat modular. Hampir semua kefungsian dalam calibre berasal dalam bentuk pemalam. Pemalam digunakan untuk pertukaran format, untuk memuat turun berita (dikenali sebagai resepi), untuk pelbagai komponen antaramuka pengguna, untuk sambung ke peranti yang berbeza, untuk proses fail bila menambahnya ke calibre dan seterusnya. Anda boleh dapatkan senarai semua pemalam terbina-dalam di dalam calibre dengan pergi ke :guilabel:`Keutamaan->Lanjutan->Pemalam`.
pt: O Calibre possui um design muito modular. Quase todas as funcionalidades do Calibre existem na forma de plugins. Os plugins são usados para conversão, para descarregar notícias (embora sejam chamadas de receitas), para vários componentes da interface de utilizador, para se ligar a dispositivos diferentes, para processar ficheiros ao adicioná-los ao Calibre e assim por diante. Pode obter uma lista completa de todos os plugins embutidos no Calibre, aceda a :guilabel:`Preferências-> Avançado-> Plugins`.

source: You can write your own plugins to customize and extend the behavior of calibre. The plugin architecture in calibre is very simple, see the tutorial :ref:`pluginstutorial`.
ms: Anda boleh menulis pemalam anda sendiri untuk suaikan dan tambah baik kelakuan calibre. Seni bina pemalam di dalam calibre adalah sangat mudah, sila rujuk tutorial
pt: Pode escrever os seus próprios plugins para personalizar e expandir o comportamento do calibre. A arquitetura de plugins do calibre é muito simples, como pode verificar no tutorial :ref:`pluginstutorial`.

source: ``http_proxy``, ``https_proxy`` - Used on linux to specify an HTTP(S) proxy
ms: ``http_proxy``, ``https_proxy`` - Digunakan pada linux untuk menyatakan proksi HTTP(S)

source: See `How to set environment variables in Windows <https://www.computerhope.com/issues/ch000549.htm>`_ or `How to set environment variables in macOS <http://www.dowdandassociates.com/blog/content/howto-set-an-environment-variable-in-mac-os-x-launchd-plist/>`_.
ms: Sila rujuk `How to set environment variables in Windows <https://www.computerhope.com/issues/ch000549.htm>`_ atau `How to set environment variables in macOS <http://www.dowdandassociates.com/blog/content/howto-set-an-environment-variable-in-mac-os-x-launchd-plist/>`_.

source: calibre allows you to override the static resources, like icons, javascript and templates for the metadata jacket, catalogs, etc. with customized versions that you like. All static resources are stored in the resources sub-folder of the calibre install location. On Windows, this is usually :file:`C:\\Program Files\\Calibre2\\resources`. On macOS, :file:`/Applications/calibre.app/Contents/Resources/resources/`. On linux, if you are using the binary installer from the calibre website it will be :file:`/opt/calibre/resources`. These paths can change depending on where you choose to install calibre.
ms: calibre membolehkan anda batalkan sumber statik, seperti ikon, skrip Java dan templat untuk jaket data meta, katalog, dan lain-lain. dengan versi tersuai yang anda suka. Semua sumber statik disimpan dalam sub-folder lokasi pemasangan calibre. Pada Window, terletak di :file:`C:\\Program Files\\Calibre2\\resources`. Manakala, pada OS X, :file:`/Applications/calibre.app/Contents/Resources/resources/`. Pada linux, jika anda menggunakan pemasang binari melalui laman sesawang calibre ia akan diletakkan dalam :file:`/opt/calibre/resources`. Laluan-laluan ini boleh diubah mengikut lokasi pemasangan calibre anda.
