Repository: debian-calibre/calibre
Catalog: translations/manual/*/db_api.po
Languages: nl

source: API documentation for the database interface
nl: API documentatie voor de gegevensbank interface

source: This API is thread safe (it uses a multiple reader, single writer locking scheme). You can access this API like this::
nl: Deze API is thread safe (meervoudige reader, single writer vergrendelingsschema). U kunt een API intreden door ::

source: If you are in a calibre plugin that is part of the main calibre GUI, you get access to it like this instead::
nl: Als u zich in een Calibre-plug-in bevindt die deel uitmaakt van de hoofd-GUI van Calibre, krijgt u er als volgt toegang toe:

source: An in-memory cache of the metadata.db file from a calibre library. This class also serves as a threadsafe API for accessing the database. The in-memory cache is maintained in normal form for maximum performance.
nl: Een geheugencache van het bestand metadata .db van een calibre bibliotheek. Deze class dient ook als een thread-safe API om toegang te krijgen tot de database. Het geheugencache wordt onderhouden in normale vorm voor maximale prestatie.

source: SQLITE is simply used as a way to read and write from metadata.db robustly. All table reading/sorting/searching/caching logic is re-implemented. This was necessary for maximum performance and flexibility.
nl: SQLITE wordt gebruikt om te lezen en schrijven van metadata .db op een robuuste manier. De logica van alle tabellen lezen/sorteren/zoeken/cachen wordt herimplementeerd. Dit was noodzakelijk voor maximale prestatie en flexibiliteit.

source: When a new book record is created in the database, with the book id as the only argument
nl: Wanneer een nieuw boekrecord wordt aangemaakt in de database, met het boek-id als enige argument

source: When a book format is edited, with arguments: (book_id, fmt)
nl: Wanneer een boekformaat wordt bewerkt, met argumenten: (boek_id, fmt)

source: When books are removed from the database with the list of book ids as the only argument
nl: Wanneer boeken uit de database worden verwijderd met de lijst met boek-id's als enige argument

source: When a format is added to a book, with arguments: (book_id, format)
nl: Wanneer een formaat aan een boek wordt toegevoegd, met argumenten: (boek_id, formaat)

source: When formats are removed from a book, with arguments: (mapping of book id to set of formats removed from the book)
nl: Wanneer formaten uit een boek worden verwijderd, met argumenten: (toewijzing van boek-id aan set formaten die uit het boek zijn verwijderd)

source: When the indexing progress changes
nl: Wanneer de indexeringsvoortgang verandert

source: When items such as tags or authors are removed from some books. Arguments: (field_name, affected book ids, ids of removed items)
nl: Wanneer items zoals tags of auteurs uit sommige boeken worden verwijderd. Argumenten: (veldnaam, betreffende boek-id's, id's van verwijderde items)

source: When items such as tags or authors are renamed in some or all books. Arguments: (field_name, affected book ids, map of old item id to new item id)
nl: Wanneer items zoals tags of auteurs in sommige of alle boeken worden hernoemd. Argumenten: (veldnaam, betreffende boek-id's, kaart van oude item-id naar nieuwe item-id)

source: When the links associated with items(s) are changed, with arguments: (field_name, item_ids)
nl: Wanneer de links die aan items zijn gekoppeld worden gewijzigd, met argumenten: (veldnaam, item-id's)

source: When some metadata is changed for some books, with arguments: (name of changed field, set of affected book ids)
nl: Wanneer bepaalde metadata voor bepaalde boeken wordt gewijzigd, met argumenten: (naam van het gewijzigde veld, reeks betreffende boek-id's)

source: When the notes associated with item(s) are changed, with arguments: (field_name, item_ids)
nl: Wanneer de notities die aan het/de item(s) zijn gekoppeld, worden gewijzigd, met argumenten: (veldnaam, item-id's)

source: Add the specified books to the library. Books should be an iterable of 2-tuples, each 2-tuple of the form :code:`(mi, format_map)` where mi is a Metadata object and format_map is a dictionary of the form :code:`{fmt: path_or_stream}`, for example: :code:`{'EPUB': '/path/to/file.epub'}`.
nl: Voeg de gespecificeerde boeken toe aan de bibliotheek. Boeken moeten een iterabel zijn van 2-tupels, elk 2-tupel van de vorm: code: `(mi, format_map)` waarbij mi een Metadata -object is en format_map een woordenboek is van de vorm: code: `{fmt: path_or_stream} `, bijvoorbeeld: :code:` {'EPUB': '/pad/naar/bestand.epub'} `.

source: Returns a pair of lists: :code:`ids, duplicates`. ``ids`` contains the book ids for all newly created books in the database. ``duplicates`` contains the :code:`(mi, format_map)` for all books that already exist in the database as per the simple duplicate detection heuristic used by :meth:`has_book`.
nl: Retourneert een paar lijsten: :code:`id's, duplicaten`. ``ids`` bevat de boek-id's voor alle nieuw gemaakte boeken in de gegevensbank. ``duplicaten`` bevat de: code: `(mi, format_map)` voor alle boeken die al bestaan in de gegevensbank volgens de eenvoudige duplicaat detectie heuristiek gebruikt door :meth:`has_book`.

source: Add data for name where val_map is a map of book_ids to values. If delete_first is True, all previously stored data for name will be removed.
nl: Toevoegen van gegevens voor naam waar val_map is een map van book-ids naar waardes. Indien delete_first is True of WAAR, dan wordt alle eerder opgeslagen gegevens voor naam verwijderd.

source: Add extra data files
nl: Extra gegevensbestanden toevoegen

source: Add a format to the specified book. Return True if the format was added successfully.
nl: Voeg een formaat toe aan het gespecificeerde boek. Koppel True terug als het formaat succesvol is toegevoegd.

source: If True replace existing format, otherwise if the format already exists, return False.
nl: Als "True" een bestaand formaat vervangt, anders als het formaat al bestaat, "False" terugkoppelen.

source: If True, file type plugins are run on the format before and after being added.
nl: Indien TRUE lopen de bestandstype-plugins in het formaat vóór en ná het toevoegen.

source: Internal use only.
nl: Alleen voor intern gebruik.

source: Register a callback function that will be called after certain actions are taken on this database. The function must take three arguments: (:class:`EventType`, library_id, event_type_specific_data)
nl: Registreer een callback functie die aangeroepen wordt nadat bepaalde acties op de database uitgevoerd werden. De functie moet drie argumenten hebben: (:class:`EventType`, library_id, event_type_specific_data)

source: Add the specified resource so it can be referenced by notes and return its content hash
nl: Voeg de opgegeven bron toe zodat deze door notities kan worden geraadpleegd en retourneer de inhoudshash ervan.

source: Return a tuple of all annotation types in the database.
nl: Geef een tuple terug met alle annotatietypen in de database.

source: Return a tuple of all (user_type, user name) that have annotations.
nl: Geef een tuple terug van alle (gebruikerstype, gebruikersnaam) die annotaties hebben.

source: Return a tuple of all annotations matching the specified criteria. `ignore_removed` controls whether removed (deleted) annotations are also returned. Removed annotations are just a skeleton used for merging of annotations.
nl: Geef een tuple terug met alle annotaties die aan de opgegeven criteria voldoen. `ignore_removed` bepaalt of verwijderde (gewiste) annotaties ook worden teruggegeven. Verwijderde annotaties zijn slechts een skelet dat wordt gebruikt voor het samenvoegen van annotaties.

source: Return a tuple containing all annotations for the specified book_id as a dict with keys: `format`, `user_type`, `user`, `annotation`. Here, annotation is the annotation data.
nl: Retourneer een tuple met alle annotaties voor de opgegeven book_id als een dict met sleutels: `format`, `user_type`, `user`, `annotation`. Hier is annotation de annotatiegegevens.

source: Frozen set of all known book ids.
nl: Bevroren voor alle beken de boek id's.

source: Same as field_for, except that it operates on multiple books at once
nl: Zelfde als field_for, behalve dat het werkt voor meerdere boeken tegelijkertijd

source: Frozen set of ids for all values in the field ``name``.
nl: Bevroren set met ID's voor alle waarden in het veld ``naam``.

source: Frozen set of all fields names (should only be used for many-one and many-many fields)
nl: Bevroren set van alle veld namen (alleen gebruikt worden voor VEEL-EEN en VEEL-VEEL velden)

source: Return the number of annotations for the specified book available in the database.
nl: Geef het aantal annotaties weer voor het opgegeven boek dat beschikbaar is in de database.

source: Return a map of annotation type -> annotation data for the specified book_id, format, user and user_type.
nl: Geef een kaart terug van annotatietype -> annotatiegegevens voor de opgegeven book_id, format, user en user_type.

source: Return author data as a dictionary with keys: name, sort, link
nl: Geeft auteurgegevens terug als woordenboek met toetsen: naam, sortering, link

source: If no authors with the specified ids are found an empty dictionary is returned. If author_ids is None, data for all authors is returned.
nl: Indien geen auteurs met de gespecificeerds id's worden gevonden, geeft dit een leeg woordenboek terug. Indien author_ids is None worden gegevens van alle auteurs getoond.

source: Given a list of authors, return the author_sort string for the authors, preferring the author sort associated with the author over the computed string.
nl: Geef een lijst met auteurs, terugkeren naar auteur_sorteren string voor de auteurs, voorkeur dat de auteur sortering geassocieerd is met de auteur over het berekende string.

source: Return all the books associated with the item identified by ``item_id``, where the item belongs to the field ``name``.
nl: Geeft alle die boeken terug die in verband staan met het item geïdentificeerd door ``item_id``, waar het item behoord tot het veld ``naam``.

source: Returned value is a set of book ids, or the empty set if the item or the field does not exist.
nl: Geeft als waarde terug een set boeken id's of een leeg set indien het item of het veld niet bestaat.

source: Return the set of books in the specified virtual library
nl: Geef de set boeken terug in de opgegeven virtuele bibliotheek

source: Compress the cover images for the specified books. A compression quality of 100 will perform lossless compression, otherwise lossy compression.
nl: Comprimeer de omslagafbeeldingen voor de gespecificeerde boeken. Een compressiekwaliteit van 100 voert een verliesvrije compressie uit, anders met verlies.

source: The progress callback will be called with the book_id and the old and new sizes for each book that has been processed. If an error occurs, the new size will be a string with the error details.
nl: De vooruitgang callback wordt aangeroepen met het book_id en de oude en nieuwe groottes voor elk boek dat verwerkt werd. Als er een fout is, zal de nieuwe grootte een string met de foutdetails zijn.

source: Copy the cover to the file like object ``dest``. Returns False if no cover exists or dest is the same file as the current cover. dest can also be a path in which case the cover is copied to it if and only if the path is different from the current path (taking case sensitivity into account).
nl: Kopieer de opslag naar het bestandsobject ``doel``. Geeft Onwaar indien geen omslag bestaat, of doel gelijk is aan de huidige omslag. Doel kan ook een pad zijn, waarbij de omslag ernaartoe wordt gekopieerd indien het pad anders is dan het huidige pad (rekening houdend met hoofdlettergevoeligheid).

source: Copy the format ``fmt`` to the file like object ``dest``. If the specified format does not exist, raises :class:`NoSuchFormat` error. dest can also be a path (to a file), in which case the format is copied to it, iff the path is different from the current path (taking case sensitivity into account).
nl: Kopieer het formaat ``fmt`` naar het bestand als object ``dest``. Als het gespecificeerd formaat niet bestaat, verhoogd :class:'NoSuchFormat' fout. dest kan ook een pad zijn (naar een bestand), in dat geval is het formaat ernaar gekopieerd, als het pad verschillend is van de huidige pad (hoofdlettergevoeligheid in het account meegenomen).

source: Return the cover image or None. By default, returns the cover as a bytestring.
nl: Geeft omslagfoto terug of None. Standaard geeft de omslag terug als een reeks bytes.

source: WARNING: Using as_path will copy the cover to a temp file and return the path to the temp file. You should delete the temp file when you are done with it.
nl: WAARSCHUWING: Het gebruik van as_path maakt een kopie van de omslag in een temp-bestand en geeft het pad terug naar het temp-bestand. U moet het temp-bestand verwijderen wanneer u er klaar mee bent.

source: If True return the image as an open file object (a SpooledTemporaryFile)
nl: Indien TRUE de afbeelding teruggeeft als een open file object (een SpooledTemporaryFile)

source: If True return the image as a QImage object
nl: Indien waar, geef de afbeelding terug als een QImage object

source: If True return the image as a QPixmap object
nl: Als True, retourneer dan de afbeelding als een QPixmap-object.

source: If True return the image as a path pointing to a temporary file
nl: Indien TRUE de afbeelding teruggeeft als een pad die verwijst naar een temporair bestand

source: Return data that can be used to implement :meth:`find_identical_books` in a worker process without access to the db. See db.utils for an implementation.
nl: Geeft data terug die gebruikt kunnen worden om :meth:`find_identical_books` toe te passen in een worker process zonder toegang tot de database. Bekijk db.utils voor een toepassing.

source: Return data suitable for use in :meth:`has_book`. This can be used for an implementation of :meth:`has_book` in a worker process without access to the db.
nl: Geeft data terug die gebruikt kunnen worden om :meth:`has_book`. Dit kan gebruikt worden voor een toepassing van :meth:`has_book` in een worker process zonder toegang tot de database.

source: Delete annotations with the specified ids.
nl: Verwijder annotaties met de opgegeven id's.

source: Delete data for name. By default deletes all data, if you only want to delete data for some book ids, pass in a list of book ids.
nl: Verwijder data voor naam. Verwijdert standaard alle data, als u enkel data voor sommige boek ID's wilt verwijderen, geef een lijst met boek ID's in.

source: Delete an entry from the trash. Here category is 'b' for books and 'f' for formats.
nl: Verwijder een item uit de prullenbak. Hier is categorie 'b' voor boeken en 'f' voor formaten.

source: Update metadata in all formats of the specified book_ids to current metadata in the database.
nl: Update metadata in alle formaten van het gespecificeerde book_ids tot huidige metadata in de database.

source: Expire entries from the trash that are too old
nl: Verwijder te oude items uit de prullenbak

source: Export the note as a single HTML document with embedded images as data: URLs
nl: Exporteer de notitie als één HTML-document met ingesloten afbeeldingen als gegevens: URL's

source: Same as field_for, except that it avoids the extra lookup to get the field object
nl: Hetzelfde als field_for, behalve dat het de extra opzoek vermijdt voor het veld object

source: Return the value of the field ``name`` for the book identified by ``book_id``. If no such book exists or it has no defined value for the field ``name`` or no such field exists, then ``default_value`` is returned.
nl: Geeft waarde van het veld ``name`` voor boek geïdentificeerd door ``book_id`` terug. Als zo geen boek bestaat of geen gedefinieerde waarde heeft voor het veld ``name`` of zulk veld bestaat niet, wordt ``default_value`` teruggegeven.

source: ``default_value`` is not used for title, title_sort, authors, author_sort and series_index. This is because these always have values in the db. ``default_value`` is used for all custom columns.
nl: ``default_value`` wordt niet gebruikt voor title, title_sort, authors, author_sort and series_index omdat deze altijd waardes hebben in de db. ``default_value`` wordt gebruikt voor alle aangepaste kolommen.

source: The returned value for is_multiple fields are always tuples, even when no values are found (in other words, default_value is ignored). The exception is identifiers for which the returned value is always a dictionary. The returned tuples are always in link order, that is, the order in which they were created.
nl: De geretourneerde waarde voor is_multiple-velden zijn altijd tuples, zelfs wanneer er geen waarden worden gevonden (met andere woorden, default_value wordt genegeerd). De uitzondering hierop zijn identificatoren, waarvoor de geretourneerde waarde altijd een woordenboek is. De geretourneerde tuples zijn altijd in linkvolgorde, dat wil zeggen in de volgorde waarin ze zijn aangemaakt.

source: Return the ids (as a tuple) for the values that the field ``name`` has on the book identified by ``book_id``. If there are no values, or no such book, or no such field, an empty tuple is returned.
nl: Geef de id's terug (als een tupel) voor de waardes dat het veld ``name`` heeft voor het boek geïdentificeerd door ``book_id``. Als er geen waardes zijn, of zo geen boek, of zo geen veld, wordt een lege tupel teruggegeven.

source: Return True iff the specified field supports notes. If field is None return frozenset of all fields that support notes.
nl: Geef True terug als het opgegeven veld notities ondersteunt. Als het veld None is, geef dan een frozenset terug van alle velden die notities ondersteunen.

source: Finds books that have a superset of the authors in mi and the same title (title is fuzzy matched). See also :meth:`data_for_find_identical_books`.
nl: Vindt boeken die een auteur superset hebben in mi en dezelfde titel (titel komt fuzzy overeen). Bekijk ook :meth:`data_for_find_identical_books`.

source: Return the e-book format as a bytestring or `None` if the format doesn't exist, or we don't have permission to write to the e-book file.
nl: Geef het boekformaat terug als een byte string of `Geen` als het formaat niet bestaat of we geen toestemming hebben om naar het e-boek bestand te schrijven.

source: If True the e-book format is returned as a file object. Note that the file object is a SpooledTemporaryFile, so if what you want to do is copy the format to another file, use :meth:`copy_format_to` instead for performance.
nl: Indien Waar wordt het e-boek formaat teruggegeven als bestandsobject. Merk op dat het bestandsobject een SpooledTemporaryFile is dus als u het formaat naar een ander bestand wil kopiëren, gebruik in plaats daarvan :meth:`copy_format_to` voor prestatie.

source: Copies the format file to a temp file and returns the path to the temp file
nl: Kopieert het formaat bestand naar een tijdelijk bestand en geeft het pad naar het tijdelijk bestand terug

source: If True and returning a path the filename is the same as that used in the library. Note that using this means that repeated calls yield the same temp file (which is re-created each time)
nl: Als True en een pad retourneert, is de bestandsnaam dezelfde als die gebruikt in de bibliotheek. Houd er rekening mee dat het gebruik hiervan betekent dat herhaalde aanroepen hetzelfde tijdelijke bestand opleveren (dat elke keer opnieuw wordt aangemaakt).

source: Return absolute path to the e-book file of format `format`. You should almost never use this, as it breaks the threadsafe promise of this API. Instead use, :meth:`copy_format_to`.
nl: Geeft absolute pad terug aan het e-boek bestand in formaat `format`. Dit mag u maar zelden gebruiken want het breekt de threadveilige belofte van deze API. Gebruik beter :meth:`copy_format_to`.

source: Currently used only in calibredb list, the viewer, edit book, compare_format to original format, open with, bulk metadata edit and the catalogs (via get_data_as_dict()).
nl: Momenteel alleen gebruikt in de lijst calibratedb, de viewer, het bewerken van boeken, het vergelijken van het formaat met het oorspronkelijke formaat, openen met, bulkbewerking van metagegevens en de catalogi (via get_data_as_dict()).

source: Apart from the viewer, open with and edit book, I don't believe any of the others do any file write I/O with the results of this call.
nl: Afgezien van de viewer, open met en bewerk boek, geloof ik niet dat een van de andere programma's bestands-I/O uitvoert met de resultaten van deze aanroep.

source: Return the hash of the specified format for the specified book. The kind of hash is backend dependent, but is usually SHA-256.
nl: Geef de hash van het opgegeven formaat voor het opgegeven boek terug. Het type hash is afhankelijk van de backend, maar is meestal SHA-256.

source: Return the path, size and mtime for the specified format for the specified book. You should not use path unless you absolutely have to, since accessing it directly breaks the threadsafe guarantees of this API. Instead use the :meth:`copy_format_to` method.
nl: Geef het pad, de grootte en de mtime terug voor het opgegeven formaat voor het opgegeven boek. Gebruik het pad alleen als dat echt nodig is, want als je het direct opent, gaat de threadsafe-garantie van deze API verloren. Gebruik in plaats daarvan de methode :meth:`copy_format_to`.

source: If ``True`` cached values are used, otherwise a slow filesystem access is done. The cache values could be out of date if access was performed to the filesystem outside of this API.
nl: Als er "True" cachewaarden worden gebruikt, anders wordt er een trage toegang tot het bestandssysteem uitgevoerd. De cachewaarden kunnen verouderd zijn als er buiten deze API om toegang tot het bestandssysteem is uitgevoerd.

source: If ``True`` The max_size field of the database is updated for this book.
nl: Als ``True``, wordt het veld max_size van de database bijgewerkt voor dit boek.

source: Return tuple of all formats for the specified book. If verify_formats is True, verifies that the files exist on disk.
nl: Geeft een tuple terug met alle formaten voor het opgegeven boek. Als verify_formats True is, wordt gecontroleerd of de bestanden op de schijf aanwezig zijn.

source: Return all item_ids for items that have notes in the specified field or all fields if field_name is None
nl: Geef alle item_ids terug voor items die notities bevatten in het opgegeven veld of alle velden als field_name None is.

source: Returns all links for all fields referenced by book identified by book_id. If book_id doesn't exist then the method returns {}.
nl: Geeft alle links weer voor alle velden waarnaar wordt verwezen door het boek dat wordt geïdentificeerd door book_id. Als book_id niet bestaat, geeft de methode {} weer.

source: Example: Assume author A has link X, author B has link Y, tag S has link F, and tag T has link G. If book 1 has author A and tag T, this method returns {'authors':{'A':'X'}, 'tags':{'T', 'G'}}. If book 2's author is neither A nor B and has no tags, this method returns {}.
nl: Voorbeeld: Stel dat auteur A link X heeft, auteur B link Y heeft, tag S link F heeft en tag T link G heeft. Als boek 1 auteur A en tag T heeft, retourneert deze methode {'authors':{'A':'X'}, 'tags':{'T', 'G'}}. Als de auteur van boek 2 noch A noch B is en geen tags heeft, retourneert deze methode {}.

source: the book id in question.
nl: het betreffende boeknummer.

source: Returns
nl: Retouren

source: {field: {field_value, link_value}, ... for all fields with a field_value having a non-empty link value for that book
nl: {veld: {veldwaarde, linkwaarde}, ... voor alle velden met een veldwaarde die een niet-lege linkwaarde heeft voor dat boek
