Repository: debian-calibre/calibre
Catalog: translations/manual/*/db_api.po
Languages: nl

source: Return the relative book path for the given id. Prefer this because you can choose the directory separator, default use the os one. If unsafe is True, allow to return None if the book_id is not in the library.
nl: Geef het relatieve boekpad voor de opgegeven id terug. Geef hier de voorkeur aan, omdat u de mapseparator kunt kiezen. Standaard wordt die van het besturingssysteem gebruikt. Als unsafe True is, mag None worden teruggegeven als de book_id niet in de bibliotheek staat.

source: Used internally to implement the Tag Browser
nl: Intern gebruikt om de labelbrowser te implementeren

source: Get data for name. By default returns data for all book_ids, pass in a list of book ids if you only want some data. Returns a map of book_id to values. If a particular value could not be decoded, uses default for it.
nl: Haal gegevens op voor naam. Standaard worden gegevens voor alle book_ids geretourneerd. Voer een lijst met boek-id's in als u slechts bepaalde gegevens wilt. Retourneert een kaart van book_id naar waarden. Als een bepaalde waarde niet kan worden gedecodeerd, wordt de standaardwaarde gebruikt.

source: Return a mapping of id numbers to values for the specified field. The field must be a many-one or many-many field, otherwise a ValueError is raised.
nl: Geef een mapping terug van id-nummers naar waarden voor het opgegeven veld. Het veld moet een veel-één- of veel-veel-veld zijn, anders wordt er een ValueError gegenereerd.

source: Return the set of book ids for which name has data.
nl: Geef de set boek-id's terug waarvoor naam gegevens bevat.

source: Return the item id for item_name or None if not found. This function is very slow if doing lookups for multiple names use either get_item_ids() or get_item_name_map(). Similarly, case sensitive lookups are faster than case insensitive ones.
nl: Geef de item-id voor item_name terug of None als deze niet wordt gevonden. Deze functie is erg traag als er naar meerdere namen wordt gezocht. Gebruik in dat geval get_item_ids() of get_item_name_map(). Ook zijn zoekopdrachten waarbij hoofdletters en kleine letters worden onderscheiden sneller dan zoekopdrachten waarbij dit niet het geval is.

source: Return a dict mapping item_name to the item id or None
nl: Geef een dict terug die item_name koppelt aan het item-id of None.

source: Return the item name for the item specified by item_id in the specified field. See also :meth:`get_id_map`.
nl: Geef de naam van het item terug voor het item dat is opgegeven door item_id in het opgegeven veld. Zie ook :meth:`get_id_map`.

source: Return mapping of item values to ids
nl: Terugkoppeling van itemwaarden aan id's

source: Return a dictionary of links for the supplied field.
nl: Geef een woordenboek met links voor het opgegeven veld terug.

source: the lookup name of the field for which the link map is desired
nl: de zoeknaam van het veld waarvoor de koppelingskaart gewenst is

source: {field_value:link_value, ...} for non-empty links
nl: {veldwaarde:linkwaarde, ...} voor niet-lege links

source: Return metadata for the book identified by book_id as a :class:`calibre.ebooks.metadata.book.base.Metadata` object. Note that the list of formats is not verified. If get_cover is True, the cover is returned, either a path to temp file as mi.cover or if cover_as_data is True then as mi.cover_data.
nl: Retourneer metadata voor het boek geïdentificeerd door book_id als een :class:`calibre.ebooks.metadata.book.base.Metadata` object. Merk op dat de lijst met formaten niet wordt geverifieerd. Als get_cover True is, wordt de omslag geretourneerd, hetzij als een pad naar een tijdelijk bestand als mi.cover, hetzij als mi.cover_data als cover_as_data True is.

source: Return the next series index for the specified series, taking into account the various preferences that control next series number generation.
nl: Geef de volgende reeksindex voor de opgegeven reeks terug, rekening houdend met de verschillende voorkeuren die het genereren van het volgende reeksnummer regelen.

source: The series-like field (defaults to the builtin series column)
nl: Het serie-achtige veld (standaard ingesteld op de ingebouwde seriekolom)

source: If True, returns a mapping of book_id to current series_index value instead.
nl: Als True, retourneert in plaats daarvan een mapping van book_id naar de huidige waarde van series_index.

source: Return a dict containing the resource data and name or None if no resource with the specified hash is found
nl: Geef een dict terug met de brongegevens en naam, of None als er geen bron met de opgegeven hash wordt gevonden.

source: Like :meth:`get_metadata` except that it returns a ProxyMetadata object that only reads values from the database on demand. This is much faster than get_metadata when only a small number of fields need to be accessed from the returned metadata object.
nl: Net als :meth:`get_metadata`, behalve dat het een ProxyMetadata-object retourneert dat alleen op verzoek waarden uit de database leest. Dit is veel sneller dan get_metadata wanneer slechts een klein aantal velden uit het geretourneerde metadata-object moet worden opgevraagd.

source: Return a mapping of id to usage count for all values of the specified field, which must be a many-one or many-many field.
nl: Geef een mapping terug van id naar gebruiksfrequentie voor alle waarden van het opgegeven veld, dat een veel-één- of veel-veel-veld moet zijn.

source: Return True iff the database contains an entry with the same title as the passed in Metadata object. The comparison is case-insensitive. See also :meth:`data_for_has_book`.
nl: Geeft Waar desda de gegevensbank een item bevat met dezelfde titel als meegegeven in het metadata object. De vergelijking is niet hoofdlettergevoelig. Zie ook :meth:`data_for_has_book`.

source: Return True iff the format exists on disk
nl: Geeft Waar desda het formaat bestaat op disk

source: Return True iff the specified book_id exists in the db
nl: Geeft Waar desda het boek_id bestaat in de db

source: Import a previously exported note or an arbitrary HTML file as the note for the specified item
nl: Importeer een eerder geëxporteerde notitie of een willekeurig HTML-bestand als notitie voor het opgegeven item.

source: Initialize this cache with data from the backend.
nl: Initialiseer deze cache met gegevens uit de backend.

source: Return a dict of field to items that have associated notes for that field for the specified book
nl: Geef een dict van veld naar items terug die bijbehorende notities voor dat veld hebben voor het opgegeven boek.

source: Return the link, if any, for the specified item or None if no link is found
nl: Geef de link terug, indien aanwezig, voor het opgegeven item of None als er geen link is gevonden.

source: Get information about extra files in the book's directory.
nl: Krijg informatie over extra bestanden in de map van het boek.

source: the database book id for the book
nl: het databaseboeknummer voor het boek

source: the pattern of filenames to search for. Empty pattern matches all extra files. Patterns must use / as separator. Use the DATA_FILE_PATTERN constant to match files inside the data directory.
nl: het patroon van bestandsnamen waarnaar moet worden gezocht. Een leeg patroon komt overeen met alle extra bestanden. Patronen moeten / als scheidingsteken gebruiken. Gebruik de constante DATA_FILE_PATTERN om bestanden in de gegevensmap te vinden.

source: A tuple of all extra files matching the specified pattern. Each element of the tuple is ExtraFile(relpath, file_path, stat_result). Where relpath is the relative path of the file to the book directory using / as a separator. stat_result is the result of calling os.stat() on the file.
nl: Een tuple van alle extra bestanden die overeenkomen met het opgegeven patroon. Elk element van de tuple is ExtraFile(relpath, file_path, stat_result). Waarbij relpath het relatieve pad is van het bestand naar de boekmap, met / als scheidingsteken. stat_result is het resultaat van het aanroepen van os.stat() op het bestand.

source: Merge the specified annotations into the existing annotations for book_id, fm, user_type, and user.
nl: Voeg de opgegeven annotaties samen met de bestaande annotaties voor book_id, fm, user_type en user.

source: Merge the extra files from src_ids into dest_id. Conflicting files are auto-renamed unless replace=True in which case they are replaced.
nl: Voeg de extra bestanden van src_ids samen in dest_id. Bestanden die conflicteren worden automatisch hernoemd, tenzij replace=True, in welk geval ze worden vervangen.

source: Undelete a book from the trash directory
nl: Een boek uit de prullenbak herstellen

source: Undelete a format from the trash directory
nl: Een formattering uit de prullenbak herstellen

source: Return a list of sorted book ids. If ids_to_sort is None, all book ids are returned.
nl: Geef een lijst met gesorteerde boek-id's terug. Als ids_to_sort None is, worden alle boek-id's teruggegeven.

source: fields must be a list of 2-tuples of the form (field_name, ascending=True or False). The most significant field is the first 2-tuple.
nl: velden moeten een lijst zijn van 2-tuples in de vorm (veldnaam, ascending=True of False). Het belangrijkste veld is de eerste 2-tuple.

source: Return all notes data as a dict or None if note does not exist
nl: Geef alle notitiegegevens terug als een dict of None als de notitie niet bestaat.

source: Return the notes document or an empty string if not found
nl: Geef het notitiedocument of een lege tekenreeks terug als het niet gevonden wordt.

source: Return the set of resource hashes of all resources used by the note for the specified item
nl: Geef de set resource-hashes terug van alle resources die door de notitie voor het opgegeven item worden gebruikt.

source: Return the value for the specified preference or the value specified as ``default`` if the preference is not set.
nl: Geef de waarde voor de opgegeven voorkeur terug of de waarde die is opgegeven als ``default`` als de voorkeur niet is ingesteld.

source: Return the OPF metadata backup for the book as a bytestring or None if no such backup exists.
nl: Geef de OPF-metadataback-up voor het boek terug als een bytestring of None als er geen back-up bestaat.

source: Remove the books specified by the book_ids from the database and delete their format files. If ``permanent`` is False, then the format files are placed in the per-library trash directory.
nl: Verwijder de boeken die zijn gespecificeerd door de book_ids uit de database en verwijder hun formaatbestanden. Als ``permanent`` False is, worden de formaatbestanden in de prullenbakmap per bibliotheek geplaatst.

source: Delete the specified extra files, either to Recycle Bin or permanently.
nl: Verwijder de opgegeven extra bestanden naar de Prullenbak of definitief.

source: Remove the specified formats from the specified books.
nl: Verwijder de opgegeven formaten uit de opgegeven boeken.

source: A mapping of book_id to a list of formats to be removed from the book.
nl: Een mapping van book_id naar een lijst met formaten die uit het boek moeten worden verwijderd.

source: If True, only remove the record for the format from the db, do not delete the actual format file from the filesystem.
nl: Als True, verwijder dan alleen het record voor het formaat uit de database, verwijder het daadwerkelijke formaatbestand niet uit het bestandssysteem.

source: A map of book id to set of formats actually deleted from the filesystem for that book
nl: Een kaart van boek-id's naar sets van formaten die daadwerkelijk uit het bestandssysteem voor dat boek zijn verwijderd

source: Delete all items in the specified field with the specified ids. Returns the set of affected book ids. ``restrict_to_book_ids`` is an optional set of books ids. If specified the items will only be removed from those books.
nl: Verwijder alle items in het opgegeven veld met de opgegeven id's. Geeft de set van betrokken boek-id's terug. ``restrict_to_book_ids`` is een optionele set van boek-id's. Indien opgegeven, worden de items alleen uit die boeken verwijderd.

source: Rename extra data files
nl: Extra gegevensbestanden hernoemen

source: Rename items from a many-one or many-many field such as tags or series.
nl: Hernoem items uit een veel-één- of veel-veel-veld, zoals tags of series.

source: When renaming in a series-like field also change the series_index values.
nl: Bij het hernoemen in een reeksachtig veld moeten ook de waarden van series_index worden gewijzigd.

source: An optional set of book ids for which the rename is to be performed, defaults to all books.
nl: Een optionele set boek-id's waarvoor de naamswijziging moet worden uitgevoerd, standaard ingesteld op alle boeken.

source: Restore the book entry in the database for a book that already exists on the filesystem
nl: Herstel de boekvermelding in de database voor een boek dat al op het bestandssysteem bestaat.

source: Restore the specified format from the previously saved ORIGINAL_FORMAT, if any. Return True on success. The ORIGINAL_FORMAT is deleted after a successful restore.
nl: Herstel het opgegeven formaat uit het eerder opgeslagen ORIGINAL_FORMAT, indien aanwezig. Geef True terug bij succes. Het ORIGINAL_FORMAT wordt verwijderd na een succesvolle herstelbewerking.

source: A safe read lock is a lock that does nothing if the thread already has a write lock, otherwise it acquires a read lock. This is necessary to prevent DowngradeLockErrors, which can happen when updating the search cache in the presence of composite columns. Updating the search cache holds an exclusive lock, but searching a composite column involves reading field values via ProxyMetadata which tries to get a shared lock. There may be other scenarios that trigger this as well.
nl: Een veilige leesvergrendeling is een vergrendeling die niets doet als de thread al een schrijfvergrendeling heeft, anders verkrijgt deze een leesvergrendeling. Dit is nodig om DowngradeLockErrors te voorkomen, die kunnen optreden bij het bijwerken van de zoekcache in aanwezigheid van samengestelde kolommen. Het bijwerken van de zoekcache houdt een exclusieve vergrendeling in, maar het doorzoeken van een samengestelde kolom houdt het lezen van veldwaarden in via ProxyMetadata, dat probeert een gedeelde vergrendeling te verkrijgen. Er kunnen ook andere scenario's zijn die dit veroorzaken.

source: This property returns a new lock object on every access. This lock object is not recursive (for performance) and must only be used in a with statement as ``with cache.safe_read_lock:`` otherwise bad things will happen.
nl: Deze eigenschap retourneert bij elke toegang een nieuw vergrendelingsobject. Dit vergrendelingsobject is niet recursief (omwille van de prestaties) en mag alleen worden gebruikt in een with-statement als ``with cache.safe_read_lock:``, anders kunnen er problemen ontstaan.

source: Save a copy of the specified format as ORIGINAL_FORMAT, overwriting any existing ORIGINAL_FORMAT.
nl: Sla een kopie van het opgegeven formaat op als ORIGINAL_FORMAT en overschrijf daarbij alle bestaande ORIGINAL_FORMAT-bestanden.

source: Search the database for the specified query, returning a set of matched book ids.
nl: Zoek in de database naar de opgegeven zoekopdracht en retourneer een reeks overeenkomende boek-id's.

source: A restriction that is ANDed to the specified query. Note that restrictions are cached, therefore the search for a AND b will be slower than a with restriction b.
nl: Een beperking die wordt gecombineerd met de opgegeven zoekopdracht. Houd er rekening mee dat beperkingen in de cache worden opgeslagen, waardoor het zoeken naar a AND b langzamer verloopt dan a met beperking b.

source: Used internally (virtual fields such as on_device to search over).
nl: Intern gebruikt (virtuele velden zoals on_device om te doorzoeken).

source: If not None, a set of book ids for which books will be searched instead of searching all books.
nl: Indien niet None, een set boek-id's waarvoor boeken worden doorzocht in plaats van alle boeken te doorzoeken.

source: Return of a tuple of annotations matching the specified Full-text query.
nl: Retournering van een tuple met annotaties die overeenkomen met de opgegeven full-text query.

source: Search the text of notes using an FTS index. If the query is empty return all notes.
nl: Doorzoek de tekst van notities met behulp van een FTS-index. Als de zoekopdracht leeg is, worden alle notities weergegeven.

source: Set all annotations for the specified book_id, fmt, user_type and user.
nl: Stel alle annotaties in voor de opgegeven book_id, fmt, user_type en user.

source: options must be a map of the form {book_id:conversion_options}
nl: opties moeten een kaart zijn in de vorm {book_id:conversion_options}

source: Set the cover for this book. The data can be either a QImage, QPixmap, file object or bytestring. It can also be None, in which case any existing cover is removed.
nl: Stel de omslag voor dit boek in. De gegevens kunnen een QImage, QPixmap, bestandsobject of bytestring zijn. Het kan ook None zijn, in welk geval elke bestaande omslag wordt verwijderd.

source: Set the values of the field specified by ``name``. Returns the set of all book ids that were affected by the change.
nl: Stel de waarden in van het veld dat is opgegeven door ``name``. Geeft de set weer van alle boek-id's die door de wijziging zijn beïnvloed.

source: Mapping of book_ids to values that should be applied.
nl: Toewijzing van book_ids aan waarden die moeten worden toegepast.

source: If True, the case of many-one or many-many fields will be changed. For example, if a book has the tag ``tag1`` and you set the tag for another book to ``Tag1`` then the both books will have the tag ``Tag1`` if allow_case_change is True, otherwise they will both have the tag ``tag1``.
nl: Als True, wordt het geval van veel-één of veel-veel velden gewijzigd. Als een boek bijvoorbeeld de tag ``tag1`` heeft en u de tag voor een ander boek instelt op ``Tag1``, dan hebben beide boeken de tag ``Tag1`` als allow_case_change True is, anders hebben ze beide de tag ``tag1``.

source: Used internally, you should never change it.
nl: Intern gebruikt, u dient dit nooit te wijzigen.

source: Sets links for item values in field. Note: this method doesn't change values not in the value_to_link_map
nl: Stelt koppelingen in voor itemwaarden in het veld. Opmerking: deze methode wijzigt geen waarden die niet in de value_to_link_map staan.

source: the lookup name
nl: de zoeknaam

source: dict(field_value:link, ...). Note that these are values, not field ids.
nl: dict(veldwaarde:link, ...). Let op: dit zijn waarden, geen veld-id's.

source: books changed by setting the link
nl: boeken gewijzigd door de link in te stellen

source: Set metadata for the book `id` from the `Metadata` object `mi`
nl: Stel metadata in voor het boek `id` uit het `Metadata`-object `mi`

source: Setting force_changes=True will force set_metadata to update fields even if mi contains empty values. In this case, 'None' is distinguished from 'empty'. If mi.XXX is None, the XXX is not replaced, otherwise it is. The tags, identifiers, and cover attributes are special cases. Tags and identifiers cannot be set to None so they will always be replaced if force_changes is true. You must ensure that mi contains the values you want the book to have. Covers are always changed if a new cover is provided, but are never deleted. Also note that force_changes has no effect on setting title or authors.
nl: Door force_changes=True in te stellen, wordt set_metadata gedwongen om velden bij te werken, zelfs als mi lege waarden bevat. In dit geval wordt 'None' onderscheiden van 'empty'. Als mi.XXX None is, wordt XXX niet vervangen, anders wel. De tags, identificatiecodes en omslagattributen zijn speciale gevallen. Tags en identificatiecodes kunnen niet worden ingesteld op None, dus ze worden altijd vervangen als force_changes true is. U moet ervoor zorgen dat mi de waarden bevat die u voor het boek wilt hebben. Covers worden altijd gewijzigd als er een nieuwe cover wordt opgegeven, maar worden nooit verwijderd. Houd er ook rekening mee dat force_changes geen effect heeft op het instellen van de titel of auteurs.

source: Set the notes document. If the searchable text is different from the document, specify it as searchable_text. If the document references resources their hashes must be present in resource_hashes. Set remove_unused_resources to True to cleanup unused resources, note that updating a note automatically cleans up resources pertaining to that note anyway.
nl: Stel het notitiedocument in. Als de doorzoekbare tekst verschilt van het document, geef deze dan op als searchable_text. Als het document verwijst naar bronnen, moeten hun hashes aanwezig zijn in resource_hashes. Stel remove_unused_resources in op True om ongebruikte bronnen op te ruimen. Houd er rekening mee dat het bijwerken van een notitie automatisch de bronnen met betrekking tot die notitie opruimt.

source: Set the specified preference to the specified value. See also :meth:`pref`.
nl: Stel de opgegeven voorkeur aan de opgegeven waarde. Zie ook: meth: `pref`.

source: If f is a composite column lookup key and the column is is_multiple then split v into unique non-empty values. The comparison is case sensitive. Order is not preserved. Return a list() for compatibility with proxy metadata field getters, for example tags.
nl: Als f een samengestelde kolomzoekcode is en de kolom is_multiple is, splits dan v in unieke, niet-lege waarden. De vergelijking is hoofdlettergevoelig. De volgorde wordt niet behouden. Retourneer een lijst () voor compatibiliteit met proxy-metadata-veldgetters, bijvoorbeeld tags.

source: Return the ids of all books having the tag ``tag`` that are older than the specified time. tag comparison is case insensitive.
nl: Geef de id's terug van alle boeken met de tag ``tag`` die ouder zijn dan de opgegeven tijd. Bij het vergelijken van tags wordt geen onderscheid gemaakt tussen hoofdletters en kleine letters.

source: A timedelta object or None. If None, then all ids with the tag are returned.
nl: Een timedelta-object of None. Als None, worden alle id's met de tag geretourneerd.

source: If not None the list of matches will be restricted to books that have this tag
nl: Als dit niet het geval is, wordt de lijst met overeenkomsten beperkt tot boeken die deze tag hebben.

source: A list of authors. If not None the list of matches will be restricted to books that have these authors (case insensitive).
nl: Een lijst met auteurs. Als dit niet 'Geen' is, wordt de lijst met resultaten beperkt tot boeken van deze auteurs (hoofdlettergevoeligheid is uitgeschakeld).

source: Unretire a previously retired note for the specified item. Notes are retired when an item is removed from the database
nl: Een eerder verwijderde notitie voor het opgegeven item weer terugzetten. Notities worden verwijderd wanneer een item uit de database wordt verwijderd.

source: Update annotations.
nl: Annotaties bijwerken.

source: Return the user categories for the specified books. proxy_metadata_map is optional and is useful for a performance boost, in contexts where a ProxyMetadata object for the books already exists. It should be a mapping of book_ids to their corresponding ProxyMetadata objects.
nl: Geef de gebruikerscategorieën voor de opgegeven boeken terug. proxy_metadata_map is optioneel en is nuttig voor een prestatieverbetering in contexten waarin al een ProxyMetadata-object voor de boeken bestaat. Het moet een mapping zijn van book_ids naar de bijbehorende ProxyMetadata-objecten.
