Repository: debian-calibre/calibre
Catalog: translations/manual/*/drm.po
Languages: sv

source: Digital Rights Management (DRM) is a generic term for access control technologies that can be used by hardware manufacturers, publishers, copyright holders and individuals to try to impose limitations on the usage of digital content and devices. It is also, sometimes, disparagingly described as Digital Restrictions Management. The term is used to describe any technology which inhibits uses (legitimate or otherwise) of digital content that were not desired or foreseen by the content provider. The term generally doesn't refer to other forms of copy protection which can be circumvented without modifying the file or device, such as serial numbers or key-files. It can also refer to restrictions associated with specific instances of digital works or devices. DRM technologies attempt to control use of digital media by preventing access, copying or conversion to other formats by end users. See `Wikipedia <https://en.wikipedia.org/wiki/Digital_rights_management>`_.
sv: Digital Rights Management (DRM) är en generisk term för åtkomstkontrollteknik som kan användas av hårdvarutillverkare, utgivare, upphovsrättsinnehavare och individer för att försöka införa begränsningar för användningen av digitalt innehåll och enheter. Det beskrivs också, ibland, nedsättande som Digital Restrictions Management. Termen används för att beskriva all teknik som hämmar användningar (legitima eller på andra sätt) av digitalt innehåll som inte önskas eller förutsågs av innehållsleverantören. Termen brukar inte hänvisa till andra former av kopieringsskydd som kan kringgås utan att ändra filen eller enheten, såsom serienummer eller nyckelfiler. Det kan också hänvisa till begränsningar i samband med specifika fall av digitala verk eller enheter. DRM-tekniker försöker kontrollera användningen av digitala medier genom att förhindra åtkomst, kopiering eller konvertering till andra format av slutanvändare. Se `Wikipedia <https://sv.wikipedia.org/wiki/Digital_rights_management>`_.

source: What does DRM imply for me personally?
sv: Vad innebär DRM för mig personligen?

source: When you buy an e-book with DRM you don't really own it but have purchased the permission to use it in a manner dictated to you by the seller. DRM limits what you can do with e-books you have "bought". Often people who buy books with DRM are unaware of the extent of these restrictions. These restrictions prevent you from reformatting the e-book to your liking, including making stylistic changes like adjusting the font sizes, although there is software that empowers you to do such things for non DRM books. People are often surprised that an e-book they have bought in a particular format cannot be converted to another format if the e-book has DRM. So if you have an Amazon Kindle and buy a book sold by Barnes and Nobles, you should know that if that e-book has DRM you will not be able to read it on your Kindle. Notice that I am talking about a book you buy, not steal or pirate but BUY.
sv: När du köper en e-bok med DRM äger du den inte riktigt utan har köpt tillstånd att använda den på ett sätt som säljaren dikterar för dig. DRM begränsar vad du kan göra med e-böcker du har "köpt". Ofta är personer som köper böcker med DRM omedvetna om omfattningen av dessa begränsningar. Dessa begränsningar hindrar dig från att formatera om e-boken efter eget tycke, inklusive att göra stilistiska ändringar som att justera teckensnittsstorlekarna, även om det finns programvara som ger dig möjlighet att göra sådana saker för icke DRM-böcker. Folk blir ofta förvånade över att en e-bok som de har köpt i ett visst format inte kan konverteras till ett annat format om e-boken har DRM. Så om du har en Amazon Kindle och köper en bok som säljs av Barnes and Nobles, bör du veta att om den e-boken har DRM kommer du inte att kunna läsa den på din Kindle. Lägg märke till att jag talar om en bok du köper, inte stjäl eller piratkopierar utan KÖPER.

source: What does DRM do for authors?
sv: Vad gör DRM för författare?

source: Publishers of DRMed e-books argue that the DRM is all for the sake of authors and to protect their artistic integrity and prevent piracy. But DRM does NOT prevent piracy. People who want to pirate content or use pirated content still do it and succeed. The three major DRM schemes for e-books today are run by Amazon, Adobe and Barnes and Noble and all three DRM schemes have been cracked. All DRM does is inconvenience legitimate users. It can be argued that it actually harms authors as people who would have bought the book choose to find a pirated version as they are not willing to put up with DRM. Those that would pirate in the absence of DRM do so in its presence as well. To reiterate, the key point is that DRM *does not prevent piracy*. So DRM is not only pointless and harmful to buyers of e-books but also a waste of money.
sv: Utgivare av e-böcker med DRM hävdar att DRM är allt för författarnas skull och för att skydda sin konstnärliga integritet och förhindra piratkopiering. Men DRM hindrar inte piratkopiering. Människor som vill piratkopiera innehåll eller använda piratkopierat innehåll gör det fortfarande och lyckas. De tre stora DRM-systemen för e-böcker idag drivs av Amazon, Adobe och Barnes and Noble och alla tre DRM-system har knäckts. Allt DRM gör är besvärar legitima användare. Det kan hävdas att det faktiskt skadar författare eftersom personer som skulle ha köpt boken väljer att hitta en piratkopierad version eftersom de inte är villiga att stå ut med DRM. De som skulle piratkopiera i frånvaro av DRM gör det också i sin närvaro. För att upprepa är huvudpunkten att DRM *inte hindrar piratkopiering*. Så DRM är inte bara meningslöst och skadligt för köpare av e-böcker utan också ett slöseri med pengar.

source: DRM and freedom
sv: DRM och frihet

source: Although digital content can be used to make information as well as creative works easily available to everyone and empower humanity, this is not in the interests of some publishers who want to steer people away from this possibility of freedom simply to maintain their relevance in world developing so fast that they can't keep up.
sv: Även om digitalt innehåll kan användas för att göra information och kreativa verk lättillgängliga för alla och stärka mänskligheten, ligger detta inte i intresset för vissa utgivare som vill styra människor bort från den här möjligheten till frihet helt enkelt för att behålla sin relevans i världsutvecklingen. så snabbt att de inte kan hänga med.

source: Why does calibre not support DRM?
sv: Varför stöder calibre inte DRM?

source: calibre is open source software while DRM by its very nature is closed. If calibre were to support opening or viewing DRM files it could be trivially modified to be used as a tool for DRM removal which is illegal under today's laws. Open source software and DRM are a clash of principles. While DRM is all about controlling the user, open source software is about empowering the user. The two simply can not coexist.
sv: calibre är programvara med öppen källkod medan DRM till sin natur är stängd. Om calibre skulle stöda öppning eller visning av DRM-filer kan det vara trivialt modifierat för att användas som ett verktyg för DRM-borttagning, vilket är olagligt enligt dagens lagar. Programvara med öppen källkod och DRM är en konflikt mellan principer. Medan DRM handlar om att styra användaren, handlar programvara med öppen källkod om att ge användaren möjlighet. De två kan helt enkelt inte samexistera.

source: What is calibre's view on content providers?
sv: Vad är calibres syn på innehållsleverantörer?

source: We firmly believe that authors and other content providers should be compensated for their efforts, but DRM is not the way to go about it. We are developing this database of DRM-free e-books from various sources to help you find DRM-free alternatives and to help independent authors and publishers of DRM-free e-books publicize their content. We hope you will find this useful and we request that you do not pirate the content made available to you here.
sv: Vi är övertygade om att författare och andra innehållsleverantörer ska kompenseras för sina ansträngningar, men DRM är inte rätt väg att ta. Vi utvecklar denna databas med DRM-fria e-böcker från olika källor för att hjälpa dig att hitta DRM-fria alternativ och för att hjälpa oberoende författare och utgivare av DRM-fria e-böcker att publicera sitt innehåll. Vi hoppas att du kommer att finna detta användbart och vi ber att du inte piratkopierar innehållet som görs tillgängligt för dig här.

source: How can I help fight DRM?
sv: Hur kan jag hjälpa till att bekämpa DRM?

source: As somebody who reads and buys e-books you can help fight DRM. Do not buy e-books with DRM. There are some publishers who publish DRM-free e-books. Make an effort to see if they carry the e-book you are looking for. If you like books by certain independent authors that sell DRM-free e-books and you can afford it make donations to them. This is money well spent as their e-books tend to be cheaper (there may be exceptions) than the ones you would buy from publishers of DRMed books and would probably work on all devices you own in the future saving you the cost of buying the e-book again. Do not discourage publishers and authors of DRM-free e-books by pirating their content. Content providers deserve compensation for their efforts. Do not punish them for trying to make your reading experience better by making available DRM-free e-books. In the long run this is detrimental to you. If you have bought books from sellers that carry both DRMed as well as DRM-free books, not knowing if they carry DRM or not make it a point to leave a comment or review on the website informing future buyers of its DRM status. Many sellers do not think it important to clearly indicate to their buyers if an e-book carries DRM or not. `Here <https://www.defectivebydesign.org/guide/ebooks>`_ you will find a guide to DRM-free living.
sv: Som någon som läser och köper e-böcker kan du hjälpa till att bekämpa DRM. Köp inte e-böcker med DRM. Det finns några utgivare som publicerar DRM-fria e-böcker. Ansträng dig för att se om de har e-boken du letar efter. Om du gillar böcker av vissa oberoende författare som säljer DRM-fria e-böcker och du har råd att göra donationer till dem. Detta är väl använda pengar eftersom deras e-böcker tenderar att vara billigare (det kan finnas undantag) än de du skulle köpa från utgivare av böcker med DRM och förmodligen skulle fungera på alla enheter du äger i framtiden, vilket sparar dig kostnaden för att köpa e-boken igen. Avskräck inte utgivare och författare av DRM-fria e-böcker genom att piratkopiera deras innehåll. Innehållsleverantörer förtjänar kompensation för sina ansträngningar. Bestraffa dem inte för att försöka göra din läsupplevelse bättre genom att göra DRM-fria e-böcker tillgängliga. I det långa loppet är detta skadligt för dig. Om du har köpt böcker från säljare som har både böcker med DRM och utan DRM, utan att veta om de har DRM eller inte, gör det till en poäng att lämna en kommentar eller recension på webbplatsen och informera framtida köpare om dess DRM-status. Många säljare tycker inte att det är viktigt att tydligt ange för sina köpare om en e-bok har DRM eller inte. `Här <https://www.defectivebydesign.org/guide/ebooks>`_ hittar du en guide till en DRM-fri livsstil.
