Repository: debian-calibre/calibre
Catalog: translations/manual/*/function_mode.po
Languages: nl, zh_cn

source: Function mode for Search & replace in the Editor
nl: Functie modus voor zoek & vervangen in de editor
zh_cn: 编辑器中搜索和替换功能

source: The :guilabel:`Search & replace` tool in the editor support a *function mode*. In this mode, you can combine regular expressions (see :doc:`regexp`) with arbitrarily powerful Python functions to do all sorts of advanced text processing.
nl: De :guilabel: `Zoek & vervangen` tool in de editor ondersteunt een *functiemodus*. In deze modus kunt u reguliere expressies combineren (zie :doc: `regexp`) met willekeurig krachtige Python-functies om allerlei geavanceerde tekstverwerking uit te voeren.
zh_cn: 编辑器中的“搜索和替换”工具支持*功能模式*。 在此模式下，您可以将正则表达式（请参阅“regexp”）与任意强大的 Python 函数结合起来，以执行各种高级文本处理。

source: In the standard *regexp* mode for search and replace, you specify both a regular expression to search for as well as a template that is used to replace all found matches. In function mode, instead of using a fixed template, you specify an arbitrary function, in the `Python programming language <https://docs.python.org>`_. This allows you to do lots of things that are not possible with simple templates.
nl: In de standaard *regexp* modus voor zoeken en vervangen, geeft u zowel een reguliere expressie op om naar te zoeken als een sjabloon, om alle gevonden overeenkomsten te vervangen. In functiemodus geeft u in plaats van een vast sjabloon een willekeurige functie op in de `Python programmeertaal <https://docs.python.org>`_. Hiermee kunt u veel dingen doen die niet mogelijk zijn met eenvoudige sjablonen.
zh_cn: 在搜索和替换的标准 *regexp* 模式中，您指定要搜索的正则表达式以及用于替换所有找到的匹配项的模板。 在函数模式下，您不使用固定模板，而是在“Python 编程语言 <https://docs.python.org>”中指定任意函数。 这使您可以完成许多使用简单模板无法完成的事情。

source: Techniques for using function mode and the syntax will be described by means of examples, showing you how to create functions to perform progressively more complex tasks.
nl: Technieken voor het gebruik van de functie modus en de syntaxis worden beschreven aan de hand van voorbeelden, waarin u wordt uitgelegd hoe u functies kunt maken om steeds complexere taken uit te voeren.
zh_cn: 将通过示例描述使用函数模式和语法的技术，向您展示如何创建函数来执行逐渐复杂的任务。

source: The Function mode
nl: De Functie modus
zh_cn: 功能模式

source: Automatically fixing the case of headings in the document
nl: Automatisch het hoofdlettergebruik van titels in documenten corrigeren
zh_cn: 自动修复文档中标题的大小写

source: Here, we will leverage one of the builtin functions in the editor to automatically change the case of all text inside heading tags to title case::
nl: Hier zullen we gebruik maken van een van de ingebouwde functies in de editor om automatisch het hoofdlettergebruik van alle tekst binnen heading-tags naar elk woord met hoofdletters te veranderen::
zh_cn: 在这里，我们将利用编辑器中的内置函数之一自动将标题标签内所有文本的大小写更改为标题大小写：

source: For the function, simply choose the :guilabel:`Title-case text (ignore tags)` builtin function. The will change titles that look like: ``<h1>some TITLE</h1>`` to ``<h1>Some Title</h1>``. It will work even if there are other HTML tags inside the heading tags.
zh_cn: 对于该函数，只需选择“标题大小写文本（忽略标签）”内置函数即可。 会将如下所示的标题更改为“<h1> some TITLE </h1>” 为“<h1> Some Title </h1>”。 即使标题标签内有其他 HTML 标签，它也能工作。

source: Your first custom function - smartening hyphens
nl: Uw eerste aangepaste functie - koppeltekens slim maken
zh_cn: 您的第一个自定义函数 - 智能连字符

source: The real power of function mode comes from being able to create your own functions to process text in arbitrary ways. The Smarten Punctuation tool in the editor leaves individual hyphens alone, so you can use the this function to replace them with em-dashes.
nl: De echte kracht van de functiemodus komt voort uit de mogelijkheid om je eigen functies te creëren om tekst op willekeurige manieren te verwerken. De Smarten Punctuation-tool in de editor laat individuele koppeltekens ongemoeid, zodat je deze functie kunt gebruiken om ze te vervangen door em-dashes.
zh_cn: 函数模式的真正强大之处在于能够创建自己的函数以任意方式处理文本。 编辑器中的 Smarten 标点符号工具会保留单个连字符，因此您可以使用此功能将它们替换为破折号。

source: To create a new function, simply click the :guilabel:`Create/edit` button to create a new function and copy the Python code from below.
nl: Om een nieuwe functie te maken, klik je gewoon op de knop :guilabel:`Maken/bewerken` om een nieuwe functie te maken en kopieer je de Python-code hieronder.
zh_cn: 要创建新函数，只需单击“创建/编辑”按钮即可创建新函数并复制下面的 Python 代码。

source: Every :guilabel:`Search & replace` custom function must have a unique name and consist of a Python function named replace, that accepts all the arguments shown above. For the moment, we won't worry about all the different arguments to ``replace()`` function. Just focus on the ``match`` argument. It represents a match when running a search and replace. Its full documentation in available `here <https://docs.python.org/library/re.html#match-objects>`_. ``match.group()`` simply returns all the matched text and all we do is replace hyphens in that text with em-dashes, first replacing double hyphens and then single hyphens.
nl: Elke aangepaste functie :guilabel:`Zoeken en vervangen` moet een unieke naam hebben en bestaan uit een Python-functie met de naam replace, die alle hierboven weergegeven argumenten accepteert. Voorlopig houden we ons niet bezig met alle verschillende argumenten voor de functie ``replace()``. Concentreer je gewoon op het argument ``match``. Dit vertegenwoordigt een overeenkomst bij het uitvoeren van een zoek- en vervangactie. De volledige documentatie is beschikbaar `hier <https://docs.python.org/library/re.html#match-objects>`_. ``match.group()`` retourneert eenvoudigweg alle overeenkomende tekst en het enige wat we doen is de koppeltekens in die tekst vervangen door em-streepjes, waarbij we eerst dubbele koppeltekens vervangen en daarna enkele koppeltekens.
zh_cn: 每个“搜索和替换”自定义函数都必须有一个唯一的名称，并由一个名为“replace”的 Python 函数组成，该函数接受上面显示的所有参数。 目前，我们不必担心“replace()”函数的所有不同参数。 只需关注“match”参数即可。 它表示运行搜索和替换时的匹配。 其完整文档位于“此处 <https://docs.python.org/library/re.html#match-objects>”_。 ``match.group()`` 只是返回所有匹配的文本，我们所做的就是用破折号替换该文本中的连字符，首先替换双连字符，然后替换单连字符。

source: Use this function with the find regular expression::
nl: Gebruik deze functie met de zoek reguliere expressie::
zh_cn: 将此函数与查找正则表达式一起使用：

source: And it will replace all hyphens with em-dashes, but only in actual text and not inside HTML tag definitions.
nl: En het vervangt alle koppeltekens met em-streepjes maar enkel in echte tekst en niet in HTML tag definities.
zh_cn: 它将用破折号替换所有连字符，但仅限于实际文本中，而不是 HTML 标记定义内。

source: The power of function mode - using a spelling dictionary to fix mis-hyphenated words
nl: De kracht van functie modus - een spellingswoordenboek gebruiken om fout koppeltekengebruik te herstellen
zh_cn: 功能模式的力量 - 使用拼写词典来修复错误连字符的单词

source: Often, e-books created from scans of printed books contain mis-hyphenated words -- words that were split at the end of the line on the printed page. We will write a simple function to automatically find and fix such words.
nl: E-boeken gecreëerd van scans van gedrukte boeken bevatten dikwijls fout koppeltekengebruik -- woorden gesplitst aan het einde van een regel in d gedrukte tekst. We gaan een eenvoudige functie schrijven om zulke woorden automatisch te vinden en herstellen.
zh_cn: 通常，通过扫描印刷书籍创建的电子书包含错误连字符的单词，即在印刷页面上的行尾处分开的单词。 我们将编写一个简单的函数来自动查找并修复这些单词。

source: Use this function with the same find expression as before, namely::
nl: Gebruik deze functie met dezelfde zoek reguliere expressie als voorheen, namelijk::
zh_cn: 使用与之前相同的查找表达式来使用此函数，即：

source: And it will magically fix all mis-hyphenated words in the text of the book. The main trick is to use one of the useful extra arguments to the replace function, ``dictionaries``. This refers to the dictionaries the editor itself uses to spell check text in the book. What this function does is look for words separated by a hyphen, remove the hyphen and check if the dictionary recognizes the composite word, if it does, the original words are replaced by the hyphen free composite word.
nl: En het zal op magische wijze alle verkeerd gespelde woorden in de tekst van het boek corrigeren. De belangrijkste truc is om een van de handige extra argumenten voor de vervangingsfunctie te gebruiken, namelijk "woordenboeken". Dit verwijst naar de woordenboeken die de editor zelf gebruikt om de tekst in het boek op spelling te controleren. Deze functie zoekt naar woorden die door een koppelteken worden gescheiden, verwijdert het koppelteken en controleert of het woordenboek het samengestelde woord herkent. Als dat het geval is, worden de oorspronkelijke woorden vervangen door het samengestelde woord zonder koppelteken.
zh_cn: 它会神奇地修复书中所有错误连字符的单词。 主要技巧是使用替换函数的有用的额外参数之一“字典”。 这是指编辑器本身用来对书中文本进行拼写检查的词典。 该函数的作用是查找由连字符分隔的单词，删除连字符并检查字典是否识别该复合词，如果是，则将原始单词替换为无连字符的复合词。

source: Note that one limitation of this technique is it will only work for mono-lingual books, because, by default, ``dictionaries.recognized()`` uses the main language of the book.
nl: Houd er rekening mee dat een beperking van deze techniek is dat deze alleen werkt voor eentalige boeken, omdat ``dictionaries.recognized()`` standaard de hoofdtaal van het boek gebruikt.
zh_cn: 请注意，此技术的一个限制是它仅适用于单语言书籍，因为默认情况下，“dictionaries.recognized()”使用书籍的主要语言。

source: Auto numbering sections
nl: Automatische nummering secties
zh_cn: 自动编号章节

source: Now we will see something a little different. Suppose your HTML file has many sections, each with a heading in an :code:`<h2>` tag that looks like :code:`<h2>Some text</h2>`. You can create a custom function that will automatically number these headings with consecutive section numbers, so that they look like :code:`<h2>1. Some text</h2>`.
nl: Nu gaan we iets anders bekijken. Stel dat uw HTML-bestand veel secties bevat, elk met een koptekst in een :code:`<h2>` tag die eruitziet als :code:`<h2>Enige tekst</h2>`. Je kunt een aangepaste functie maken die deze koppen automatisch nummert met opeenvolgende sectienummers, zodat ze eruit zien als :code:`<h2>1. Enige tekst</h2>`.
zh_cn: 现在我们会看到一些不同的东西。 假设您的 HTML 文件有许多部分，每个部分都有一个位于“<h2>”标记中的标题，看起来像“<h2>Some text</h2>”。 您可以创建一个自定义函数，自动使用连续的节号对这些标题进行编号，使它们看起来像“<h2> 1。Some text </h2>”。

source: Use it with the find expression::
nl: Gebruik het met de find expresse::
zh_cn: 将其与查找表达式一起使用：

source: Place the cursor at the top of the file and click :guilabel:`Replace all`.
nl: Plaats de cursor aan het begin van het bestand en klik op :guilabel:`Alle vervangen`.
zh_cn: 将光标置于文件顶部，然后单击“全部替换”。

source: This function uses another of the useful extra arguments to ``replace()``: the ``number`` argument. When doing a :guilabel:`Replace All` number is automatically incremented for every successive match.
nl: Deze functie maakt gebruik van een ander handig extra argument van ``replace()``: het argument ``number``. Bij het uitvoeren van een :guilabel:`Replace All` wordt het getal automatisch verhoogd voor elke opeenvolgende overeenkomst.
zh_cn: 该函数使用了另一个有用的额外参数“replace()”：“number”参数。 当执行“全部替换”时，每个连续匹配的数字都会自动增加。

source: Another new feature is the use of ``replace.file_order`` -- setting that to ``'spine'`` means that if this search is run on multiple HTML files, the files are processed in the order in which they appear in the book. See :ref:`file_order_replace_all` for details.
nl: Een andere nieuwe functie is het gebruik van de ``replace.file_order`` -- instelling die voor ``'spine'`` betekent dat als deze zoekopdracht draait op meerdere HTML files, de bestanden verwerkt worden in de volgorde waarin ze verschijnen in het book. Bekijk :ref:`file_order_replace_all` voor details.
zh_cn: 另一个新功能是使用“replace.file_order”——将其设置为“'spine”意味着如果在多个 HTML 文件上运行此搜索，则文件将按照它们出现的顺序进行处理。 这本书。 有关详细信息，请参阅“file_order_replace_all”。

source: Auto create a Table of Contents
nl: Maak automatische inhoudsopgave aan
zh_cn: 自动创建目录

source: Finally, lets try something a little more ambitious. Suppose your book has headings in ``h1`` and ``h2`` tags that look like ``<h1 id="someid">Some Text</h1>``. We will auto-generate an HTML Table of Contents based on these headings. Create the custom function below:
nl: Laten we tot slot iets ambitieuzer proberen. Stel dat uw boek kopteksten heeft in ``h1``- en ``h2``-tags die er als volgt uitzien: ``<h1 id="someid">Some Text</h1>``. We gaan automatisch een HTML-inhoudsopgave genereren op basis van deze kopteksten. Maak de onderstaande aangepaste functie:
zh_cn: 最后，让我们尝试一些更雄心勃勃的事情。 假设您的书的“h1”和“h2”标签中的标题看起来像“<h1 id="someid"> Some Text </h1>”。 我们将根据这些标题自动生成 HTML 目录。 创建以下自定义函数：

source: And use it with the find expression::
nl: En gebruik het met de find expressie::
zh_cn: 并将其与 find 表达式一起使用：

source: Run the search on :guilabel:`All text files` and at the end of the search, a window will popup with "Debug output from your function" which will have the HTML Table of Contents, ready to be pasted into :file:`toc.html`.
nl: Voer de zoekopdracht uit op :guilabel:`Alle tekstbestanden` en aan het einde van de zoekopdracht verschijnt er een venster met "Debug-uitvoer van uw functie" met de HTML-inhoudsopgave, klaar om te worden geplakt in :file:`toc.html`.
zh_cn: 在“所有文本文件”上运行搜索，在搜索结束时，将弹出一个窗口，其中显示“调试函数的输出”，其中包含 HTML 目录，可以粘贴到“toc.html”中。

source: The function above is heavily commented, so it should be easy to follow. The key new feature is the use of another useful extra argument to the ``replace()`` function, the ``data`` object. The ``data`` object is a Python *dictionary* that persists between all successive invocations of ``replace()`` during a single :guilabel:`Replace All` operation.
nl: De bovenstaande functie is uitgebreid van commentaar voorzien, dus deze zou gemakkelijk te volgen moeten zijn. De belangrijkste nieuwe functie is het gebruik van een ander nuttig extra argument voor de functie ``replace()``, het object ``data``. Het object ``data`` is een Python *woordenboek* dat blijft bestaan tussen alle opeenvolgende aanroepen van ``replace()`` tijdens een enkele :guilabel:`Replace All`-bewerking.
zh_cn: 上面的函数有很多注释，所以应该很容易理解。 关键的新功能是对“replace()”函数使用另一个有用的额外参数，即“data”对象。 “data” 对象是一个 Python *字典*，在单个“全部替换”操作期间，在所有连续调用“replace()”之间持续存在。

source: Another new feature is the use of ``call_after_last_match`` -- setting that to ``True`` on the ``replace()`` function means that the editor will call ``replace()`` one extra time after all matches have been found. For this extra call, the match object will be ``None``.
nl: Een andere nieuwe functie is het gebruik van ``call_after_last_match`` -- als je dat instelt op ``True`` in de functie ``replace()``, betekent dit dat de editor ``replace()`` nog een keer extra aanroept nadat alle overeenkomsten zijn gevonden. Voor deze extra aanroep is het overeenkomstobject ``None``.
zh_cn: 另一个新功能是使用“call_after_last_match”——在“replace()”函数上将其设置为“True”意味着编辑器将额外调用一次“replace()” 已找到匹配项。 对于这个额外的调用，匹配对象将为“None”。

source: This was just a demonstration to show you the power of function mode, if you really needed to generate a Table of Contents from headings in your book, you would be better off using the dedicated Table of Contents tool in :guilabel:`Tools->Table of Contents`.
nl: Dit was slechts een demonstratie om u de kracht van de functiemodus te laten zien. Als u echt een inhoudsopgave wilt genereren op basis van de kopjes in uw boek, kunt u beter de speciale inhoudsopgavetool gebruiken in :guilabel:`Tools->Table of Contents`.
zh_cn: 这只是一个演示，向您展示功能模式的强大功能，如果您确实需要根据书中的标题生成目录，您最好使用“工具”->“目录”中的专用目录工具 。

source: The API for the function mode
nl: De API voor de functie modus
zh_cn: 功能模式的API

source: All function mode functions must be Python functions named replace, with the following signature::
nl: Alle functiemodusfuncties moeten Python-functies zijn met de naam replace en de volgende handtekening:
zh_cn: 所有函数模式函数必须是名为replace的Python函数，具有以下签名：

source: When a find/replace is run, for every match that is found, the ``replace()`` function will be called, it must return the replacement string for that match. If no replacements are to be done, it should return ``match.group()`` which is the original string. The various arguments to the ``replace()`` function are documented below.
nl: Wanneer een zoek-/vervangactie wordt uitgevoerd, wordt voor elke gevonden overeenkomst de functie ``replace()`` aangeroepen, die de vervangende tekenreeks voor die overeenkomst moet retourneren. Als er geen vervangingen moeten worden uitgevoerd, moet deze ``match.group()`` retourneren, wat de oorspronkelijke tekenreeks is. De verschillende argumenten voor de functie ``replace()`` worden hieronder beschreven.
zh_cn: 当运行查找/替换时，对于找到的每个匹配项，将调用“replace()”函数，它必须返回该匹配项的替换字符串。 如果不进行替换，则应返回原始字符串“match.group()”。 下面记录了“replace()”函数的各种参数。

source: The ``match`` argument
nl: Het argument ``match``
zh_cn: “match” 参数

source: The ``match`` argument represents the currently found match. It is a `Python Match object <https://docs.python.org/library/re.html#match-objects>`_. Its most useful method is ``group()`` which can be used to get the matched text corresponding to individual capture groups in the search regular expression.
nl: Het argument ``match`` vertegenwoordigt de momenteel gevonden overeenkomst. Het is een `Python Match-object <https://docs.python.org/library/re.html#match-objects>`_. De meest bruikbare methode is ``group()``, die kan worden gebruikt om de overeenkomende tekst op te halen die overeenkomt met individuele capture-groepen in de reguliere zoekuitdrukking.
zh_cn: “match”参数代表当前找到的匹配。 它是一个`Python Match 对象<https://docs.python.org/library/re.html#match-objects>`_。 它最有用的方法是“group()”，它可用于获取与搜索正则表达式中的各个捕获组相对应的匹配文本。

source: The ``number`` argument
zh_cn: ``number`` 参数

source: The ``number`` argument is the number of the current match. When you run :guilabel:`Replace All`, every successive match will cause ``replace()`` to be called with an increasing number. The first match has number 1.
nl: Het argument ``number`` is het nummer van de huidige overeenkomst. Wanneer u :guilabel:`Replace All` uitvoert, zal elke opeenvolgende overeenkomst ervoor zorgen dat ``replace()`` wordt aangeroepen met een oplopend nummer. De eerste overeenkomst heeft nummer 1.
zh_cn: ``number`` 参数是当前匹配的编号。 当您运行“全部替换”时，每个连续的匹配都会导致以递增的数字调用“replace()”。 第一场比赛的号码为 1。

source: The ``file_name`` argument
nl: Het ``file_name`` argument
zh_cn: “file_name”参数

source: This is the filename of the file in which the current match was found. When searching inside marked text, the ``file_name`` is empty. The ``file_name`` is in canonical form, a path relative to the root of the book, using ``/`` as the path separator.
nl: Dit is de bestandsnaam van het bestand waarin de huidige overeenkomst is gevonden. Bij het zoeken in gemarkeerde tekst is de ``bestandsnaam`` leeg. De ``bestandsnaam`` is in canonieke vorm, een pad ten opzichte van de root van het boek, waarbij ``/`` als padscheidingsteken wordt gebruikt.
zh_cn: 这是找到当前匹配项的文件的文件名。 在标记文本内搜索时，``file_name`` 为空。 “file_name” 是规范形式，是相对于本书根目录的路径，使用“/” 作为路径分隔符。

source: The ``metadata`` argument
nl: Het ``metadata`` argument
zh_cn: “metadata” 参数

source: This represents the metadata of the current book, such as title, authors, language, etc. It is an object of class :class:`calibre.ebooks.metadata.book.base.Metadata`. Useful attributes include, ``title``, ``authors`` (a list of authors) and ``language`` (the language code).
nl: Dit vertegenwoordigt de metadata van het huidige boek, zoals titel, auteurs, taal, enz. Het is een object van klasse :class:`calibre.ebooks.metadata.book.base.Metadata`. Nuttige attributen zijn onder andere ``title``, ``authors`` (een lijst met auteurs) en ``language`` (de taalcode).
zh_cn: 这代表当前书籍的元数据，例如标题、作者、语言等。它是`calibre.ebooks.metadata.book.base.Metadata`类的对象。 有用的属性包括“标题”、“作者”（作者列表）和“语言”（语言代码）。

source: The ``dictionaries`` argument
nl: Het ``dictionaries`` argument
zh_cn: “dictionaries” 参数

source: This represents the collection of dictionaries used for spell checking the current book. Its most useful method is ``dictionaries.recognized(word)`` which will return ``True`` if the passed in word is recognized by the dictionary for the current book's language.
nl: Dit vertegenwoordigt de verzameling woordenboeken die worden gebruikt voor spellingcontrole van het huidige boek. De meest bruikbare methode is ``dictionaries.recognized(word)``, die ``True`` retourneert als het doorgegeven woord wordt herkend door het woordenboek voor de taal van het huidige boek.
zh_cn: 这代表用于对当前书籍进行拼写检查的词典集合。 它最有用的方法是“dictionaries.recognized(word)”，如果传入的单词被当前书籍语言的字典识别，它将返回“True”。

source: The ``data`` argument
nl: Het ``data`` argument
zh_cn: “data” 参数

source: This a simple Python ``dictionary``. When you run :guilabel:`Replace all`, every successive match will cause ``replace()`` to be called with the same ``dictionary`` as data. You can thus use it to store arbitrary data between invocations of ``replace()`` during a :guilabel:`Replace all` operation.
nl: Dit is een eenvoudige Python-woordenlijst. Wanneer u :guilabel:`Alles vervangen` uitvoert, zal elke opeenvolgende overeenkomst ervoor zorgen dat ``replace()`` wordt aangeroepen met dezelfde woordenlijst als gegevens. U kunt dit dus gebruiken om willekeurige gegevens op te slaan tussen aanroepen van ``replace()`` tijdens een :guilabel:`Alles vervangen`-bewerking.
zh_cn: 这是一个简单的 Python“字典”。 当您运行“全部替换”时，每个连续的匹配都会导致使用与数据相同的“字典”来调用“replace()”。 因此，您可以使用它在“全部替换”操作期间调用“replace()”之间存储任意数据。

source: The ``functions`` argument
nl: Het ``functions`` argument
zh_cn: “functions” 参数

source: The ``functions`` argument gives you access to all other user defined functions. This is useful for code re-use. You can define utility functions in one place and re-use them in all your other functions. For example, suppose you create a function name ``My Function`` like this:
nl: Het argument ``functions`` geeft u toegang tot alle andere door de gebruiker gedefinieerde functies. Dit is handig voor het hergebruik van code. U kunt hulpprogrammafuncties op één plek definiëren en ze in al uw andere functies hergebruiken. Stel bijvoorbeeld dat u een functie met de naam ``My Function`` als volgt maakt:
zh_cn: ``functions`` 参数使您可以访问所有其他用户定义的函数。 这对于代码重用很有用。 您可以在一处定义实用函数，然后在所有其他函数中重复使用它们。 例如，假设您创建一个函数名称“My Function”，如下所示：

source: Then, in another function, you can access the ``utility()`` function like this:
nl: Dan, in een andere functie, hebt u toegang tot de ``utility()`` functie, zo:
zh_cn: 然后，在另一个函数中，您可以像这样访问“utility()”函数：

source: You can also use the functions object to store persistent data, that can be re-used by other functions. For example, you could have one function that when run with :guilabel:`Replace All` collects some data and another function that uses it when it is run afterwards. Consider the following two functions:
nl: U kunt het functiesobject ook gebruiken om permanente gegevens op te slaan, die door andere functies opnieuw kunnen worden gebruikt. U kunt bijvoorbeeld één functie hebben die bij uitvoering met :guilabel:`Replace All` bepaalde gegevens verzamelt, en een andere functie die deze gegevens gebruikt wanneer deze daarna wordt uitgevoerd. Bekijk de volgende twee functies eens:
zh_cn: 您还可以使用函数对象来存储持久数据，这些数据可以被其他函数重用。 例如，您可以拥有一个函数，当使用“全部替换”运行时会收集一些数据，而另一个函数则在随后运行时使用这些数据。 考虑以下两个函数：

source: Debugging your functions
nl: Foutzoeken in uw functies
zh_cn: 调试你的函数

source: You can debug the functions you create by using the standard ``print()`` function from Python. The output of print will be displayed in a popup window after the Find/replace has completed. You saw an example of using ``print()`` to output an entire table of contents above.
nl: U kunt de functies die u maakt debuggen met behulp van de standaardfunctie ``print()`` van Python. De uitvoer van print wordt weergegeven in een pop-upvenster nadat het zoeken/vervangen is voltooid. Hierboven zag u een voorbeeld van het gebruik van ``print()`` om een volledige inhoudsopgave weer te geven.
zh_cn: 您可以使用 Python 中的标准“print()”函数来调试您创建的函数。 查找/替换完成后，打印的输出将显示在弹出窗口中。 您在上面看到了使用“print()”输出整个目录的示例。
