Repository: debian-calibre/calibre
Catalog: translations/manual/*/function_mode.po
Languages: nl, zh_cn

source: Choose file order when running on multiple HTML files
nl: Kies bestandsvolgorde bij uitvoeren meerdere HTML bestanden
zh_cn: 在多个 HTML 文件上运行时选择文件顺序

source: When you run a :guilabel:`Replace all` on multiple HTML files, the order in which the files are processes depends on what files you have open for editing. You can force the search to process files in the order in which the appear by setting the ``file_order`` attribute on your function, like this:
nl: Wanneer u een :guilabel:`Replace all` uitvoert op meerdere HTML-bestanden, hangt de volgorde waarin de bestanden worden verwerkt af van welke bestanden u hebt geopend om te bewerken. U kunt ervoor zorgen dat de zoekopdracht bestanden verwerkt in de volgorde waarin ze verschijnen door het attribuut ``file_order`` in te stellen op uw functie, zoals hier:
zh_cn: 当您对多个 HTML 文件运行“全部替换”时，文件的处理顺序取决于您打开进行编辑的文件。 您可以通过在函数上设置“file_order”属性来强制搜索按文件出现的顺序处理文件，如下所示：

source: ``file_order`` accepts two values, ``spine`` and ``spine-reverse`` which cause the search to process multiple files in the order they appear in the book, either forwards or backwards, respectively.
nl: ``file_order`` accepteert twee waarden, ``spine`` en ``spine-reverse``, waardoor de zoekopdracht meerdere bestanden verwerkt in de volgorde waarin ze in het boek voorkomen, respectievelijk voorwaarts of achterwaarts.
zh_cn: ``file_order`` 接受两个值，``spine`` 和 ``spine-reverse`` ，这两个值会导致搜索按照文件在书中出现的顺序（分别向前或向后）处理多个文件。

source: Having your function called an extra time after the last match is found
nl: Je functie wordt nog een keer aangeroepen nadat de laatste wedstrijd is gevonden.
zh_cn: 在找到最后一个匹配项后额外调用您的函数

source: Sometimes, as in the auto generate table of contents example above, it is useful to have your function called an extra time after the last match is found. You can do this by setting the ``call_after_last_match`` attribute on your function, like this:
nl: Soms, zoals in het voorbeeld van het automatisch genereren van een inhoudsopgave hierboven, is het handig om uw functie nog een keer aan te roepen nadat de laatste overeenkomst is gevonden. U kunt dit doen door het attribuut ``call_after_last_match`` in te stellen op uw functie, zoals hier:
zh_cn: 有时，如上面的自动生成目录示例所示，在找到最后一个匹配项后额外调用函数会很有用。 您可以通过在函数上设置“call_after_last_match”属性来做到这一点，如下所示：

source: Appending the output from the function to marked text
nl: De uitvoer van de functie toevoegen aan gemarkeerde tekst
zh_cn: 将函数的输出附加到标记的文本

source: When running search and replace on marked text, it is sometimes useful to append so text to the end of the marked text. You can do that by setting the ``append_final_output_to_marked`` attribute on your function (note that you also need to set ``call_after_last_match``), like this:
nl: Wanneer u zoeken en vervangen uitvoert op gemarkeerde tekst, is het soms handig om tekst toe te voegen aan het einde van de gemarkeerde tekst. U kunt dat doen door het kenmerk ``append_final_output_to_marked`` in te stellen op uw functie (let op: u moet ook ``call_after_last_match`` instellen), zoals hier:
zh_cn: 在标记文本上运行搜索和替换时，有时将文本附加到标记文本的末尾很有用。 您可以通过在函数上设置“append_final_output_to_marked”属性来做到这一点（请注意，您还需要设置“call_after_last_match”），如下所示：

source: Suppressing the result dialog when performing searches on marked text
nl: Het resultaatvenster onderdrukken bij het zoeken in gemarkeerde tekst
zh_cn: 对标记文本执行搜索时禁止显示结果对话框

source: You can also suppress the result dialog (which can slow down the repeated application of a search/replace on many blocks of text) by setting the ``suppress_result_dialog`` attribute on your function, like this:
nl: U kunt ook het resultatendialoogvenster onderdrukken (wat het herhaaldelijk toepassen van een zoek-/vervangactie op veel tekstblokken kan vertragen) door het kenmerk ``suppress_result_dialog`` in uw functie in te stellen, zoals hier:
zh_cn: 您还可以通过在函数上设置“suppress_result_dialog”属性来抑制结果对话框（这会减慢在许多文本块上重复应用搜索/替换的速度），如下所示：

source: More examples
nl: Meer voorbeelden
zh_cn: 更多示例

source: More useful examples, contributed by calibre users, can be found in the `calibre E-book editor forum <https://www.mobileread.com/forums/showthread.php?t=237181>`_.
nl: Meer nuttige voorbeelden, aangeleverd door Calibre-gebruikers, zijn te vinden op het `Calibre E-book editor forum <https://www.mobileread.com/forums/showthread.php?t=237181>`_.
zh_cn: 由 calibre 用户贡献的更多有用示例可以在 `calibre 电子书编辑器论坛 <https://www.mobileread.com/forums/showthread.php?t=237181>`_ 中找到。

source: For the function, simply choose the :guilabel:`Title-case text (ignore tags)` builtin function. The will change titles that look like: ``<h1>some titLE</h1>`` to ``<h1>Some Title</h1>``. It will work even if there are other HTML tags inside the heading tags.
nl: Voor de functie kiest u gewoon de ingebouwde functie :guilabel:`Titeltekst (tags negeren)`. Deze functie verandert titels die er als volgt uitzien: ``<h1>some titLE</h1>`` in ``<h1>Some Title</h1>``. Dit werkt zelfs als er andere HTML-tags in de kopteksttags staan.
