Repository: debian-calibre/calibre
Catalog: translations/manual/*/index.po
Languages: hu

source: calibre User Manual
hu: calibre felhsználói kéziköny

source: calibre is an ebook library manager. It can view, convert and catalog ebooks in most of the major ebook formats. It can also talk to many ebook reader devices. It can go out to the Internet and fetch metadata for your books. It can download newspapers and convert them into ebooks for convenient reading. It is cross platform, running on Linux, Windows and OS X.
hu: calibre egy ekönyv könyvtár kezező szoftver, segítségével megjeleníthető, konvertálható és katalogizálható a legtöbb ekönyv formátum. Rengeteg ekönyv olvasóval képes kommunikálni. Le tud tölteni metaadatokat az internetről a ekönyveihez. Újságokat is le tud töleni az internetről és ekönyv formátumba konvertálni a kényelmes olvasáshoz. Elérhető Windows, Linux és OS X operációs rendszerekhez.

source: You've just started calibre. What do you do now? Before calibre can do anything with your ebooks, it first has to know about them. Drag and drop a few ebook files into calibre, or click the "Add books" button and browse for the ebooks you want to work with. Once you've added the books, they will show up in the main view looking something like this:
hu: Ön most indította el először a calibret. Mégis mit csináljon most? Mielőtt calibre bármit tudna kezdeni az ön ekönyveivel tudnia kell róluk. Húzza az ekönyveket a calibre ablakába vagy kattintson a "Könyvek hozzáadása" gonbra és válassza ki azokat az ekönyveket, amelyek a cailbreval szeretne kezelni. Hozzáadás utána a könyvek megjelennek calibre ablakában, valahogy így:

source: Once you've admired the list of books you just added to your heart's content, you'll probably want to read one. In order to do that you'll have to convert the book to a format your reader understands. When first running calibre, the Welcome Wizard starts and will set up calibre for your reader device. Conversion is a breeze. Just select the book you want to convert then click the "Convert books" button. Ignore all the options for now and click "OK". The little icon in the bottom right corner will start spinning. Once it's finished spinning, your converted book is ready. Click the "View" button to read the book.
hu: Ha a frissen hozzáadott könyvek listájának nézegetését megunta, akkor valószínüleg el szeretne olvasni egyet. Ahhoz hogy ezt meg tudja tenni, az ekönyvet először olyan formátumba kell konvertálnia, amelyet az ekönyv-olvasója megért. Amikor először futtatja calibre az "Üdvözlő varázsló" elindul és beállítja calibre az ön ekönyv-olvasójának megfelelően. A konvertálás rendkívül egyszerű, csak válassza ki a könyvet és kattintson a "Könyvek konvertálása" gombra. Egyenlőre ne foglakozzon a különböző beállítási lehetőségekkel és kattintson az "OK" gombra. A jobb alsó sarokban lévő kis ikonka elkezd forogni, ha abbahagyja akkor a könyvek konvertálása befejeződött. Kattintson a "Megtekintés" gombra a könyv olvasásához.

source: If you want to read the book on your reader, connect it to the computer, wait till calibre detects it (10-20 seconds) and then click the "Send to device" button. Once the icon stops spinning again, disconnect your reader and read away! If you didn't convert the book in the previous step, calibre will auto convert it to the format your reader device understands.
hu: Ha a könyvet egy ekönyv-olvasón kívánja olvasni, csatlakoztassa az eszközt a számítógéphez és várjon amíg calibre felismeri (általában 10-20 másodperc), majd kattintson a "Ekönyv-olvasóra küldés" gombra. Ha a gomb befejezte a forgást, akkor a fájlküldés sikeres, az ekönyv-olvasót lehúzhatja a számítógépről és máris kezdhet olvasni! Ha az előző lépésben nem konvertálta át az ekönyvet a olyan formátumba, amely kompatibilis az ön ekönyv-olvasójáva, akkor calibre ezt automatikusan megteszi.

source: To get started with more advanced usage, you should read about :doc:`gui`. For even more power and versatility, learn the :doc:`generated/en/cli-index`. You will find the list of :doc:`faq` useful as well.
hu: A hozzáértő mód használatának megkezdéséhez javasoljuk először olvasson többet a:doc:`gui`-ról. Még több funkció és lehetőség eléréséhez sajátítsa el a :doc:`generated/hu/cli-index` részt. A :doc:`faq` tartalmát is hasznosnak fogja tartani.

source: **An ebook version of this user manual is available in** `EPUB format <calibre.epub>`_, `AZW3 (Kindle Fire) format <calibre.azw3>`_ and `PDF format <calibre.pdf>`_.
hu: A felhasználói kézikönyv elérhető ekönyv formátumban is. EPUB formátum <calibre.epub>`_, `AZW3 (Kindle Fire) formátum <calibre.azw3>`_ és `PDF formátum <calibre.pdf>`_.

source: Sections
hu: Szakaszok

source: The main calibre user interface
hu: calibre központi felhasználói felülete

source: Adding your favorite news website to calibre
hu: Kedvenc híroldalának hozzádasa calibrehez

source: The calibre ebook viewer
hu: calibre ekönyv-olvasó

source: Customizing calibre's ebook conversion
hu: calibre ekönyv konvertálójának testreszabása

source: Editing ebooks
hu: Ekönyvek szerkesztése

source: Comparing ebooks
hu: Ekönyvek összehasonlítása

source: Editing ebook metadata
hu: Ekönyv metaadaok szerkesztése

source: Frequently Asked Questions
hu: Gyakran ismételt kérdések

source: Tutorials
hu: Bemutató

source: Customizing calibre
hu: calibre testreszabása

source: The Command Line Interface
hu: A parancssor-i felület

source: Setting up a calibre development environment
hu: calibre fejlesztői környezet beállítása
