Repository: debian-calibre/calibre
Catalog: translations/manual/*/regexp_quick_reference.po
Languages: ar, cs, it, nl, ta

source: The slash (/) and the number sign (or hash character) (#) are not meta-characters, they don’t need to be escaped.
ar: الشرطة المائلة (/) وعلامة الرقم (أو حرف الهاش) (#) ليست أحرفًا وصفية، لا تحتاج إلى أن يتم الهروب منها.
cs: Lomítko (/) a křížek (nebo znak hash) (#) nejsou metaznaky, nemusejí mít řídící znak.
it: La barra (/) e il cancelletto (o hashtag) (#) non sono metacaratteri, non hanno bisogno del carattere di escape.
nl: De slash (/) en het hekje (of kardinaalteken) (#) zijn geen meta-karakters, zij moeten niet voorafgegaan worden door een escape karakter.
ta: ஸ்லாஷ் (/) மற்றும் எண் அடையாளம் (அல்லது ஹாஷ் எழுத்து) (#) மெட்டா-கதாபாத்திரங்கள் அல்ல, அவை தப்பிக்க தேவையில்லை.

source: In some tools, like regex101.com with the Python engine, double quotes have the special status of separator, and must be escaped, or the options changed. This is not the case in the editor of calibre.
ar: في بعض الأدوات، مثل regex101.com مع محرك Python، تتمتع علامات الاقتباس المزدوجة بحالة خاصة كفاصل، ويجب الهروب منها، أو تغيير الخيارات. هذا ليس هو الحال في محرر calibre.
cs: V některých nástrojích, jako je například regex101.com s modulem Python, mají dvojité uvozovky zvláštní status oddělovače a musí mít řídící znak, nebo se možnosti změní. Toto není případ editoru Calibre.
it: In alcuni strumenti, come regex101.com con il motore Python, le virgolette doppie hanno lo stato speciale di separatore e devono essere precedute dal carattere di escape, oppure vanno cambiate le opzioni. Così non è nell'editor di calibre.
nl: In sommige tools, zoals regex101.com in de Python engine, hebben dubbele aanhalingstekens de speciale status van scheidingsteken, en moeten voorafgegaan worden door een escape teken, of de opties moeten aangepast worden. Dit is niet het geval in de calibre editor.
ta: சில கருவிகளில், பைதான் எஞ்சினுடன் Regex101.com போன்றவை, இரட்டை மேற்கோள்கள் பிரிப்பானின் சிறப்பு நிலையைக் கொண்டுள்ளன, மேலும் அவை தப்பிக்கப்பட வேண்டும், அல்லது விருப்பங்கள் மாற்றப்பட வேண்டும். காலிபரின் ஆசிரியரில் இது அப்படி இல்லை.

source: Modes
ar: الأوضاع
cs: Režimy
it: Modalità
ta: முறைகள்

source: ``(?s)``
ta: `` (? கள்) ``

source: Causes the dot (``.``) to match newline characters as well
ar: يجعل النقطة (``.``) تطابق أحرف السطر الجديد أيضًا
cs: Způsobí, že tečka (``.``) bude odpovídat také znakům nového řádku
it: Fa in modo che il punto (``.``) trovi anche i caratteri newline
nl: Zorgt ervoor dat het punt (``.``) ook met nieuwe lijn karakters overeenkomt
ta: டாட் (`` .``) நியூலைன் எழுத்துக்களையும் பொருத்த காரணமாகிறது

source: ``(?m)``
ta: `` (? மீ) ``

source: Makes the ``^`` and ``$`` anchors match the start and end of lines instead of the start and end of the entire string.
ar: يجعل علامتي ``^`` و ``$`` تطابقان بداية ونهاية الأسطر بدلاً من بداية ونهاية السلسلة بأكملها.
cs: Učiní, že kotvy ``^`` a ``$`` budou odpovídat začátku a konci řádků namísto začátku a konce celého řetězce.
it: Fa in modo che gli ancoraggi ``^`` e ``$`` trovino l'inizio e la fine delle righe invece dell'inizio e della fine dell'intera stringa.
nl: Laat de ``^`` en ``$`` ankers overeenkomen met het begin en einde van regels ipv het begin en einde van de hele string.
ta: ``^`` மற்றும் `` `` `நங்கூரங்கள் முழு சரத்தின் தொடக்கத்திற்கும் முடிவிற்கும் பதிலாக வரிகளின் தொடக்கத்தையும் முடிவையும் பொருத்துகின்றன.

source: This checklist summarizes the most commonly used/hard to remember parts of the regexp engine available in the calibre edit and conversion search/replace features. Note that this engine is more powerful than the basic regexp engine used throughout the rest of calibre.
cs: Tento kontrolní seznam shrnuje nejčastěji používané nebo těžko zapamatovatelné části modulu regulárních výrazů, které jsou k dostupné ve funkcích Calibre pro úpravy, převod a hledání a nahrazování. Pamatujte, že tento modul je výkonnější než základní modul regulárních výrazů používaný ve zbytku Calibre.

source: ``pattern_to_exclude\K|(pattern_to_select)``
cs: ``vzor_k_vyloučení\K|(vzor_k_vybrání)``
it: ``schema_da_escludere\K|(schema_da_selezionare)``
