Repository: debian-calibre/calibre
Catalog: translations/manual/*/regexp_quick_reference.po
Languages: ar, cs, it, nl, ta

source: Group that does not capture the selection
ar: مجموعة لا تلتقط التحديد
cs: Skupina, která nezachytí výběr
it: Gruppo che non cattura la selezione
nl: Groep die de selectie niet vangt
ta: தேர்வைக் கைப்பற்றாத குழு

source: ``(?>expression)``
cs: ``(?>výraz)``
it: ``(?>espressione)``
ta: `` (?> வெளிப்பாடு) ``

source: Atomic Group: As soon as the expression is satisfied, the regexp engine passes, and if the rest of the pattern fails, it will not backtrack to try other combinations with the expression. Atomic groups do not capture.
ar: مجموعة ذرية: بمجرد استيفاء التعبير، يمر محرك التعبير العادي، وإذا فشل بقية النمط، فلن يتراجع لمحاولة مجموعات أخرى مع التعبير. المجموعات الذرية لا تلتقط.
cs: Atomická skupina: Jakmile je výraz splněn, modul regulárních výrazů ji předá. A pokud zbytek vzoru selže, nebude se snažit vyzkoušet jiné kombinace s výrazem. Atomické skupiny nezachycují.
it: Gruppo Atomico: Non appena l'espressione è soddisfatta, il motore regex prosegue, e se il resto dello schema fallisce, non tornerà indietro per provare altre combinazioni con l'espressione. I gruppi atomici non sono di cattura.
nl: Atomic Group: Zo gauw aan de uitdrukking voldaan is, geeft de regexp engine door, en als de rest van het patroon faalt, zal hij niet terug gaan om andere combinaties met de uitdrukking te proberen. Atomic groepen vangen niet.
ta: அணு குழு: வெளிப்பாடு திருப்தி அடைந்தவுடன், REGEXP இயந்திரம் கடந்து செல்கிறது, மீதமுள்ள முறை தோல்வியுற்றால், வெளிப்பாட்டுடன் மற்ற சேர்க்கைகளை முயற்சிக்க இது பின்வாங்காது. அணு குழுக்கள் பிடிக்கவில்லை.

source: ``(?|expression)``
cs: ``(?|výraz)``
it: ``(?|espressione)``
ta: `` (? | வெளிப்பாடு) ``

source: Branch reset group: the branches of the alternations included in the expression share the same group numbers
ar: مجموعة إعادة تعيين الفرع: فروع التبديلات المضمنة في التعبير تشترك في نفس أرقام المجموعة.
cs: Skupina obnovení větve: Větve alternativ zahrnutých ve výrazu sdílejí stejná čísla skupin
it: Gruppo branch reset: i rami (branches) delle alternative incluse nell'espressione condividono gli stessi numeri di gruppo
nl: Branch reset groep: de branches van de alternaties inbegrepen in de uitdrukking delen dezelfde groep nummers
ta: கிளை மீட்டமைப்புக் குழு: வெளிப்பாட்டில் சேர்க்கப்பட்ட மாற்றங்களின் கிளைகள் ஒரே குழு எண்களைப் பகிர்ந்து கொள்ளுங்கள்

source: ``(?<name>expression)``
cs: ``(?<name>výraz)``
it: ``(?<nome>espressione)``
ta: `` (? <பெயர்> வெளிப்பாடு) ``

source: Group named “name”. The selection can be recalled later in the *search* pattern by ``(?P=name)`` and in the *replace* by ``\g<name>``. Two different groups can use the same name.
ar: مجموعة مسماة "name". يمكن استدعاء التحديد لاحقًا في نمط *البحث* بواسطة ``(?P=name)`` وفي *الاستبدال* بواسطة ``\g<name>``. يمكن لمجموعتين مختلفتين استخدام نفس الاسم.
cs: Skupina s názvem „name“: Výběr lze později vyvolat ve vzorci *search* pomocí výrazu ``(?P=name)`` a ve vzorci *replace* výrazem ``\g``. Dvě různé skupiny mohou používat stejný název.
it: Gruppo chiamato “nome”. La selezione può essere richiamata in seguito nell'espressione *cerca* con ``(?P=nome)`` e in quella *sostituisci* con ``\g<nome>``. Due gruppi diversi possono usare lo stesso nome.
nl: Groep "naam" genoemd. De selectie kan later terug opgeroepen worden in het *zoek* patroon door ``(?P=name)`` en in de *vervang* door ``\g<name>``. Twee verschillende groepen kunnen dezelfde naam gebruiken.
ta: “பெயர்” என்ற குழு. தேர்வை பின்னர் * தேடல் * வடிவத்தில் `` (? P = பெயர்) `` மற்றும் * மாற்றத்தில் * `\ g <amane>` `மூலம் நினைவுபடுத்தலாம். இரண்டு வெவ்வேறு குழுக்கள் ஒரே பெயரைப் பயன்படுத்தலாம்.

source: Lookarounds
ar: نظرة سريعة
cs: Prohledávání
it: Lookaround
ta: தேடல்கள்

source: **Lookaround**
ar: **نظرة سريعة**
cs: **Prohledávání**
ta: ** தேடல் **

source: **Meaning**
ar: **المعنى**
cs: **Význam**
it: **Significato**
ta: ** பொருள் **

source: Positive lookahead (to be placed after the selection)
ar: بحث أمامي إيجابي (يوضع بعد التحديد)
cs: Pozitivní hledání vpřed (bude umístěno za výběr)
it: Lookahead positivo (da inserire dopo la selezione)
nl: Positieve lookahead (na de selectie te plaatsen)
ta: நேர்மறையான பார்வை (தேர்வுக்குப் பிறகு வைக்கப்பட வேண்டும்)

source: Negative lookahead (to be placed after the selection)
ar: بحث أمامي سلبي (يوضع بعد التحديد)
cs: Negativní hledání vpřed (bude umístěno za výběr)
it: Lookahead negativo (da inserire dopo la selezione)
nl: Negatieve lookahead (na de selectie te plaatsen)
ta: எதிர்மறை லுக்காஹெட் (தேர்வுக்குப் பிறகு வைக்கப்பட வேண்டும்)

source: Positive lookbehind (to be placed before the selection)
ar: بحث خلفي إيجابي (يوضع قبل التحديد)
cs: Pozitivní hledání zpět (bude umístěno před výběr)
it: Lookbehind positivo (da inserire prima della selezione)
nl: Positieve lookbehind (voor de selectie te plaatsen)
ta: நேர்மறை தேடல் (தேர்வுக்கு முன் வைக்கப்பட வேண்டும்)

source: Negative lookbehind (to be placed before the selection)
ar: بحث خلفي سلبي (يوضع قبل التحديد)
cs: Negativní hledání zpět (bude umístěno před výběr)
it: Lookbehind negativo (da inserire prima della selezione)
nl: Negatieve lookbehind (voor de selectie te plaatsen)
ta: எதிர்மறை தேடல் (தேர்வுக்கு முன் வைக்கப்பட வேண்டும்)

source: Lookaheads and lookbehinds do not consume characters, they are zero length and do not capture. They are atomic groups: as soon as the assertion is satisfied, the regexp engine passes, and if the rest of the pattern fails, it will not backtrack inside the lookaround to try other combinations.
ar: البحث الأمامي والخلفي لا يستهلكان الأحرف، فهما ذو طول صفري ولا يلتقطان. إنهما مجموعات ذرية: بمجرد استيفاء التأكيد، يمر محرك التعبير العادي، وإذا فشل بقية النمط، فلن يتراجع داخل البحث الأمامي أو الخلفي لمحاولة مجموعات أخرى.
cs: Hledání vpřed a zpět nespotřebovávají znaky, jsou nulové délky a nezachycují. Jsou to atomické skupiny: jakmile je tvrzení splněno, modul regulárních výrazů ho předá, a pokud zbytek vzoru selže, nebude se vracet zpět do prohledávání, aby vyzkoušel jiné kombinace.
it: I lookahead e i lookbehind non consumano caratteri, hanno lunghezza zero e non catturano. Sono gruppi atomici: non appena l'asserzione è soddisfatta, il motore regex prosegue, e se il resto dello schema fallisce, non tornerà indietro all'interno del lookaround per provare altre combinazioni.
nl: Lookaheads en lookbehinds verbruiken geen karakters, ze hebben zero lengte en vangen niet. Het zijn atomic groepen: zo gauw aan de stelling voldaan is, geeft de regexp engine door, en als de rest van het patroon faalt, zal hij niet terug gaan in de lookaround om andere combinaties te proberen.
ta: லுக்காஹெட்ஸ் மற்றும் லுக்ஸ்பைண்ட்ஸ் கதாபாத்திரங்களை உட்கொள்ளாது, அவை பூஜ்ஜிய நீளம் மற்றும் பிடிக்காது. அவை அணுக் குழுக்கள்: கூற்று திருப்தி அடைந்தவுடன், ரீஜெக்ஸ்ப் எஞ்சின் கடந்து செல்கிறது, மீதமுள்ள முறை தோல்வியுற்றால், மற்ற சேர்க்கைகளை முயற்சிக்க இது தேடலுக்குள் பின்வாங்காது.

source: When looking for multiple matches in a string, at the starting position of each match attempt, a lookbehind can inspect the characters before the current position. Therefore, on the string 123, the pattern ``(?<=\d)\d`` (a digit preceded by a digit) should, in theory, select 2 and 3. On the other hand, ``\d\K\d`` can only select 2, because the starting position after the first selection is immediately before 3, and there are not enough digits for a second match. Similarly, ``\d(\d)`` only captures 2. In calibre's regexp engine practice, the positive lookbehind behaves in the same way, and selects only 2, contrary to theory.
ar: عند البحث عن تطابقات متعددة في سلسلة، عند موضع بداية كل محاولة مطابقة، يمكن للبحث الخلفي فحص الأحرف قبل الموضع الحالي. لذلك، على السلسلة 123، يجب أن يختار النمط ``(?<=\d)\d`` (رقم مسبوق برقم)، نظريًا، 2 و 3. من ناحية أخرى، يمكن لـ ``\d\K\d`` اختيار 2 فقط، لأن موضع البداية بعد التحديد الأول هو مباشرة قبل 3، ولا توجد أرقام كافية لمطابقة ثانية. وبالمثل، فإن ``\d(\d)`` يلتقط 2 فقط. في ممارسة محرك التعبير العادي في calibre، يتصرف البحث الخلفي الإيجابي بنفس الطريقة، ويختار 2 فقط، على عكس النظرية.
cs: Při hledání více shod v řetězci, v počáteční pozici každého pokusu o shodu, může hledání zpět zkontrolovat znaky před aktuální pozicí. Proto v řetězci 123 by měl vzor ``(?<=\d)\d`` (číslice předcházející číslici) teoreticky vybrat 2 a 3. Na druhou stranu ``\d\K\d`` může vybrat pouze 2, protože počáteční pozice po prvním výběru je bezprostředně před 3 a pro druhou shodu zde není dostatek číslic. Podobně ``\d(\d)`` zachytí pouze 2. V modulu regulárních výrazů Calibre se pozitivní hledání zpět chová stejně a vybere pouze 2, na rozdíl od teorie.
it: Quando si cercano più corrispondenze in una stringa, alla posizione di partenza di ogni tentativo di corrispondenza, un lookbehind può esaminare i caratteri precedenti la posizione corrente. Di conseguenza, nella stringa 123, lo schema ``(?<=\d)\d`` (una cifra preceduta da una cifra) dovrebbe in teoria selezionare 2 e 3. D'altra parte ``\d\K\d`` può solo selezionare 2, perché la posizione di partenza dopo la prima selezione si trova immediatamente prima del 3, e non ci sono abbastanza cifre per una seconda corrispondenza. Similmente, ``\d(\d)`` cattura solo 2. Nella pratica del motore regex di calibre, il lookbehind positivo si comporta allo stesso modo, e seleziona solo 2, contrariamente alla teoria.
nl: Bij het zoeken naar meerdere overeenkomsten in een string, kan een lookbehind, bij de startpositie van elke poging, de karakters inspecteren voor de huidige positie. Dus, in de string 123, het patroon ``(?<=\d)\d`` (een cijfer voorafgegaan door een cijfer) zou, in theorie, 2 en 3 moeten kiezen. Anderzijds, ``\d\K\d`` kan enkel 2 kiezen omdat de startpositie na de eerste selectie onmiddellijk voor 3 is en er niet genoeg cijfers zijn voor een tweede overeenkomst. Gelijkaardig, ``\d(\d)`` vangt enkel 2. In calibre's regexp engine praktijk gedraagt de positieve lookbehind zich op dezelfde manier en kiest enkel 2, in tegenstelling tot de theorie.
ta: ஒரு சரத்தில் பல போட்டிகளைத் தேடும்போது, ஒவ்வொரு போட்டி முயற்சியின் தொடக்க நிலையிலும், ஒரு தேடல் தற்போதைய நிலைக்கு முன் எழுத்துக்களை ஆய்வு செய்யலாம். ஆகையால், சரம் 123 இல், `` (? <= \ D) \ d`` (ஒரு இலக்கத்திற்கு முந்தைய ஒரு இலக்க), கோட்பாட்டில், 2 மற்றும் 3 ஐத் தேர்ந்தெடுக்க வேண்டும். `` \ D \ K \ d`` \ ஐ மட்டுமே தேர்ந்தெடுக்க முடியும், ஏனென்றால் முதல் தேர்வுக்குப் பிறகு தொடக்க நிலை 3 க்கு முன்பே உள்ளது, மேலும் இரண்டாவது போட்டிக்கு போதுமான இலக்கங்கள் இல்லை. இதேபோல், `` \ d (\ d) `` `2 ஐ மட்டுமே பிடிக்கிறது 2. காலிபரின் ரெஜெக்ஸ் எஞ்சின் நடைமுறையில், நேர்மறையான தேடல் ஒரே வழியில் செயல்படுகிறது, மேலும் கோட்பாட்டிற்கு மாறாக 2 ஐ மட்டுமே தேர்ந்தெடுக்கிறது.

source: Groups can be placed inside lookarounds, but capture is rarely useful. Nevertheless, if it is useful, it will be necessary to be very careful in the use of a quantifier in a lookbehind: the greed associated with the absence of backtracking can give a surprising capture. For this reason, use ``\K`` rather than a positive lookbehind when you have a quantifier (or worse, several) in a capturing group of the positive lookbehind.
ar: يمكن وضع المجموعات داخل عمليات البحث، ولكن الالتقاط نادرًا ما يكون مفيدًا. ومع ذلك، إذا كان مفيدًا، فسيكون من الضروري توخي الحذر الشديد في استخدام محدد كمي في البحث الخلفي: الجشع المرتبط بـ غياب التراجع يمكن أن يعطي التقاطًا مفاجئًا. لهذا السبب، استخدم ``\K`` بدلاً من البحث الخلفي الإيجابي عندما يكون لديك محدد كمي (أو أسوأ من ذلك، عدة) في مجموعة التقاط للبحث الخلفي الإيجابي.
cs: Skupiny mohou být umístěny uvnitř prohledávání, ale zachytávání je zřídka užitečné. Pokud je to přesto užitečné, bude muset být při používání kvantifikátoru v hledání zpět velmi opatrní: chamtivost spojená s absencí zpětného dozoru může poskytovat překvapující zachytávání. Z tohoto důvodu použijte spíše ``\K`` než pozitivní hledání zpět, když máte v zachytávací skupině pozitivního hledání zpět kvantifikátor (nebo ještě hůře několik).
it: I gruppi possono essere inseriti all'interno dei lookaround, ma la cattura è raramente utile. Cionondiméno, se necessaria, bisognerà fare molta attenzione nell'uso di un quantificatore in un lookbehind: la voracità associata al non tornare indietro puo dare una cattura sorprendente. Per questa ragione, usa ``\K`` piuttosto che un lookbehind positivo quando hai un quantificatore (o peggio, più di uno) in un gruppo di cattura del lookbehind positivo.
nl: Groepen kunnen in lookarounds geplaatst worden, maar vangen is zelden bruikbaar. Niettegenstaande, als het bruikbaar is, is het nodig om zeer zorgvuldig te zijn in het gebruik van een quantifier in een lookbehind: de hebzucht die komt met de afwezigheid van backtracking kan een verrassende vangst geven. Hierom, gebruik eerder ``\K`` dan een positieve lookbehind als je een quantifier hebt (of erger, meerdere) in een vang groep van de positieve lookbehind.
ta: குழுக்கள் தோற்றங்களுக்குள் வைக்கப்படலாம், ஆனால் பிடிப்பு அரிதாகவே பயனுள்ளதாக இருக்கும். ஆயினும்கூட, இது பயனுள்ளதாக இருந்தால், ஒரு தேடலில் ஒரு அளவுகோலைப் பயன்படுத்துவதில் மிகவும் கவனமாக இருப்பது அவசியமாக இருக்கும்: பின்வாங்காததால் தொடர்புடைய பேராசை ஒரு ஆச்சரியமான பிடிப்பைக் கொடுக்கும். இந்த காரணத்திற்காக, நேர்மறையான தேடலின் ஒரு குழுவில் நீங்கள் ஒரு அளவுகோலைக் கொண்டிருக்கும்போது (அல்லது மோசமான, பல) நேர்மறையான தேடலைக் காட்டிலும் `` \ k`` ஐப் பயன்படுத்தவும்.

source: Example of negative lookahead:
ar: مثال على البحث الأمامي السلبي:
cs: Příklad negativního hledání vpřed:
it: Esempio di lookahead negativo:
nl: Voorbeeld van een negatieve lookahead:
ta: எதிர்மறை தோற்றத்தின் எடுத்துக்காட்டு:

source: Placed at the end of the pattern prevents to select within a tag or a style embedded in the file.
ar: يوضع في نهاية النمط لمنع التحديد داخل علامة أو نمط مضمن في الملف.
cs: Umístění na konci vzoru zabraňuje výběru uvnitř značky nebo stylu vloženého do souboru.
it: Inserito alla fine dell'espressione impedisce la selezione dentro un tag o uno stile incorporato nel file.
nl: Voorkomt het selecteren binnenin een tag of stijl in een bestand indien aan het einde van het patroon geplaatst.
ta: வடிவத்தின் முடிவில் வைக்கப்படுவது ஒரு குறிச்சொல்லுக்குள் அல்லது கோப்பில் பதிக்கப்பட்ட பாணிக்குள் தேர்ந்தெடுப்பதைத் தடுக்கிறது.

source: Whenever possible, it is always better to "anchor" the lookarounds, to reduce the number of steps necessary to obtain the result.
ar: كلما أمكن، من الأفضل دائمًا "تثبيت" البحث، لتقليل عدد الخطوات اللازمة للحصول على النتيجة.
cs: Kdykoliv je to možné, je vždy lepší vyhledávání „ukotvit“, aby se snížil počet kroků nezbytných k dosažení výsledku.
it: Quando possibile, è sempre meglio "ancorare" i lookaround, per ridurre il numero di passi necessari ad ottenere il risultato.
nl: Wanneer mogelijk, is het altijd beter om de lookarounds the 'ankeren", om het aantal stappen om het resultaat te verkrijgen, te verkleinen.
ta: முடிந்த போதெல்லாம், தோற்றங்களை "நங்கூரமிடுவது", முடிவைப் பெறுவதற்குத் தேவையான படிகளின் எண்ணிக்கையை குறைக்க எப்போதும் நல்லது.

source: Recursion
ar: الاستدعاء الذاتي
cs: Rekurze
it: Ricorsività
nl: Recursie
ta: மறுநிகழ்வு

source: Recursion of the entire pattern
ar: الاستدعاء الذاتي للنمط بأكمله
cs: Rekurze celého vzoru
it: Ricorsività dell'intero schema
nl: Recursie van het gehele patroon
ta: முழு வடிவத்தின் மறுநிகழ்வு

source: Recursion of the only pattern of the numbered capturing group, here group 1
ar: الاستدعاء الذاتي للنمط الوحيد لمجموعة الالتقاط المرقمة، هنا المجموعة 1
cs: Rekurze jediného vzoru číslované zachytávací skupiny, zde skupina 1
it: Ricorsività solamente dello schema del gruppo di cattura numerato, qui il gruppo 1
nl: Recursie van het enige patroon van de genummerde vang groep, hier groep 1
ta: எண்ணப்பட்ட கைப்பற்றும் குழுவின் ஒரே வடிவத்தின் மறுநிகழ்வு, இங்கே குழு 1

source: Recursion is calling oneself. This is useful for balanced queries, such as quoted strings, which can contain embedded quoted strings. Thus, if during the processing of a string between double quotation marks, we encounter the beginning of a new string between double quotation marks, well we know how to do, and we call ourselves. Then we have a pattern like::
ar: الاستدعاء الذاتي هو استدعاء الذات. هذا مفيد للاستعلامات المتوازنة، مثل السلاسل المقتبسة، والتي يمكن أن تحتوي على سلاسل مقتبسة مضمنة. وبالتالي، إذا واجهنا أثناء معالجة سلسلة بين علامتي اقتباس مزدوجتين، بداية سلسلة جديدة بين علامتي اقتباس مزدوجتين، فنحن نعرف كيف نفعل ذلك، ونستدعي أنفسنا. ثم يكون لدينا نمط مثل::
cs: Rekurze je vyvolání sebe sama. To je užitečné pro vyvážené dotazy, jako jsou řetězce v uvozovkách, které mohou obsahovat vložené řetězce v uvozovkách. Pokud tedy během zpracování řetězce mezi uvozovkami narazíme na začátek nového řetězce mezi uvozovkami, dobře víme, jak to udělat, a vyvoláme sebe sama. Pak máme podobný vzor::
it: Ricorsività qui significa invocare se stessi. Ciò è utile per richieste equilibrate, come le stringhe tra virgolette, che possono avere incorporate stringhe tra virgolette. Quindi, se durante l'elaborazione di una stringa tra virgolette doppie incontriamo l'inizio di una nuova stringa compresa tra due virgolette doppie, sappiamo cosa fare, e invochiamo noi stessi. E abbiamo uno schema di questo tipo::
nl: Recursie is zichzelf roepen. Dit is nuttig voor gebalanceerde queries, zoals quoted strings, die binnenin quoted strings kunnen bevatten. Dus, als tijdens het verwerken van een string tussen dubbele aanhalingstekens, we het begin van een andere string tussen dubbele aanhalingstekens tegen komen, weten we wat te doen en we roepen onszelf. Dan hebben we een patroon zoals::
ta: மறுநிகழ்வு தன்னை அழைக்கிறது. மேற்கோள் காட்டப்பட்ட சரங்கள் போன்ற சீரான வினவல்களுக்கு இது பயனுள்ளதாக இருக்கும், அதில் உட்பொதிக்கப்பட்ட மேற்கோள் சரங்கள் இருக்கலாம். ஆகவே, இரட்டை மேற்கோள் மதிப்பெண்களுக்கு இடையில் ஒரு சரத்தின் செயலாக்கத்தின் போது, இரட்டை மேற்கோள் மதிப்பெண்களுக்கு இடையில் ஒரு புதிய சரத்தின் தொடக்கத்தை நாங்கள் சந்திக்கிறோம், எப்படி செய்வது என்று எங்களுக்குத் தெரியும், நாங்கள் நம்மை அழைக்கிறோம். பின்னர் எங்களுக்கு ஒரு முறை உள்ளது ::

source: To select a string between double quotation marks without stopping on an embedded string::
ar: لتحديد سلسلة بين علامتي اقتباس مزدوجتين دون التوقف عند سلسلة مضمنة::
cs: Pro výběr řetězce mezi uvozovkami bez zastavení na vloženém řetězci::
it: Per selezionare una stringa compresa tra due virgolette doppie senza fermarci su una stringa incorporata::
nl: Om een string te selecteren tussen dubbele aanhalingstekens zonder te stoppen voor een string daar binnenin::
ta: உட்பொதிக்கப்பட்ட சரத்தை நிறுத்தாமல் இரட்டை மேற்கோள் மதிப்பெண்களுக்கு இடையில் ஒரு சரத்தைத் தேர்ந்தெடுக்க ::

source: This template can also be used to modify pairs of tags that can be embedded, such as ``<div>`` tags.
ar: يمكن استخدام هذا القالب أيضًا لتعديل أزواج من العلامات التي يمكن تضمينها، مثل علامات ``<div>``.
cs: Tuto šablonu lze také použít ke změně párů značek, které mohou být vloženy, například značek ``<div>``.
it: Questo modello può anche essere usato per modificare coppie di tag che possono essere incorporati, come i tag ``<div>``.
nl: Deze template kan ook gebruikt worden om tag paren te wijzigen die ergens binnenin staan, zoals ``<div>`` tags.
ta: `` <viv> `` குறிச்சொற்கள் போன்ற உட்பொதிக்கக்கூடிய குறிச்சொற்களை மாற்றவும் இந்த வார்ப்புரு பயன்படுத்தப்படலாம்.

source: Special characters
ar: أحرف خاصة
cs: Speciální znaky
it: Caratteri speciali
nl: Speciale karakters
ta: சிறப்பு எழுத்துக்கள்

source: **Character**
ar: **الحرف**
cs: **Znak**
it: **Carattere**
ta: ** எழுத்து **

source: tabulation
ar: جدولة
cs: tabulátor
it: rientro (tabulazione)
ta: அட்டவணை

source: line break
ar: فاصل سطر
cs: konec řádku
it: interruzione di linea
ta: வரி இடைவெளி

source: (breakable) space
ar: مسافة (قابلة للكسر)
cs: (měkká) mezera
it: spazio (divisibile)
nl: (zachte) spatie
ta: (உடைக்கக்கூடிய) இடம்

source: no-break space
ar: مسافة غير قابلة للكسر
cs: tvrdá mezera
it: spazio unificatore (nbsp)
nl: harde spatie
ta: பிரேக் ஸ்பேஸ் இல்லை

source: Meta-characters
ar: أحرف ميتا
cs: Metaznaky
it: Metacaratteri
nl: Meta-karakters
ta: மெட்டா-கதாபாத்திரங்கள்

source: Meta-characters are those that have a special meaning for the regexp engine. Of these, twelve must be preceded by an escape character, the backslash (``\``), to lose their special meaning and become a regular character again::
ar: الأحرف الوصفية هي تلك التي لها معنى خاص لمحرك التعبير العادي. من بين هذه، يجب أن يسبق اثنا عشر حرفًا حرف هروب، وهو الشرطة المائلة للخلف (``\``)، لتفقد معناها الخاص وتصبح حرفًا عاديًا مرة أخرى::
cs: Metaznaky jsou ty, které mají zvláštní význam pro modul regulárních výrazů. Dvanáct z nich musí předcházet řídící znak, zpětné lomítko (``\``), aby ztratily svůj zvláštní význam a stal se z nich opět normální znak::
it: I metacaratteri sono quelli che hanno un significato speciale per il motore di regex. Di questi, dodici devono essere preceduti da un carattere di escape, la barra rovesciata (``\``), per perdere il loro significato speciale e ridiventare caratteri normali::
nl: Meta-karakters zijn diegene die een speciale betekenis hebben voor de regexp engine. Van deze moeten er 12 voorafgegaan worden door een escape karakter, de backslash (``\``), om hun speciale betekenis te verliezen en terug een gewoon karakter te worden::
ta: மெட்டா-கதாபாத்திரங்கள் REGEXP எஞ்சினுக்கு ஒரு சிறப்பு அர்த்தம் கொண்டவை. இவற்றில், பன்னிரண்டு பேர் ஒரு தப்பிக்கும் கதாபாத்திரம், பின்சாய்வுக்கோடான (`` \ ``), அவர்களின் சிறப்புப் பொருளை இழந்து மீண்டும் ஒரு வழக்கமான தன்மையாக மாற வேண்டும் ::

source: Seven other meta-characters do not need to be preceded by a backslash (but can be without any other consequence)::
ar: سبعة أحرف وصفية أخرى لا تحتاج إلى أن يسبقها شرطة مائلة للخلف (ولكن يمكن أن تكون بدون أي عواقب أخرى)::
cs: Sedm dalších metaznaků nemusí předcházet zpětné lomítko (ale může bez jakýchkoliv dalších důsledků)::
it: Sette altri metacaratteri non hanno bisogno di essere preceduti da una barra rovesciata (ma lo possono essere senza altre conseguenze)::
nl: Zeven andere meta-karakters moeten niet door een backslash vooraf gegaan worden (maar het kan zonder gevolgen)::
ta: மற்ற ஏழு மெட்டா-கதாபாத்திரங்கள் பின்சாய்வுக்குறிப்புக்கு முன்னதாக இருக்க வேண்டிய அவசியமில்லை (ஆனால் வேறு எந்த விளைவுகளும் இல்லாமல் இருக்கலாம்) ::

source: Special characters lose their status if they are used inside a class (between brackets ``[]``). The closing bracket and the dash have a special status in a class. Outside the class, the dash is a simple literal, the closing bracket remains a meta-character.
ar: تفقد الأحرف الخاصة حالتها إذا تم استخدامها داخل فئة (بين الأقواس ``[]``). القوس الإغلاقي والشرطة لهما حالة خاصة في الفئة. خارج الفئة، الشرطة هي حرف عادي بسيط، القوس الإغلاقي يظل حرفًا وصفيًا.
cs: Speciální znaky ztratí svůj status, pokud jsou použity ve třídě (mezi lomenými závorkami ``[]``). Uzavírací lomená závorka a pomlčka mají ve třídě zvláštní status. Mimo třídu je pomlčka jednoduchým literálem, uzavírací lomená závorka zůstává metaznakem.
it: I caratteri speciali perdono il loro stato se vengono usati dentro una classe (tra le parentesi ``[]``). La parentesi di chiusura e il trattino hanno uno stato speciale dentro una classe. Fuori dalla classe, il trattino è una semplice lettera, mentre la parentesi di chiusura rimane un metacarattere.
nl: Speciale karakters verliezen hun status als ze in een class gebruikt worden (tussen haakjes ``[]``). Het sluitende haakje en het streepje hebben een speciale betekenis in een class. Buiten de class is het streepje gewoon een streepje, het sluitend haakje blijft een meta-karakter.
ta: ஒரு வகுப்பினுள் (அடைப்புக்குறிக்கு இடையில் `` [] ``) பயன்படுத்தப்பட்டால் சிறப்பு எழுத்துக்கள் அவற்றின் நிலையை இழக்கின்றன. இறுதி அடைப்புக்குறி மற்றும் கோடு ஒரு வகுப்பில் ஒரு சிறப்பு அந்தஸ்தைக் கொண்டுள்ளன. வகுப்பிற்கு வெளியே, கோடு ஒரு எளிய நேரடி, நிறைவு அடைப்புக்குறி ஒரு மெட்டா-பாத்திரமாக உள்ளது.
