Repository: debian-calibre/calibre
Catalog: translations/manual/*/regexp_quick_reference.po
Languages: ar, cs, it, nl, ta

source: Quick reference for regexp syntax
ar: مرجع سريع لبناء جملة التعبيرات العادية
cs: Rychlý odkaz pro syntaxi regulárních výrazů
it: Riferimenti rapidi sulla sintassi regex
nl: Quick reference voor regexp syntax
ta: REGEXP தொடரியல் விரைவான குறிப்பு

source: This checklist summarizes the most commonly used/hard to remember parts of the regexp engine available in most parts of calibre.
ar: تلخص هذه القائمة المرجعية الأجزاء الأكثر استخدامًا/صعوبة التذكر من محرك التعبيرات العادية المتاح في معظم أجزاء calibre.
it: Questo elenco riassume le parti più comunemente usate/più difficili da ricordare del motore regex disponibile in molte delle parti di calibre.
nl: Deze checklist vat de meest gebruikte/moeilijk te onthouden delen van de regexp engine, beschikbaar in de meeste delen van calibre, samen.
ta: இந்த சரிபார்ப்பு பட்டியல் காலிபரின் பெரும்பாலான பகுதிகளில் கிடைக்கும் Regexp இயந்திரத்தின் சில பகுதிகளை நினைவில் கொள்ள பொதுவாக பயன்படுத்தப்படும்/கடினமாக உள்ளது.

source: Contents
ar: المحتويات
cs: Obsah
it: Contenuti
nl: Inhoud
ta: உள்ளடக்கங்கள்

source: Character classes
ar: فئات الأحرف
cs: Třídy znaků
it: Classi di caratteri
nl: Karakter klassen
ta: எழுத்து வகுப்புகள்

source: Character classes are useful to represent different groups of characters, succinctly.
ar: فئات الأحرف مفيدة لتمثيل مجموعات مختلفة من الأحرف، بإيجاز.
cs: Stručně řečeno jsou třídy znaků užitečné pro zastupování různých skupin znaků.
it: Le classi di caratteri sono utili per rappresentare gruppi diversi di caratteri in modo conciso.
nl: Tekenklassen zijn handig om verschillende groepen karakters samen te stellen, kort en bondig.
ta: எழுத்துக்குறி வகுப்புகள் சுருக்கமாக கதாபாத்திரங்களின் வெவ்வேறு குழுக்களைக் குறிக்க பயனுள்ளதாக இருக்கும்.

source: Examples:
ar: أمثلة:
cs: Příklady:
it: Esempi:
nl: Voorbeelden:
ta: எடுத்துக்காட்டுகள்:

source: **Representation**
ar: **التمثيل**
cs: **Zastoupení**
it: **Rappresentazione**
nl: **Vertegenwoordiging**
ta: ** பிரதிநிதித்துவம் **

source: **Class**
ar: **الفئة**
cs: **Třída**
it: **Classe**
nl: **Klasse**
ta: **வர்க்கம்**

source: Lowercase letters. Does not include characters with accent mark and ligatures
ar: أحرف صغيرة. لا تتضمن الأحرف ذات علامات التشكيل والروابط.
cs: Malá písmena. Nezahrnuje znaky s diakritikou a ligatury
it: Lettere minuscole. Non include caratteri accentati, segnati e legature
nl: Kleine letters. Bevat geen tekens met accentmarkering en ligaturen
ta: சிறிய ஆங்கில எழுத்துக்கள். உச்சரிப்பு குறி மற்றும் தசைநார்கள் கொண்ட எழுத்துக்கள் இல்லை

source: Lowercase letters from a to z or numbers from 0 to 9
ar: أحرف صغيرة من a إلى z أو أرقام من 0 إلى 9
cs: Malá písmena od a do z nebo čísla od 0 do 9
it: Lettere minuscole dalla a alla z o numeri da 0 a 9
nl: Kleine letters van a tot z of cijfers van 0 tot 9
ta: A முதல் Z வரை அல்லது எண்கள் 0 முதல் 9 வரையிலான சிறிய எழுத்துக்கள்

source: Uppercase or lowercase letters, or a dash. To include the dash in a class, you must put it at the beginning or at the end so as not to confuse it with the hyphen that specifies a range of characters
ar: أحرف كبيرة أو صغيرة، أو شرطة. لتضمين الشرطة في فئة، يجب وضعها في البداية أو في النهاية حتى لا تختلط بالواصلة التي تحدد نطاقًا من الأحرف.
cs: Velká nebo malá písmena nebo pomlčka. Pro zahrnutí pomlčky do třídy ji musíte umístit na začátek nebo na konec, aby se nepletla se spojovníkem, který určuje rozsah znaků.
it: Lettere maiuscole, minuscole o un trattino. Per includere il trattino in una classe devi metterlo all'inizio oppure alla fine, per non confonderlo con quello che specifica un intervallo di caratteri.
nl: Hoofdletters of kleine letters, of een streepje. Om het streepje in een klasse op te nemen, moet u het aan het begin of aan het einde plaatsen om het niet te verwarren met het koppelteken dat een reeks tekens specificeert
ta: பெரிய எழுத்துக்கள் அல்லது சிறிய எழுத்துக்கள், அல்லது ஒரு கோடு. ஒரு வகுப்பில் கோடு சேர்க்க, நீங்கள் அதை ஆரம்பத்திலோ அல்லது முடிவிலோ வைக்க வேண்டும், இதனால் அதை ஹைபனுடன் குழப்பக்கூடாது, இது பலவிதமான எழுத்துக்களைக் குறிப்பிடுகிறது

source: Any character except a digit. The caret (^) placed at the beginning of the class excludes the characters of the class (complemented class)
ar: أي حرف باستثناء رقم. العلامة (^) الموضوعة في بداية الفئة تستبعد أحرف الفئة (فئة مكملة).
cs: Libovolný znak kromě číslice. Stříška (^) umístěná na začátku třídy vylučuje znaky ze třídy (doplňková třída)
it: Qualsiasi carattere tranne una cifra. Il segno di omissione (^) all'inizio della classe esclude i caratteri della classe (classe complementare)
nl: Elk teken behalve een cijfer. Het caret (^) aan het begin van de klasse sluit de karakters van de klasse uit (gecomplementeerde klasse)
ta: ஒரு இலக்கத்தைத் தவிர வேறு எந்த எழுத்தும். வகுப்பின் தொடக்கத்தில் வைக்கப்பட்டுள்ள கேரட் (^) வகுப்பின் எழுத்துக்களை விலக்குகிறது (பூர்த்தி செய்யப்பட்ட வகுப்பு)

source: The lowercase consonants. A class can be included in a class. The characters ``--`` exclude what follows them
ar: الحروف الساكنة الصغيرة. يمكن تضمين فئة داخل فئة. الأحرف ``--`` تستبعد ما يليها.
cs: Malá písmena souhlásek. Třída může být zahrnuta do třídy. Znaky ``--`` vylučují to, co následuje
it: Consonanti minuscole. Una classe può essere inclusa in una classe. I caratteri `--` escludono ciò che li segue
nl: De medeklinkers in kleine letters. Een klas kan in een klas worden opgenomen. De karakters ``--`` sluiten uit wat hen volgt
ta: சிறிய எழுத்துக்கள். ஒரு வகுப்பில் ஒரு வகுப்பைச் சேர்க்கலாம். எழுத்துக்கள் `` --`` அவற்றைப் பின்தொடர்வதை விலக்கவும்

source: All letters (including foreign accented characters). Abbreviated classes can be used inside a class
ar: جميع الأحرف (بما في ذلك الأحرف الأجنبية المشددة). يمكن استخدام الفئات المختصرة داخل فئة.
cs: Všechna písmena (včetně cizích znaků s diakritikou). Uvnitř třídy lze použít zkrácené třídy
it: Tutte le lettere (inclusi i caratteri accentati stranieri). Le classi abbreviate possono essere utilizzate all'interno di una classe
nl: Alle letters (inclusief tekens met buitenlandse accenten). Afgekorte klassen kunnen binnen een klas worden gebruikt
ta: அனைத்து கடிதங்களும் (வெளிநாட்டு உச்சரிக்கப்பட்ட எழுத்துக்கள் உட்பட). சுருக்கமான வகுப்புகள் ஒரு வகுப்பிற்குள் பயன்படுத்தப்படலாம்

source: Example::
ar: مثال::
cs: Příklad::
it: Esempio::
nl: Voorbeeld::
ta: உதாரணமாக::

source: Shorthand character classes
ar: فئات الأحرف المختصرة
cs: Zjednodušené třídy znaků
it: Classi di caratteri abbreviate
nl: Steno tekenklassen
ta: சுருக்கெழுத்து எழுத்து வகுப்புகள்

source: A digit (same as ``[0-9]``)
ar: رقم (نفس ``[0-9]``)
cs: Číslo (stejné jako ``[0-9]``)
it: Una cifra (uguale a ``[0-9]``)
nl: Een cijfer (hetzelfde als ``[0-9]``)
ta: ஒரு இலக்க (`[0-9]` `போன்றவை)

source: Any non-numeric character (same as ``[^0-9]``)
ar: أي حرف غير رقمي (نفس ``[^0-9]``)
cs: Libovolný nečíselný znak (stejné jako ``[^0-9]``)
it: Ogni carattere non numerico (uguale a ``[^0-9]``)
nl: Elk niet-numeriek karakter (hetzelfde als ``[^0-9]``)
ta: எந்த நோயுற்ற தன்மை அல்லாத எழுத்து (`` [^0-9] ``)

source: An alphanumeric character (``[a-zA-Z0-9]``) including characters with accent mark and ligatures
ar: حرف أبجدي رقمي (``[a-zA-Z0-9]``) بما في ذلك الأحرف ذات علامات التشكيل والروابط.
cs: Alfanumerický znak (``[a-zA-Z0-9]``) včetně znaků s diakritikou a ligatur
it: Un carattere alfanumerico (``[a-zA-Z0-9]``) inclusi caratteri con accenti, segni e legature.
nl: Een alfanumeriek karakter (``[a-zA-Z0-9]``) inbegrepen karakters met accent en ligatuur
ta: உச்சரிப்பு குறி மற்றும் தசைநார்கள் கொண்ட எழுத்துக்கள் உட்பட ஒரு எண்ணெழுத்து எழுத்து (`` [a-za-z0-9] ``)

source: Any “non-word” character
ar: أي حرف "غير كلمة"
cs: Libovolný znak, který není „slovo“
it: Qualsiasi carattere "non-parola"
nl: Elk "niet-woord"karakter
ta: எந்த “சொல் அல்லாத” பாத்திரம்

source: Space, non-breaking space, tab, return line
ar: مسافة، مسافة غير فاصلة، علامة جدولة، سطر جديد
cs: Mezera, pevná mezera, tabulátor, enter.
it: Spazio, spazio unificatore, rientro (tabulazione), testo a capo
nl: Spatie, harde spatie, tab, nieuweregelteken
ta: இடம், உடைக்காத இடம், தாவல், வருவாய் வரி

source: Any “non-whitespace” character
ar: أي حرف "غير مسافة بيضاء"
cs: Libovolný znak, který není „prázdný znak“
it: Qualsiasi carattere "non-vuoto"
nl: Elk "niet blanco ruimte" karakter
ta: எந்த “வெண்மையான அல்லாத” பாத்திரம்

source: Any character except newline. Use the “dot all” checkbox or the ``(?s)`` regexp modifier to include the newline character.
ar: أي حرف باستثناء السطر الجديد. استخدم مربع الاختيار "كل النقاط" أو معدّل التعبير العادي ``(?s)`` لتضمين حرف السطر الجديد.
cs: Jakýkoliv znak kromě nového řádku. Použijte zaškrtávací políčko „vytečkovat vše“ nebo modifikátor regulárních výrazů ``(?s)`` pro zahrnutí nového řádku.
it: Qualsiasi carattere eccetto newline. Usa la casella "Il punto vale tutto" o il modificatore regex ``(?s)`` per includere il carattere newline.
nl: Elk karakter uitgezonderd nieuwe regel. Gebruik het "dot all" aankruisvakje of de ``(?s)`` regexp modifier om het nieuwe regel karakter mee te tellen.
ta: நியூலைன் தவிர வேறு எந்த கதாபாத்திரமும். நியூலைன் எழுத்தை சேர்க்க “டாட் ஆல்” தேர்வுப்பெட்டி அல்லது `` (? கள்) `` regexp மாற்றியமைப்பைப் பயன்படுத்தவும்.

source: The quantifiers
ar: المحددات الكمية
cs: Kvantifikátory
it: I quantificatori
nl: De quantifiers
ta: அளவு

source: **Quantifier**
ar: **المحدد الكمي**
cs: **Kvantifikátor**
it: **Quantificatore**
ta: ** அளவு **

source: **Number of occurrences of the expression preceding the quantifier**
ar: **عدد مرات ظهور التعبير الذي يسبق المحدد الكمي**
cs: **Počet výskytů výrazů předcházejících kvantifikátor**
it: **Numero di occorrenze dell'espressione che precede il quantificatore**
nl: **Aantal keren dat de uitdrukking voorkomt voor de quantifier**
ta: ** குவாண்டிஃபையருக்கு முந்தைய வெளிப்பாட்டின் நிகழ்வுகளின் எண்ணிக்கை **

source: 0 or 1 occurrence of the expression. Same as ``{0,1}``
ar: 0 أو 1 تكرار للتعبير. نفس ``{0,1}``
cs: 0 nebo 1 výskytů výrazu. Stejné jako ``{0,1}``
it: 0 o 1 occorrenze dell'espressione. Uguale a ``{0,1}``
nl: 0 of 1 keer voorkomen van de uitdrukking. Hetzelfde als ``{0,1}``
ta: 0 அல்லது 1 வெளிப்பாட்டின் நிகழ்வு. `` {0,1} ``

source: 1 or more occurrences of the expression. Same as ``{1,}``
ar: 1 أو أكثر من مرات ظهور التعبير. نفس ``{1,}``
cs: 1 nebo více výskytů výrazu. Stejné jako ``{1,}``
it: 1 o più occorrenze dell'espressione. Uguale a ``{1,}``
nl: 1 of meer keer voorkomen van de uitdrukking. Hetzelfde als ``{1,}``
ta: வெளிப்பாட்டின் 1 அல்லது அதற்கு மேற்பட்ட நிகழ்வுகள். `` {1,} ``

source: 0, 1 or more occurrences of the expression. Same as ``{0,}``
ar: 0، 1 أو أكثر من مرات ظهور التعبير. نفس ``{0,}``
cs: 0, 1 nebo více výskytů výrazu. Stejné jako ``{0,}``
it: 0, 1 o più occorrenze dell'espressione. Uguale a ``{0,}``
nl: 0, 1 of meer keer voorkomen van de uitdrukking. Hetzelfde als ``{0,}``
ta: வெளிப்பாட்டின் 0, 1 அல்லது அதற்கு மேற்பட்ட நிகழ்வுகள். `` {0,} ``

source: Exactly n occurrences of the expression
ar: بالضبط n تكرار للتعبير
cs: Přesně n výskytů výrazu
it: Esattamente n occorrenze dell'espressione
nl: Exact n keer voorkomen van de uitdrukking
ta: வெளிப்பாட்டின் சரியாக n நிகழ்வுகள்

source: ``{min,max}``
ta: `` {நிமிடம், அதிகபட்சம்} ``

source: Number of occurrences between the minimum and maximum values included
ar: عدد مرات الظهور بين القيم الدنيا والقصوى المضمنة
cs: Počet výskytů mezi minimální a maximální hodnotou včetně
it: Un numero di occorrenze compreso tra i valori minimo e massimo inclusi
nl: Aantal keer voorkomen tussen de minimum en maximum waarden inbegrepen
ta: சேர்க்கப்பட்ட குறைந்தபட்ச மற்றும் அதிகபட்ச மதிப்புகளுக்கு இடையிலான நிகழ்வுகளின் எண்ணிக்கை

source: ``{min,}``
ta: `` {நிமிடம்,} ``

source: Number of occurrences between the minimum value included and the infinite
ar: عدد مرات الظهور بين القيمة الدنيا المضمنة واللانهاية
cs: Počet výskytů mezi minimální hodnotou včetně a nekonečnem
it: Un numero di occorrenze compreso tra il valore minimo e l'infinito
nl: Aantal keren voorkomen tussen de minimum waarde inbegrepen en oneindig
ta: சேர்க்கப்பட்ட குறைந்தபட்ச மதிப்பு மற்றும் எல்லையற்ற இடங்களுக்கு இடையிலான நிகழ்வுகளின் எண்ணிக்கை

source: ``{,max}``
ta: `` {, அதிகபட்சம்} ``

source: Number of occurrences between 0 and the maximum value included
ar: عدد مرات الظهور بين 0 والقيمة القصوى المضمنة
cs: Počet výskytů mezi 0 a maximální hodnotou včetně
it: Un numero di occorrenze compreso tra 0 e il valore massimo incluso
nl: Aantal keren voorkomen tussen 0 en de maximum waarde inbegrepen
ta: 0 மற்றும் அதிகபட்ச மதிப்புக்கு இடையிலான நிகழ்வுகளின் எண்ணிக்கை சேர்க்கப்பட்டுள்ளது

source: Greed
ar: الجشع
cs: Nenasytnost
it: Voracità
nl: Hebzucht
ta: பேராசை

source: By default, with quantifiers, the regular expression engine is greedy: it extends the selection as much as possible. This often causes surprises, at first. ``?`` follows a quantifier to make it lazy. Avoid putting two in the same expression, the result can be unpredictable.
ar: افتراضيًا، مع المحددات الكمية، يكون محرك التعبير العادي جشعًا: فهو يمدد التحديد قدر الإمكان. غالبًا ما يسبب هذا مفاجآت في البداية. تتبع ``?`` محددًا كميًا لجعله كسولًا. تجنب وضع اثنين في نفس التعبير، فقد تكون النتيجة غير متوقعة.
cs: Ve výchozím nastavení je modul regulárního výrazu s kvantifikátory nenasytný: rozšiřuje výběr co nejvíce. To zpočátku často způsobuje překvapení. ``?`` následovaný kvantifikátorem je lenost. Vyhněte se dávání dvou do stejného výrazu, výsledek může být nepředvídatelný.
it: Per impostazione predefinita, con i quantificatori, il motore delle espressioni regolari è vorace (greedy): estende la selezione il più possibile. Questo causa delle sorprese all'inizio. ``?`` segue un quantificatore per renderlo pigro (lazy). Evita di metterne due nella stessa espressione, i risultati possono essere imprevedibili.
nl: Standaard, met quantifiers, is de regular expression engine hebzuchtig: hij breidt de selectie zo ver mogelijk uit. Dit geeft dikwijls verassingen, in het begin. ``?`` volgt een quantifier om hem lui te maken. Vermijd twee ervan in dezelfde uitdrukking, het resultaat kan onvoorspelbaar zijn.
ta: இயல்பாக, குவாண்டிஃபையர்களுடன், வழக்கமான வெளிப்பாடு இயந்திரம் பேராசை கொண்டது: இது தேர்வை முடிந்தவரை நீட்டிக்கிறது. இது பெரும்பாலும் ஆச்சரியங்களை ஏற்படுத்துகிறது. ``? `` சோம்பேறியாக மாற்ற ஒரு அளவைப் பின்பற்றுகிறது. ஒரே வெளிப்பாட்டில் இரண்டை வைப்பதைத் தவிர்க்கவும், இதன் விளைவாக கணிக்க முடியாதது.

source: Beware of nesting quantifiers, for example, the pattern ``(a*)*``, as it exponentially increases processing time.
ar: احذر من تداخل المحددات الكمية، على سبيل المثال، النمط ``(a*)*``، لأنه يزيد وقت المعالجة بشكل كبير.
cs: Dejte si pozor na vnořené kvantifikátory, například vzor ``(a*)*``, protože exponenciálně zvyšuje dobu zpracování.
it: Fai attenzione nel nidificare i quantificatori, come ad esempio nell'espressione ``(a*)*``, perché fare ciò aumenta esponenzialmente il tempo di elaborazione.
nl: Let op met het nesten van quantifiers, bv het patroon ``(a*)*``, omdat het de verwerkingstijd exponentieel verhoogt.
ta: கூடு கட்டும் அளவுகோல்களைப் பற்றி ஜாக்கிரதை, எடுத்துக்காட்டாக, `` (அ*)*`` என்ற முறை, இது செயலாக்க நேரத்தை அதிவேகமாக அதிகரிக்கிறது.

source: Alternation
ar: التبديل
cs: Alternace
it: Alternative
nl: Afwisseling
ta: மாற்றீடு

source: The ``|`` character in a regular expression is a logical ``OR``. It means that either the preceding or the following expression can match.
ar: الحرف ``|`` في التعبير العادي هو ``OR`` منطقي. هذا يعني أن التعبير السابق أو التالي يمكن أن يتطابق.
cs: Znak ``|`` v regulárním výrazu je logické ``OR``. To znamená, že se může shodovat buď předcházející nebo následující výraz.
it: Il carattere ``|`` in un'espressione regolare è un ``OR`` logico. Significa che verrà cercata una corrispondenza o per l'espressione precedente o per quella seguente.
nl: Het ``|`` karakter in een regular expression is een logische ``OR``. Het betekent dat ofwel de voorgaande ofwel de navolgende uitdrukking kan overeenkomen.
ta: வழக்கமான வெளிப்பாட்டில் உள்ள `` | `` எழுத்து ஒரு தர்க்கரீதியான `` அல்லது``. இதன் பொருள் முந்தைய அல்லது பின்வரும் வெளிப்பாடு பொருந்தக்கூடும்.

source: Exclusion
ar: الاستبعاد
cs: Vyloučení
it: Esclusione
nl: Uitsluiting
ta: விலக்கு

source: Method 1
ar: الطريقة 1
cs: Metoda 1
it: Metodo 1
nl: Methode 1
ta: முறை 1

source: ``pattern_to_exclude(*SKIP)(*FAIL)|pattern_to_select``
cs: ``vzor_k_vyloučení(*SKIP)(*FAIL)|vzor_k_vybrání``
it: ``schema_da_escludere(*SKIP)(*FAIL)|schema_da_selezionare``
ta: `` `pattern_to_exclude (*SKIP) (*தோல்வி) | Pattern_to_Select``

source: Example:
ar: مثال:
cs: Příklad:
it: Esempio:
nl: Voorbeeld:
ta: உதாரணமாக:

source: ``"Blabla"(*SKIP)(*FAIL)|Blabla``
ta: `` "பிளாப்லா" (*ஸ்கிப்) (*தோல்வி) | பிளாப்லா``

source: selects Blabla, in the strings Blabla or "Blabla or Blabla", but not in "Blabla".
ar: يختار Blabla، في السلاسل Blabla أو "Blabla أو Blabla"، ولكن ليس في "Blabla".
cs: vybere Blabla v řetězcích Blabla nebo „Blabla nebo Blabla“, ale ne v „Blabla“.
it: seleziona Blabla, nelle stringhe Blabla o "Blabla or Blabla", ma non in "Blabla".
nl: selecteert Blabla, in de strings Blabla of "Blabla of Blabla", maar niet in "Blabla".
ta: பிளாப்லா அல்லது "பிளப்லா அல்லது பிளப்லா" இன் சரங்களில் பிளாப்லாவைத் தேர்ந்தெடுக்கிறது, ஆனால் "பிளாப்லா" இல் இல்லை.

source: Method 2
ar: الطريقة 2
cs: Metoda 2
it: Metodo 2
nl: Methode 2
ta: முறை 2

source: ``"Blabla"\K|(Blabla)``
ta: `` "பிளாப்லா" \ கே | (பிளாப்லா) ``

source: Anchors
ar: المراسي
cs: Kotvy
it: Ancoraggi
nl: Ankers
ta: நங்கூரர்கள்

source: An anchor is a way to match a logical location in a string, rather than a character. The most useful anchors for text processing are:
ar: المرساة هي طريقة لمطابقة موقع منطقي في سلسلة، بدلاً من حرف. أكثر المراسي فائدة لمعالجة النصوص هي:
cs: Kotva je způsob, jak porovnat logické umístění v řetězci, spíše než znaku. Nejužitečnější kotvy pro zpracování textu jsou:
it: Un ancoraggio è un modo di trovare una posizione logica in una stringa, invece di un carattere. Gli ancoraggi più utili per l'elaborazione del testo sono:
nl: Een anker is een manier om een logische locatie in een string te matchen, eerder dan een karakter. De nuttigste ankers voor tekstverwerking zijn:
ta: ஒரு நங்கூரம் என்பது ஒரு கதாபாத்திரத்தை விட, ஒரு தர்க்கரீதியான இருப்பிடத்தை ஒரு சரம் பொருத்துவதற்கான ஒரு வழியாகும். உரை செயலாக்கத்திற்கு மிகவும் பயனுள்ள நங்கூரங்கள்:

source: Designates a word boundary, i.e. a transition from space to non-space character. For example, you can use ``\bsurd`` to match ``the surd`` but not ``absurd``.
ar: يشير إلى حدود الكلمة، أي انتقال من مسافة إلى حرف غير مسافة. على سبيل المثال، يمكنك استخدام ``\bsurd`` لمطابقة ``the surd`` ولكن ليس ``absurd``.
cs: Určuje hranici slova, tj. přechod z mezery na nemezerový znak. Například můžete použít ``\bdar``, aby odpovídal ``mám dar``, ale ne ``nezdar``.
it: Indica il confine di una parola, ovvero una transizione da un carattere spazio a uno non-spazio. Per esempio, puoi usare ``\bcerto`` per trovare ``di certo`` ma non ``concerto``.
nl: Geeft een woordgrens aan, bv een overgang van een spatie naar een niet blanco ruimte karakter. U kan bv ``\bsurd`` gebruiken om overeen te komen met ``the surd`` maar niet ``absurd``.
ta: ஒரு சொல் எல்லையை நியமிக்கிறது, அதாவது விண்வெளியில் இருந்து விண்வெளி அல்லாத எழுத்துக்கு மாறுதல். எடுத்துக்காட்டாக, `` சர்ப்`` உடன் பொருந்த `` \ bsurd`` ஐப் பயன்படுத்தலாம், ஆனால் `` அபத்தமானது`.

source: Matches the start of a line (in multi-line mode, which is the default)
ar: يطابق بداية السطر (في وضع الأسطر المتعددة، وهو الوضع الافتراضي)
cs: Odpovídá začátku řádku (v režimu více řádků, což je výchozí nastavení)
it: Trova l'inizio di una riga (in modalità multilinea, che è quella predefinita)
nl: Komt overeen met het begin van een regel (in multi-regel modus, wat standaard is)
ta: ஒரு வரியின் தொடக்கத்துடன் பொருந்துகிறது (மல்டி-லைன் பயன்முறையில், இது இயல்புநிலை)

source: Matches the end of a line (in multi-line mode, which is the default)
ar: يطابق نهاية السطر (في وضع الأسطر المتعددة، وهو الوضع الافتراضي)
cs: Odpovídá konci řádku (v režimu více řádků, což je výchozí nastavení)
it: Trova la fine di una riga (in modalità multilinea, che è quella predefinita)
nl: Komt overeen met het einde van een regel (in multi-regel modus, wat standaard is)
ta: ஒரு வரியின் முடிவுடன் பொருந்துகிறது (மல்டி-லைன் பயன்முறையில், இது இயல்புநிலை)

source: Resets the start position of the selection to its position in the pattern. Some regexp engines (but not calibre) do not allow lookbehind of variable length, especially with quantifiers. When you can use ``\K`` with these engines, it also allows you to get rid of this limit by writing the equivalent of a positive lookbehind of variable length.
ar: يعيد تعيين موضع بداية التحديد إلى موضعه في النمط. بعض محركات التعبيرات العادية (ولكن ليس calibre) لا تسمح بالبحث الخلفي ذي الطول المتغير، خاصة مع المحددات الكمية. عندما يمكنك استخدام ``\K`` مع هذه المحركات، فإنه يسمح لك أيضًا بالتخلص من هذا القيد عن طريق كتابة ما يعادل بحثًا خلفيًا إيجابيًا ذا طول متغير.
cs: Obnovuje výchozí pozici výběru na pozici ve vzoru. Některé moduly regulárních výrazů (ale ne Calibre) nedovolí hledat vpřed v proměnlivé délce, obzvláště s kvantifikátory. Když můžete s těmito moduly použít ``\K``, také vám to umožní zbavit se tohoto limitu napsáním ekvivalentu pozitivního hledání vpřed v proměnlivé délce.
it: Ripristina la posizione di partenza della selezione alla sua posizione nello schema. Alcuni motori di regex (ma non quello di calibre) non permettono lookbehind di lunghezza variabile, specialmente con i quantificatori. Se puoi utilizzare ``\K`` con questi motori, puoi anche aggirare questa limitazione scrivendo l'equivalente di un lookbehind positivo di lunghezza variabile.
nl: Reset de start positie van de selectie naar z'n positie in het patroon. Sommige regex engines (maar niet calibre) laten geen lookbehind of variabele lengte toe, zeker met quantifiers. Als u ``\K`` kan gebruiken bij deze engines, laat het u ook toe om van deze beperking vanaf te raken door het equivalent van een positieve lookbehind van variabele lengte te schrijven.
ta: தேர்வின் தொடக்க நிலையை அதன் நிலைக்கு மீட்டெடுக்கிறது. சில Regexp என்ஜின்கள் (ஆனால் திறமை வாய்ந்தவை அல்ல) மாறி நீளத்தைத் தேடுவதை அனுமதிக்காது, குறிப்பாக அளவுகோல்கள். இந்த என்ஜின்களுடன் `` \ k`` ஐப் பயன்படுத்தும்போது, மாறி நீளத்தின் நேர்மறையான தேடலுக்கு சமமானதை எழுதுவதன் மூலம் இந்த வரம்பை அகற்றவும் இது உங்களை அனுமதிக்கிறது.

source: Groups
ar: المجموعات
cs: Skupiny
it: Gruppi
nl: Groepen
ta: குழுக்கள்

source: ``(expression)``
cs: ``(výraz)``
it: ``(espressione)``
ta: `` (வெளிப்பாடு) ``

source: Capturing group, which stores the selection and can be recalled later in the *search* or *replace* patterns with ``\n``, where ``n`` is the sequence number of the capturing group (starting at 1 in reading order)
ar: مجموعة التقاط، تخزن التحديد ويمكن استدعاؤها لاحقًا في أنماط *البحث* أو *الاستبدال* باستخدام ``\n``، حيث ``n`` هو الرقم التسلسلي لمجموعة الالتقاط (تبدأ من 1 بترتيب القراءة).
cs: Zachytávací skupina: Uloží výběr a může být později vyvolána ve vzorech *search* nebo *replace* pomocí ``\n``, kde ``n`` je pořadové číslo zachytávací skupiny (počínaje od 1 v pořadí čtení)
it: Gruppo di cattura, che conserva la selezione e può essere richiamato in seguito nelle espressioni *cerca* e *sostituisci* usando ``\n``, dove ``n`` è il numero di sequenza del gruppo di cattura (a partire da 1 in ordine di lettura)
nl: Vang groep, die de selectie bewaart en later terug opgeroepen kan worden in de *search* or *replace* patronen met ``\n``, waar ``n`` het volgnummer is van de vang groep (beginnend bij 1 in leesvolgorde)
ta: படத்தைக் கைப்பற்றுதல், இது தேர்வை சேமித்து, பின்னர் * தேடலில் * அல்லது * வடிவங்களை `` \ n`` உடன் நினைவுபடுத்துகிறது, அங்கு `` n`` என்பது கைப்பற்றும் குழுவின் வரிசை எண் (வாசிப்பில் 1 இல் தொடங்குகிறது ஒழுங்கு)

source: ``(?:expression)``
cs: ``(?:výraz)``
it: ``(?:espressione)``
ta: `` (?: வெளிப்பாடு) ``
