Repository: debian-calibre/calibre
Catalog: translations/manual/*/server.po
Languages: de, ms, pl, pt_br, ta, tr

source: That's all, you will now be able to access the calibre Content server under the ``/calibre`` URL in your main server. The above rules pass all requests under ``/calibre`` to the calibre server running on port 8080 and thanks to the ``--url-prefix`` option above, the calibre server handles them transparently.
ta: அவ்வளவுதான், உங்கள் பிரதான சேவையகத்தில் ``/காலிபிரே`` URL இன் கீழ் காலிபர் உள்ளடக்க சேவையகத்தை இப்போது அணுக முடியும். மேலே உள்ள விதிகள் அனைத்து கோரிக்கைகளையும் ``/காலிபிரே`` இன் கீழ் போர்ட் 8080 இல் இயங்கும் காலிபர் சேவையகத்திற்கு அனுப்புகின்றன, மேலும் மேலே உள்ள `` --url-prefix`` விருப்பத்திற்கு நன்றி, காலிபர் சேவையகம் அவற்றை வெளிப்படையாகக் கையாளுகிறது.

source: When using a reverse proxy, you should tell the calibre Content server to only listen on localhost, by using ``--listen-on 127.0.0.1``. That way, the server will only listen for connections coming from the same computer, i.e. from the reverse proxy.
ta: தலைகீழ் ப்ராக்ஸியைப் பயன்படுத்தும் போது, ``--லிஸ்டன்-ஆன் 127.0.0.1`` ஐப் பயன்படுத்துவதன் மூலம், உள்ளூர் ஹோஸ்டில் மட்டுமே கேட்கும்படி காலிபர் உள்ளடக்க சேவையகத்தை நீங்கள் சொல்ல வேண்டும். அந்த வகையில், ஒரே கணினியிலிருந்து வரும் இணைப்புகளை மட்டுமே சேவையகம் கேட்கும், அதாவது தலைகீழ் ப்ராக்ஸியிலிருந்து.

source: If you have setup SSL for your main server, you should tell the calibre server to use basic authentication instead of digest authentication, as it is faster. To do so, pass the ``--auth-mode=basic`` option to ``calibre-server``.
ta: உங்கள் பிரதான சேவையகத்திற்கான SSL ஐ நீங்கள் வைத்திருந்தால், அங்கீகாரத்தை டைஜஸ்ட் செய்வதற்கு பதிலாக அடிப்படை அங்கீகாரத்தைப் பயன்படுத்துமாறு காலிபர் சேவையகத்திற்கு நீங்கள் சொல்ல வேண்டும். அவ்வாறு செய்ய, `` --auth-mode = அடிப்படை`` விருப்பத்தை `` காலிபர்-சேவையகத்திற்கு` அனுப்பவும்.

source: Creating a service for the calibre server on a modern Linux system
ta: நவீன லினக்ஸ் கணினியில் காலிபர் சேவையகத்திற்கான சேவையை உருவாக்குதல்

source: You can easily create a service to run calibre at boot on a modern (`systemd <https://www.freedesktop.org/wiki/Software/systemd/>`_) based Linux system. Just create the file ``/etc/systemd/system/calibre-server.service`` with the contents shown below::
ta: நவீன (`systemd <https://www.freedesktop.org/wiki/software/systemd/>` _) அடிப்படையிலான லினக்ஸ் கணினியில் துவக்கத்தில் காலிபரை இயக்க ஒரு சேவையை எளிதாக உருவாக்கலாம். கீழே காட்டப்பட்டுள்ள உள்ளடக்கங்களுடன் ``/etc/systemd/system/system/calibre-server.service`` கோப்பை உருவாக்கவும் ::

source: Change ``mylinuxuser`` and ``mylinuxgroup`` to whatever user and group you want the server to run as. This should be the same user and group that own the files in the calibre library folder. Note that it is generally not a good idea to run the server as root. Also change the path to the calibre library folder to suit your system. You can add multiple libraries if needed. See the help for the ``calibre-server`` command.
ta: `` Mylinuxuser`` மற்றும் `` mylinuxgroup`` ஐ நீங்கள் சேவையகம் இயக்க விரும்பும் எந்த பயனர் மற்றும் குழுவிற்கு மாற்றவும். காலிபர் நூலகக் கோப்புறையில் கோப்புகளை வைத்திருக்கும் அதே பயனர் மற்றும் குழுவாக இது இருக்க வேண்டும். சேவையகத்தை ரூட்டாக இயக்குவது பொதுவாக நல்ல யோசனையல்ல என்பதை நினைவில் கொள்க. உங்கள் கணினிக்கு ஏற்றவாறு காலிபர் நூலக கோப்புறையில் பாதையையும் மாற்றவும். தேவைப்பட்டால் நீங்கள் பல நூலகங்களைச் சேர்க்கலாம். `` காலிபர்-சர்வர்`` கட்டளைக்கான உதவியைக் காண்க.

source: Now run::
ta: இப்போது ஓடு ::

source: to start the server. Check its status with::
ta: சேவையகத்தைத் தொடங்க. அதன் நிலையை சரிபார்க்கவும் ::

source: To make it start at boot, run::
ta: துவக்கத்தில் தொடங்க, ரன் ::

source: The calibre server *does not* need a running X server, but it does need the X libraries installed as some components it uses link against them.
ta: காலிபர் சேவையகத்திற்கு * இயங்கும் எக்ஸ் சேவையகம் தேவையில்லை, ஆனால் இதற்கு சில கூறுகளாக நிறுவப்பட்ட எக்ஸ் நூலகங்கள் அவற்றுக்கு எதிரான இணைப்பைப் பயன்படுத்துகின்றன.

source: The calibre server also supports systemd socket activation, so you can use that, if needed, as well.
ta: காலிபர் சேவையகம் சிஸ்டம் டி சாக்கெட் செயல்பாட்டையும் ஆதரிக்கிறது, எனவே நீங்கள் தேவைப்பட்டால் அதைப் பயன்படுத்தலாம்.

source: Integrating the calibre content server into other servers
de: Integrieren des Calibre-Inhalteservers in andere Server
ms: Menyepadukan pelayan kandungan calibre ke dalam pelayan lain
pl: Integrowanie serwera zawartości z innymi serwerami
pt_br: Integrando o servidor de conteúdo calibre com outros servidores
tr: calibre içerik sunucusunu başka sunucularla bütünleştirmek

source: Here, we will show you how to integrate the calibre content server into another server. The most common reason for this is to make use of SSL or more sophisticated authentication. There are two main techniques: Running the calibre content server as a standalone process and using a reverse proxy to connect it with your main server or running the content server in process in your main server with WSGI. The examples below are all for Apache 2.x on linux, but should be easily adaptable to other platforms.
de: Hier zeigen wir Ihnen, wie Sie den Calibre Inhalteserver in einen anderen Server integrieren. Der häufigste Grund dafür ist die Verwendung von SSL oder eine ausgefeiltere Authentifizierung. Es gibt zwei Techniken: den Calibre Inhalteserver als Stand-Alone Prozess auszuführen und einen Reverse-Proxy zum Verbinden mit dem Hauptserver zu verwenden, oder den Inhalteserver auf Ihrem Hauptserver mit WSGI laufen zu lassen. Die folgenden Beispiele sind alle für Apache 2.x unter Linux, sollten aber einfach auf andere Plattformen übertragbar sein.
ms: Di sini, kita akan tunjukkan bagaimana anda dapat mengintegrasikan pelayan kandungan calibre ke dalam pelayan lain. Sebab utama melakukannya kerana penggunaan SSL atau pengesahihan canggih. Terdapat dua teknik utama: Menjalankan pelayan kandungan calibre sebagai proses berdiri-sendiri dan menggunakan proksi songsang untuk menyambung ia dengan pelayan utama anda atau menjalankan pelayan kandungan dalam proses di dalam pelayan utama denga WSGI. Contoh-contoh di bawah menggunakan Apache 2.x dalam linux, tetapi ia mudah disuaikan dengan platform lain.
pl: Z tego rozdziału dowiesz się jak zintegrować serwer zawartości calibre z innym serwerem. Najczęściej powodem takiej operacji jest użycie SSL lub silniejszej autentykacji. Są dwie metody integracji: uruchomienie serwera calibre jako oddzielnego procesu i użycie odwrotnego proxy, by podłączyć go do głównego serwera albo użycie WSGI. Poniższe przykłady odnoszą się do Apache 2.x na Linuksie, ale łatwo je dostosować do innych platform.
pt_br: Demonstraremos aqui como integrar o servidor de conteúdo calibre com outro servidor. O motivo mais comum para isto é usar SSL ou autenticação mais sofisticada. Existem duas técnicas principais: Rodar o servidor de conteúdo calibre como um processo standalone e usar um proxy reverso para conectá-lo com seu servidor principal ou rodar o servidor de conteúdo como processo em seu servidor principal com WSGI. Os exemplos abaixo são todos para Apache 2.x no linux, mas deve ser facilmente adaptável para outras plataformas.
tr: Burada size calibre içerik sunucusunun başka bir sunucu ile nasıl bütünleştirileceğini göstereceğiz. Bunun için en yaygın neden SSL veya daha gelişmiş bir kimlik doğrulama yönteminin kullanılmasıdır. İki ana teknik bulunmaktadır: calibre içerik sunucusunu tek başına çalışan bir süreç olarak çalıştırmak ve ana sunucunuza bağlanmak için ters vekil sunucu kullanmak veya içerik sunucusunu ana sunucunuzun içerisinde WSGI ile bir süreç olarak çalıştırmak. Aşağıdaki örneklerin tümü Linux üzerinde Apache 2.x sürümleri için geçerli olsa da kolaylıkla diğer platformlara uyarlanabilirler.

source: This only applies to calibre releases >= 0.7.25
de: Dies gilt nur für Calibre Versionen >= 0.7.25
ms: Ini hanya dilaksanakan pada calibre keluaran >= 0.7.25
pl: Działa tylko w calibre w wersji >= 0.7.25
pt_br: Somente se aplica as versões do calibre >= 0.7.25
tr: Bu sadece calibre 0.7.25 ve üzeri sürümlerde uygulanabilir

source: Using a reverse proxy
de: Verwenden eines Reverse Proxy
ms: Menggunakan proksi songsang
pl: Użycie odwrotnego proxy
pt_br: Usando um proxy reverso
tr: Ters vekil sunucu kullanmak

source: A reverse proxy is when your normal server accepts incoming requests and passes them onto the calibre server. It then reads the response from the calibre server and forwards it to the client. This means that you can simply run the calibre server as normal without trying to integrate it closely with your main server, and you can take advantage of whatever authentication systems your main server has in place. This is the simplest approach as it allows you to use the binary calibre install with no external dependencies/system integration requirements. Below, is an example of how to achieve this with Apache as your main server, but it will work with any server that supports Reverse Proxies.
de: Ein Reverse-Proxy ist gegeben, wenn Ihr normaler Server eingehende Anfragen annimmt und Sie an den Calibre-Server weitergibt. Er liest dann die Antwort des Calibre-Servers und leitet diese an den Client weiter. Das heißt, dass Sie den Calibre einfach wie immer laufen lassen können, ohne eine enge Integration in Ihren Hauptserver anstellen zu müssen und dabei ggf. die Vorteile der Authentifizierungsmechanismen auf Ihrem Hauptserver nutzen. Dies ist die einfachste Herangehensweise, denn Sie ermöglicht die Nutzung der binären Calibre-Installation ohne externe Abhängigkeiten oder Anforderungen an die Systemintegration. Unterhalb finden Sie ein Beispiel, wie Sie das mit einem Apache-Server als Hauptserver erreichen können, es funktioniert aber mit jedem Server, der Reverse-Proxys unterstützt.
ms: Proksi songsang berlaku bila pelayan biasa anda menerima permintaan masuk dan melepasi ia ke dalam pelayan calibre. Kemudian ia membaca respon dari pelayan calibre dan memajukannya kepada klien. Ini bermaksud anda dengan mudah jalankan pelayan calibre seperti biasa tanpa cuba menyepadukannya dengan pelayan utama anda, dan anda boleh guna apa jua kelebihan sistem pengesahihan pelayan utama yang ada. Pendekatan yang paling mudah adalah membenarkan anda guna binary calibre install tanpa apa-apa keperluan penyepaduan sistem/dependensi luaran. Contoh di bawah adalah bagaimana hendak menjalankannya dengan Apache sebagai pelayan utama anda, tetapi ia akan berfungsi dengan mana-mana pelayan yang menyokong Proksi Songsang.
pl: Odwrotne proxy działa w ten sposób, że główny serwer przyjmuje żądania i przekierowuje je do calibre. Następnie odbiera odpowiedź od calibre i przesyła ją do klienta. Oznacza to, że możesz uruchomić calibre normalnie, bez konieczności dokładniejszej integracji z serwerem, korzystając jednocześnie z uwierzytelniania zapewnianego przez główny serwer. To najprostszy sposób, pozwalający na użycie plików instalacyjnych calibre bez dodatkowych zależności czy spełniania systemowych wymagań do integracji. Poniżej pokazano jak zintegrować w ten sposób calibre z Apache'em jako głównym serwerem, ale dokładnie tak samo zadziała to z każdym innym, który obsługuje odwrotne proxy.
pt_br: Um proxy reverso é quando seu servidor normal aceita solicitações de entrada e as passa para o servidor calibre. Ele então lê a resposta do servidor calibre e a direciona para o cliente. Isto significa que você pode simplesmente rodar o servidor calibre normalmente sem tentar integrá-lo profundamente com seu servidor principal, e pode se aproveitar de quaisquer sistemas de autenticação que seu servidor principal tenha implementado. Esta é a abordagem mais simples já que ela permite que você use o arquivo binário de instalação do calibre sem requisitos de integração com o sistema/dependências externas. Abaixo, está um exemplo de como realizar isto com Apache como seu servidor principal, mas funcionará com qualquer servidor que suporte Proxies Reversos.
tr: Bir ters vekil sunucu gelen istekleri kabul eden ve onları calibre sunucusuna ileten bir sunucudur. Yanıtı da calibre sunucusundan okur ve istemciye iletir. Bu calibre sunucusunu ana sunucunuza bütünleştirmek için uğraşmadan normal bir şekilde çalıştıracağınız ve ana sunucunuzun sağladığı kimlik doğrulama sisteminden faydalanabileceğiniz anlamına gelir. Bu calibre kurulumuna ilave biçbir dış bağımlılık veya sistem bütünleştirmesi ihtiyacı ile uğraşmayacağınız en basit yaklaşımdır. Aşağıda ana sunucunuz olarak Apache kullanıldığında bu işlemin nasıl yapıldığının bir örneği bulunmaktaysa da Ters Vekil Sunucu destekli her sunucu ile çalışacaktır.

source: First start the calibre content server as shown below::
de: Starten Sie zuerst den Calibre Netzwerkserver wie folgt::
ms: Pertama, mulakan pelayan kandungan calibre yang ditunjukkan di bawah::
pl: Najpierw uruchom serwer zawartości, jak to pokazano poniżej::
pt_br: Primeiro inicie o servidor de conteúdo do calibre como apresentado abaixo::
tr: İlk olarak calibre içerik sunucusunu aşağıdaki gibi başlatın::

source: The key parameter here is ``--url-prefix /calibre``. This causes the content server to serve all URLs prefixed by calibre. To see this in action, visit ``http://localhost:8080/calibre`` in your browser. You should see the normal content server website, but now it will run under /calibre.
de: Der wichtigste Parameter ist hier ``--url-prefix /calibre``. Er bewirkt, dass der Inhalte-Server alle URLs, die er bereitstellt, durch Calibre mit einem Präfix versieht. Um das zu beobachten, gehen Sie in Ihrem Browser auf ``http://localhost:8080/calibre``. Es sollte die normale Seite des Inhalte-Servers zu sehen sein, doch sie ist nun unter '/calibre' zu erreichen.
ms: Parameter kunci di sini ialah ``--url-prefix /calibre``. Ini membolehkan pelayan kandungan melayan semua URL yang diawali oleh calibre. Untuk melihat tindakan ini, lawati ``http://localhost:8080/calibre`` dalam pelayar anda. Anda dapat melihat laman sesawang pelayan kandungan biasa, tetapi kini ia akan dijalankan di bawah /calibre.
pl: Głównym parametrem jest tutaj ``--url-prefix /calibre``. Powoduje on, że serwer zawartości obsługuje wszystkie adresy, z prefiksem calibre. Żeby to przetestować wpisz w przeglądarce adres ``http://localhost:8080/calibre``. Powinieneś zobaczyć tę samą stronę calibre, co zawsze, teraz jednak jest ona pod adresem /calibre.
pt_br: O parâmetro chave aqui é "--url-prefix -calibre". Neste caso o servidor de conteúdo serve todas as URLs com prefixo calibre. Veja isso é ação visitando "http://localhost:8080/calibre" no seu navegador. Você pode ver o conteúdo normal de seu website, mas estará rodando abaixo de /calibre
tr: Buradaki anahtar parametre ``--url-prefix /calibre``dir. Bu içerik sunucusunun tüm adresleri calibre önekiyle sunacağı anlamına gelir. Bunu görmek için tarayıcınıza ``http://localhost:8080/calibre`` yazın. Normal içeriğinizin web sayfasında göründüğünü ama artık /calibre dizininde bulunduğunu göreceksiniz.

source: Now suppose you are using Apache as your main server. First enable the proxy modules in apache, by adding the following to :file:`httpd.conf`::
de: Nehmen wir nun an, Sie setzen Apache auf Ihrem Hauptserver ein. Aktivieren Sie in Apache zuerst die Proxy-Module, indem Sie folgendes zu :file:`httpd.conf` hinzufügen::
ms: Sekarang anggap anda menggunakan Apache sebagai pelayan utama anda. Pertama sekali, benarkan modul proksi di dalam apache, dengan menambah yang berikut ke :file:`httpd.conf`::
pl: Przypuśćmy, że używasz Apache'a jako głównego serwera. Najpierw musisz włączyć moduł proxy w Apache, dodając do :file:`httpd.conf`::
pt_br: Supondo que você esteja utilizando Apache como servidor principal. Primeiro habilite o módulo de proxy do Apache. Adicionando o seguinte ao arquivo :filé:'httpd.conf'::
tr: Şimdi ana sunucunuz olarak Apache kullandığınızı düşünelim. Önce Apache vekil sunucu modüllerini :file:`httpd.conf` dosyasına aşağıdakileri ekleyerek etkinleştirin::

source: The exact technique for enabling the proxy modules will vary depending on your Apache installation. Once you have the proxy modules enabled, add the following rules to httpd.conf (or if you are using virtual hosts to the conf file for the virtual host in question)::
de: Abhängig von Ihrer Apache-Installation, wird die genaue Vorgehensweise für die Aktivierung der Proxy-Module variieren. Sobald Sie diese aktiviert haben, fügen Sie folgende Regeln zu 'httpd.conf' (oder, falls Sie virtuelle Hosts verwenden, zur Konfigurationsdatei des zutreffenden virtuellen Hosts) hinzu::
ms: Teknik yang tepat untuk membenarkan modul proksi akan berubah mengikut cara pemasangan Apache anda. Bilamana anda telah membenarkan modul proksi, tambah peraturan berikut ke httpd.conf (atau jika anda menggunakan hos maya ke dalam fail conf untuk hos maya dalam persoalan)::
pl: Sposób włączania modułu proxy może być różny, w zależności od instalacji Apache'a. Kiedy moduł proxy jest włączony, dodaj następujące reguły do httpd.conf (albo, jeśli używasz wirtualnych hostów, do pliku konfiguracyjnego właściwego wirtualnego hosta):
pt_br: A técnica exata para habilitar o módulo de proxy pode mudar conforme sua instalação do Apache. Você tem que habilitar o módulo proxy adicionando as regras em httpd.conf (ou se utilizar virtual hosts no arquivo da virtual host corresponde a esta questão)::
tr: Vekil sunucu modüllerinin tam olarak nasıl etkinleştirileceği Apache kurulumunuza bağlıdır. Bir defa vekil sunucu modüllerini etkinleştirdiğinizde aşağıdaki kuralları httpd.conf dosyasına (veya sanal host kullanıyorsanız ilgili dosyaya) ekleyin::

source: That's all, you will now be able to access the calibre Content Server under the /calibre URL in your apache server. The above rules pass all requests under /calibre to the calibre server running on port 8080 and thanks to the --url-prefix option above, the calibre server handles them transparently.
de: Das war's schon. Ab jetzt können Sie den Calibre-Inhalteserver über die URL '/calibre' auf Ihrem Apache-Server erreichen. Die oben gezeigten Regeln geben alle Anfragen über '/calibre' an den Calibre-Server auf Port 8080 weiter, und Dank der oben gezeigten Option '--url-prefix', bearbeitet dieser jene transparent.
ms: Setakat ini sahaja, anda kini dapat mencapai Pelayan Kandungan di bawah URL /calibre dalam pelayan apache. Peratuan di atas melepasi semua permintaan di bawah /calibre kepada pelayan calibre yang dijalankan pada port 8080 dan atas penggunaan pilihan --url-prefix seperti di atas, pelayan calibre akan mengendalikannya tanpa masalah.
pl: To wszystko, teraz serwer zawartości calibre jest dostępny pod adresem /calibre. Powyższe reguły przekierowują wszystkie żądania z adresu /calibre do serwera zawartości calibre, działającego na porcie 8080, a dzięki argumentowi --url-prefix, calibre obsługuje je transparentnie.
pt_br: Isto é tudo, agora você pode acessar o servidor d conteúdo calibre abaixo da URL /calibre no seu servidor Apache. As regras acima passam toda a requisição abaixo de /calibre para o servidor rodando na porta 8080 e obriga a opção acima --url-prefix, o servidor calibre trabalha transparentemente.
tr: Hepsi bu kadar, artık apache sunucunuzda adresin sonuna /calibre yazarak calibre içerik sunucunuza ulaşabilirsiniz. Yukarıdaki kurallar /calibre dizini altındaki tüm istekleri calibre sunucunuzun 8080 portuna iletir ve yukarıdaki --url-prefix seçeneği sayesinde calibre sunucusu onları şeffaf olarak işler.

source: If you are willing to devote an entire VirtualHost to the content server, then there is no need to use --url-prefix and RewriteRule, instead just use the ProxyPass directive.
de: Wenn Sie dem Inhalte-Server einen ganzen virtuellen Host widmen möchten, gibt es keinen Grund für '--url-prefix' und 'RewriteRule'. Stattdessen reicht dann die 'ProxyPass'-Direktive aus.
ms: Jika anda mahu guna sepenuhnya VirtualHost ke pelayan kandungan, maka tidak perlu guna --url-prefix dan RewriteRule, sebagai pengganti guna arahan ProxyPass.
pl: Jeśli chcesz użyć wirtualnego hosta dedykowanego na serwer calibre, to nie ma potrzeby korzystania z --url-prefiks i RewriteRule, można po prostu użyć dyrektywy ProxyPass.
pt_br: Se você utiliza um VirtualHost para servidor de conteúdo, não precisa utilizar --url-prefix and RewriteRule, invés disso simplesmente utilize a diretiva ProxyPass
tr: Eğer bir Sanal Hst'un tamamını içerik sunucusuna ayırmak istiyorsanız --url-prefix ve RewriteRule ifadelerini kullanmanıza gerek yoktur, sadece ProxyPass kullanmanız yeterli olacaktır.

source: The server engine calibre uses, CherryPy, can have trouble with proxying and KeepAlive requests, so turn them off in Apache, with the SetEnv directives shown above.
de: Die Server-Engine CherryPy, die Calibre verwendet, kann Schwierigkeiten mit Proxys und 'KeepAlive'-Anfragen haben. Schalten Sie diese also in Apache mithilfe der 'SetEnv'-Direktiven aus.
ms: Enjin pelayan calibre gunakan iaitu, CherryPy, kadangkala menghadapi masalah dengan proses proksi dan permintaan KeepAlive, oleh itu sebaiknya matikan mereka di dalam Apache, dengan arahan SetEnv ditunjukkan seperti di atas.
pl: Serwer, którego używa calibre, CherryPy, może mieć kłopoty z proxy i żądaniami KeepAlive, wyłącz je więc w Apache poleceniami SetEnv, pokazanymi powyżej.
pt_br: O servidor do calibre utiliza CherryPy, pode ter problemas com proxying e requisições KeepAlive, desligue-o no Apache com as diretivas SetEnv apresentadas acima.
tr: calibre'nin kullandığı sunucu motoru, CherryPy, vekil sunucu ve KeepAlive istekleri ile sorun yaşayabileceğinden onları yukarıda gösterildiği gibi SetEnv ifadeleriyle Apache içinden kapatın.

source: In process
de: Innerhalb eines Prozesses
ms: Dalam proses
pl: Integracja
pt_br: Processando
tr: Uygulama içinde

source: The calibre content server can be run directly, in process, inside a host server like Apache using the WSGI framework.
de: Der Calibre-Inhalteserver kann direkt als Prozess, innerhalb eines Host-Servers wie Apache, mithilfe eines 'WSGI'-Rahmens betrieben werden.
ms: Pelayan kandungan calibre boleh dijalankan secara terus, dalam proses, di dalam pelayan hos seperti Apache menggunakan bingkai kerja WSGI.
pl: Serwer zawartości calibre może być zintegrowany z innym serwerem np. Apache przy użyciu WSGI.
pt_br: O servidor de conteúdo do calibre é executado dentro de um servidor como Apache usando o framework WSGI.
tr: calibre içerik sunucusu Apache gibi bir sunucu içinde WSGI çatısı kullanılarak uygulama içinde çalıştırılabilir.
