Repository: debian-calibre/calibre
Catalog: translations/manual/*/server.po
Languages: de, ms, pl, pt_br, ta, tr

source: The calibre Content server
ta: காலிபர் உள்ளடக்க சேவையகம்

source: The calibre :guilabel:`Content server` allows you to access your calibre libraries and read books directly in a browser on your favorite mobile phone or tablet device. As a result, you do not need to install any dedicated book reading/management apps on your phone. Just use the browser. The server downloads and stores the book you are reading in an off-line cache so that you can read it even when there is no internet connection.
ta: காலிபர்: கிலாபெல்: `உள்ளடக்க சேவையகம்` உங்கள் காலிபர் நூலகங்களை அணுகவும், உங்களுக்கு பிடித்த மொபைல் போன் அல்லது டேப்லெட் சாதனத்தில் உலாவியில் நேரடியாக புத்தகங்களைப் படிக்கவும் உங்களை அனுமதிக்கிறது. இதன் விளைவாக, உங்கள் தொலைபேசியில் எந்த பிரத்யேக புத்தக வாசிப்பு/மேலாண்மை பயன்பாடுகளையும் நிறுவ தேவையில்லை. உலாவியைப் பயன்படுத்துங்கள். சேவையகம் நீங்கள் படிக்கும் புத்தகத்தை ஆஃப்லைன் தற்காலிக சேமிப்பில் பதிவிறக்கம் செய்து சேமிக்கிறது, இதன் மூலம் இணைய இணைப்பு இல்லாதபோதும் அதைப் படிக்க முடியும்.

source: Contents
pl: Spis treści
pt_br: Conteúdo
ta: உள்ளடக்கங்கள்
tr: İçindekiler

source: To start the server, click the :guilabel:`Connect/share` button and choose :guilabel:`Start Content server`. You might get a message from your computer's firewall or anti-virus program asking if it is OK to allow access to ``calibre.exe``. Click the ``Allow`` or ``OK`` button. Then open a browser (preferably Chrome or Firefox) in your computer and type in the following address:
ta: சேவையகத்தைத் தொடங்க,: கிலாபெல்: `இணைக்கவும்/பகிரவும்` பொத்தானைக் கிளிக் செய்து தேர்வு செய்யவும்: கிலாபெல்:` உள்ளடக்க சேவையகத்தைத் தொடங்கவும்`. உங்கள் கணினியின் ஃபயர்வால் அல்லது வைரஸ் எதிர்ப்பு திட்டத்திலிருந்து ஒரு செய்தியைப் பெறலாம் `` calibre.exe``. `` அனுமதி` அல்லது `` சரி`` பொத்தானைக் கிளிக் செய்க. உங்கள் கணினியில் ஒரு உலாவியை (முன்னுரிமை Chrome அல்லது Firefox) திறந்து பின்வரும் முகவரியைத் தட்டச்சு செய்க:

source: The address used above ``http://127.0.0.1:8080`` will only work on the computer that is running calibre. To access the server from other computers/phones/tablets/etc. you will need to do a little more work, as described in the next section.
ta: `` Http: //127.0.0.1: 8080`` க்கு மேலே பயன்படுத்தப்படும் முகவரி காலிபர் இயங்கும் கணினியில் மட்டுமே வேலை செய்யும். பிற கணினிகள்/தொலைபேசிகள்/டேப்லெட்டுகள்/போன்றவற்றிலிருந்து சேவையகத்தை அணுக. அடுத்த பகுதியில் விவரிக்கப்பட்டுள்ளபடி, நீங்கள் இன்னும் கொஞ்சம் வேலை செய்ய வேண்டும்.

source: Accessing the Content server from other devices
ta: பிற சாதனங்களிலிருந்து உள்ளடக்க சேவையகத்தை அணுகும்

source: There are two types of remote device access that you will typically need. The first, simpler kind is from within your home network. If you are running calibre on a computer on your home network and you have also connected your other devices to the same home network, then you should be easily able to access the server on those devices.
ta: உங்களுக்கு பொதுவாக தேவைப்படும் இரண்டு வகைகள் தொலைநிலை சாதன அணுகல் உள்ளன. முதல், எளிமையான வகை உங்கள் வீட்டு நெட்வொர்க்கில் இருந்து வந்தது. உங்கள் வீட்டு நெட்வொர்க்கில் ஒரு கணினியில் நீங்கள் காலிபரை இயக்குகிறீர்கள் என்றால், உங்கள் பிற சாதனங்களையும் அதே வீட்டு நெட்வொர்க்குடன் இணைத்துள்ளீர்கள் என்றால், அந்த சாதனங்களில் சேவையகத்தை எளிதாக அணுக முடியும்.

source: Accessing the server from devices on your home network
ta: உங்கள் வீட்டு நெட்வொர்க்கில் உள்ள சாதனங்களிலிருந்து சேவையகத்தை அணுகலாம்

source: After starting the server in calibre as described above, click the :guilabel:`Connect/share` button again. Instead of the :guilabel:`Start Content server` action, you should see a :guilabel:`Stop Content server` action instead. To the right of this action will be listed an IP address and port number. These look like a bunch of numbers separated by periods. For example::
ta: மேலே விவரிக்கப்பட்டபடி காலிபரில் சேவையகத்தைத் தொடங்கிய பிறகு,: கிலாபெல்: `இணைக்கவும்/பகிரவும்` பொத்தானைக் கிளிக் செய்க. அதற்கு பதிலாக: கிலாபெல்: `உள்ளடக்க சேவையகத்தைத் தொடங்குங்கள்` செயல், நீங்கள் ஒரு: கிலாபெல்:` உள்ளடக்க சேவையகத்தை நிறுத்துங்கள். இந்த செயலின் வலதுபுறத்தில் ஐபி முகவரி மற்றும் போர்ட் எண் பட்டியலிடப்படும். இவை காலங்களால் பிரிக்கப்பட்ட எண்களின் கொத்து போல இருக்கும். உதாரணத்திற்கு::

source: These numbers tell you what address to use to connect to the server in your devices. Following the example above, the address becomes::
ta: உங்கள் சாதனங்களில் உள்ள சேவையகத்துடன் இணைக்க என்ன முகவரியைப் பயன்படுத்த வேண்டும் என்பதை இந்த எண்கள் உங்களுக்குக் கூறுகின்றன. மேலே உள்ள உதாரணத்தைத் தொடர்ந்து, முகவரி ::

source: The first part of the address is always ``http://`` the next part is the IP address, which is the numbers before the comma and finally we have the port number which must be added to the IP address with a colon (``:``). If you are lucky, that should be all you need and you will be looking at the calibre libraries on your device. If not, read on.
ta: முகவரியின் முதல் பகுதி எப்போதும் `` http: // `` அடுத்த பகுதி ஐபி முகவரி, இது கமாவுக்கு முந்தைய எண்கள் மற்றும் இறுதியாக எங்களிடம் போர்ட் எண் உள்ளது, இது ஒரு பெருங்குடலுடன் ஐபி முகவரியில் சேர்க்கப்பட வேண்டும் ``: ``). நீங்கள் அதிர்ஷ்டசாலி என்றால், அது உங்களுக்குத் தேவையானதாக இருக்க வேண்டும், மேலும் உங்கள் சாதனத்தில் உள்ள காலிபர் நூலகங்களைப் பார்ப்பீர்கள். இல்லையென்றால், படிக்கவும்.

source: Trouble-shooting the home network connection
ta: வீட்டு நெட்வொர்க் இணைப்பில் சிக்கல்

source: If you are unable to access the server from your device, try the following steps:
ta: உங்கள் சாதனத்திலிருந்து சேவையகத்தை அணுக முடியாவிட்டால், பின்வரும் படிகளை முயற்சிக்கவும்:

source: Check that the server is running by opening the address ``http://127.0.0.1:8080`` in a browser running on the same computer as the server.
ta: சேவையகத்தின் அதே கணினியில் இயங்கும் உலாவியில் `` http: //127.0.0.1: 8080`` என்ற முகவரியைத் திறப்பதன் மூலம் சேவையகம் இயங்குகிறதா என்பதைச் சரிபார்க்கவும்.

source: Check that your firewall/anti-virus is allowing connections to your computer on the port ``8080`` and to the calibre program. The easiest way to eliminate the firewall/anti-virus as the source of problems is to temporarily turn them both off and then try connecting. You should first disconnect from the internet, before turning off the firewall, to keep your computer safe.
ta: உங்கள் ஃபயர்வால்/வைரஸ் எதிர்ப்பு போர்ட் `` 8080`` மற்றும் காலிபர் திட்டத்தில் உங்கள் கணினியுடன் இணைப்புகளை அனுமதிக்கிறது என்பதை சரிபார்க்கவும். ஃபயர்வால்/வைரஸ் தடுப்பு பிரச்சினைகளின் ஆதாரமாக அகற்றுவதற்கான எளிதான வழி, அவை இரண்டையும் தற்காலிகமாக அணைத்துவிட்டு பின்னர் இணைக்க முயற்சிப்பதாகும். உங்கள் கணினியைப் பாதுகாப்பாக வைத்திருக்க, ஃபயர்வாலை அணைக்க முன், நீங்கள் முதலில் இணையத்திலிருந்து துண்டிக்க வேண்டும்.

source: Check that your device and computer are on the same network. This means they should both be connected to the same wireless router. In particular neither should be using a cellular or ISP provided direct-WiFi connection.
ta: உங்கள் சாதனமும் கணினியும் ஒரே பிணையத்தில் உள்ளனவா என்பதைச் சரிபார்க்கவும். இதன் பொருள் அவர்கள் இருவரும் ஒரே வயர்லெஸ் திசைவியுடன் இணைக்கப்பட வேண்டும். குறிப்பாக செல்லுலார் அல்லது ஐ.எஸ்.பி வழங்கப்பட்ட நேரடி-விஃபை இணைப்பைப் பயன்படுத்தக்கூடாது.

source: If you have non-standard networking setup, it might be that the IP address shown on the :guilabel:`Connect/share` menu is incorrect. In such a case you will have to figure out what the correct IP address to use is, yourself. Unfortunately, given the infinite diversity of network configurations possible, it is not possible to give you a roadmap for doing so.
ta: உங்களிடம் தரமற்ற நெட்வொர்க்கிங் அமைப்பு இருந்தால், ஐபி முகவரி: கிலாபெல்: `இணைக்க/பகிர்வு` மெனு தவறானது. அத்தகைய சந்தர்ப்பத்தில், பயன்படுத்த சரியான ஐபி முகவரி என்ன என்பதை நீங்கள் கண்டுபிடிக்க வேண்டும். துரதிர்ஷ்டவசமாக, நெட்வொர்க் உள்ளமைவுகளின் எல்லையற்ற பன்முகத்தன்மையைக் கருத்தில் கொண்டு, அவ்வாறு செய்வதற்கான ஒரு வரைபடத்தை உங்களுக்கு வழங்க முடியாது.

source: If you have setup a username and password, first try it without that to see if it is causing issues. Some e-ink devices have browsers that do not handle authentication. You can sometimes workaround this by including the username and password in the URL, for example: ``http://username:password@192.168.1.2:8080``.
ta: நீங்கள் ஒரு பயனர்பெயர் மற்றும் கடவுச்சொல்லை அமைத்திருந்தால், முதலில் அது இல்லாமல் முயற்சிக்கவும். சில ஈ-மை சாதனங்களில் உலாவிகள் உள்ளன, அவை அங்கீகாரத்தைக் கையாளாது. URL இல் பயனர்பெயர் மற்றும் கடவுச்சொல்லை சேர்ப்பதன் மூலம் நீங்கள் சில நேரங்களில் இதைச் செயல்படுத்தலாம், எடுத்துக்காட்டாக: `` http: // பயனர்பெயர்: கடவுச்சொல் @192.168.1.2: 8080``.

source: If you are stuck, you can always ask for help in the `calibre user forums`_.
ta: நீங்கள் சிக்கிக்கொண்டால், நீங்கள் எப்போதும் `காலிபர் பயனர் மன்றங்கள்`_ இல் உதவி கேட்கலாம்.

source: Accessing the server from anywhere on the internet
ta: இணையத்தில் எங்கிருந்தும் சேவையகத்தை அணுகலாம்

source: Before doing this you should turn on username/password protection in the server, otherwise anyone in the world will be able to access your books. Go to :guilabel:`Preferences->Sharing->Sharing over the net` and enable the option to :guilabel:`Require username and password to access the content server`.
ta: இதைச் செய்வதற்கு முன் நீங்கள் சேவையகத்தில் பயனர்பெயர்/கடவுச்சொல் பாதுகாப்பை இயக்க வேண்டும், இல்லையெனில் உலகில் உள்ள எவரும் உங்கள் புத்தகங்களை அணுக முடியும். இதற்குச் செல்லுங்கள்: கிலாபெல்: `விருப்பத்தேர்வுகள்-> பகிர்வு-> வலையில் பகிர்வது` என்பதற்கு விருப்பத்தை இயக்கவும்: கிலாபெல்:` உள்ளடக்க சேவையகத்தை அணுக பயனர்பெயர் மற்றும் கடவுச்சொல் தேவை`.

source: While the particular details on setting up internet access vary depending on the network configuration and type of computer you are using, the basic schema is as follows.
ta: இணைய அணுகலை அமைப்பது குறித்த குறிப்பிட்ட விவரங்கள் நீங்கள் பயன்படுத்தும் பிணைய உள்ளமைவு மற்றும் கணினியின் வகையைப் பொறுத்து மாறுபடும் போது, அடிப்படை திட்டம் பின்வருமாறு.

source: Find out the external IP address of the computer you are going to run the server on. You can do that by visiting the site `What is my IP address <https://www.whatismyip.com/>`_ in a browser running on the computer.
ta: நீங்கள் சேவையகத்தை இயக்கப் போகும் கணினியின் வெளிப்புற ஐபி முகவரியைக் கண்டறியவும். கணினியில் இயங்கும் உலாவியில் `எனது ஐபி முகவரி என்ன <https://www.whatismyip.com/> _` தளத்தைப் பார்வையிடுவதன் மூலம் நீங்கள் அதைச் செய்யலாம்.

source: If the computer is behind a router, enable port forwarding on the router to forward the port ``8080`` (or whatever port you choose to run the calibre Content server on) to the computer.
ta: கணினி ஒரு திசைவிக்கு பின்னால் இருந்தால், போர்ட் `` 8080`` (அல்லது காலிபர் உள்ளடக்க சேவையகத்தை இயக்க நீங்கள் தேர்வுசெய்த எந்த போர்ட்) கணினியில் அனுப்ப திசைவரில் போர்ட் பகிர்தலை இயக்கவும்.

source: Make sure the calibre server is allowed through any firewalls/anti-virus programs on your computer.
ta: உங்கள் கணினியில் எந்த ஃபயர்வால்கள்/வைரஸ் எதிர்ப்பு நிரல்கள் மூலமாக காலிபர் சேவையகம் அனுமதிக்கப்படுவதை உறுதிசெய்க.

source: Now you should be able to access the server on any internet-connected device using the IP address you found in the first step. For example, if the IP address you found was ``123.123.123.123`` and the port you are using for the calibre server is ``8080``, the address to use on your device becomes: ``http://123.123.123.123:8080``.
ta: முதல் கட்டத்தில் நீங்கள் கண்டறிந்த ஐபி முகவரியைப் பயன்படுத்தி இணையத்துடன் இணைக்கப்பட்ட எந்த சாதனத்திலும் சேவையகத்தை இப்போது அணுக முடியும். எடுத்துக்காட்டாக, நீங்கள் கண்டறிந்த ஐபி முகவரி `` 123.123.123.123`` மற்றும் காலிபர் சேவையகத்திற்கு நீங்கள் பயன்படுத்தும் துறை `` 8080`` என்றால், உங்கள் சாதனத்தில் பயன்படுத்த வேண்டிய முகவரி: `` http: //123.123 .123.123: 8080``.

source: Optionally, use a service like `no-ip <https://www.noip.com/free>`_ to setup an easy to remember address to use instead of the IP address you found in the first step.
ta: விருப்பமாக, முதல் கட்டத்தில் நீங்கள் கண்டறிந்த ஐபி முகவரிக்கு பதிலாக பயன்படுத்த எளிதான முகவரியை அமைக்க `இல்லை-ஐபி <https://www.noip.com/free> _ _ போன்ற சேவையைப் பயன்படுத்தவும்.

source: For maximum security, you should also enable HTTPS on the Content server. You can either do so directly in the server by providing the path to the HTTPS certificate to use in the advanced configuration options for the server, or you can setup a reverse proxy as described below, to use an existing HTTPS setup.
ta: அதிகபட்ச பாதுகாப்பிற்கு, உள்ளடக்க சேவையகத்தில் HTTP களையும் இயக்க வேண்டும். சேவையகத்திற்கான மேம்பட்ட உள்ளமைவு விருப்பங்களில் பயன்படுத்த HTTPS சான்றிதழுக்கான பாதையை வழங்குவதன் மூலம் நீங்கள் நேரடியாக சேவையகத்தில் அவ்வாறு செய்யலாம் அல்லது ஏற்கனவே உள்ள HTTPS அமைப்பைப் பயன்படுத்த, கீழே விவரிக்கப்பட்டுள்ளபடி தலைகீழ் ப்ராக்ஸியை அமைக்கலாம்.

source: The server interface
ta: சேவையக இடைமுகம்

source: The server interface is a simplified version of the main calibre interface, optimised for use with touch screens. The home screen shows you books you are currently reading as well as allowing to choose a calibre library you want to browse. The server in calibre gives you access to all your libraries, not just a single one, as before.
ta: சேவையக இடைமுகம் என்பது முக்கிய காலிபர் இடைமுகத்தின் எளிமைப்படுத்தப்பட்ட பதிப்பாகும், இது தொடுதிரைகளுடன் பயன்படுத்த உகந்ததாகும். நீங்கள் தற்போது படித்துக்கொண்டிருக்கும் புத்தகங்களையும், நீங்கள் உலவ விரும்பும் காலிபர் நூலகத்தைத் தேர்வுசெய்ய அனுமதிப்பதையும் முகப்புத் திரை காட்டுகிறது. காலிபரில் உள்ள சேவையகம் உங்கள் எல்லா நூலகங்களுக்கும் அணுகலை வழங்குகிறது, முன்பு போல ஒரு ஒற்றை மட்டுமல்ல.

source: The book list
ta: புத்தக பட்டியல்

source: The server book list is a simple grid of covers. Tap on a cover to see the detailed metadata for a book, or to read the book. If you prefer a more detailed list, you can change the default view by clicking the three vertical dots in the top right corner.
ta: சேவையக புத்தக பட்டியல் அட்டைகளின் எளிய கட்டம். ஒரு புத்தகத்திற்கான விரிவான மெட்டாடேட்டாவைக் காண அல்லது புத்தகத்தைப் படிக்க ஒரு அட்டையைத் தட்டவும். நீங்கள் இன்னும் விரிவான பட்டியலை விரும்பினால், மேல் வலது மூலையில் உள்ள மூன்று செங்குத்து புள்ளிகளைக் கிளிக் செய்வதன் மூலம் இயல்புநிலை காட்சியை மாற்றலாம்.

source: Sorting and searching of the book list should be familiar to calibre users. They can be accessed by clicking their icons in the top right area. They both work exactly the same as in the main calibre program. The search page even allows you to construct search queries by clicking on authors/tags/etc., just as you can using the Tag browser in the main program.
ta: புத்தக பட்டியலை வரிசைப்படுத்துதல் மற்றும் தேடுவது காலிபர் பயனர்களுக்கு தெரிந்திருக்க வேண்டும். அவர்களின் ஐகான்களை மேல் வலது பகுதியில் கிளிக் செய்வதன் மூலம் அவற்றை அணுகலாம். அவர்கள் இருவரும் பிரதான காலிபர் திட்டத்தைப் போலவே சரியாக வேலை செய்கிறார்கள். பிரதான நிரலில் குறிச்சொல் உலாவியைப் பயன்படுத்துவது போலவே, ஆசிரியர்கள்/குறிச்சொற்கள்/போன்றவற்றைக் கிளிக் செய்வதன் மூலம் தேடல் வினவல்களை உருவாக்க தேடல் பக்கம் கூட உங்களை அனுமதிக்கிறது.

source: A much loved feature of the main program, :guilabel:`Virtual libraries` is present in the server interface as well. Click the three vertical dots in the top right corner to choose a Virtual library.
ta: முக்கிய திட்டத்தின் மிகவும் விரும்பப்படும் அம்சம்,: கிலாபெல்: `மெய்நிகர் நூலகங்கள்` சேவையக இடைமுகத்திலும் உள்ளது. மெய்நிகர் நூலகத்தைத் தேர்வுசெய்ய மேல் வலது மூலையில் உள்ள மூன்று செங்குத்து புள்ளிகளைக் கிளிக் செய்க.

source: The book reader
ta: புத்தக வாசகர்

source: If you leave the Content server running, you can even open the same book on multiple devices and it will remember your last read position. If it does not you can force a sync by tapping in the top quarter and choosing :guilabel:`Sync`.
ta: உள்ளடக்க சேவையகத்தை இயக்குவதை நீங்கள் விட்டுவிட்டால், ஒரே புத்தகத்தை பல சாதனங்களில் கூட திறக்கலாம், மேலும் இது உங்கள் கடைசி வாசிப்பு நிலையை நினைவில் கொள்ளும். அது இல்லையென்றால், சிறந்த காலாண்டில் தட்டுவதன் மூலம் ஒரு ஒத்திசைவை கட்டாயப்படுத்தலாம்: கிலாபெல்: `ஒத்திசைவு`.

source: Browser support
ta: உலாவி ஆதரவு

source: The new calibre server makes lots of use of advanced HTML 5 and CSS 3 features. As such it requires an up-to-date browser to use. It has been tested on Android Chrome and iOS Safari as well as Chrome and Firefox on the desktop.
ta: புதிய காலிபர் சேவையகம் மேம்பட்ட HTML 5 மற்றும் CSS 3 அம்சங்களைப் பயன்படுத்துகிறது. எனவே இதைப் பயன்படுத்த புதுப்பித்த உலாவி தேவைப்படுகிறது. இது ஆண்ட்ராய்டு குரோம் மற்றும் ஐஓஎஸ் சஃபாரி மற்றும் டெஸ்க்டாப்பில் குரோம் மற்றும் பயர்பாக்ஸில் சோதிக்கப்பட்டுள்ளது.

source: The server is careful to use functionality that has either been already standardised or is on the standards track. As such if it does not currently work with your favorite browser, it probably will once that browser has caught up.
ta: சேவையகம் ஏற்கனவே தரப்படுத்தப்பட்ட அல்லது தர நிர்ணயத்தில் இருக்கும் செயல்பாட்டைப் பயன்படுத்த கவனமாக இருக்கிறது. இது தற்போது உங்களுக்கு பிடித்த உலாவியுடன் வேலை செய்யாவிட்டால், அந்த உலாவி பிடிபட்டவுடன் அது இருக்கும்.

source: If you are using a particularly old or limited browser or you don't like to run JavaScript, you can use the *mobile* view, by simply adding ``/mobile`` to the server address.
ta: நீங்கள் குறிப்பாக பழைய அல்லது வரையறுக்கப்பட்ட உலாவியைப் பயன்படுத்துகிறீர்கள் அல்லது ஜாவாஸ்கிரிப்டை இயக்க விரும்பவில்லை என்றால், சேவையக முகவரியில் ``/மொபைல்`` சேர்ப்பதன் மூலம் * மொபைல் * பார்வையைப் பயன்படுத்தலாம்.

source: On iOS, Apple allows only a single browser engine, so Firefox, Chrome and Safari are all actually the same browser under the hood. The new server interface requires iOS 10.3.2 or newer. On Android, the server has been tested with Chrome version 58 and newer.
ta: IOS இல், ஆப்பிள் ஒரு உலாவி இயந்திரத்தை மட்டுமே அனுமதிக்கிறது, எனவே பயர்பாக்ஸ், குரோம் மற்றும் சஃபாரி அனைத்தும் உண்மையில் ஒரே உலாவி. புதிய சேவையக இடைமுகத்திற்கு iOS 10.3.2 அல்லது புதியது தேவைப்படுகிறது. Android இல், சேவையகம் Chrome பதிப்பு 58 மற்றும் புதியது மூலம் சோதிக்கப்பட்டுள்ளது.

source: Enabling offline support
ta: ஆஃப்லைன் ஆதரவை செயல்படுத்துகிறது

source: Managing user accounts from the command-line only
ta: கட்டளை வரியிலிருந்து மட்டுமே பயனர் கணக்குகளை நிர்வகித்தல்

source: The calibre program has a nice section in :guilabel:`Preferences` to allow you to manage user accounts for the server. However, if you want to run the standalone server and cannot run the main calibre program on the same computer/user account, you can also manage users using just the command-line.
ta: காலிபர் நிரலில் ஒரு நல்ல பிரிவு உள்ளது: கிலாபெல்: `விருப்பத்தேர்வுகள்` சேவையகத்திற்கான பயனர் கணக்குகளை நிர்வகிக்க உங்களை அனுமதிக்க. இருப்பினும், நீங்கள் முழுமையான சேவையகத்தை இயக்க விரும்பினால், அதே கணினி/பயனர் கணக்கில் முக்கிய காலிபர் நிரலை இயக்க முடியாவிட்டால், பயனர்களை கட்டளை வரியைப் பயன்படுத்தி நிர்வகிக்கலாம்.

source: You can manage user accounts using the ``--manage-users`` option to the standalone ``calibre-server`` program. Suppose you want to store the user database in the folder ``/srv/calibre``, then you create it by running::
ta: ``-மானேஜ்-பயனர்கள்` விருப்பத்தை முழுமையான `` காலிபர்-சர்வர்`` திட்டத்தைப் பயன்படுத்தி பயனர் கணக்குகளை நிர்வகிக்கலாம். பயனர் தரவுத்தளத்தை ``/srv/calibre`` கோப்புறையில் சேமிக்க விரும்புகிறீர்கள் என்று வைத்துக்கொள்வோம், பின்னர் இயங்குவதன் மூலம் அதை உருவாக்குகிறீர்கள் ::

source: Just follow the prompts to create user accounts, set their permission, etc. Once you are done, you can run the server as::
ta: பயனர் கணக்குகளை உருவாக்கவும், அவற்றின் அனுமதியை அமைக்கவும் கேட்கும் தூண்டுதல்களைப் பின்பற்றுங்கள். நீங்கள் முடிந்ததும், சேவையகத்தை இயக்கலாம் ::

source: It will use the user accounts you created in the previous step.
ta: இது முந்தைய கட்டத்தில் நீங்கள் உருவாக்கிய பயனர் கணக்குகளைப் பயன்படுத்தும்.

source: Integrating the calibre Content server into other servers
ta: காலிபர் உள்ளடக்க சேவையகத்தை பிற சேவையகங்களில் ஒருங்கிணைத்தல்

source: Here, we will show you how to integrate the calibre Content server into another server. The most common reason for this is to make use of SSL or to serve the calibre library as part of a larger site. The basic technique is to run the calibre server and setup a reverse proxy to it from the main server.
ta: இங்கே, காலிபர் உள்ளடக்க சேவையகத்தை மற்றொரு சேவையகத்துடன் எவ்வாறு ஒருங்கிணைப்பது என்பதைக் காண்பிப்போம். இதற்கு மிகவும் பொதுவான காரணம், SSL ஐப் பயன்படுத்துவது அல்லது ஒரு பெரிய தளத்தின் ஒரு பகுதியாக காலிபர் நூலகத்திற்கு சேவை செய்வது. அடிப்படை நுட்பம் காலிபர் சேவையகத்தை இயக்கி, பிரதான சேவையகத்திலிருந்து தலைகீழ் ப்ராக்ஸியை அமைப்பது.

source: A reverse proxy is when your normal server accepts incoming requests and passes them onto the calibre server. It then reads the response from the calibre server and forwards it to the client. This means that you can simply run the calibre server as normal without trying to integrate it closely with your main server.
ta: உங்கள் சாதாரண சேவையகம் உள்வரும் கோரிக்கைகளை ஏற்றுக்கொண்டு அவற்றை காலிபர் சேவையகத்திற்கு அனுப்பும்போது ஒரு தலைகீழ் ப்ராக்ஸி. இது காலிபர் சேவையகத்திலிருந்து பதிலைப் படித்து கிளையண்டிற்கு அனுப்புகிறது. உங்கள் முக்கிய சேவையகத்துடன் நெருக்கமாக ஒருங்கிணைக்க முயற்சிக்காமல் காலிபர் சேவையகத்தை இயல்பாக இயக்க முடியும் என்பதே இதன் பொருள்.

source: Using a full virtual host
ta: முழு மெய்நிகர் ஹோஸ்டைப் பயன்படுத்துதல்

source: The simplest configuration is to dedicate a full virtual host to the calibre server. In this case, run the calibre server as::
ta: ஒரு முழு மெய்நிகர் ஹோஸ்டை காலிபர் சேவையகத்திற்கு அர்ப்பணிப்பதே எளிமையான உள்ளமைவு. இந்த வழக்கில், காலிபர் சேவையகத்தை இயக்கவும் ::

source: Now setup the virtual host in your main server, for example, for nginx::
ta: இப்போது உங்கள் பிரதான சேவையகத்தில் மெய்நிகர் ஹோஸ்டை அமைக்கவும், எடுத்துக்காட்டாக, nginx ::

source: Or, for Apache::
ta: அல்லது, அப்பாச்சிக்கு ::

source: Using a URL prefix
ta: URL முன்னொதியைப் பயன்படுத்துதல்

source: If you do not want to dedicate a full virtual host to calibre, you can have it use a URL prefix. Start the calibre server as::
ta: முழு மெய்நிகர் ஹோஸ்டை காலிபருக்கு அர்ப்பணிக்க நீங்கள் விரும்பவில்லை என்றால், அதை நீங்கள் ஒரு URL முன்னொதியைப் பயன்படுத்தலாம். காலிபர் சேவையகத்தைத் தொடங்கவும் ::

source: The key parameter here is ``--url-prefix /calibre``. This causes the Content server to serve all URLs prefixed by ``/calibre``. To see this in action, visit ``http://localhost:8080/calibre`` in your browser. You should see the normal Content server website, but now it will run under ``/calibre``.
ta: இங்கே முக்கிய அளவுரு `` --url-prefix /calibre``. இது உள்ளடக்க சேவையகம் ``/காலிபிரே`` ஆல் முன்னொட்டுள்ள அனைத்து URL களுக்கும் சேவை செய்ய காரணமாகிறது. இதை செயலில் காண, உங்கள் உலாவியில் `` http: // localhost: 8080/calibre`` ஐப் பார்வையிடவும். நீங்கள் சாதாரண உள்ளடக்க சேவையக வலைத்தளத்தைப் பார்க்க வேண்டும், ஆனால் இப்போது அது ``/காலிபிரே`` இன் கீழ் இயங்கும்.

source: With nginx, the required configuration is::
ta: Nginx உடன், தேவையான உள்ளமைவு ::

source: For Apache, first enable the proxy modules in Apache, by adding the following to :file:`httpd.conf`::
ta: அப்பாச்சிக்கு, முதலில் அப்பாச்சியில் ப்ராக்ஸி தொகுதிகளை இயக்கவும், பின்வருவனவற்றைச் சேர்ப்பதன் மூலம்: கோப்பு: `httpd.conf` ::

source: The exact technique for enabling the proxy modules will vary depending on your Apache installation. Once you have the proxy modules enabled, add the following rules to :file:`httpd.conf` (or if you are using virtual hosts to the conf file for the virtual host in question)::
ta: ப்ராக்ஸி தொகுதிகளை இயக்குவதற்கான சரியான நுட்பம் உங்கள் அப்பாச்சி நிறுவலைப் பொறுத்து மாறுபடும். நீங்கள் ப்ராக்ஸி தொகுதிகள் இயக்கப்பட்டதும், பின்வரும் விதிகளைச் சேர்க்கவும்: கோப்பு: `httpd.conf` (அல்லது கேள்விக்குரிய மெய்நிகர் ஹோஸ்டுக்கான CONF கோப்பில் மெய்நிகர் ஹோஸ்ட்களைப் பயன்படுத்துகிறீர்கள் என்றால்) ::
