Repository: debian-calibre/calibre
Catalog: translations/manual/*/server.po
Languages: de, ms, pl, pt_br, ta, tr

source: For this to work, all the dependencies needed by calibre must be installed on your system. Doing so is highly non-trivial and you are encouraged not to use in process servers. You will not get any assistance with debugging in process server problems.
de: Damit das funktioniert, müssen alle Abhängigkeiten Calibres auf Ihrem System installiert sein. Dies zu bewerkstelligen ist alles andere als trivial und es wird davon abgeraten Server innerhalb eines Prozesses zu einzusetzen. Sie werden keine Hilfestellung zur Fehlersuche bei Problemen auf solchen Im-Prozess-Servern erhalten.
ms: Untuk memastikannya berfungsi, semua dependensi yang diperlukan oleh calibre mesti dipasang dalam sistem anda. Membuatnya sangat tidak-trivial dan tidak digalakkan guna ia di dalam pelayan proses. Ini kerana, anda tidak akan dapat apa-apa bantuan berkenaan penyahpepijatan jika ada masalah pelayan proses.
pl: Aby to zadziałało, wszystkie potrzebne biblioteki muszą być zainstalowane w systemie. Może to być kłopotliwe i nie zaleca się stosowania tego sposobu w serwerach produkcyjnych. Nie jest dostępna żadna pomoc w przypadku problemów z integracją.
pt_br: Para isto funcionar, todas as dependências necessárias para o calibre devem ser instaladas no seu sistema. Isto não é trivial e encorajamos você a não usar um servidor de processo. Você não terá assistência com depuração em problemas de Servidor de processo.
tr: Bu işlem için calibre'nin tüm bağımlılıkları sisteminize kurulu olmalıdır. Bunu yapmak pek açık olmadığından sunucular içinde çalıştırmanız önerilmemektedir. Sunucu sorunlarının hatalarını ayıklamak için yardım alamayacaksınız.

source: First, we have to create a WSGI *adapter* for the calibre content server. Here is a template you can use for the purpose. Replace the paths as directed in the comments
de: Als Erstes müssen wir einen WSGI-*Adapter* für den Calibre-Inhalteserver erstellen. Hier haben Sie eine Vorlage dafür. Ersetzen Sie die Pfade, wie es in den Kommentaren beschrieben ist.
ms: Mula-mula, kita perlu wujudkan WSGI *adapter* untuk pelayan kandungan calibre content. Contoh di sini merupakan templat yang anda boleh gunakan. Gantikan laluan sepertimana yang diarah dalam ulasan
pl: Po pierwsze należy stworzyć *adapter* WSGI dla serwera calibre. Oto szablon, którym możesz posłużyć się w tym celu. Zmień ścieżki zgodnie ze wskazówkami w komentarzach.
pt_br: Primeiro, nós criamos um WSGI *adapter* para o servidor de conteúdo calibre. Aqui está um template que você pode utilizar. Altere os paths como indicado nos comentários.
tr: İlk olarak calibre içerik sunucunuza bir WSGI *bağdaştırıcı*oluşturmalısınız. Burada bu amaç için kullanabileceğiniz bir şablon bulacaksınız. Yolları uygun şekilde değiştirmelisiniz

source: Save this adapter as :file:`calibre-wsgi-adpater.py` somewhere your server will have access to it.
de: Speichern Sie diesen Adapter als :file:`calibre-wsgi-adpater.py`, wo Ihr Server zugriff darauf hat.
ms: Simpan penyesuai ini sebagai :file:`calibre-wsgi-adpater.py` dilokasi yang mana pelayan anda akan mencapainya.
pl: Zapisz ten adapter jako :file:`calibre-wsgi-adpater.py` w miejscu, do którego twój serwer ma dostęp.
pt_br: Salve o adaptador como :file:'calibre-wsgi-adapter.py' em alguma pasta que seu servidor tenha acesso.
tr: Bu bağdaştırıcıyı sunucunuzun erişebileceği bir yere :file:`calibre-wsgi-adpater.py` adıyla kaydedin.

source: Let's suppose that we want to use WSGI in Apache. First enable WSGI in Apache by adding the following to :file:`httpd.conf`::
de: Angenommen wir wollen WSGI in Apache einsetzen: Zuerst aktivieren Sie WSGI, indem Sie folgendes zu :file:`httpd.conf` hinzufügen::
ms: Kita anggap mahu gunakan WSGI di dalam Apache. Pertama, benarkan WSGI di dalam Apache dengan menambah yang berikut ke dalam :file:`httpd.conf`::
pl: Przypuśćmy, że chcesz użyć WSGI w Apache'u. Najpierw trzeba włączyć WSGI, dodając do :file:`httpd.conf` następujące polecenie::
pt_br: Suponha que esteja usando WSGI no Apache. Primeiro habilite o WSGI no Apache adicionando a linha a seguir em :file:'httpd.conf'::
tr: Şimdi Apache içinde WSGI kullanmak istediğinizi varsayalım. İlk olarak :file:`httpd.conf`dosyasına aşağıdaki satırı ekleyerek Apache içinde WSGI'yı etkinleştirin::

source: The exact technique for enabling the wsgi module will vary depending on your Apache installation. Once you have the proxy modules enabled, add the following rules to httpd.conf (or if you are using virtual hosts to the conf file for the virtual host in question::
de: Abhängig von Ihrer Apache-Installation, wird die genaue Vorgehensweise für die Aktivierung des WSGI-Moduls variieren. Sobald Sie dieses aktiviert haben, fügen Sie folgende Regeln zu 'httpd.conf' (oder, falls Sie virtuelle Hosts verwenden, zur Konfigurationsdatei des zutreffenden virtuellen Hosts) hinzu::
ms: Teknik yang tepat untuk membenarkan modul wsgi akan berubah mengikut cara pemasangan Apache anda. Bilamana anda telah membenarkan modul proksi, tambah peraturan berikut ke httpd.conf (atau jika anda menggunakan hos maya ke dalam fail conf untuk hos maya dalam question::
pl: Sposób włączania WSGI może się różnić w zależności od instalacji Apache'a. Po włączeniu modułów proxy dodaj następujące reguły do httpd.conf (albo, jeśli używasz wirtualnych hostów, do pliku konfiguracyjnego wirtualnego hosta)::
pt_br: A técnica exata para habilitar o módulo wsgi pode mudar dependendo da instalação do Apache. Você tem que habilitar o módulo de proxy, adicionando as seguintes regras em httpd.conf (ou se você utiliza virtual hosts no arquivo correspondente a esta questão::
tr: WSGI modülünün tam olarak etkinleştirilmesi Apache kurulumunuza bağlıdır. Vekil sunucu modülleri etkinleştirildiğinde aşağıdaki kuralı httpd.conf (veya ilgili sanal suncuu dosyasına) dosyasına ekleyin::

source: Change the path to :file:`calibre-wsgi-adapter.py` to wherever you saved it previously (make sure Apache has access to it).
de: Passen Sie den Pfad zu :file:`calibre-wsgi-adapter.py` auf den Pfad Ihres Speicherortes an. (Stellen Sie sicher, dass Apache zugriff darauf hat).
ms: Ubah laluan ke :file:`calibre-wsgi-adapter.py` ke mana sahaja yang anda simpan ia sebelum ini (pastikan Apache dapat mencapainya).
pl: Zmień ścieżkę do pliku :file:`calibre-wsgi-adapter.py` na lokalizację, w której go zapisałeś (upewnij się, że Apache ma do niej dostęp).
pt_br: Escolha o local para salvar o arquivo :file:'calibre-wsgi-adapter.py' (o Apache deve ter acesso a ele)
tr: :file:`calibre-wsgi-adapter.py` dosyasının yolunu önceden kaydettiğiniz şekilde değiştirin (Apache'nin buraya erişimi olduğundan emin olun).

source: That's all, you will now be able to access the calibre Content Server under the /calibre URL in your apache server.
de: Das war's schon. Ab jetzt können Sie den Calibre-Inhalteserver über die URL '/calibre' auf Ihrem Apache-Server erreichen.
ms: Setakat ini sahaja, anda kini akan dapat mencapai Pelayan Kandungan calibre di bawah URL / calibre di dalam pelayan apache anda.
pl: To wszystko, teraz serwer calibre jest dostępny pod adresem twojego serwera jako /calibre.
pt_br: Isto é tudo, agora você pode acessar o servidor de Conteúdo do calibre pela URL /calibre em seu servidor Apache.
tr: Hepsi bu kadar, artık Apache sunucunuzdan /calibre adresi altından calibre İçerik Sunucusuna erişebilirsiniz.

source: For more help with using mod_wsgi in Apache, see `mod_wsgi <http://code.google.com/p/modwsgi/wiki/WhereToGetHelp>`_.
pl: Więcej informacji na temat mod_wsgi w Apache znajdziesz w `code.google.com <http://code.google.com/p/modwsgi/wiki/WhereToGetHelp>`_.
pt_br: Mais informações de como utilizar o mod_wsgi no Apache, veja `mod_wsgi <http://code.google.com/p/modwsgi/wiki/WhereToGetHelp>`_.
tr: Apache ile mod_wsgi kullanımı için `mod_wsgi <http://code.google.com/p/modwsgi/wiki/WhereToGetHelp>`_ sayfasına bakabilirsiniz.

source: For more help with using mod_wsgi in Apache, see `mod_wsgi <https://code.google.com/p/modwsgi/wiki/WhereToGetHelp>`_.
ms: Untuk bantuan lanjut berkenaan penggunaan mod_wsgi di dalam Apache, sila rujuk `mod_wsgi <https://code.google.com/p/modwsgi/wiki/WhereToGetHelp>`_.
