Repository: debian-calibre/calibre
Catalog: translations/manual/*/snippets.po
Languages: sv

source: Snippets
sv: Avsnitt

source: The calibre editor supports *snippets*. A snippet is a piece of text that is either re-used often or contains a lot of redundant text. The editor allows you to insert a snippet with only a few key strokes. For example, suppose you often find yourself inserting link tags when editing HTML files, then you can simply type ``<a`` in the editor and press |ct|. The editor will expand it to::
sv: Den calibre redigerare stöder *avsnitt*. Ett avsnitt är ett stycke text som antingen återanvänds ofta eller innehåller mycket överflödig text. Redigeraren kan du infoga ett avsnitt med endast ett fåtal knapptryckningar. Anta till exempel att du ofta befinner dig sätta in etikettlänkar när du redigerar HTML-filer, då kan du helt enkelt skriva ``<a`` i redigeraren och trycka |ct|. Redigeraren kommer att expandera den till::

source: Not only that, the word ``filename`` will be selected, with the cursor placed over it, so that you can easily type in the real filename, using the editor's nifty :ref:`editor_auto_complete` feature. And once you are done typing the filename, press |ct| again and the cursor will jump to the position in between the ``<a>`` tags so you can easily type in the text for the link.
sv: Inte bara det, kommer ordet ``filnamn`` väljas, med markören placeras över det, så att du enkelt kan skriva i den verkliga filnamnet, använder redaktörens fiffiga :ref:`editor_auto_complete`-funktionen. Och när du är klar att skriva filnamnet tryck |ct| igen och markören hoppar till positionen i mellan ``<a>`` etiketter så att du enkelt kan skriva in texten för länken.

source: The snippets system in the editor is very sophisticated, there are a few built-in snippets and you can create your own to suit your editing style.
sv: Avsnittsystemet i redigeraren är mycket sofistikerad, finns det några inbyggda avsnitt och du kan skapa din egen för att passa din redigeringsstil.

source: The following discussion of the built-in snippets should help illustrate the power of the snippets system.
sv: Följande diskussion av de inbyggda avsnitt bör hjälpa illustrera kraften i avsnittsystemet.

source: You can also use snippets in the text entry fields in the :guilabel:`Search & replace` panel, however, placeholders (using |ct| to jump around) will not work.
sv: Du kan också använda avsnitt i textinmatningsfält i :guilabel:`Sök och ersätt`-panelen, dock platshållare (med |ct| för att hoppa runt) kommer inte att fungera.

source: The built-in snippets
sv: Inbyggda avsnitt

source: The built-in snippets are described below. Note that you can override them by creating your own snippets with the same trigger text.
sv: De inbyggda avsnitt beskrivs nedan. Observera att du kan åsidosätta dem genom att skapa egna avsnitt med samma textutlösare.

source: Inserting filler text [Lorem]
sv: Infoga fyllnadstext [Lorem]

source: The first built-in snippet, and the simplest is used to insert filler text into a document. The filler text is taken from `De finibus bonorum et malorum <https://en.wikipedia.org/wiki/De_finibus_bonorum_et_malorum>`_ a philosophical work by Cicero (translated to English). To use it simply type ``Lorem`` in an HTML file and press |ct|. It will be replaced by a couple of paragraphs of filler.
sv: Det första inbyggda avsnittet, och det enklaste används för att infoga fyllnads text i ett dokument. Fyllnadstexten är hämtad från `De finibus bonorum et malorum <https://en.wikipedia.org/wiki/De_finibus_bonorum_et_malorum>`_ ett filosofiskt verk av Cicero (översatt till engelska). För att använda den helt enkelt skriva ``Lorem`` i en HTML-fil och tryck |ct|. Det kommer att ersättas av ett par stycken av fyllnadstext.

source: The definition of this snippet is very simple, the trigger text is defined as ``Lorem`` and the template is defined simply as the literal text to be inserted. You can easily customize it to use your favorite form of filler text.
sv: Definitionen av detta avsnitt är mycket enkel, textutlösaren definieras som ``Lorem`` och mallen definieras helt enkelt som den bokstav texten som ska infogas. Du kan enkelt anpassa den för att använda din favorit form av fyllnadstext.

source: Inserting a self-closing HTML tag [<>]
sv: Infoga en självstängande HTML-etikett [<>]

source: Now let's look at a simple example of the powerful concept of *placeholders*. Say you want to insert the self-closing tag ``<hr/>``. Just type ``<>``, and press |ct|, the editor will expand the snippet to::
sv: Nu ska vi titta på ett enkelt exempel på den kraftfulla begreppet *platshållare*. Säg att du vill infoga självstängande etiketten ``<hr/>``. Skriv bara ``<>`` och tryck |ct| så kommer redigeraren expandera avsnittet till::

source: Here, the ``|`` symbol represents the current cursor position. You can then type ``hr`` and press |ct| to move the cursor to after the end of the tag. This snippet is defined as::
sv: Här, representerar ``|`` symbolen den aktuella markörpositionen. Du kan sedan skriva ``hr`` och trycka |ct| för att flytta markören till efter slutet av etiketten. Detta avsnitt definieras som::

source: Placeholders are simply the dollar ($) sign followed by a number. When the snippet is expanded by pressing |ct| the cursor is positioned at the first placeholder (the placeholder with the lowest number). When you press |ct| again the cursor jumps to the next placeholder (the placeholder with the next higher number).
sv: Platshållare är helt enkelt dollar ($)-tecken följt av ett nummer. När avsnittet utökas genom att trycka |ct| är markören placerad vid den första platshållaren (platshållaren med det lägsta numret). När du trycker på |ct| igen markören hoppar till nästa platshållare (platshållaren med nästa högre nummer).

source: Inserting an HTML link tag [<a]
sv: Infoga en HTML-länketikett [<a]

source: HTML link tags all share a common structure. They have an ``href`` attribute and some text between the opening and closing tags. A snippet to make typing them more efficient will introduce us to some more features of placeholders. To use this snippet, simply type ``<a`` and press |ct|. The editor will expand this to::
sv: HTML-länketiketter delar alla en gemensam struktur. De har ett ``href`` attribut och lite text mellan start- och slutetiketten. Ett avsnitt att skriva in dem mer effektiva kommer att introducera oss till några fler funktioner i platshållare. För att använda denna textavsnitt, skriv helt enkelt ``<a`` och tryck |ct|. Redigeraren kommer att utöka detta till::

source: Not only that, the word ``filename`` will be selected, with the cursor placed over it, so that you can easily type in the real filename, using the editor's nifty :ref:`editor_auto_complete` feature. And once you are done typing the filename, press |ct| again and the cursor will jump to the position in between the ``<a>`` tags so you can easily type in the text for the link. After you are done typing the text, press |ct| again to jump to the point after the closing tag. This snippet is defined as::
sv: Inte bara det, kommer ordet ``filnamn`` väljas, med markören placeras över det, så att du enkelt kan skriva i den verkliga filnamnet, använder redigerarens fiffiga :ref:`editor_auto_complete`-funktionen. Och när du är klar att skriva filnamnet trycker |ct| igen och markören hoppar till positionen i mellan ``<a>`` etiketter så att du enkelt kan skriva in texten för länken. När du är klar skriver texten, tryck |ct| igen för att hoppa till positionen efter den avslutande etiketten. Detta avsnittet definieras som::

source: There are a couple of new features here. First the ``$1`` placeholder has become more complex. It now includes some *default text* (the word ``filename``). If a placeholder contains default text, the default text is substituted for the placeholder when the snippet is expanded. Also when you jump to a placeholder with default text using |ct|, the default text is selected. In this way, you can use default text to act as a reminder to you to fill in important parts of the template. You can specify default text for a placeholder by using the syntax: ``${<number>:default text}``.
sv: Det finns ett par nya funktioner här. Först ``$1`` platshållare har blivit mer komplex. Den innehåller nu en del *standardtext* (ordet `` filename``). Om en platshållare innehåller standardtext, är standardtexten istället för platshållaren när avsnittet utvidgas. Även när du hoppar till en platshållare med standardtext som använder |ct|, väljs standardtexten. På detta sätt kan du använda standardtexten som en påminnelse till dig att fylla i viktiga delar av mallen. Du kan ange standardtext för en platshållare genom att använda syntaxen: ``${<number>:default text}``.

source: The other new feature is that the second placeholder has an asterisk after it (``${2*}``). This means that any text that was selected before expanding the template is substituted for the placeholder. To see this in action, select some text in the editor, press |ct|, type ``<a`` and press |ct| again, the template will be expanded to::
sv: Den andra nyheten är att den andra platshållaren har en asterisk efter det (``${2*}``). Det innebär att all text som valdes innan expansion ersätts mallen av platshållaren. För att se detta i handling, välja någon text i redigeraren, tryck |ct|, typ ``<a`` och tryck |ct| igen, mallen kommer att utökas till::

source: Inserting a HTML image tag [<i]
sv: Infoga en HTML-bildetikett [<i]

source: This is very similar to inserting an HTML link, as we saw above. It allows you to quickly input an ``<img src="filename" alt="description" />`` tag and jump between the ``src`` and ``alt`` attributes::
sv: Detta är mycket likt att infoga en HTML-länk, som vi såg ovan. Det gör att du snabbt kan mata in en ``<img src="filename" alt="description" />`` etikett och hoppa mellan ``src`` och ``alt`` attribut::

source: Insert an arbitrary HTML tag [<<]
sv: Infoga en godtycklig HTML-etikett [<<]

source: This allows you to insert an arbitrary full HTML tag (or wrap previously selected text in the tag). To use it, simply type ``<<`` and press |ct|. The editor will expand it to::
sv: Detta låter dig infoga en godtycklig fullständig HTML-etikett (eller radbryta tidigare markerad text i etiketten). För att använda det, skriv bara ``<<`` och tryck |ct|. Redigeraren kommer att expandera den till::

source: Type the tag name, for example: ``span`` and press |ct|, that will result in::
sv: Skriv etikettnamnet, till exempel: ``span`` och tryck |ct|, som kommer att resultera i::

source: You will note that the closing tag has been automatically filled with ``span``. This is achieved with yet another feature of placeholders, *mirroring*. Mirroring simply means that if you specify the sample placeholder more than once in a template, the second and all later positions will be automatically filled in with whatever you type in the first position, when you press |ct|. The definition for this snippet is::
sv: Du kommer att observera att den avslutande etiketten automatiskt har fyllts med ``span``. Detta uppnås med ännu ett annat särdrag av platshållare, *spegling*. Spegling betyder helt enkelt att om du anger provplatshållaren mer än en gång i en mall, den andra och alla senare positioner kommer automatiskt fyllas i med vad du skriver i det första positionen, när du trycker |ct|. Definitionen för detta avsnitt är::

source: As you can see, the first placeholder ($1) has been specified twice, the second time in the closing tag, which will simply copy whatever you type in the opening tag.
sv: Som ni kan se, har den första platshållaren ($1) specificerats två gånger, andra gången i den avslutande etiketten, som helt enkelt kommer att kopiera vad du skriver i öppningsetiketten.

source: Inserting an arbitrary HTML tag with a class attribute [<c]
sv: Infoga en godtycklig HTML-etikett med ett klassattribut [<c]

source: This is very similar to the insert arbitrary tag example above, except that it assumes that you want to specify a class for the tag::
sv: Detta är mycket likt infogningen av godtycklig etikett i exemplet ovan, förutom att det förutsätter att du vill ange en klass för etiketten::

source: This will allow you to first type the tag name, press |ct|, type the class name, press |ct| type the contents of the tag and press |ct| one last time to jump out of the tag. The closing tag will be auto-filled.
sv: Detta gör att du kan först skriva etikettnamnet, tryck |ct|, skriv klassnamnet, tryck |ct|, skriv innehållet i etiketten och tryck |ct| en sista gång för att hoppa ur etiketten. Den avslutande etiketten kommer att automatiskt fyllas.

source: Creating your own snippets
sv: Skapa dina egna avsnitt

source: Snippets really shine because you can create your own to suit your editing style. To create your own snippets go to :guilabel:`Edit->Preferences->Editor settings->Manage snippets` in the editor. This will pop-up an easy to use dialog to help you create your own snippets. Simply click the :guilabel:`Add snippet` button and you will see a dialog that looks like:
sv: Avsnitt lyser verkligen eftersom du kan skapa dina egna för att passa din redigeringsstil. För att skapa egna avsnitt gå till :guilabel:`Redigera->Inställningar->Redigerarinställningar->Hantera avsnitt` i redigeraren. Detta kommer att ta fram en lättanvänd dialogruta för att hjälpa dig att skapa dina egna avsnitt. Klicka bara på knappen :guilabel:`Lägg till avsnitt` och du kommer att se en dialogruta som ser ut:

source: First give your snippet a name, something descriptive, to help identify the snippet in the future. Then specify the *trigger*. A trigger is simply the text that you have to type in the editor before pressing |ct| in order to expand the snippet.
sv: Först ge ditt avsnitt ett namn, något beskrivande, för att hjälpa till att identifiera avsnittet i framtiden. Ange sedan *textutlösare*. En textutlösare är helt enkelt den text som du måste skriva i redigeraren innan du trycker |ct| för att expandera avsnittet.

source: Then specify the snippet template. You should start with one of the example above and modify it to suit your needs. Finally, specify which file types you want the snippet to be active for. This way you can have multiple snippets with the same trigger text that work differently in different file types.
sv: Ange sedan avsnittsmallen. Du bör börja med en av exemplet ovan och ändra det för att passa dina behov. Slutligen, ange vilka filtyper du vill att avsnittet ska vara aktiv för. På så sätt kan du ha flera avsnitt med samma textutlösare som fungerar olika i olika filtyper.

source: The next step is to test your newly created snippet. Use the :guilabel:`Test` box at the bottom. Type in the trigger text and press |ct| to expand the snippet and jump between placeholders.
sv: Nästa steg är att testa ditt nyskapade avsnitt. Använd :guilabel:`Test`-rutan längst ner. Skriv in textutlösaren och tryck |ct| att utöka avsnittet och hoppa mellan platshållarna.
