Repository: debian-calibre/calibre
Catalog: translations/manual/*/template_lang.po
Languages: ja, nl, ta, zh_cn

source: When an item with a `search template` is clicked in :guilabel:`Book details` the template is evaluated. It is provided the normal book metadata. It is also provided three additional fields:
zh_cn: 当在“:guilabel:图书详情”面板中点击一个带有“搜索模板”的项目时，该模板将被执行。系统会为其提供常规的书籍元数据，此外还会额外提供三个字段：

source: ``item_value``: the value of the clicked item.
zh_cn: item_value：被点击项目的具体内容。

source: ``item_value_quoted``: the value of clicked item, URL-encoded. Special characters are escaped to make them valid in URLs and spaces are replaced by ``'+'`` (plus) signs.
zh_cn: item_value_quoted：被点击项目的 URL 编码值。特殊字符将被转义以确保在 URL 中有效，空格则会被替换为 '+'（加号）。

source: ``item_value_no_plus``: the value of clicked item, URL-encoded. Special characters are escaped to make them valid in URLs and spaces are replaced by the ``%20``, not plus.
zh_cn: item_value_no_plus：被点击项目的 URL 编码值。特殊字符将被转义以确保在 URL 中有效，空格将被替换为 %20，而不是加号。

source: There are several ways to construct the URL. The following use Wikipedia as an example.
zh_cn: 构建 URL 有多种方式。以下以维基百科（Wikipedia）为例。

source: The simplest is a basic template::
zh_cn: 最简单的是基础模板::

source: In some cases you might want to do more processing. There are four template functions you can use, depending on the complexity of the processing.
zh_cn: 在某些情况下，你可能希望进行更多的处理。根据处理过程的复杂程度，有四种模板函数可供使用。

source: For example, assume you have a custom column `Translators` (``#translators``) where the names are `Last name, First name`. You might need to convert the name to `First name Last name` when creating the URL. You can use the :ref:`ff_make_url` function to do this::
zh_cn: 例如，假设你有一个名为‘译者’（#translators）的自定义列，其中的姓名格式为‘姓, 名’。在创建 URL 时，你可能需要将姓名转换为‘名 姓’。你可以使用 :ref:ff_make_url 函数来实现这一点::

source: If we assume that the translator's name is `Boy-Żeleński, Tadeusz` then the above template produces the link::
zh_cn: 假设译者的姓名是 Boy-Żeleński, Tadeusz，那么上述模板将生成如下链接::

source: Note that the person's first name is now first, the space is now a plus, and that the non-English characters in the last name are URL-encoded.
zh_cn: 请注意，现在名字（First name）排在了前面，空格被替换成了加号（+），并且姓氏中的非英语字符已进行了 URL 编码。

source: The functions :ref:`ff_make_url_extended`, :ref:`ff_query_string`, and :ref:`ff_encode_for_url` might be useful depending upon any additional processing complexity.
zh_cn: 根据后续处理的复杂程度， :ref:`ff_make_url_extended`, :ref:`ff_query_string`, 以及 :ref:`ff_encode_for_url` 这些函数可能也会非常有用。

source: **The calibre URL scheme**
zh_cn: **calibre URL协议**

source: Calibre supports several different URLs to navigate your calibre libraries. This section shows how to use templates to construct some of the URLs. See :doc:`url_scheme` for details on the URLs available.
zh_cn: Calibre 支持多种不同的 URL 用于导航你的 Calibre 书库。本节将展示如何使用模板来构建其中的部分 URL。有关可用 URL 的详细信息，请参阅 :doc:`url_scheme` 。

source: Switch to a specific library. The syntax of this URL is::
zh_cn: 切换到特定的书库。此 URL 的语法如下::

source: ``Library_Name`` must be replaced with the name of the calibre library you wish to open. The library name is shown in the title bar of the window. It is a simple name, not the file path to the library. You must spell it as shown in the title bar, including letter case. The character ``_`` (underscore) stands for the current library. If the name contains any spaces or special characters then it must be hex encoded using the :ref:`ff_to_hex` function, as in the following example::
zh_cn: Library_Name 必须替换为你希望打开的 Calibre 书库的名称。书库名称显示在窗口的标题栏中。它是一个简单的名称，而不是书库的文件路径。你必须按照标题栏中显示的名称书写，包括字母的大小写。字符 _（下划线）代表当前书库。如果名称包含任何空格或特殊字符，则必须使用 :ref:ff_to_hex 函数进行十六进制编码，如下例所示::

source: The template generates the URL::
zh_cn: 该模板将生成 URL::

source: You can replace the ``current_library_name()`` function with the actual name of the library, as in::
zh_cn: 你可以将 current_library_name() 函数替换为书库的实际名称，例如::

source: Links to show books. These links select a book in the calibre library. The syntax for this URL is::
zh_cn: 显示书籍的链接。这些链接用于在 Calibre 书库中选中某本书。此 URL 的语法如下::

source: The ``book id`` is the numeric calibre id for the book, available to templates as ``$id``. As above, the library name might need to be hex encoded. Here is an example::
zh_cn: book id 是 Calibre 为书籍分配的数字 ID，在模板中可以通过 $id 获取。与前文相同，书库名称可能需要进行十六进制编码。示例如下::

source: It produces the URL::
zh_cn: 它生成如下的 URL::

source: Searching for books. These links search for books in the specified calibre library. The syntax for this URL is::
zh_cn: 搜索书籍。这些链接用于在指定的 Calibre 书库中搜索书籍。此 URL 的语法如下::

source: where `query` is any valid calibre search expression. You must hex encode any query containing spaces or special characters, which generally means all of them. For example, the calibre search expression for searching for a hierarchical tag beginning with 'AA' is ``tags:"=.AA"``. This template constructs a search URL for that expression::
zh_cn: 其中 query 是任何有效的 Calibre 搜索表达式。如果查询内容包含空格或特殊字符（通常所有查询都包含），则必须进行十六进制编码。例如，搜索以‘AA’开头的层级标签，其 Calibre 搜索表达式为 tags:"=.AA"。以下模板为该表达式构建了一个搜索 URL::

source: The resulting URL is::
zh_cn: 生成的 URL 如下::

source: Here is an example of the same URL built using the :ref:``ff_make_url_extended`` function instead of :ref:`ff_strcat`::
zh_cn: 以下是使用:ref:``ff_make_url_extended`` 函数代替 :ref:`ff_strcat` 构建相同 URL 的示例::

source: Open a book details window on a book in some library. The syntax for this URL is::
zh_cn: 在某个书库中打开书籍详情窗口。此 URL 的语法如下::

source: An example template is::
zh_cn: 示例模板如下::

source: which produces the URL::
zh_cn: 生成如下的 URL::

source: Open the notes associated with an author/series/etc. The syntax of the URL is::
zh_cn: 打开与作者、丛书等相关联的备注。此 URL 的语法如下::

source: ``Field_Name`` is the lookup name of the field. If the field is a custom column then replace the ``#`` character with an underscore (``_``). ``Item_Id`` is the internal numeric ID of the value in the field. There isn't a template function that returns the ``Item_Id``, so templates will normally use the second form, ``Hex_Encoded_Item_Name``. Here is a sample template that opens the note for the person ``Boy-Żeleński, Tadeusz`` in the field ``#authtest``::
zh_cn: Field_Name 是该字段的查找名称（Lookup name）。如果该字段是自定义列，请将 # 字符替换为下划线（_）。Item_Id 是该字段值在内部的数字 ID。由于目前没有返回 Item_Id 的模板函数，因此模板通常使用第二种形式，即 Hex_Encoded_Item_Name（经十六进制编码的项目名称）。以下是一个示例模板，用于打开 #authtest 字段中名为 Boy-Żeleński, Tadeusz 这一作者的备注::

source: You can add your own Python functions to the template processor. Such functions can be used in any of the three template programming modes. The functions are added by going to :guilabel:`Preferences -> Advanced -> Template functions`. Instructions are shown in that dialog. Note that you can use `Python Templates` for a similar purpose. As calling user-defined functions is faster than calling a Python template, user-defined functions might be more efficient depending on the complexity of what the function or template does.
zh_cn: 您可以向模板处理器添加自定义的 Python 函数。此类函数可用于三种模板编程模式中的任何一种。通过进入 :guilabel:首选项 -> 高级 -> 模板函数 即可添加这些函数。该对话框中会显示具体的说明。请注意，您也可以出于类似目的使用 Python 模板。由于调用用户自定义函数的执行速度比调用 Python 模板更快，因此根据函数或模板逻辑的复杂程度，用户自定义函数可能会更加高效。

source: Special notes for using templates in different contexts
zh_cn: 在不同语境下使用模板的特别说明

source: In the GUI (:guilabel:`Columns made from other columns` and :guilabel:`Template searches`):
zh_cn: 在GUI中 (:guilabel:`Columns made from other columns` 和 :guilabel:`Template searches`)：

source: GPM templates work as before.
zh_cn: GPM（通用程序模式）模板的工作方式与之前相同。

source: Python templates have full access to the calibre database.
zh_cn: Python 模板拥有访问 calibre 数据库的完整权限。

source: In icon rules:
zh_cn: 在图标规则中：

source: icon rule templates have no book data so field-based functions such as :ref:`ff_format_date_field`, :ref:`ff_list_count_field`, and :ref:`ff_check_yes_no` won't work.
zh_cn: 图标规则模板不包含书籍数据，因此基于字段的函数，如 :ref:`ff_format_date_field`, :ref:`ff_list_count_field`, 和 :ref:`ff_check_yes_no` 将无法工作。

source: In the Content server:
zh_cn: 在内容服务器中：

source: Templates have access to the new API but not the old API (LibraryDatabase).
zh_cn: 模板可以访问新的 API，但无法访问旧的 API（LibraryDatabase）。

source: Because of the above, the following formatter functions are not guaranteed to work in GPM templates (composite columns, icon rules, etc) and should be avoided if you use the content server:
zh_cn: 由于上述原因，以下格式化函数在 GPM 模板（复合列、图标规则等）中无法保证正常运行；如果您使用内容服务器，应当避免使用这些函数：

source: Special processing is applied when a template is used in a :guilabel:`Save to disk` or :guilabel:`Send to device` template. The values of the fields are cleaned, replacing characters that are special to file systems with underscores, including slashes. This means that field text cannot be used to create folders. However, slashes are not changed in prefix or suffix strings, so slashes in these strings will cause folders to be created. Because of this, you can create variable-depth folder structure.
zh_cn: 当模板用于 :guilabe :guilabel:`Save to disk` 或 :guilabel:`Send to device` 时，系统会进行特殊处理。字段的值会被‘清洗’，即文件系统中的特殊字符（包括斜杠）都会被替换为下划线。这意味着字段内的文本不能直接用于创建文件夹。然而，前缀或后缀字符串中的斜杠不会被更改，因此这些字符串中的斜杠会导致文件夹的创建。利用这一特性，您可以创建深度可变的文件夹结构。

source: Set the save template to ``{series:lookup(.,#aa,#bb)}``. This template chooses composite field ``#aa`` if series is not empty and composite field ``#bb`` if series is empty. We therefore have two completely different save paths, depending on whether or not `series` is empty.
zh_cn: 将保存模板设置为“{series:lookup（.，#aa，#bb）}`”。如果系列不为空，则此模板选择复合字段“#aa”，如果系列为空，请选择复合字段。因此，根据“系列”是否为空，我们有两个完全不同的保存路径。

source: Template function reference
zh_cn: 模板函数参考
