Repository: debian-calibre/calibre
Catalog: translations/manual/*/template_lang.po
Languages: ja, nl, ta, zh_cn

source: In the function documentation below, the notation ``[something]*`` means that ``something`` can be repeated zero or more times. The notation ``[something]+`` means that the ``something`` is repeated one or more times (must exist at least one time).
ja: 以下の関数説明書では、``[something]*`` という表記は ``something`` が 0 回以上繰り返される可能性があることを意味しています。``[something]+`` という表記は ``something`` が 1 回以上繰り返される (1 回は必ず存在する) ことを意味しています。
nl: In de functie documentatie onder betekent de notatie ``[something]*`` dat ``something`` nul of meer keren herhaald kan worden. De notatie ``[something]+`` betekent dat ``something`` één of meer keren herhaald wordt (moet minstens één keer bestaan).
ta: கீழேயுள்ள செயல்பாட்டு ஆவணங்களில், `` [ஏதாவது]*`` என்ற குறியீடு `` ஏதாவது`` பூஜ்ஜியமாக அல்லது அதற்கு மேற்பட்ட முறை மீண்டும் செய்யப்படலாம் என்பதாகும். குறியீட்டு `` [ஏதாவது]+`` என்பது `` ஏதாவது`` ஒன்று அல்லது அதற்கு மேற்பட்ட முறை மீண்டும் மீண்டும் செய்யப்படுகிறது (குறைந்தது ஒரு முறையாவது இருக்க வேண்டும்).

source: The functions intended for use in Single Function Mode are:
ja: 単関数モードでの利用が想定されている関数は:
nl: De functies bedoeld voor gebruik in Eén Functie Modus zijn:
ta: ஒற்றை செயல்பாட்டு பயன்முறையில் பயன்படுத்த நோக்கம் கொண்ட செயல்பாடுகள்:

source: ``capitalize()`` -- returns the value with the first letter upper case and the rest lower case.
ja: ``capitalize()`` -- 最初の文字が大文字で残りが小文字の値を返します。
nl: ``capitalize()`` -- geeft de waarde terug met de eerste letter als hoofdletter en de rest klein.
ta: `` மூலதனமாக்கவும் () `` - முதல் கடித மேல் வழக்கு மற்றும் மீதமுள்ள கீழ் வழக்குடன் மதிப்பை வழங்குகிறது.

source: ``contains(pattern, text if match, text if not match)`` -- checks if the value is matched by the regular expression ``pattern``. Returns ``text if match`` if the pattern matches the value, otherwise returns ``text if no match``.
ja: ``contains(pattern, text if match, text if not match)`` -- 値が正規表現 ``pattern`` とマッチするかどうかを調べます。pattern が値にマッチすれば ``text if match`` を返し、そうでなければ ``text if no match`` を返します。
nl: ``contains(pattern, text if match, text if not match)`` -- controleert of de waarde overeen komt met het reguliere expressie ``pattern``. Geeft ``text if match`` terug als het pattern overeenkomt met de waarde, anders ``text if no match``.
ta: `` கொண்டுள்ளது (முறை, உரை பொருத்தமாக இருந்தால், உரை பொருந்தவில்லை என்றால்) `` - வழக்கமான வெளிப்பாடு `` முறை`` உடன் மதிப்பு பொருந்துமா என்பதை சரிபார்க்கிறது. மாதிரி மதிப்புடன் பொருந்தினால் `` உரையை பொருத்தினால் `உரையை வழங்குகிறது, இல்லையெனில் பொருந்தவில்லை என்றால்` `உரையை வழங்குகிறது`.

source: ``count(separator)`` -- interprets the value as a list of items separated by ``separator`` and returns the number of items in the list. Most lists use a comma as the separator, but ``authors`` uses an ampersand (&). Examples: ``{tags:count(,)}``, ``{authors:count(&)}``. Aliases: ``count()``, ``list_count()``
ja: ``count(separator)`` -- 値を ``separator`` で区切られた項目のリストとして解釈し、リスト内の項目数を返します。ほとんどのリストは区切り文字としてカンマを使用しますが、``authors`` はアンパーサンド (&) を使用します。例: ``{tags:count(,)}``, ``{authors:count(&)}``. Aliases: ``count()``, ``list_count()``
nl: ``count(separator)`` -- interpreteert de waarde als een lijst van termen gescheiden door ``separator`` en geeft het aantal items in de lijst terug. Meeste lijsten gebruiken een komma als scheiding maar ``authors`` gebruikt een ampersand (&). Bv.: ``{tags:count(,)}``, ``{authors:count(&)}``. Aliassen: ``count()``, ``list_count()``
ta: `` எண்ணுங்கள் (பிரிப்பான்) `` - `` பிரிப்பான்`` ஆல் பிரிக்கப்பட்ட பொருட்களின் பட்டியலாக மதிப்பை விளக்குகிறது மற்றும் பட்டியலில் உள்ள பொருட்களின் எண்ணிக்கையை வழங்குகிறது. பெரும்பாலான பட்டியல்கள் கமாவை பிரிப்பானாகப் பயன்படுத்துகின்றன, ஆனால் `` ஆசிரியர்கள்`` ஒரு ஆம்பர்சாண்டைப் பயன்படுத்துகிறார்கள் (&). எடுத்துக்காட்டுகள்: `` {குறிச்சொற்கள்: எண்ணிக்கை (,)} ``, `` {ஆசிரியர்கள்: எண்ணிக்கை (&)} ``. மாற்றுப்பெயர்கள்: `` கவுண்ட் () ``, `` பட்டியல்_கவுண்ட் () ``

source: ``format_number(template)`` -- interprets the value as a number and formats that number using a Python formatting template such as ``{0:5.2f}`` or ``{0:,d}`` or ``${0:5,.2f}``. The formatting template must begin with ``{0:`` and end with ``}`` as in the above examples. Exception: you can leave off the leading "{0:" and trailing "}" if the format template contains only a format. See the template language and the `Python documentation <https://docs.python.org/3/library/string.html#formatstrings>`_ for more examples. Returns the empty string if formatting fails.
ja: ``format_number(template)`` -- 値を数値として解釈し、その数値を Python 整形テンプレートを使用して ``{0:5.2f}`` や ``{0:,d}`` や ``${0:5,.2f}`` のように整形します。上の例に示されるように、整形テンプレートは必ず ``{0:`` で始め、 ``}`` で終わらなくてはなりません。例外: 整形テンプレートに書式がひとつしか含まれていない場合には、先頭の "{0:" と末尾の "}" を省略可能です。その他の例については `Python 説明書 <https://docs.python.org/3/library/string.html#formatstrings>`_ を参照してください。整形に失敗した場合には、空の文字列を返します。
nl: ``format_number(template)`` -- interpreteert de waarde als een getal en formateert dat getal met een Python formateersjabloon zoals ``{0:5.2f}`` of ``{0:,d}`` of ``${0:5,.2f}``. De formateersjabloon moet beginnen met ``{0:`` en eindigen met ``}`` zoals in de voorbeelden boven. Uitzondering: u kan de voorloop "{0:" en volg "}" weglaten als de formateersjabloon enkel een formaat bevat. Bekijk de sjabloontaal en de `Python documentatie <https://docs.python.org/3/library/string.html#formatstrings>`_ voor meer voorbeelden. Geeft de lege string terug als formateren mislukt.
ta: `` `{0: 5.2f}` `அல்லது` `{0:, d}` `` `` அல்லது ` `$ {0: 5, .2f}` `. வடிவமைப்பு வார்ப்புரு `` {0: `` உடன் தொடங்கி, மேலே உள்ள எடுத்துக்காட்டுகளைப் போலவே ``} `` உடன் முடிவடைய வேண்டும். விதிவிலக்கு: வடிவமைப்பு வார்ப்புருவில் ஒரு வடிவம் மட்டுமே இருந்தால், நீங்கள் முன்னணி "{0:" மற்றும் "}" ஐ பின்னால் விட்டுவிடலாம். வார்ப்புரு மொழி மற்றும் `பைதான் ஆவணங்கள் <https://docs.python.org/3/library/string.html#formatstrings>` _ மேலும் எடுத்துக்காட்டுகளுக்கு பார்க்கவும். வடிவமைப்பு தோல்வியுற்றால் வெற்று சரத்தை வழங்குகிறது.

source: ``human_readable()`` -- expects the value to be a number and returns a string representing that number in KB, MB, GB, etc.
ja: ``human_readable()`` -- 値が数値であると想定し、その数値を KB、MB、GB などで表す文字列を返します。
nl: ``human_readable()`` -- verwacht een cijfer als waarde en geeft een string terug die dat cijfer voorstelt in KB, MB, GB, enz.
ta: `` haman_readable () `` - மதிப்பு ஒரு எண்ணாக இருக்க வேண்டும் என்று எதிர்பார்க்கிறது மற்றும் KB, MB, GB போன்றவற்றில் அந்த எண்ணைக் குறிக்கும் ஒரு சரத்தை வழங்குகிறது.

source: ``ifempty(text if empty)`` -- if the value is not empty then return the value of the field, otherwise return `text if empty`.
ja: ``ifempty(text if empty)`` -- 値が空でない場合はフィールドの値を返し、そうでない場合は `text if empty` を返します
nl: ``ifempty(text if empty)`` -- als de waarde niet leeg is, geef dan de waarde van het veld terug, anders `tekst als leeg`.
ta: `` ifempty (காலியாக இருந்தால் உரை) `` - மதிப்பு காலியாக இல்லாவிட்டால், புலத்தின் மதிப்பைத் திருப்பி, இல்லையெனில் `உரையை காலியாக இருந்தால்` திரும்பவும்.

source: ``in_list(separator, [ pattern, found_val, ]* not_found_val)`` -- interpret the value as a list of items separated by ``separator``, checking the ``pattern`` against each item in the list. If the ``pattern`` matches an item then return ``found_val``, otherwise return ``not_found_val``. The pair ``pattern`` and ``found_value`` can be repeated as many times as desired, permitting returning different values depending on the item's value. The patterns are checked in order, and the first match is returned.
ja: ``in_list(separator, [ pattern, found_val, ]* not_found_val)`` -- 値を ``separator`` で区切られた項目のリストと解釈し、リスト内の各項目に対して ``pattern`` をチェックします。``pattern`` が項目にマッチする場合は ``found_val`` を返し、そうでなければ ``not_found_val`` を返します。``pattern`` と ``found_value`` のペアは好きなだけ繰り返すことができるので、項目の値に応じて異なる値を返すことができます。pattern は順番にチェックされ、最初にマッチしたものが返されます。
nl: ``in_list(separator, [ pattern, found_val, ]* not_found_val)`` -- interpreteert de waarde als een itemlijst gescheiden door ``separator``, het ``pattern`` controlerend tegen elk item in de lijst. Als het ``pattern`` overeen komt met een item komt ``found_val`` terug, anders ``not_found_val``. Het paar ``pattern`` en ``found_value`` kan zo vaak als gewenst herhaald worden, toelatend verschillende waarden terug te geven, afhankelijk van item's waarde. De patterns worden op volgorde gecontroleerd en de eerste overeenkomst wordt terug gegeven.
ta: `` in_list (பிரிப்பான், [முறை, கண்டுபிடிக்கப்பட்ட_வல்,]* not_found_val) `` - `` பிரிப்பான்`` ஆல் பிரிக்கப்பட்ட பொருட்களின் பட்டியலாக மதிப்பை விளக்கவும், பட்டியலில் உள்ள ஒவ்வொரு உருப்படிக்கும் எதிராக `` முறை`` சரிபார்க்கிறது. `` முறை`` ஒரு உருப்படியுடன் பொருந்தினால், `` find_val`` திரும்பவும், இல்லையெனில் `` not_found_val`` ஐத் தரவும். ஜோடி `` முறை`` மற்றும் `` find_value`` ஆகியவற்றை விரும்பிய அளவுக்கு மீண்டும் மீண்டும் செய்ய முடியும், இது உருப்படியின் மதிப்பைப் பொறுத்து வெவ்வேறு மதிப்புகளைத் தர அனுமதிக்கிறது. வடிவங்கள் வரிசையில் சரிபார்க்கப்படுகின்றன, மேலும் முதல் போட்டி திரும்பப் பெறப்படுகிறது.

source: ``language_strings(localize)`` -- return the `language names <https://www.loc.gov/standards/iso639-2/php/code_list.php>`_ for the `language codes <https://www.loc.gov/standards/iso639-2/php/code_list.php>`_ passed in as the value. Example: ``{languages:language_strings()}``. If ``localize`` is zero, return the strings in English. If ``localize`` is not zero, return the strings in the language of the current locale. ``Lang_codes`` is a comma-separated list.
ja: ``language_strings(localize)`` -- 渡された値の `言語コード <https://www.loc.gov/standards/iso639-2/php/code_list.php>`_ の `言語名 <https://www.loc.gov/standards/iso639-2/php/code_list.php>`_ を返します。例: ``{languages:language_strings()}`` もし ``localize`` がゼロなら、英語の文字列を返します。``localize`` がゼロでなければ、現在のロケールの言語の文字列を返します。``Lang_codes`` はカンマ区切りのリストです。
nl: ``language_strings(localize)`` -- geef de `taalnamen <https://www.loc.gov/standards/iso639-2/php/code_list.php>`_ terug voor de `taalcodes <https://www.loc.gov/standards/iso639-2/php/code_list.php>`_ ingegeven als de waarde. Bv.: ``{languages:language_strings()}``. Als ``localize`` nul is, geef de string in het Engels terug. Als ``localize`` niet nul is, geef de string terug in de taal van de huidige locale. ``Lang_codes`` is een komma gescheiden lijst.
ta: `` மொழி_ஸ்ட்ரிங்ஸ் (உள்ளூர்மயமாக்கல்) ``-`மொழி பெயர்களைத் திருப்பி விடுங்கள் www.loc.gov/standards/iso639-2/php/code_list.php>`_ மதிப்பாக அனுப்பப்பட்டது. எடுத்துக்காட்டு: `` {மொழிகள்: மொழி_ஸ்ட்ரிங்ஸ் ()} ``. `` உள்ளூர்மயமாக்கல்`` பூஜ்ஜியமாக இருந்தால், சரங்களை ஆங்கிலத்தில் திருப்பித் தரவும். `` உள்ளூர்மயமாக்குதல்`` பூஜ்ஜியமாக இல்லாவிட்டால், தற்போதைய இடத்தின் மொழியில் உள்ள சரங்களை திருப்பித் தரவும். `` Lang_codes`` என்பது கமாவால் பிரிக்கப்பட்ட பட்டியல்.

source: ``list_item(index, separator)`` -- interpret the value as a list of items separated by ``separator``, returning the 'index'th item. The first item is number zero. The last item has the index ``-1`` as in ``list_item(-1,separator)``. If the item is not in the list, then the empty string is returned.
ja: ``list_item(index, separator)`` -- 値を ``separator`` で区切られた項目のリストと解釈し、'index' 番目の項目を返します。最初の項目はゼロ番目です。最後の項目は ``-1`` 番目で、`list_item(-1,separator)`` のように指定します。項目がリストの中になければ、空の文字列を返します。
nl: ``list_item(index, separator)`` -- begrijp de waarde als een lijst met items gescheiden door ``separator``, terug gevend het 'index'th item. Het eerste item is nummer nul. Het laatste item heeft index ``-1`` zoals in ``list_item(-1,separator)``. Als het item niet op de lijst staat, wordt een lege string terug gegeven.
ta: `` list_item (குறியீட்டு, பிரிப்பான்) `` - `` பிரிப்பான்`` ஆல் பிரிக்கப்பட்ட உருப்படிகளின் பட்டியலாக மதிப்பை 'குறியீட்டு உருப்படியைத் திருப்பித் தருகிறது. முதல் உருப்படி எண் பூஜ்ஜியம். கடைசி உருப்படி `` -1`` குறியீட்டைக் கொண்டுள்ளது `` பட்டியல்_இடெம் (-1, பிரிப்பான்) ``. உருப்படி பட்டியலில் இல்லை என்றால், வெற்று சரம் திரும்பும்.

source: ``lookup([ pattern, key, ]* else_key)`` -- The patterns will be checked against the value in order. If a pattern matches then the value of the field named by ``key`` is returned. If no pattern matches then the value of the field named by ``else_key`` is returned. See``switch`` (below).
ja: ``lookup([ pattern, key, ]* else_key)`` -- pattern は値に対して順番にチェックされます。pattern がマッチしたら、``key`` で指定されたフィールドの値を返します。pattern にマッチするものがなければ、 ``else_key`` で指定されるフィールドの値を返します。``switch`` (下記) を参照のこと。
nl: ``lookup([ pattern, key, ]* else_key)`` -- De patronen worden gecontroleerd tegen de waarde op volgorde. Als een patroon overeenkomt, wordt de waarde van het veld benoemd door ``key`` teruggegeven. Als geen patroon overeenkomt, wordt de waarde van het veld benoemd door ``else_key`` teruggegeven. Kijk bij ``switch`` (onder).
ta: `` தேடல் ([முறை, விசை,]* else_key) `` - வடிவங்கள் வரிசையில் மதிப்புக்கு எதிராக சரிபார்க்கப்படும். ஒரு முறை பொருந்தினால், `` KEY`` பெயரிட்ட புலத்தின் மதிப்பு திரும்பப் பெறப்படும். எந்த வடிவமும் பொருந்தவில்லை என்றால், `` else_key`` பெயரிட்ட புலத்தின் மதிப்பு திரும்பப் பெறப்படுகிறது. ``ஸ்விட்ச்`` ஐப் பார்க்கவும் (கீழே).

source: ``lowercase()`` -- returns the value of the field in lower case.
ja: ``lowercase()`` -- フィールドの値を小文字にして返します。
nl: ``lowercase()`` -- geeft de waarde van het veld terug in kleine letters.
ta: `` லோயர் மாடி () `` - புலத்தின் மதிப்பை சிறிய விஷயத்தில் வழங்குகிறது.

source: ``rating_to_stars(use_half_stars)`` -- Returns the rating as string of star (``★``) characters. The value must be a number between 0 and 5. Set use_half_stars to 1 if you want half star characters for fractional numbers available with custom ratings columns.
ja: ``rating_to_stars(use_half_stars)`` -- 星 (``★``) の文字列で評価を返します。値は 0 から 5 までの数値でなくてはなりません。カスタム評価列で使用可能な小数値に星半分を使いたい場合は、use_half_stars に 1 を設定します。
nl: ``rating_to_stars(use_half_stars)`` -- Geeft de waardering terug als een string ster (``★``) karakters. De waarde moet een cijfer zijn tussen 0 en 5. Stel use_half_stars in op 1 als u halve ster karakters wilt voor fractionele getallen beschikbaar met aangepaste waarderingskolommen.
ta: `` kation_to_stars (Use_half_stars) `` - மதிப்பீட்டை நட்சத்திரத்தின் சரமாக (`` ★ ``) எழுத்துக்களாக வழங்குகிறது. தனிப்பயன் மதிப்பீட்டு நெடுவரிசைகளுடன் கிடைக்கும் பகுதியளவு எண்களுக்கு அரை நட்சத்திர எழுத்துக்களை விரும்பினால், மதிப்பு 0 மற்றும் 5 க்கு இடையில் ஒரு எண்ணாக இருக்க வேண்டும்.

source: ``re(pattern, replacement)`` -- return the value after applying the regular expression. All instances of ``pattern`` in the value are replaced with ``replacement``. The template language uses case insensitive `Python regular expressions <https://docs.python.org/3/library/re.html>`_.
ja: ``re(pattern, replacement)`` -- 正規表現を適用した後に値を返します。値の中にある ``pattern`` のインスタンスはすべて ``replacement`` に置換されます。テンプレート言語では、大文字と小文字を区別しない `Python 正規表現 <https://docs.python.org/3/library/re.html>`_ を使用します。
nl: ``re(pattern, replacement)`` -- geef de waarde terug na toepassen reguliere expressie. Alle exemplaren van ``pattern`` in de waarde worden vervangen door ``replacement``. De sjabloontaal gebruikt hoofdletterongevoelige `Python reguliere expressies <https://docs.python.org/3/library/re.html>`_.
ta: `` மறு (முறை, மாற்றீடு) `` - வழக்கமான வெளிப்பாட்டைப் பயன்படுத்திய பின் மதிப்பைத் திருப்பித் தரவும். மதிப்பில் `` முறை`` இன் அனைத்து நிகழ்வுகளும் `` மாற்று`` உடன் மாற்றப்படுகின்றன. வார்ப்புரு மொழி வழக்கு உணர்வற்ற `பைதான் வழக்கமான வெளிப்பாடுகளைப் பயன்படுத்துகிறது <https://docs.python.org/3/library/re.html>` _.

source: ``select(key)`` -- interpret the value as a comma-separated list of items with each item having the form ``id:value`` (the calibre ``identifier`` format). The function finds the first pair with the id equal to key and returns the corresponding value. If no id matches then the function returns the empty string.
ja: ``select(key)`` -- 値を項目のカンマ区切りリストとして解釈します。項目はそれぞれ ``id:value`` (calibre の ``identifier`` ID形式) の形式です。この関数は、id が key に等しい最初のペアを見つけて、対応する値を返します。一致するIDがなければ、関数は空の文字列を返します。
nl: ``select(key)`` -- interpreteer de waarde als een komma gescheiden lijst met items waar elk item de vorm ``id:value`` heeft (het calibre ``identifier`` formaat). De functie vindt het eerste paar met het id gelijk aan de sleutel en geeft de overeenkomende waarde terug. Als geen id overeenkomt, geeft de functie de lege string terug.
ta: `` தேர்ந்தெடுக்கவும் (விசை) ``-`` ஐடி: மதிப்பு`` (காலிபர் `` அடையாளங்காட்டி` `வடிவம்) வடிவத்தைக் கொண்ட ஒவ்வொரு உருப்படியுடனும் கமாவால் பிரிக்கப்பட்ட பொருட்களின் பட்டியலாக மதிப்பை விளக்கவும். செயல்பாடு முதல் ஜோடியை ஐடியுடன் விசைக்கு சமமாகக் கண்டறிந்து தொடர்புடைய மதிப்பை வழங்குகிறது. ஐடி பொருந்தவில்லை என்றால், செயல்பாடு வெற்று சரத்தை வழங்குகிறது.

source: ``shorten(left chars, middle text, right chars)`` -- Return a shortened version of the value, consisting of ``left chars`` characters from the beginning of the value, followed by ``middle text``, followed by ``right chars`` characters from the end of the value. ``Left chars`` and ``right chars`` must be non-negative integers. Example: assume you want to display the title with a length of at most 15 characters in length. One template that does this is ``{title:shorten(9,-,5)}``. For a book with the title `Ancient English Laws in the Times of Ivanhoe` the result will be `Ancient E-anhoe`: the first 9 characters of the title, a ``-``, then the last 5 characters. If the value's length is less than ``left chars`` + ``right chars`` + the length of ``middle text`` then the value will be returned unchanged. For example, the title `The Dome` would not be changed.
ja: ``shorten(left chars, middle text, right chars)`` -- 値の短縮バージョンを返します。短縮バージョンは値の先頭から ``left chars`` で指定した文字数分の文字列、その次に ``middle text``、その後ろに値の末尾から ``right chars`` で指定した文字数分の文字列で構成されます。``Left chars`` および ``right chars`` 負でない整数でなければなりません。例: 最大 15 文字の長さのタイトルを表示するとします。これを行うテンプレートの一例は、 ``{title:shorten(9,-,5)}`` です。`Ancient English Laws in the Times of Ivanhoe` というタイトルの本の場合は `Ancient E-anhoe`: タイトルの最初の 9 文字, ``-``, そして末尾の 5 文字です。 値の長さが ``left chars`` + ``right chars`` + ``middle text`` の長さよりも短ければ、変更せずに返されます。たとえば `The Dome` は変更されません。
nl: ``shorten(left chars, middle text, right chars)`` -- Geeft een verkorte versie van de waarde terug, bestaande uit ``left chars`` karakters van het begin van de waarde, gevolgd door ``middle text``, gevolgd door ``right chars`` karakters van het einde van de waarde. ``Left chars`` en ``right chars`` moeten niet-negatieve integers zijn. Bv.: veronderstel u wilt de titel tonen met een lengte van maximaal 15 karakters. Een sjabloon die dat doet is ``{title:shorten(9,-,5)}``. Voor een boek met de titel `Ancient English Laws in the Times of Ivanhoe` zal het resultaat `Ancient E-nhoe` zijn: de eerste 9 karakters van de titel, een ``-``, dan de laatste 5 karakters. Als de lengte van de waarde minder is dan ``left chars`` + ``right chars`` + de lengte van ``middle text`` wordt de waarde onveranderd teruggegeven. Bv. de titel `The Dome` wordt niet veranderd.
ta: `` சுருக்கவும் (இடது எழுத்துக்கள், நடுத்தர உரை, வலது கைகள்) `` - மதிப்பின் சுருக்கப்பட்ட பதிப்பைத் திருப்பி விடுங்கள், இது மதிப்பின் தொடக்கத்திலிருந்து `` இடது எழுத்துக்கள்`` எழுத்துக்களைக் கொண்டுள்ளது, அதைத் தொடர்ந்து `` நடுத்தர உரை``, அதைத் தொடர்ந்து `` சரியான எழுத்துக்கள்` `மதிப்பின் முடிவில் இருந்து. `` இடது எழுத்துக்கள்`` மற்றும் `` வலது எழுத்துக்கள்`` எதிர்மறையான முழு எண்களாக இருக்க வேண்டும். எடுத்துக்காட்டு: தலைப்பை அதிகபட்சம் 15 எழுத்துக்கள் நீளத்துடன் காண்பிக்க விரும்புகிறீர்கள் என்று வைத்துக் கொள்ளுங்கள். இதைச் செய்யும் ஒரு வார்ப்புரு `` {தலைப்பு: சுருக்கவும் (9,-, 5)} ``. `இவான்ஹோவின் காலங்களில் பண்டைய ஆங்கில சட்டங்கள்` என்ற தலைப்பைக் கொண்ட ஒரு புத்தகத்திற்கு, இதன் விளைவாக `பண்டைய மின்-அன்ஹோ`: தலைப்பின் முதல் 9 எழுத்துக்கள், ஒரு` `-``, பின்னர் கடைசி 5 எழுத்துக்கள். மதிப்பின் நீளம் `` இடது எழுத்துக்கள்` + `` வலது எழுத்துக்கள்` + ஐ விட குறைவாக இருந்தால், `` நடுத்தர உரை`` இன் நீளம், மதிப்பு மாறாமல் திருப்பித் தரப்படும். எடுத்துக்காட்டாக, `தி டோம்` தலைப்பு மாற்றப்படாது.

source: ``str_in_list(separator, [ string, found_val, ]+ not_found_val)`` -- interpret the value as a list of items separated by ``separator`` then compare ``string`` against each value in the list. The ``string`` is not a regular expression. If ``string`` is equal to any item (ignoring case) then return the corresponding ``found_val``. If ``string`` contains ``separators`` then it is also treated as a list and each subvalue is checked. The ``string`` and ``found_value`` pairs can be repeated as many times as desired, permitting returning different values depending on string's value. If none of the strings match then ``not_found_value`` is returned. The strings are checked in order. The first match is returned.
ja: ``str_in_list(separator, [ string, found_val, ]+ not_found_val)`` -- 値を ``separator`` で区切られた項目のリストとして解釈し、``string`` をリスト内の各値と比較します。``string`` は正規表現ではありません。``string`` が任意の項目と等しい場合 (大文字と小文字を区別しない)、対応する ``found_val`` を返します。``string`` に ``separators`` が含まれていればリストとしても扱われ、各サブ値がチェックされます。``string`` と ``found_value`` のペアは好きなだけ繰り返すことができ、文字列の値の応じて異なる値を返すことができます。マッチする文字列がなければ ``not_found_value`` が返されます。文字列は順番にチェックされ、最初にマッチしたものが返されます。
nl: ``str_in_list(separator, [ string, found_val, ]+ not_found_val)`` -- interpreteer de waarde als een lijst met items gescheiden door ``separator`` vergelijk dan ``string`` met elke waarde in de lijst. De ``string`` is geen reguliere expressie. Als ``string`` gelijk is aan een item (hoofdlettergebruik negerend) geef dan de bijhorende ``found_val`` terug. Bevat ``string`` ``separators``, wordt het ook als een lijst behandeld en elke subwaarde gecontroleerd. De ``string`` en ``found_value`` paren kunnen naar believen herhaald worden, teruggave van verschillende waardes toelatend afhankelijk van de string waarde. Komt geen enkele string overeen, wordt ``not_found_value`` teruggegeven. Strings worden in volgorde gecontroleerd. De eerste overeenkomst wordt teruggegeven.
ta: `` str_in_list (பிரிப்பான், [சரம், find_val,]+ not_found_val) `` - `` பிரிப்பான்` ஆல் பிரிக்கப்பட்ட பொருட்களின் பட்டியலாக மதிப்பை விளக்கவும், பின்னர் பட்டியலில் உள்ள ஒவ்வொரு மதிப்பிற்கும் எதிராக `` சரம்`` ஒப்பிடுக. `` சரம்`` ஒரு வழக்கமான வெளிப்பாடு அல்ல. `` சரம்`` எந்தவொரு பொருளுக்கும் சமமாக இருந்தால் (வழக்கைப் புறக்கணித்தல்) பின்னர் தொடர்புடைய `` find_val`` ஐத் தரவும். `` சரம்`` `` பிரிப்பான்கள்`` இருந்தால், அது ஒரு பட்டியலாகவும் கருதப்படுகிறது, மேலும் ஒவ்வொரு துணை மதிப்பும் சரிபார்க்கப்படுகிறது. `` சரம்`` மற்றும் `` ஃபென்ட்_வல்யூ`` ஜோடிகளை விரும்பிய பல முறை மீண்டும் மீண்டும் செய்யலாம், இது சரத்தின் மதிப்பைப் பொறுத்து வெவ்வேறு மதிப்புகளைத் தர அனுமதிக்கிறது. சரங்கள் எதுவும் பொருந்தவில்லை என்றால் `` not_found_value`` திரும்பப் பெறப்படுகிறது. சரங்கள் வரிசையில் சரிபார்க்கப்படுகின்றன. முதல் போட்டி திரும்பியது.
