Repository: debian-calibre/calibre
Catalog: translations/manual/*/template_lang.po
Languages: ja, nl, ta, zh_cn

source: Much of the calibre template language formatting comes from Python. For more details on the syntax of these advanced formatting operations see the `Python documentation <https://docs.python.org/3/library/string.html#formatstrings>`_.
ja: calibre テンプレート言語のフォーマットの多くは Python のものです。これらの高度なフォーマット操作の構文の詳細については、 `Python documentation <https://docs.python.org/3/library/string.html#formatstrings>`_ を参照してください。
nl: Veel van de calibre sjabloontaalvormgeving komt van Python. Voor meer details over de syntaxis van deze geavanceerde vormgevingsoperaties zie de `Python documentatie <https://docs.python.org/3/library/string.html#formatstrings>`_.
ta: காலிபர் வார்ப்புரு மொழி வடிவமைப்பின் பெரும்பகுதி பைத்தானில் இருந்து வருகிறது. இந்த மேம்பட்ட வடிவமைப்பு செயல்பாடுகளின் தொடரியல் பற்றிய கூடுதல் விவரங்களுக்கு `பைதான் ஆவணங்கள் <https://docs.python.org/3/library/string.html#formatstrings>` _.
zh_cn: 大部分 calibre 模板语言格式都来自 Python。 有关这些高级格式化操作的语法的更多详细信息，请参阅“Python 文档 <https://docs.python.org/3/library/string.html#formatstrings>”_。

source: Using templates to define custom columns
ja: テンプレートを使用してカスタム列を定義する
nl: Sjablonen gebruiken om aangepaste kolommen te definiëren
ta: தனிப்பயன் நெடுவரிசைகளை வரையறுக்க வார்ப்புருக்களைப் பயன்படுத்துதல்
zh_cn: 使用模板来定义自定义栏目

source: Templates can be used to display information that isn't in calibre metadata, or to display metadata differently from calibre's normal format. For example, you might want to show the ``ISBN``, a field that calibre does not display. You can accomplish this creating a custom column with the type `Column built from other columns` (hereafter called `composite columns`) and providing a template to generate the displayed text. The column will display the result of evaluating the template. For example, to display the ISBN, create the column and enter ``{identifiers:select(isbn)}`` in the template box. To display a column containing the values of two series custom columns, separated by a comma, use ``{#series1:||,}{#series2}``.
ja: テンプレートを使用すると、calibre の書誌にない情報を表示したり、calibre の通常の形式とは異なる方法で書誌を表示したりできます。たとえば、calibre が表示しないフィールドである ISBN を表示したいことがあるかもしれません。これは、`他の列から構築された列` タイプ (以降、複合列と呼びます) を使用してカスタム列を作成し、表示されるテキストを生成するためのテンプレートを提供することで実現できます。この列には、テンプレートの評価結果が表示されます。たとえば、ISBN を表示するには、列を作成し、テンプレートボックスに ``{identifiers:select(isbn)}`` と入力します。 2 つのシリーズカスタム列の値をカンマで区切って含む列を表示するには、``{#series1:||,}{#series2}`` を使用します。
nl: Sjablonen kunnen gebruikt worden om informatie weer te geven niet in calibre's metadata of metadata afwijkend van calibre's gewone formaat. Bv. u wilt misschien het ``ISBN`` tonen, een veld dat calibre niet weergeeft. Dit kan door een aangepaste kolom te creëren van het type `Kolom gemaakt van andere kolommen` (hierna `samengestelde kolommen`) en een sjabloon te voorzien om de weer te geven tekst te genereren. De kolom geeft het resultaat weer van het evalueren van de sjabloon. Bv. om het ISBN weer te geven, creëer de kolom en voer ``{identifiers:select(isbn)}`` in in het sjabloon vak. Om een kolom weer te geven met de waardes van twee series aangepaste kolommen, gescheiden door een komma, gebruik ``{#series1:||,}{#series2}``.
ta: காலிபர் மெட்டாடேட்டாவில் இல்லாத தகவல்களைக் காண்பிக்க அல்லது காலிபரின் இயல்பான வடிவமைப்பிலிருந்து வித்தியாசமாகக் காண்பிக்க வார்ப்புருக்கள் பயன்படுத்தப்படலாம். எடுத்துக்காட்டாக, நீங்கள் காண்பிக்காத `` isbn`` என்பதைக் காட்ட விரும்பலாம். மற்ற நெடுவரிசைகளிலிருந்து கட்டப்பட்ட `நெடுவரிசை (இனிமேல்` கலப்பு நெடுவரிசைகள்` என அழைக்கப்படுகிறது) மற்றும் காண்பிக்கப்படும் உரையை உருவாக்க ஒரு வார்ப்புருவை வழங்கும் வகை `நெடுவரிசையுடன் தனிப்பயன் நெடுவரிசையை உருவாக்குவதை நீங்கள் நிறைவேற்றலாம். வார்ப்புருவை மதிப்பிடுவதன் முடிவை நெடுவரிசை காண்பிக்கும். எடுத்துக்காட்டாக, ISBN ஐக் காண்பிக்க, நெடுவரிசையை உருவாக்கி `` {அடையாளங்காட்டிகள்: வார்ப்புரு பெட்டியில் (ISBN)} `` தேர்ந்தெடுக்கவும். கமாவால் பிரிக்கப்பட்ட இரண்டு தொடர் தனிப்பயன் நெடுவரிசைகளின் மதிப்புகளைக் கொண்ட ஒரு நெடுவரிசையைக் காட்ட, `{#தொடர் 1: ||,} {#SERIES2}` `ஐப் பயன்படுத்தவும்.
zh_cn: 模板可用于显示 calibre 元数据中没有的信息，或以不同于 calibre 正常格式的方式显示元数据。 例如，您可能想要显示“ISBN”，这是 calibre 不显示的字段。 您可以通过创建类型为“从其他列构建的列”（以下称为“复合列”）的自定义列来完成此操作，并提供一个模板来生成显示的文本。 该列将显示评估模板的结果。 例如，要显示 ISBN，请创建列并在模板框中输入“{identifiers:select(isbn)}”。 要显示包含两个系列自定义列的值（以逗号分隔）的列，请使用``{#series1:||,}{#series2}``。

source: Composite columns can use any template option, including formatting.
ja: 複合列は、書式設定を含む任意のテンプレートオプションを使用できます。
nl: Samengestelde kolommen kunnen elke sjabloonoptie gebruiken, inclusief opmaak.
ta: கலப்பு நெடுவரிசைகள் வடிவமைப்பு உட்பட எந்த வார்ப்புரு விருப்பத்தையும் பயன்படுத்தலாம்.
zh_cn: 组合列可以使用任何模板选项，包括格式化功能。

source: Note: You cannot edit the data displayed in a composite column. Instead you edit the source columns. If you edit a composite column, for example by double-clicking it, calibre will open the template for editing, not the underlying data.
ja: 注: 複合列に表示されているデータを編集することはできません。代わりに、ソース列を編集します。複合列を編集する場合、たとえばダブルクリックした場合、calibreは、基になるデータではなく、編集用のテンプレートを開きます。
nl: Nota: U kan data getoond in een samengestelde kolom niet bewerken. U moet de bronkolommen bewerken. Als u een samengestelde kolom bewerkt, bv. door erop dubbel te klikken, zal calibre de bewerksjabloon openen, niet de onderliggende data.
ta: குறிப்பு: கலப்பு நெடுவரிசையில் காட்டப்படும் தரவை நீங்கள் திருத்த முடியாது. அதற்கு பதிலாக மூல நெடுவரிசைகளைத் திருத்துகிறீர்கள். நீங்கள் ஒரு கலப்பு நெடுவரிசையைத் திருத்தினால், எடுத்துக்காட்டாக, அதை இருமுறை கிளிக் செய்வதன் மூலம், காலிபர் எடிட்டிங் வார்ப்புருவைத் திறக்கும், அடிப்படை தரவு அல்ல.
zh_cn: 注意：您无法编辑复合列中显示的数据。 相反，您可以编辑源列。 如果您编辑复合列，例如通过双击它，calibre 将打开模板进行编辑，而不是基础数据。

source: Templates and plugboards
ja: テンプレートとプラグボード
ta: வார்ப்புருக்கள் மற்றும் செருகுநிரல்கள்
zh_cn: 模板与元数据处理规则

source: Plugboards are used for changing the metadata written into books during send-to-device and save-to-disk operations. A plugboard permits you to specify a template to provide the data to write into the book's metadata. You can use plugboards to modify the following fields: authors, author_sort, language, publisher, tags, title, title_sort. This feature helps people who want to use different metadata in books on devices to solve sorting or display issues.
ja: プラグボードは、デバイスへの送信およびディスクへの保存操作中に本に書き込まれる書誌を変更するために使用されます。プラグボードを使用すると、本の書誌に書き込むデータを提供するテンプレートを指定できます。プラグボードを使用すると authors, author_sort, language, publisher, tags, title, title_sort のフィールドを変更できます。この機能は、デバイス上の本で別の書誌を使用して、並べ替えや表示の問題を解決したい人に役立ちます。
ta: அனுப்பு-சாதனத்தின் போது புத்தகங்களில் எழுதப்பட்ட மெட்டாடேட்டாவை மாற்றுவதற்கும், விலக்கப்பட்ட செயல்பாடுகளைச் சேமிப்பதற்கும் பிளேக் போர்டுகள் பயன்படுத்தப்படுகின்றன. புத்தகத்தின் மெட்டாடேட்டாவில் எழுத தரவை வழங்க ஒரு வார்ப்புருவைக் குறிப்பிட ஒரு செருகுநிரல் உங்களை அனுமதிக்கிறது. பின்வரும் புலங்களை மாற்ற நீங்கள் செருகுநிரல்களைப் பயன்படுத்தலாம்: ஆசிரியர்கள், ஆசிரியர்_சார்ட், மொழி, வெளியீட்டாளர், குறிச்சொற்கள், தலைப்பு, தலைப்பு_சார்ட். வரிசையாக்கத்தை தீர்க்க அல்லது சிக்கல்களைக் காண்பிக்க சாதனங்களில் புத்தகங்களில் வெவ்வேறு மெட்டாடேட்டாவைப் பயன்படுத்த விரும்பும் நபர்களுக்கு இந்த அம்சம் உதவுகிறது.
zh_cn: 插件板用于在发送到设备和保存到磁盘操作期间更改写入书籍的元数据。 插件板允许您指定一个模板来提供要写入书籍元数据的数据。 您可以使用插件板修改以下字段：作者、author_sort、语言、出版商、标签、书名、title_sort。 此功能可以帮助想要在设备上使用图书中的不同元数据的人们解决排序或显示问题。

source: When you create a plugboard, you specify the format and device for which the plugboard is to be used. A special device is provided, ``save_to_disk``, that is used when saving formats (as opposed to sending them to a device). Once you have chosen the format and device, you choose the metadata fields to change, providing templates to supply the new values. These templates are `connected` to their destination fields, hence the name `plugboards`. You can of course use composite columns in these templates.
ja: プラグボードを作成するときは、プラグボードを使用する形式とデバイスを指定します。形式を保存するときに使用される特別なデバイス ``save_to_disk`` が提供されます (デバイスに送信するのではありません)。形式とデバイスを選択したら、変更する書誌フィールドを選択し、新しい値を提供するためのテンプレートを提供します。これらのテンプレートは宛先フィールドに `接続` されているため、プラグボードという名前が付けられています。これらのテンプレートでは、もちろん複合列を使用できます。
ta: நீங்கள் ஒரு செருகுநிரலை உருவாக்கும்போது, செருகுநிரல் பயன்படுத்த வேண்டிய வடிவம் மற்றும் சாதனத்தை நீங்கள் குறிப்பிடுகிறீர்கள். ஒரு சிறப்பு சாதனம் வழங்கப்படுகிறது, `` save_to_disk``, இது வடிவங்களைச் சேமிக்கும்போது பயன்படுத்தப்படுகிறது (அவற்றை ஒரு சாதனத்திற்கு அனுப்புவதற்கு மாறாக). நீங்கள் வடிவமைப்பு மற்றும் சாதனத்தைத் தேர்ந்தெடுத்ததும், மாற்றுவதற்கு மெட்டாடேட்டா புலங்களை தேர்வு செய்கிறீர்கள், புதிய மதிப்புகளை வழங்க வார்ப்புருக்களை வழங்குகிறீர்கள். இந்த வார்ப்புருக்கள் அவற்றின் இலக்கு புலங்களுடன் `இணைக்கப்பட்டுள்ளன, எனவே` பிளேப் போர்டுகள்` என்ற பெயர். இந்த வார்ப்புருக்களில் நீங்கள் நிச்சயமாக கலப்பு நெடுவரிசைகளைப் பயன்படுத்தலாம்.
zh_cn: 创建插接板时，您可以指定插接板要使用的格式和设备。 提供了一个特殊的设备“save_to_disk”，在保存格式时使用（而不是将它们发送到设备）。 选择格式和设备后，您可以选择要更改的元数据字段，并提供模板来提供新值。 这些模板“连接”到其目标字段，因此称为“插件板”。 您当然可以在这些模板中使用复合列。

source: Plugboards are quite flexible and can be written in Single Function Mode, Template Program Mode, General Program Mode, or Python Template mode.
ta: செருகுநிரல்கள் மிகவும் நெகிழ்வானவை, மேலும் அவை ஒற்றை செயல்பாட்டு பயன்முறை, வார்ப்புரு நிரல் பயன்முறை, பொது நிரல் பயன்முறை அல்லது பைதான் வார்ப்புரு பயன்முறையில் எழுதப்படலாம்.
zh_cn: 处理规则功能非常灵活，可以使用“单函数模式”、“模板程序模式”、“通用程序模式”或“Python 模板模式”进行编写。

source: When a plugboard might apply (Content server, save to disk, or send to device), calibre searches the defined plugboards to choose the correct one for the given format and device. For example, to find the appropriate plugboard for an EPUB book being sent to an ANDROID device, calibre searches the plugboards using the following search order:
ja: プラグボードが適用される可能性がある場合 (コンテンツサーバ、ディスクに保存、またはデバイスに送信)、calibre は定義されたプラグボードを検索して、指定された形式とデバイスに適したプラグボードを選択します。たとえば、ANDROID デバイスに送信される EPUB ブックに適切なプラグボードを見つけるために、calibre は次の検索順でプラグボードを検索します:
ta: ஒரு செருகுநிரல் பொருந்தும் போது (உள்ளடக்க சேவையகம், வட்டில் சேமிக்கவும் அல்லது சாதனத்திற்கு அனுப்பவும்), கொடுக்கப்பட்ட வடிவம் மற்றும் சாதனத்திற்கு சரியான ஒன்றைத் தேர்வுசெய்ய காலிபர் வரையறுக்கப்பட்ட பிளேக் போர்டுகளைத் தேடுகிறது. எடுத்துக்காட்டாக, ஆண்ட்ராய்டு சாதனத்திற்கு அனுப்பப்படும் எபப் புத்தகத்திற்கு பொருத்தமான செருகுநிரலைக் கண்டுபிடிக்க, பின்வரும் தேடல் வரிசையைப் பயன்படுத்தி காலிபர் பிளேக் போர்டுகளைத் தேடுகிறார்:
zh_cn: 当插件板可能适用时（内容服务器、保存到磁盘或发送到设备），calibre 会搜索定义的插件板，为给定的格式和设备选择正确的插件板。 例如，要为发送到 ANDROID 设备的 EPUB 图书找到合适的插件板，calibre 使用以下搜索顺序搜索插件板：

source: a plugboard with an exact match on format and device, e.g., ``EPUB`` and ``ANDROID``
ja: 形式とデバイスが完全に一致するプラグボード。例: ``EPUB`` かつ ``ANDROID``
nl: een adapter met een exacte overeenkomst op formaat en toestel, bv. ``EPUB`` en ``ANDROID``
ta: வடிவமைப்பு மற்றும் சாதனத்தில் சரியான பொருத்தத்துடன் கூடிய செருகுநிரல், எ.கா., `` எபப்`` மற்றும் `` Android``
zh_cn: 一条针对格式和设备进行了精确匹配的处理规则，例如：格式为``EPUB``且设备为``ANDROID``。

source: a plugboard with an exact match on format and the special ``any device`` choice, e.g., ``EPUB`` and ``any device``
ja: 形式が完全に一致し、特別な ``任意のデバイス`` を選択できるプラグボード。例: ``EPUB`` かつ ``任意のデバイス``
ta: வடிவமைப்பில் சரியான பொருத்தம் மற்றும் சிறப்பு `` எந்த சாதனமும்` தேர்வு, எ.கா., `` எபப்`` மற்றும் `` எந்த சாதனமும்` `
zh_cn: 一条针对格式进行了精确匹配、但设备选择为特殊的 ``any device``（任何设备）的处理规则，例如：格式为``EPUB``且设备为 ``any device``

source: a plugboard with the special ``any format`` choice and an exact match on device, e.g., ``any format`` and ``ANDROID``
ja: 特別な ``任意のフォーマット`` を選択し、デバイス上で完全に一致するプラグボード。例: ``任意のフォーマット`` かつ ``ANDROID``
nl: een adapter met de speciale ``any format`` keuze en een exacte overeenkomst op toestel, bv. ``any format`` en ``ANDROID``
ta: சிறப்பு `` எந்த வடிவமும்` `தேர்வு மற்றும் சாதனத்தில் சரியான பொருத்தம், எ.கா.,` `எந்த வடிவமும்`` மற்றும்` `Android``
zh_cn: 一条格式选择为特殊的 ``any format ``（任何格式）、但针对设备进行了精确匹配的处理规则，例如：格式为 ``any format `` 且设备为 ``ANDROID ``。

source: a plugboard with ``any format`` and ``any device``
ja: ``任意のフォーマット`` と ``任意のデバイス`` を備えたプラグボード
ta: `` எந்த வடிவமும் `` `எந்த சாதனமும்`` `` `` `
zh_cn: 一条格式为 ``any format``（任何格式）且设备为 ``any device``（任何设备）的处理规则

source: The tags and authors fields have special treatment, because both of these fields can hold more than one item. A book can have many tags and many authors. When you specify that one of these two fields is to be changed, the template's result is examined to see if more than one item is there. For tags, the result is cut apart wherever calibre finds a comma. For example, if the template produces the value ``Thriller, Horror``, then the result will be two tags, ``Thriller`` and ``Horror``. There is no way to put a comma in the middle of a tag.
ja: タグフィールドと著者フィールドはどちらも複数のアイテムを保持できるため、特殊な扱いがあります。本にはいくつものタグと何人もの著者を含めることができます。これら 2 つのフィールドのいずれかを変更するように指定すると、テンプレートの結果に複数の項目がないか確認されます。タグの場合、calibre はカンマを見つけるたびに結果を分割します。たとえばテンプレートが値 ``Thriller, Horror`` を生成すると、結果は2つのタグ、``Thriller`` と ``Horror``になります。タグの途中にカンマを入れる方法はありません。
nl: De labels en auteurs velden hebben een speciale behandeling omdat beide velden meer dan één item kunnen vasthouden. Een boek kan vele labels en meerdere auteurs hebben. Als u opgeeft dat één van deze twee velden gewijzigd gaat worden, wordt de template resultaat onderzocht om te zien of meer dan één item is. Voor labels wordt het resultaat gescheiden waar Calibre een komma vindt. Bijvoorbeeld, als de template de waarde `` Thriller, Horror`` produceert, dan zal het resultaat twee labels zijn, ``Thriller`` en ``Horror``. Er is geen manier om een komma in het midden van een tag te zetten.
ta: குறிச்சொற்கள் மற்றும் ஆசிரியர்கள் துறைகள் சிறப்பு சிகிச்சையைக் கொண்டுள்ளன, ஏனெனில் இந்த இரண்டு துறைகளும் ஒன்றுக்கு மேற்பட்ட உருப்படிகளை வைத்திருக்க முடியும். ஒரு புத்தகத்தில் பல குறிச்சொற்கள் மற்றும் பல ஆசிரியர்கள் இருக்கலாம். இந்த இரண்டு புலங்களில் ஒன்று மாற்றப்பட வேண்டும் என்று நீங்கள் குறிப்பிடும்போது, ஒன்றுக்கு மேற்பட்ட உருப்படிகள் இருக்கிறதா என்று வார்ப்புருவின் முடிவு ஆராயப்படுகிறது. குறிச்சொற்களைப் பொறுத்தவரை, காலிபர் ஒரு கமாவைக் கண்டறிந்த இடங்களில் இதன் விளைவாக துண்டிக்கப்படுகிறது. எடுத்துக்காட்டாக, வார்ப்புரு `` த்ரில்லர், திகில்`` மதிப்பை உருவாக்கினால், இதன் விளைவாக இரண்டு குறிச்சொற்கள், `` த்ரில்லர்`` மற்றும் `` திகில்``. ஒரு குறிச்சொல்லின் நடுவில் கமாவை வைக்க வழி இல்லை.
zh_cn: 标签和作者字段有特殊处理，因为这两个字段都可以容纳多个项目。 一本书可以有多个标签和多个作者。 当您指定要更改这两个字段之一时，将检查模板的结果以查看是否存在多个项目。 对于标签，只要 calibre 找到逗号，结果就会被分割。 例如，如果模板生成值“Thriller, Horror”，则结果将是两个标签“Thriller”和“Horror”。 无法在标签中间放置逗号。

source: The same thing happens for authors, but using a different character for the cut, a `&` (ampersand) instead of a comma. For example, if the template produces the value ``Blogs, Joe&Posts, Susan``, then the book will end up with two authors, ``Blogs, Joe`` and ``Posts, Susan``. If the template produces the value ``Blogs, Joe;Posts, Susan``, then the book will have one author with a rather strange name.
ja: 著者にも同じことが起こりますが、分割に別の文字、カンマの代わりに `&` (アンパサンド) を使用します。たとえばテンプレートが値 ``Blogs, Joe&Posts, Susan`` を生成すると、本の著者は``Blogs, Joe`` と ``Posts, Susan`` の 2 人になります。テンプレートが ``Blogs, Joe;Posts, Susan`` という値を生成すると、その本の著者はかなり変わった名前の 1 人となります。
ta: ஆசிரியர்களுக்கும் இதே விஷயம் நிகழ்கிறது, ஆனால் வெட்டுக்கு வேறுபட்ட பாத்திரத்தைப் பயன்படுத்துதல், கமாவிற்கு பதிலாக ஒரு `&` (ஆம்பர்சண்ட்). எடுத்துக்காட்டாக, வார்ப்புரு `` வலைப்பதிவுகள், ஜோ & பதிவுகள், சூசன்`` மதிப்பை உருவாக்கினால், புத்தகம் இரண்டு ஆசிரியர்களுடன் முடிவடையும், `` வலைப்பதிவுகள், ஜோ`` மற்றும் `இடுகைகள், சூசன்``. வார்ப்புரு `` வலைப்பதிவுகள், ஜோ; இடுகைகள், சூசன்`` மதிப்பை உருவாக்கினால், புத்தகத்தில் ஒரு எழுத்தாளர் ஒரு விசித்திரமான பெயரைக் கொண்டிருப்பார்.
zh_cn: 作者也会发生同样的情况，但使用不同的字符进行剪切，即“&”（与号）而不是逗号。 例如，如果模板生成值“Blogs, Joe&Posts, Susan”，则该书最终将有两个作者：“Blogs, Joe”和“Posts, Susan”。 如果模板生成值“博客，乔；帖子，苏珊”，那么这本书将有一位作者的名字相当奇怪。

source: Plugboards affect the metadata written into the book when it is saved to disk or written to the device. Plugboards do not affect the metadata used by ``save to disk`` and ``send to device`` to create the file names. Instead, file names are constructed using the templates entered on the appropriate preferences window.
ja: プラグボードは、本がディスクに保存されるとき、またはデバイスに書き込まれるときに、本に書き込まれる書誌に影響を与えます。プラグボードは、ファイル名を作成するための ``ディスクに保存`` や ``デバイスに送信`` によって使われる書誌には影響しません。代わりに、ファイル名は、適切な設定ウィンドウに入力されたテンプレートを使用して作成されます。
ta: பிளேப் போர்டுகள் புத்தகத்தில் எழுதப்பட்ட மெட்டாடேட்டாவை வட்டில் சேமிக்கும்போது அல்லது சாதனத்தில் எழுதும்போது பாதிக்கின்றன. கோப்பு பெயர்களை உருவாக்க `` வட்டில் சேமி `` வட்டுக்கு அனுப்பவும் `` `சாதனத்திற்கு அனுப்பவும். அதற்கு பதிலாக, பொருத்தமான விருப்பத்தேர்வுகள் சாளரத்தில் உள்ளிடப்பட்ட வார்ப்புருக்களைப் பயன்படுத்தி கோப்பு பெயர்கள் கட்டமைக்கப்படுகின்றன.
zh_cn: 当将书籍保存到磁盘或写入设备时，插件板会影响写入书中的元数据。 插件板不会影响“保存到磁盘”和“发送到设备”用来创建文件名的元数据。 相反，文件名是使用在适当的首选项窗口中输入的模板构建的。

source: Using functions in templates - Single Function Mode
ja: テンプレートでの関数の使用 - 単関数モード
nl: Functies gebruiken in sjablonen - Eén Functie Modus
ta: வார்ப்புருக்களில் செயல்பாடுகளைப் பயன்படுத்துதல் - ஒற்றை செயல்பாட்டு முறை
zh_cn: 在模板中使用函数 - 单函数模式

source: Suppose you want to display the value of a field in upper case when that field is normally in title case. You can do this using `template functions`. For example, to display the title in upper case use the ``uppercase`` function, as in ``{title:uppercase()}``. To display it in title case, use ``{title:titlecase()}``.
ja: あるフィールドが通常はタイトルケースで、その値を大文字で表示したいと仮定します。`テンプレート関数` を使用すれば、それが可能です。たとえば、タイトルを大文字で表示するには ``uppercase`` 関数を使用して、`{title:uppercase()}`` とします。タイトルケースで表示するには ``{title:titlecase()}`` を使用します。
nl: Veronderstel dat u de waarde van een veld in hoofdletters wil tonen wanneer dat veld normaal elk woord met beginhoofdletter toont. Dit kan met `sjabloonfuncties`. Bv., om de titel in hoofdletters te tonen, gebruik de ``uppercase`` functie, zoals in ``{title:uppercase()}``. Om met beginhoofdletters te tonen, gebruik ``{title:titlecase()}``.
ta: அந்த புலம் பொதுவாக தலைப்பு வழக்கில் இருக்கும்போது ஒரு புலத்தின் மதிப்பை மேல் விஷயத்தில் காண்பிக்க விரும்புகிறீர்கள் என்று வைத்துக்கொள்வோம். `வார்ப்புரு செயல்பாடுகளை` பயன்படுத்தி இதைச் செய்யலாம். எடுத்துக்காட்டாக, மேல் வழக்கில் தலைப்பைக் காண்பிக்க `` {தலைப்பு: பெரிய எழுத்து ()} `` போன்ற `` பெரிய எழுத்து`` செயல்பாட்டைப் பயன்படுத்தவும். தலைப்பு வழக்கில் இதைக் காட்ட, `` {தலைப்பு: டிட்லெகேஸ் ()} `` ஐப் பயன்படுத்தவும்.
zh_cn: 假设您想要以大写形式显示某个字段的值，而该字段通常为标题大写形式。 您可以使用“模板函数”来完成此操作。 例如，要以大写形式显示标题，请使用“uppercase”函数，如“{title:uppercase()}”。 要以标题大小写显示它，请使用``{title:titlecase()}``。

source: Functions go into the format part of the template, after the ``:`` and before the first ``|`` or the closing ``}`` if no prefix/suffix is used. If you have both a format and a function reference, the function comes after a second ``:``. Functions return the value of the column specified in the template, suitably modified.
ja: 関数は、テンプレートのフォーマット部分に入ります。それは ``:`` の後、かつ最初の ``|`` またはプレフィックス/サフィックスが使われていれば閉じ括弧 ``}`` の前です。フォーマットと関数参照の両方がある場合、関数は 2 個目の ``:`` の後に来ます。関数は、テンプレートで指定された列の値を適切に変更して返します。
nl: Functies gaan in het formaat deel van de sjabloon, na de ``:`` en voor de eerste ``|`` of de sluit ``}`` als geen voor- of achtervoegsel is gebruikt. Als u zowel een formaat als een functie referentie hebt, komt de functie na een tweede ``:``. Functies geven de waarde terug van de kolom gespecificeerd in de sjabloon, gepast gewijzigd.
ta: ``: `` க்குப் பிறகு, முதல் `` | `` அல்லது முன்னொட்டு/பின்னொட்டு எதுவும் பயன்படுத்தப்படாவிட்டால் ``} `` மூடுவதற்கு முன், செயல்பாடுகள் வார்ப்புருவின் வடிவமைப்பு பகுதிக்குச் செல்கின்றன. உங்களிடம் ஒரு வடிவம் மற்றும் செயல்பாட்டு குறிப்பு இரண்டும் இருந்தால், செயல்பாடு இரண்டாவது ``: `` க்குப் பிறகு வருகிறது. செயல்பாடுகள் வார்ப்புருவில் குறிப்பிடப்பட்டுள்ள நெடுவரிசையின் மதிப்பை மாற்றியமைக்கின்றன, பொருத்தமாக மாற்றியமைக்கப்படுகின்றன.
zh_cn: 函数进入模板的格式部分，在 ``:`` 之后和第一个 ``|`` 之前，或者如果没有使用前缀/后缀，则在结束的 ``}`` 之前。 如果您同时具有格式和函数引用，则该函数位于第二个 ``:`` 后面。 函数返回模板中指定的列的值，经过适当修改。

source: The syntax for using functions is one of::
ja: 関数を使用するための構文は、次のいずれかです::
nl: De syntaxis voor gebruik van functies is een van::
ta: செயல்பாடுகளைப் பயன்படுத்துவதற்கான தொடரியல் ஒன்றாகும் ::
zh_cn: 使用函数的语法形式为以下之一::

source: Function names must always be followed by opening and closing parentheses. Some functions require extra values (arguments), and these go inside the parentheses. Arguments are separated by commas. Literal commas (commas as text, not argument separators) must be preceded by a backslash (``\``) . The last (or only) argument cannot contain a textual closing parenthesis.
ja: 関数名の後には、必ず開き括弧と閉じ括弧を付ける必要があります。一部の関数は追加の値 (引数) を必要とし、これらは括弧内に入ります。引数はカンマで区切ります。リテラルコンマ (引数の区切り文字ではなくテキストとしてのカンマ) の前には、バックスラッシュ (``\``) を付ける必要があります。最後の (または唯一の) 引数には、テキストの閉じ括弧を含めることはできません。
nl: Functienamen moeten altijd gevolgd worden door open/sluithaakjes. Sommige functies hebben extra waarden (argumenten) nodig en deze staan tussen de haakjes. Argumenten worden gescheiden door komma's. Letterlijke komma's (als tekst, niet als argumenten scheiders) moeten vooraf gegaan worden door een achteroverhellend streepje (``\``). Het laatste (of enige) argument kan geen tekstueel sluithaakje bevatten.
ta: அடைப்புக்குறிகளைத் திறப்பதன் மூலமும் மூடுவதன் மூலமும் செயல்பாட்டு பெயர்கள் எப்போதும் பின்பற்றப்பட வேண்டும். சில செயல்பாடுகளுக்கு கூடுதல் மதிப்புகள் (வாதங்கள்) தேவைப்படுகின்றன, மேலும் இவை அடைப்புக்குறிக்குள் செல்கின்றன. வாதங்கள் காற்புள்ளிகளால் பிரிக்கப்படுகின்றன. நேரடி காற்புள்ளிகள் (உரையாக கமாக்கள், வாத பிரிப்பான்கள் அல்ல) ஒரு பின்சாய்வுப்பால் (`` \ ``) முன்னதாக இருக்க வேண்டும். கடைசி (அல்லது மட்டும்) வாதத்தில் உரை நிறைவு அடைப்புக்குறிப்பு இருக்க முடியாது.
zh_cn: 函数名称后面必须始终跟有左括号和右括号。 有些函数需要额外的值（参数），这些值位于括号内。 参数之间用逗号分隔。 文字逗号（逗号作为文本，而不是参数分隔符）前面必须有反斜杠 (``\``) 。 最后一个（或唯一的）参数不能包含文本右括号。

source: Functions are evaluated before format specifications and the prefix/suffix. See further down for an example of using both a format and a function.
ja: 関数は、フォーマット指定とプレフィックス/サフィックスの前に評価されます。フォーマットと関数の両方を使用する例については、さらに下を参照してください。
nl: Functies worden geëvalueerd voor formaat specificaties en het voor-/achtervoegsel. Kijk verder beneden voor een voorbeeld van gebruik van zowel een formaat als een functie.
ta: வடிவமைப்பு விவரக்குறிப்புகள் மற்றும் முன்னொட்டு/பின்னொட்டுக்கு முன் செயல்பாடுகள் மதிப்பீடு செய்யப்படுகின்றன. ஒரு வடிவம் மற்றும் செயல்பாடு இரண்டையும் பயன்படுத்துவதற்கான எடுத்துக்காட்டுக்கு மேலும் கீழே காண்க.
zh_cn: 函数会在格式规范（format specifications）以及前缀/后缀（prefix/suffix）之前执行评估。有关同时使用格式和函数的示例，请参阅下文。

source: **Important**: If you have programming experience, please note that the syntax in `Single Function Mode` is not what you expect. Strings are not quoted and spaces are significant. All arguments are considered to be constants; there are no expressions.
ja: **重要**: プログラミングの経験がある場合は、`単関数モード` の構文が思ったものと違うことに注意してください。文字列は引用符で囲まれておらず、スペースは重要です。すべての引数は定数と見なされます。式はありません。
nl: **Belangrijk**: Als u programmeerervaring hebt, hou er a.u.b. rekening mee dat de syntaxis in `Eén Functie Modus` niet is wat u verwacht. Strings hebben geen aanhalingstekens en spaties zijn belangrijk. Alle argumenten worden gezien als contanten; er zijn geen expressies.
ta: ** முக்கியமானது **: உங்களுக்கு நிரலாக்க அனுபவம் இருந்தால், `ஒற்றை செயல்பாட்டு பயன்முறையில் 'தொடரியல் நீங்கள் எதிர்பார்ப்பது அல்ல என்பதை நினைவில் கொள்க. சரங்கள் மேற்கோள் காட்டப்படவில்லை மற்றும் இடைவெளிகள் குறிப்பிடத்தக்கவை. அனைத்து வாதங்களும் மாறிலிகளாக கருதப்படுகின்றன; வெளிப்பாடுகள் எதுவும் இல்லை.
zh_cn: **重要**：如果您有编程经验，请注意“单函数模式”中的语法不是您所期望的。 字符串不加引号，并且空格很重要。 所有参数都被视为常量； 没有表达式。

source: Some functions require regular expressions. In the template language regular expression matching is case-insensitive.
ja: 一部の関数には正規表現が必要です。テンプレート言語では、正規表現のマッチでは大文字と小文字が区別されません。
nl: Sommige functies vereisen reguliere expressies. In de sjabloontaal zijn reguliere expressie overeenkomsten niet hoofdlettergevoelig.
ta: சில செயல்பாடுகளுக்கு வழக்கமான வெளிப்பாடுகள் தேவை. வார்ப்புரு மொழியில் வழக்கமான வெளிப்பாடு பொருத்தம் வழக்கு-உணர்வற்றது.
