Repository: debian-calibre/calibre
Catalog: translations/manual/*/template_lang.po
Languages: ja, nl, ta, zh_cn

source: ``program: 'f.o' in field('series')`` returns ``'1'`` if the book's series matches the regular expression ``f.o`` (e.g., `foo`, `Off Onyx`, etc.), otherwise ``''``.
ja: ``program: 'f.o' in field('series')`` は、本のシリーズが正規表現 ``f.o`` (例: `foo`, `Off Onyx`, など) とマッチすれば ``'1'`` を返し、そうでなければ ``''`` を返します。
nl: ``program: 'f.o' in field('series')`` geeft ``'1'`` terug als het boek z'n serie overeenkomt met de reguliere expressie ``f.o`` (bv., `foo`, `Off Onyx`, enz.), anders ``''``.
ta: `` நிரல்: 'F.O.R' புலத்தில் ('தொடர்') `` புத்தகத் தொடர் வழக்கமான வெளிப்பாட்டுடன் பொருந்தினால் `` f.o`` (எ.கா., `ஃபூ`,` ஆஃப் ஓனிக்ஸ்`, போன்றவை .), இல்லையெனில் `` '' ``.
zh_cn: program: 'f.o' in field('series') 如果书籍的丛书名匹配正则表达式 f.o（例如：foo、Off Onyx 等），则返回 '1'，否则返回空字符串（''）。

source: ``program: 'science' inlist field('#genre')`` returns ``'1'`` if any of the book's genres match the regular expression ``science``, e.g., `Science`, `History of Science`, `Science Fiction` etc.), otherwise ``''``.
ja: ``program: 'science' inlist field('#genre')`` は、本のジャンルのいずれかが正規表現 ``science``, (例: `Science`, `History of Science`, `Science Fiction` など) とマッチすれば ``'1'`` を返し、そうでなければotherwise ``''`` を返します。
nl: ``program: 'science' inlist field('#genre')`` geeft ``'1'`` terug als één van de boeken z'n genres overeenkomen met de reguliere expressie ``science``, bv., `Science`, `History of Science`, `Science Fiction` etc.), anders ``''``.
ta: `` நிரல்: 'அறிவியல்' இன்லிஸ்ட் புலம் ('#வகை') `` புத்தகத்தின் வகைகள் ஏதேனும் வழக்கமான வெளிப்பாட்டுடன் பொருந்தினால் `` '1'``, எ.கா., `அறிவியல்`,` வரலாறு அறிவியல்`, `அறிவியல் புனைகதை` போன்றவை), இல்லையெனில்` `''` `.

source: ``program: '^science$' inlist field('#genre')`` returns ``'1'`` if any of the book's genres exactly match the regular expression ``^science$``, e.g., `Science`. The genres `History of Science` and `Science Fiction` don't match. If there isn't a match then returns ``''``.
ja: ``program: '^science$' inlist field('#genre')`` は、本のジャンルのいずれかが正規表現 ``^science$`` に完全一致すれば (例: `Science`) ``'1'`` を返します。ジャンル `History of Science` や `Science Fiction` はマッチしません。マッチするものがなければ ``''`` を返します。
nl: ``program: '^science$' inlist field('#genre')`` geeft ``'1'`` terug als één van de boeken z'n genres exact overeenkomt met de reguliere expressie ``^science$``, bv., `Science`. De genres `History of Science` en `Science Fiction` komen niet overeen. Bij geen overeenkomst wordt ``''`` teruggegeven.
ta: `` நிரல்: '^சயின்ஸ் $' இன்லிஸ்ட் புலம் ('#வகை') `` `` '1'`` புத்தகத்தின் எந்தவொரு வகைகளும் வழக்கமான வெளிப்பாட்டுடன் சரியாக பொருந்தினால், `^அறிவியல் $` `, எ.கா.,` அறிவியல் `. `அறிவியலின் வரலாறு` மற்றும்` அறிவியல் புனைகதை` வகைகள் பொருந்தவில்லை. ஒரு போட்டி இல்லையென்றால் `` '' `` `திரும்பும்.

source: ``program: if field('series') != 'foo' then 'bar' else 'mumble' fi`` returns ``'bar'`` if the book's series is not ``foo``. Otherwise it returns ``'mumble'``.
ja: ``program: if field('series') != 'foo' then 'bar' else 'mumble' fi`` は、本の series が ``foo`` でなければ ``'bar'`` を返します。それ以外のときには ``'mumble'`` を返します。
nl: ``program: if field('series') != 'foo' then 'bar' else 'mumble' fi`` geeft ``'bar'`` terug als het boek z'n serie niet ``foo`` is. Anders geeft het ``'mumble'`` terug.
ta: `` நிரல்: புலம் ('தொடர்')! இல்லையெனில் அது `` 'முணுமுணுப்பு'`` தருகிறது.

source: ``program: if field('series') == 'foo' || field('series') == '1632' then 'yes' else 'no' fi`` returns ``'yes'`` if series is either ``'foo'`` or ``'1632'``, otherwise ``'no'``.
ja: ``program: if field('series') == 'foo' || field('series') == '1632' then 'yes' else 'no' fi`` は、本の series が ``'foo'`` または ``'1632'`` のとき ``'yes'`` を返し、それ以外のときにいは ``'no'`` を返します。
nl: ``program: if field('series') == 'foo' || field('series') == '1632' then 'yes' else 'no' fi`` geeft ``'yes'`` terug als de serie ofwel``'foo'`` is ofwel ``'1632'``, anders ``'no'``.
ta: `` நிரல்: புலம் ('தொடர்') == 'ஃபூ' || புலம் ('தொடர்') == '1632' பின்னர் 'ஆம்' வேறு 'இல்லை' fi`` திரும்பும் `` 'ஆம்'`` என்றால் தொடர் ``' 'foo'`` அல்லது ``' 1632'``, இல்லையெனில் `` 'இல்லை'``.

source: ``program: if '^(foo|1632)$' in field('series') then 'yes' else 'no' fi`` returns ``'yes'`` if series is either ``'foo'`` or ``'1632'``, otherwise ``'no'``.
ja: ``program: if '^(foo|1632)$' in field('series') then 'yes' else 'no' fi`` は series が ``'foo'`` または ``'1632'`` なら ``'yes'``を返し、それ以外のときには ``'no'`` を返します。
nl: ``program: if '^(foo|1632)$' in field('series') then 'yes' else 'no' fi`` geeft ``'yes'`` terug als de serie ofwel ``'foo'`` is ofwel ``'1632'``, anders ``'no'``.
ta: `` நிரல்: if '^(foo | 1632) $' புலத்தில் ('தொடர்') பின்னர் 'ஆம்' வேறு 'இல்லை' fi`` திரும்புகிறது `` 'ஆம்'`` `அல்லது` `'1632'``, இல்லையெனில்` `' இல்லை'`.

source: ``program: if 11 > 2 then 'yes' else 'no' fi`` returns ``'no'`` because the ``>`` operator does a lexical comparison.
ja: ``program: if 11 > 2 then 'yes' else 'no' fi`` は ``'no'`` を返します。なぜなら ``>`` 演算子が辞書比較を行うからです。
nl: ``program: if 11 > 2 then 'yes' else 'no' fi`` geeft ``'no'`` omdat de ``>`` operator een lexicale vergelijking doet.
ta: `` நிரல்: 11> 2 என்றால் 'ஆம்' வேறு 'இல்லை' fi`` `` 'இல்லை'` திரும்பி வருவதால் ``> `` ஆபரேட்டர் ஒரு சொற்பொழிவு ஒப்பீட்டைச் செய்கிறார்.
zh_cn: program: if 11 > 2 then 'yes' else 'no' fi 返回 'no'，因为 > 运算符执行的是词典顺序（字符串）比较。

source: ``program: if 11 ># 2 then 'yes' else 'no' fi`` returns ``'yes'`` because the ``>#`` operator does a numeric comparison.
ja: ``program: if 11 ># 2 then 'yes' else 'no' fi`` は ``'yes'`` を返します。なぜなら ``>#`` 演算子は数値比較を行うからです。
nl: ``program: if 11 ># 2 then 'yes' else 'no' fi`` geeft ``'yes'`` terug omdat de ``>#`` operator een numerieke vergelijking doet.
ta: `` நிரல்: 11># 2 என்றால் 'ஆம்' வேறு 'இல்லை' fi`` `` 'ஆம்'`` திரும்பி வருகிறார், ஏனெனில் ``># `` ஆபரேட்டர் ஒரு எண் ஒப்பீட்டைச் செய்கிறார்.
zh_cn: program: if 11 ># 2 then 'yes' else 'no' fi 返回 'yes'，因为 ># 运算符执行的是数值比较。

source: **Additional available functions**
ja: **利用可能な追加の関数**
nl: **Extra beschikbare functies**
ta: ** கூடுதல் கிடைக்கக்கூடிய செயல்பாடுகள் **

source: The following functions are available in addition to those described in :ref:`Single Function Mode <single_mode>`.
ja: :ref:`単関数モード <single_mode>` で説明したものに加えて、次の関数が利用できます。
nl: Volgende functies zijn beschikbaar bovenop die beschreven in :ref:`Eén Functie Modus <single_mode>`.
ta: விவரிக்கப்பட்டுள்ளவற்றுடன் கூடுதலாக பின்வரும் செயல்பாடுகள் கிடைக்கின்றன: குறிப்பு: `ஒற்றை செயல்பாட்டு பயன்முறை <ஒற்றை_மோட்>`.

source: In `GPM` the functions described in `Single Function Mode` all require an additional first parameter specifying the value to operate upon. All parameters are expression_lists (see the grammar above).
ja: `GPM` では、`単関数モード` で説明されている機能はすべて、操作する値を指定する最初のパラメータを追加で必要とします。すべてのパラメータは expression_lists です (上記の文法を参照)。
nl: In `APM` hebben de functies beschreven in `Eén Functie Modus` allemaal een extra eerste parameter nodig die de waarde specificeert waarop te werken. Alle parameters zijn expression_lists (zie de grammatica boven).
ta: `ஜிபிஎம்` இல்` ஒற்றை செயல்பாட்டு பயன்முறையில் 'விவரிக்கப்பட்டுள்ள செயல்பாடுகள் அனைத்தும் செயல்படுவதற்கான மதிப்பைக் குறிப்பிடும் கூடுதல் முதல் அளவுரு தேவைப்படுகிறது. அனைத்து அளவுருக்கள் வெளிப்பாடு_ பட்டியல்கள் (மேலே உள்ள இலக்கணத்தைக் காண்க).

source: ``add(x [, y]*)`` -- returns the sum of its arguments. Throws an exception if an argument is not a number. In most cases you can use the ``+`` operator instead of this function.
ja: ``add(x [, y]*)`` -- 引数の合計を返します。引数が数値でない場合は、例外をスローします。ほとんどの場合、この関数の代わりに ``+`` 演算子を使用できます。
nl: ``add(x [, y]*)`` -- geeft de som van z'n argumenten terug. Gooit een uitzondering als een argument geen getal is. In de meeste gevallen kan u de ``+`` operator gebruiken i.p.v. deze functie.
ta: `` சேர் (x [, y]*) `` - அதன் வாதங்களின் தொகையை வழங்குகிறது. ஒரு வாதம் ஒரு எண்ணாக இல்லாவிட்டால் விதிவிலக்கை வீசுகிறது. பெரும்பாலான சந்தர்ப்பங்களில் நீங்கள் இந்த செயல்பாட்டிற்கு பதிலாக ``+`` ஆபரேட்டரைப் பயன்படுத்தலாம்.

source: ``and(value [, value]*)`` -- returns the string "1" if all values are not empty, otherwise returns the empty string. You can have as many values as you want. In most cases you can use the ``&&`` operator instead of this function. One reason not to replace ``and`` with ``&&`` is if short-circuiting can change the results because of side effects. For example, ``and(a='',b=5)`` will always do both assignments, where the ``&&`` operator won't do the second.
ja: ``and(value [, value]*)`` -- すべての値が空でない場合は文字列 "1" を返し、そうでない場合は空の文字列を返します。必要な数だけ値を持つことができます。ほとんどの場合、この関数の代わりに ``&&`` 演算子を使用できます。``and`` と ``&&`` を置き換えない理由のひとつは、副作用により短絡評価が結果を変えてしまう可能性があるためです。たとえば、``and(a='',b=5)`` は常に両方の割り当てを行いますが、``&&`` 演算子は 2 番目の割り当てを行いません。
nl: ``and(value [, value]*)`` -- geeft de string "1" terug als geen enkele waarde leeg is, anders de lege string. U kan zoveel waardes hebben als u wil. In de meeste gevallen kan u de ``&&`` operator gebruiken i.p.v. deze functie. Een reden om ``and`` niet te vervangen door ``&&`` is als short-circuiting de resultaten kan veranderen door bijwerkingen. Bv. ``and(a='',b=5)`` zal altijd beide opdrachten doen terwijl de ``&&`` operator de tweede niet zal doen.
ta: `` மற்றும் (மதிப்பு [, மதிப்பு]*) `` - எல்லா மதிப்புகளும் காலியாக இல்லாவிட்டால், "1" என்ற சரத்தை வழங்குகிறது, இல்லையெனில் வெற்று சரத்தை வழங்குகிறது. நீங்கள் விரும்பும் பல மதிப்புகளை நீங்கள் கொண்டிருக்கலாம். பெரும்பாலான சந்தர்ப்பங்களில் நீங்கள் இந்த செயல்பாட்டிற்கு பதிலாக `` && ஆபரேட்டரைப் பயன்படுத்தலாம். `` மற்றும்`` ஐ `` && `` உடன் மாற்றக்கூடாது என்பதற்கு ஒரு காரணம், குறுகிய சுற்று பக்க விளைவுகளின் காரணமாக முடிவுகளை மாற்ற முடியும் என்றால். எடுத்துக்காட்டாக, `` மற்றும் (a = '', b = 5) `` எப்போதும் இரண்டு பணிகளையும் செய்யும், அங்கு `` && `ஆபரேட்டர் இரண்டாவது செய்ய மாட்டார்கள்.

source: ``assign(id, val)`` -- assigns ``val`` to ``id``, then returns ``val``. ``id`` must be an identifier, not an expression. In most cases you can use the ``=`` operator instead of this function.
ja: ``assign(id, val)`` -- ``val`` を ``id`` に割り当ててから、``val`` を返します。 ``id`` は、式ではなく識別子でなくてはなりません。ほとんどの場合、この関数の代わりに ``=`` 演算子を使用できます。
nl: ``assign(id, val)`` -- wijst ``val`` toe aan ``id``, geeft dan ``val`` terug. ``id`` moet een identificator zijn, geen expressie. Meestal kan u de ``=`` operator gebruiken i.p.v. deze functie.
ta: `` ஒதுக்கு (ஐடி, வால்) `` - `` ஐடி`` க்கு `` வால்`` ஒதுக்குகிறது, பின்னர் `` வால்`` ஐ வழங்குகிறது. `` ஐடி`` ஒரு அடையாளங்காட்டியாக இருக்க வேண்டும், ஒரு வெளிப்பாடு அல்ல. பெரும்பாலான சந்தர்ப்பங்களில் நீங்கள் இந்த செயல்பாட்டிற்கு பதிலாக `` = `` ஆபரேட்டரைப் பயன்படுத்தலாம்.

source: ``approximate_formats()`` -- return a comma-separated list of formats associated with the book. There is no guarantee that the list is correct, although it probably is. This and other zero-parameter functions can be called in Template Program Mode (see below) using the template ``{:'approximate_formats()'}``. Note that resulting format names are always uppercase, as in EPUB. The ``approximate_formats()`` function is significantly faster than the ``formats_...`` functions discussed below.
ja: ``approximate_formats()`` -- 本に関連付けられている形式のカンマ区切りリストを返します。おそらく正しいとはいえ、リストが正しいという保証はありません。この関数およびその他のゼロパラメータ関数は、テンプレート ``{:'approximate_formats()'}`` を使用してテンプレートプログラムモード (以下を参照) で呼び出すことができます。結果の形式名は、EPUB の場合と同様に、常に大文字となります。``approximate_formats()`` 関数は、以下で説明する ``formats_... `` 関数よりも大幅に高速です。
nl: ``approximate_formats()`` -- geeft een komma gescheiden lijst terug met formaten geassocieerd met het boek. Er is garantie dat de lijst correct is maar waarschijnlijk wel. Deze en andere nul-parameter functies kunnen aangeroepen worden in Sjabloon Programma Modus (zie onder) met de sjabloon ``{:'approximate_formats()'}``. Merk op dat de resulterende formaatnamen altijd in hoofdletters zijn, zoals in EPUB. De ``approximate_formats()`` functie is beduidend sneller dan de ``formats_...`` functies besproken onder.
ta: `` தோராயமான_ஃபார்மேட்ஸ் () ``-புத்தகத்துடன் தொடர்புடைய வடிவங்களின் கமாவால் பிரிக்கப்பட்ட பட்டியலைத் தரவும். பட்டியல் சரியானது என்பதற்கு எந்த உத்தரவாதமும் இல்லை, அது அநேகமாக இருந்தாலும். இது மற்றும் பிற பூஜ்ஜிய-அளவுரு செயல்பாடுகளை வார்ப்புரு நிரல் பயன்முறையில் (கீழே காண்க) `` {: 'தோராயமான_பிரேதங்கள் ()'} `` ஆகியவற்றைப் பயன்படுத்தி அழைக்கலாம். இதன் விளைவாக வரும் வடிவமைப்பு பெயர்கள் எபப் போலவே எப்போதும் பெரிய எழுத்தாளர்களாக இருக்கும் என்பதை நினைவில் கொள்க. `` தோராயமான_ வடிவங்கள் () `` செயல்பாடு `` வடிவங்கள் _... `` கீழே விவாதிக்கப்பட்ட செயல்பாடுகளை விட கணிசமாக வேகமானது.

source: ``author_links(val_separator, pair_separator)`` -- returns a string containing a list of authors and those authors' link values in the form::
ja: ``author_links(val_separator, pair_separator)`` -- 著者のリストとそれらの著者のリンク値を含む文字列を次の形式で返します::
nl: ``author_links(val_separator, pair_separator)`` -- geeft een string terug met een lijst van auteurs en deze auteurs' hun link waarde in de vorm::
ta: `` author_links (val_separator, ஜோடி_சப்பரேட்டர்) `` - ஆசிரியர்கள் மற்றும் அந்த ஆசிரியர்களின் இணைப்பு மதிப்புகள் கொண்ட ஒரு சரத்தை படிவத்தில் வழங்குகிறது ::

source: An author is separated from its link value by the ``val_separator`` string with no added spaces. ``author:linkvalue`` pairs are separated by the ``pair_separator`` string argument with no added spaces. It is up to you to choose separator strings that do not occur in author names or links. An author is included even if the author link is empty.
ja: 作成者は、スペースを追加せずに ``val_separator`` 文字列によってリンク値から分離されます。 ``author:linkvalue`` のペアは、スペースを追加せずに、``pair_separator`` 文字列引数で区切られます。著者名やリンクに含まれない区切り文字列を選択してください。著者リンクが空の場合でも、著者が含まれます。
nl: Een auteur wordt gescheiden van z'n link waarde door de ``val_separator`` string zonder extra spaties. ``author:linkvalue`` paren worden gescheiden door het ``pair_separator`` string argument zonder extra spaties. Het is aan u om separator strings te kiezen die niet in de auteursnaam of -links voorkomen. Een auteur wordt inbegrepen zelfs als de auteur link leeg is.
ta: ஒரு எழுத்தாளர் அதன் இணைப்பு மதிப்பிலிருந்து `` val_separator`` சரம் கூடுதல் இடங்கள் இல்லாமல் பிரிக்கப்படுகிறார். `` ஆசிரியர்: லிங்க்வால்யூ`` ஜோடிகள் கூடுதல் இடைவெளிகள் இல்லாமல் `` ஜோடி_சபரேட்டர்`` சரம் வாதத்தால் பிரிக்கப்படுகின்றன. ஆசிரியர் பெயர்கள் அல்லது இணைப்புகளில் ஏற்படாத பிரிப்பான் சரங்களைத் தேர்ந்தெடுப்பது உங்களுடையது. ஆசிரியர் இணைப்பு காலியாக இருந்தாலும் ஒரு ஆசிரியர் சேர்க்கப்படுவார்.

source: ``author_sorts(val_separator)`` -- returns a string containing a list of author's sort values for the authors of the book. The sort is the one in the author metadata information (different from the author_sort in books). The returned list has the form ``author sort 1`` ``val_separator`` ``author sort 2`` etc. with no added spaces. The author sort values in this list are in the same order as the authors of the book. If you want spaces around ``val_separator`` then include them in the ``val_separator`` string.
ja: ``author_sorts(val_separator)`` -- 本の著者の著者読みの値のリストを含む文字列を返します。著者読みは、著者の書誌情報に含まれるものです (本の author_sort とは異なります)。``author sort 1`` ``val_separator`` ``author sort 2`` などの形のリストを返します。スペースは追加されません。このリストの著者読みの値は、本の著者と同じ順序です。 ``val_separator`` の前後にスペースが必要な場合は、それらを ``val_separator`` 文字列に含めます。
nl: ``author_sorts(val_separator)`` -- geeft een string terug die een lijst van auteur sorteer waarden bevat voor de auteurs van het boek. De sortering is diegene in de auteur's metadata (anders dan de auteur_sort in boeken). De teruggegeven lijst heeft de vorm auteur ``author sort 1`` ``val_separator`` ``author sort 2`` enz. De author_sort waarden in de lijst zijn in dezelfde volgorde als de auteurs van het boek. Indien u spaties wilt rond ``val_separator`` zet deze in de ``val_separator`` string
ta: `` author_sorts (val_separator) `` - புத்தகத்தின் ஆசிரியர்களுக்கான ஆசிரியரின் வரிசை மதிப்புகளின் பட்டியலைக் கொண்ட ஒரு சரத்தை வழங்குகிறது. ஆசிரியர் மெட்டாடேட்டா தகவல்களில் (புத்தகங்களில் உள்ள ஆசிரியர்_சார்ட்டிலிருந்து வேறுபட்டது). திரும்பிய பட்டியலில் `` ஆசிரியர் வரிசை 1`` `` `val_separator``` `ஆசிரியர் வரிசைப்படுத்தல் 2`` போன்ற படிவங்கள் உள்ளன. இந்த பட்டியலில் ஆசிரியர் வரிசைப்படுத்தப்பட்ட மதிப்புகள் புத்தகத்தின் ஆசிரியர்களின் அதே வரிசையில் உள்ளன. `` Val_separator`` ஐச் சுற்றியுள்ள இடைவெளிகளை நீங்கள் விரும்பினால், அவற்றை `` val_separator`` சரத்தில் சேர்க்கவும்.

source: ``book_count(query, use_vl)`` -- returns the count of books found by searching for ``query``. If ``use_vl`` is ``0`` (zero) then virtual libraries are ignored. This function and its companion ``book_values()`` are particularly useful in template searches, supporting searches that combine information from many books such as looking for series with only one book. It cannot be used in composite columns unless the tweak ``allow_template_database_functions_in_composites`` is set to True. It can be used only in the GUI.
ta: `` book_count (வினவல், use_vl) `` - `` வினவல்`` தேடுவதன் மூலம் கண்டுபிடிக்கப்பட்ட புத்தகங்களின் எண்ணிக்கையை வழங்குகிறது. `` Use_vl`` `` 0`` (பூஜ்ஜியம்) என்றால் மெய்நிகர் நூலகங்கள் புறக்கணிக்கப்படும். இந்த செயல்பாடு மற்றும் அதன் தோழர் `` book_values () `` வார்ப்புரு தேடல்களில் குறிப்பாக பயனுள்ளதாக இருக்கும், இது ஒரே ஒரு புத்தகத்துடன் தொடர்களைத் தேடுவது போன்ற பல புத்தகங்களிலிருந்து தகவல்களை இணைக்கும் தேடல்களை ஆதரிக்கிறது. `` Allow_template_database_functions_in_composites`` என்ற மாற்றங்கள் உண்மைக்கு அமைக்கப்படாவிட்டால், கலப்பு நெடுவரிசைகளில் இதைப் பயன்படுத்த முடியாது. இதை GUI இல் மட்டுமே பயன்படுத்த முடியும்.

source: For example this template search uses this function and its companion to find all series with only one book:
ta: எடுத்துக்காட்டாக, இந்த வார்ப்புரு தேடல் இந்த செயல்பாட்டையும் அதன் தோழரையும் ஒரே ஒரு புத்தகத்துடன் மட்டுமே கண்டுபிடிக்க பயன்படுத்துகிறது:

source: Define a stored template (using :guilabel:`Preferences->Advanced->Template functions`) named ``series_only_one_book`` (the name is arbitrary). The template is::
ta: சேமிக்கப்பட்ட வார்ப்புருவை வரையறுக்கவும் (பயன்படுத்துதல்: கிலாபெல்: `விருப்பத்தேர்வுகள்-> மேம்பட்ட-> வார்ப்புரு செயல்பாடுகள்`) வார்ப்புரு ::

source: The first time the template runs (the first book checked) it stores the results of the database lookups in a ``global`` template variable named ``vals``. These results are used to check subsequent books without redoing the lookups.
ta: முதல் முறையாக வார்ப்புரு இயங்கும் போது (முதல் புத்தகம் சரிபார்க்கப்பட்டது) இது தரவுத்தள தேடல்களின் முடிவுகளை `` உலகளாவிய` வார்ப்புரு மாறியில் `` வால்கள்`` ஐ சேமிக்கிறது. இந்த முடிவுகள் தேடல்களை மீண்டும் செய்யாமல் அடுத்தடுத்த புத்தகங்களை சரிபார்க்க பயன்படுத்தப்படுகின்றன.

source: Use the stored template in a template search::
ta: ஒரு வார்ப்புரு தேடலில் சேமிக்கப்பட்ட வார்ப்புருவைப் பயன்படுத்தவும் ::

source: Using a stored template instead of putting the template into the search eliminates problems caused by the requirement to escape quotes in search expressions.
ta: தேடல் வெளிப்பாடுகளில் மேற்கோள்களில் இருந்து தப்பிக்க வேண்டிய தேவையால் ஏற்படும் சிக்கல்களைத் தேடுவதற்கு பதிலாக சேமிக்கப்பட்ட வார்ப்புருவைப் பயன்படுத்துவது.

source: ``book_values(column, query, sep, use_vl)`` -- returns a list of the unique values contained in the column ``column`` (a lookup name), separated by ``sep``, in the books found by searching for ``query``. If ``use_vl`` is ``0`` (zero) then virtual libraries are ignored. This function and its companion ``book_count()`` are particularly useful in template searches, supporting searches that combine information from many books such as looking for series with only one book. It cannot be used in composite columns unless the tweak ``allow_template_database_functions_in_composites`` is set to True. It can be used only in the GUI.
ta: `` book_values (நெடுவரிசை, வினவல், செப்டம்பர், USE_VL) `` - `` நெடுவரிசை`` (ஒரு தேடல் பெயர்) என்ற நெடுவரிசையில் உள்ள தனித்துவமான மதிப்புகளின் பட்டியலை வழங்குகிறது, இது `` செப்`` ஆல் பிரிக்கப்பட்டுள்ளது, இது கண்டுபிடிக்கப்பட்ட புத்தகங்களில் `` வினவல்`` தேடுவதன் மூலம். `` Use_vl`` `` 0`` (பூஜ்ஜியம்) என்றால் மெய்நிகர் நூலகங்கள் புறக்கணிக்கப்படும். இந்த செயல்பாடு மற்றும் அதன் தோழர் `` book_count () `` வார்ப்புரு தேடல்களில் குறிப்பாக பயனுள்ளதாக இருக்கும், இது ஒரே ஒரு புத்தகத்துடன் தொடர்களைத் தேடுவது போன்ற பல புத்தகங்களிலிருந்து தகவல்களை இணைக்கும் தேடல்களை ஆதரிக்கிறது. `` Allow_template_database_functions_in_composites`` என்ற மாற்றங்கள் உண்மைக்கு அமைக்கப்படாவிட்டால், கலப்பு நெடுவரிசைகளில் இதைப் பயன்படுத்த முடியாது. இதை GUI இல் மட்டுமே பயன்படுத்த முடியும்.

source: ``booksize()`` -- returns the value of the calibre 'size' field. Returns '' if there are no formats.
ja: ``booksize()`` -- calibre の 'size' フィールドの値を返します。形式がない場合は '' を返します。
nl: ``booksize()`` -- geeft de waarde van het calibre 'grootte' veld terug. Geeft '' terug als er geen formaten zijn.
ta: `` புத்தகங்கள் () `` - காலிபர் 'அளவு' புலத்தின் மதிப்பை வழங்குகிறது. வடிவங்கள் இல்லை என்றால் வருவாய் ''.

source: ``check_yes_no(field_name, is_undefined, is_false, is_true)`` -- checks if the value of the yes/no field named by the lookup name ``field_name`` is one of the values specified by the parameters, returning ``'yes'`` if a match is found otherwise returning the empty string. Set the parameter ``is_undefined``, ``is_false``, or ``is_true`` to 1 (the number) to check that condition, otherwise set it to 0. Example:
ja: ``check_yes_no(field_name, is_undefined, is_false, is_true)`` -- ルックアップ名 ``field_name`` で指定された yes/no フィールドの値がパラメータで指定された値のいずれかであるかどうかをチェックし、一致が見つかった場合は ``'yes'`` を返し、そうでなければ空の文字列を返します。パラメータ``is_undefined``, ``is_false``, または ``is_true``を1（数値）に設定してその条件を確認します。それ以外の場合は0に設定します。例:
nl: ``check_yes_no(field_name, is_undefined, is_false, is_true)`` -- controleert of de waarde van het ja/nee veld genoemd door de opzoeknaam ``field_name`` is een van de waardes gespecificeerd door de parameters, ``'yes'`` teruggevend als een overeenkomst werd gevonden anders de lege string. Stel de parameter ``is_undefined``, ``is_false``, of ``is_true`` in op 1 (het cijfer) om die voorwaarde te controleren, anders op 0. Bv.:
ta: `` check_yes_no (field_name, is_undefined, is_false, is_true) `` - தேடல் பெயரின் பெயரிடப்பட்ட ஆம்/இல்லை புலத்தின் மதிப்பு `` field_name`` `` `'' '' ஆம்'`` ஒரு போட்டி கண்டுபிடிக்கப்பட்டால், இல்லையெனில் வெற்று சரத்தை திருப்பித் தருகிறது. `` Is_undefined``, `` is_false``, அல்லது `` is_true`` ஐ அந்த நிபந்தனையைச் சரிபார்க்க 1 (எண்) என அமைக்கவும், இல்லையெனில் அதை 0 ஆக அமைக்கவும்: எடுத்துக்காட்டு: எடுத்துக்காட்டு:

source: ``check_yes_no("#bool", 1, 0, 1)`` returns ``'Yes'`` if the yes/no field ``#bool`` is either True or undefined (neither True nor False).
ta: `` check_yes_no ("#bool", 1, 0, 1) `` `` 'ஆம்'`` ஆம்/இல்லை புலம் ``#பூல்`` உண்மை அல்லது வரையறுக்கப்படவில்லை (உண்மை அல்லது பொய்).

source: More than one of ``is_undefined``, ``is_false``, or ``is_true`` can be set to 1.
ja: ``is_undefined``, ``is_false``, または ``is_true`` のうち複数を 1 に設定できます。
nl: Meer dan een van ``is_undefined``, ``is_false``, of ``is_true`` kan op 1 gezet worden.
ta: `` Is_undefined``, `` is_false``, அல்லது `` is_true`` ஆகியவற்றில் ஒன்றுக்கு மேல் 1 ஆக அமைக்கப்படலாம்.

source: ``ceiling(x)`` -- returns the smallest integer greater than or equal to ``x``. Throws an exception if ``x`` is not a number.
ja: ``ceiling(x)`` -- ``x`` 以上の最小の整数を返します。 ``x`` が数値でない場合、例外をスローします。
nl: ``ceiling(x)`` -- geeft de kleinste integer terug groter dan of gelijk aan ``x``. Gooit een uitzondering als ``x`` geen getal is.
ta: `` உச்சவரம்பு (x) `` - `` x`` ஐ விட அதிகமாகவோ அல்லது சமமாகவோ மிகச்சிறிய முழு எண்ணை வழங்குகிறது. `` X`` ஒரு எண் இல்லையென்றால் விதிவிலக்கை வீசுகிறது.
