Repository: debian-calibre/calibre
Catalog: translations/manual/*/template_lang.po
Languages: ja, nl, ta, zh_cn

source: ``strcat_max(max, string1 [, prefix2, string2]*)`` -- Returns a string formed by concatenating the arguments. The returned value is initialized to ``string1``. Strings made from ``prefix, string`` pairs are added to the end of the value as long as the resulting string length is less than ``max``. Prefixes can be empty. Returns ``string1`` even if ``string1`` is longer than ``max``. You can pass as many ``prefix, string`` pairs as you wish.
ja: ``strcat_max(max, string1 [, prefix2, string2]*)`` -- 引数を連結して形成された文字列を返します。戻り値は ``string1`` に初期化されます。結果の文字列の長さが ``max`` 未満である限り、``prefix, string`` のペアから作成された文字列が値の最後に追加されます。プレフィックスは空にすることができます。 ``string1`` が ``max`` より長くても、``string1`` を返します。必要なだけの数の ``prefix, string`` のペアを渡すことができます。
nl: ``strcat_max(max, string1 [, prefix2, string2]*)`` -- Geeft een string terug gevormd door samenvoegen van de argumenten. De teruggegeven waarde wordt aan ``string1` toegewezen. Paren van ``prefix, string`` worden aan het einde van die waarde toegevoegd, zolang de daaruit volgende string niet langer dan ``max`` is. Prefixen kunnen leeg zijn. Geeft ``string1` terug, zelfs als ``string1` langer is dan ``max``. U kunt zoveel ``prefix, string`` paren opgeven als u wil.
ta: `` strcat_max (அதிகபட்சம், சரம் 1 [, முன்னொட்டு 2, சரம் 2]*) `` - வாதங்களை ஒருங்கிணைப்பதன் மூலம் உருவாக்கப்பட்ட ஒரு சரத்தை வழங்குகிறது. திரும்பிய மதிப்பு `` சரம் 1`` க்கு துவக்கப்படுகிறது. `` முன்னொட்டு, சரம்`` ஜோடிகளிலிருந்து தயாரிக்கப்பட்ட சரங்கள் மதிப்பின் முடிவில் சேர்க்கப்படுகின்றன, இதன் விளைவாக வரும் சரம் நீளம் `` அதிகபட்சம்`` ஐ விட குறைவாக இருக்கும் வரை. முன்னொட்டுகள் காலியாக இருக்கலாம். `` String1`` `` `அதிகபட்சம்`` ஐ விட நீளமாக இருந்தாலும்` `சரம் 1`` ஐ வழங்குகிறது. நீங்கள் விரும்பும் பல `` முன்னொட்டு, சரம்` `ஜோடிகளை நீங்கள் கடந்து செல்லலாம்.

source: ``strcmp(x, y, lt, eq, gt)`` -- does a case-insensitive lexical comparison of ``x`` and ``y``. Returns ``lt`` if ``x < y``, ``eq`` if ``x == y``, otherwise ``gt``. This function can often be replaced by one of the lexical comparison operators (``==``, ``>``, ``<``, etc.)
ja: ``strcmp(x, y, lt, eq, gt)`` -- 大文字と小文字を区別しないxとyの字句比較を行います。``x < y`` ならば ``lt`` を返し、``x == y`` であれば ``eq`` を返し、それ以外の場合に ``gt`` を返します。この関数はたいていの場合、辞書比較演算子 (``==``, ``>``, ``<`` など) のひとつに置き換えることができます。
nl: ``strcmp(x, y, lt, eq, gt)`` -- doet een hoofdletterongevoelige lexicale vergelijking van ``x`` en ``y``. Geeft ``lt`` terug als ``x < y``, ``eq`` als ``x == y``, anders ``gt``. Deze functie kan dikwijls vervangen worden door een van de lexicale vergelijkingsoperatoren (``==``, ``>``, ``<``, etc.)
ta: `` strcmp (x, y, lt, eq, gt) ``-`` x`` மற்றும் `` y`` ஆகியவற்றின் வழக்கு-உணர்வற்ற லெக்சிகல் ஒப்பீடு செய்கிறது. `` Lt`` என்றால் `` x <y``, `` eq`` என்றால் `` x == y`` என்றால், இல்லையெனில் `` gt``. இந்த செயல்பாடு பெரும்பாலும் லெக்சிகல் ஒப்பீட்டு ஆபரேட்டர்களில் ஒருவரால் மாற்றப்படலாம் (`` == ``, ``> ``, `<` ``, முதலியன)

source: ``strcmpcase(x, y, lt, eq, gt)`` -- does a case-sensitive lexical comparison of ``x`` and ``y``. Returns ``lt`` if ``x < y``, ``eq`` if ``x == y``, otherwise ``gt``.
ta: `` strcmpcase (x, y, lt, eq, gt) ``-`` x`` மற்றும் `y``` ஆகியவற்றின் வழக்கு-உணர்திறன் ஒப்பீட்டு ஒப்பீடு செய்கிறது. `` Lt`` என்றால் `` x <y``, `` eq`` என்றால் `` x == y`` என்றால், இல்லையெனில் `` gt``.

source: Note: This is NOT the default behavior used by calibre, for example, in the lexical comparison operators (``==``, ``>``, ``<``, etc.). This function could cause unexpected results, preferably use ``strcmp()`` whenever possible.
ta: குறிப்பு: இது காலிபர் பயன்படுத்தும் இயல்புநிலை நடத்தை அல்ல, எடுத்துக்காட்டாக, லெக்சிகல் ஒப்பீட்டு ஆபரேட்டர்கள் (`` == ``, `>` `,` `<` `, முதலியன). இந்த செயல்பாடு எதிர்பாராத முடிவுகளை ஏற்படுத்தக்கூடும், முன்னுரிமை `` strcmp () `` முடிந்தவரை பயன்படுத்தவும்.

source: ``strlen(value)`` -- Returns the length of the string ``value``.
ja: ``strlen(value)`` -- 文字列 ``value`` の長さを返します。
nl: ``strlen(value)`` -- Geeft de lengte van de string ``value`` terug.
ta: `` strlen (மதிப்பு) `` - சரத்தின் நீளத்தை `` மதிப்பு`` தருகிறது.

source: ``substr(str, start, end)`` -- returns the ``start``'th through the ``end``'th characters of ``str``. The first character in ``str`` is the zero'th character. If ``end`` is negative, then it indicates that many characters counting from the right. If ``end`` is zero, then it indicates the last character. For example, ``substr('12345', 1, 0)`` returns ``'2345'``, and ``substr('12345', 1, -1)`` returns ``'234'``.
ja: ``substr(str, start, end)`` -- ``str`` の ``start`` 番目から ``end`` 番目まで文字列を返します。 ``str`` の先頭の文字は 0 番目の文字となります。 ``end`` が負の場合には、右から数えて ``end`` 番目までの文字となります。 ``end`` がゼロなら、最後の文字を示します。たとえば ``substr('12345', 1, 0)`` は ``'2345'`` を返し、``substr('12345', 1, -1)`` は ``'234'`` を返します。
nl: ``substr(str, start, end)`` -- geeft de ``start``'th tot de ``end``'th karakters van ``str`` terug. Het eerste teken in ``str`` is het 0-de karakter. Als ``end`` negatief is betekent dit ‘tot zoveel karakters vanaf rechts’. Als ``end`` nul is betekent dit het laatste karakter. Bijvoorbeeld: substr('12345', 1, 0) geeft '2345', en substr('12345', 1, -1) geeft '234'.
ta: `` அடிமை (str, start, end) `` - `` str` 'இன் `` எண்ட்``' என்ற எழுத்துக்கள் மூலம் `` தொடக்க`` ஐ வழங்குகிறது. `` Str`` இன் முதல் எழுத்து பூஜ்ஜியத்தின் பாத்திரம். `` முடிவு`` எதிர்மறையாக இருந்தால், பல எழுத்துக்கள் வலதுபுறத்தில் இருந்து எண்ணப்படுவதை இது குறிக்கிறது. `` முடிவு`` பூஜ்ஜியமாக இருந்தால், அது கடைசி தன்மையைக் குறிக்கிறது. எடுத்துக்காட்டாக, `` அடிமை ('12345', 1, 0) `` `` 2345'`` ஐத் தருகிறது, மற்றும் `` 12345 ', 1, -1) `` `234' 234'``` திரும்புகிறது .

source: ``subtract(x, y)`` -- returns ``x - y``. Throws an exception if either ``x`` or ``y`` are not numbers. This function can usually be replaced by the ``-`` operator.
ja: ``subtract(x, y)`` -- ``x - y`` を返します。 ``x`` と ``y`` のいずれかが数値でない場合、例外をスローします。この関数は通常、 ``-`` 演算子で置き換えることができます。
nl: ``subtract(x, y)`` -- geeft ``x - y`` terug. Gooit een uitzondering als ofwel ``x`` ofwel ``y`` geen getallen zijn. Deze functie kan gewoonlijk vervangen worden door de ``-`` operator.
ta: `` கழிக்கவும் (x, y) `` - `` x - y`` ஐ வழங்குகிறது. `` X`` அல்லது `` y`` எண்கள் இல்லையென்றால் விதிவிலக்கை வீசுகிறது. இந்த செயல்பாட்டை வழக்கமாக `` -`` ஆபரேட்டரால் மாற்றலாம்.

source: ``switch_if([test_expression, value_expression,]+ else_expression)`` -- for each ``test_expression, value_expression`` pair, checks if ``test_expression`` is True (non-empty) and if so returns the result of ``value_expression``. If no ``test_expression`` is True then the result of ``else_expression` is returned. You can have as many ``test_expression, value_expression`` pairs as you want.
ta: `` Switch_if ([test_expression, value_expression,]+ else_expression) ``-ஒவ்வொரு `` டெஸ்ட்_எக்ஸ்பிரஷன்` ஜோடிக்கும், `` டெஸ்ட்_எக்ஸ்பிரஷன்`` உண்மையாக இருந்தால் (காலியாக இல்லாதது), எனவே `` டெஸ்ட்_எக்ஸ்பிரஷன்` `value_expression``. `` Test_expression`` உண்மை என்றால், `` else_expression` இன் முடிவு திரும்பப் பெறப்படும். நீங்கள் விரும்பும் அளவுக்கு `` டெஸ்ட்_எக்ஸ்பிரஷன், மதிப்பு_எக்ஸ்பிரஷன்` ஜோடிகளைக் கொண்டிருக்கலாம்.

source: ``today()`` -- return a date+time string for today (now). This value is designed for use in `format_date` or `days_between`, but can be manipulated like any other string. The date is in `ISO <https://en.wikipedia.org/wiki/ISO_8601>`_ date/time format.
ja: ``today()`` -- 今日 (現在) の日付と時刻の文字列を返します。この値は `format_date` または `days_between` で使用するために設計されていますが、他の文字列と同じように取り扱うことができます。日付は `ISO <https://en.wikipedia.org/wiki/ISO_8601>`_ による日付/時刻の書式です。
nl: ``today()`` -- geeft een datum+tijd string voor vandaag (nu) terug. Deze waarde is gemaakt voor gebruik in `format_date` of `days_between` maar kan aangepast worden als elke andere string. De datum is in `ISO <https://en.wikipedia.org/wiki/ISO_8601>`_ datum/tijd formaat.
ta: `` இன்று () `` - இன்றைய (இப்போது) தேதி+நேர சரத்தை திருப்பித் தரவும். இந்த மதிப்பு `format_date` அல்லது` Days_between` இல் பயன்படுத்த வடிவமைக்கப்பட்டுள்ளது, ஆனால் வேறு எந்த சரத்தையும் போல கையாளலாம். தேதி `ஐசோ <https://en.wikipedia.org/wiki/iso_8601>` _ தேதி/நேர வடிவத்தில் உள்ளது.

source: ``template(x)`` -- evaluates ``x`` as a template. The evaluation is done in its own context, meaning that variables are not shared between the caller and the template evaluation.
ja: ``template(x)`` -- ``x`` をテンプレートとして評価します。評価は独自のコンテキストで実行されます。つまり、変数は呼び出し元とテンプレート評価の間で共有されません。
nl: ``template(x)`` -- evalueert ``x`` als een sjabloon. De evaluatie wordt in z'n eigen context gedaan, variabelen worden dus niet gedeeld door de caller en de sjabloon evaluatie.
ta: `` வார்ப்புரு (x) `` - `` x`` ஒரு வார்ப்புருவாக மதிப்பிடுகிறது. மதிப்பீடு அதன் சொந்த சூழலில் செய்யப்படுகிறது, அதாவது அழைப்பாளருக்கும் வார்ப்புரு மதிப்பீட்டிற்கும் இடையில் மாறிகள் பகிரப்படவில்லை.

source: ``to_hex(val)`` -- returns the string ``val`` encoded in hex. This is useful when constructing calibre URLs.
ta: `` to_hex (val) `` - ஹெக்ஸில் குறியிடப்பட்ட சரம் `` வால்`` ஐ வழங்குகிறது. காலிபர் URL களை உருவாக்கும்போது இது பயனுள்ளதாக இருக்கும்.

source: ``urls_from_identifiers(identifiers, sort_results)`` -- given a comma-separated list of ``identifiers``, where an `identifier` is a colon-separated pair of values (``id_name:id_value``), returns a comma-separated list of HTML URLs generated from the identifiers. The list not sorted if sort_results is ``0`` (character or number), otherwise it is sorted alphabetically by the identifier name. The URLs are generated in the same way as the built-in identifiers column when shown in :guilabel:`Book details`.
ja: ``urls_from_identifiers(identifiers, sort_results)`` -- カンマで区切られた ``identifiers`` のリストを指定すると、その ID から生成されたHTML URLをカンマで区切ったリストで返します。`identifier` はコロンで区切られた値のペア(``id_name:id_value``) です。sort_results が ``0`` (文字または数値) のとき、リストは並べ替えられません。それ以外の場合は、ID 名のアルファベット順に並べ替えられます。 URLは、:guilabel:`本の詳細` に表示されるビルトイン ID 列と同じ方法で生成されます。
ta: `` urls_from_identifiers (அடையாளங்காட்டிகள், sort_results) ``-`` அடையாளங்காட்டிகள்`` இன் கமாவால் பிரிக்கப்பட்ட பட்டியலைக் கொடுத்தால், ஒரு `அடையாளங்காட்டி` என்பது பெருங்குடலால் பிரிக்கப்பட்ட ஜோடி மதிப்புகள் (` `ஐடி_நேம்: ஐடி_வலூ``), ஒரு வருமானம் அடையாளங்காட்டிகளிடமிருந்து உருவாக்கப்பட்ட HTML URL களின் கமாவால் பிரிக்கப்பட்ட பட்டியல். Sort_Results `` 0`` (எழுத்து அல்லது எண்) என்றால் பட்டியல் வரிசைப்படுத்தப்படாது, இல்லையெனில் இது அடையாளங்காட்டி பெயரால் அகர வரிசைப்படி வரிசைப்படுத்தப்படுகிறது. URL கள் காட்டப்படும் போது உள்ளமைக்கப்பட்ட அடையாளங்காட்டிகள் நெடுவரிசையைப் போலவே உருவாக்கப்படுகின்றன: கிலாபெல்: `புத்தக விவரங்கள்`.

source: More complex programs in template expressions - Template Program Mode
ja: より複雑なテンプレート表現のプログラム - テンプレートプログラムモード
nl: Meer complexe programma's in sjabloonexpressies - Sjabloon Programma Modus
ta: வார்ப்புரு வெளிப்பாடுகளில் மிகவும் சிக்கலான நிரல்கள் - வார்ப்புரு நிரல் பயன்முறை
zh_cn: 模板表达式中的复杂程序 —— 模板程序模式

source: `Template Program Mode` (`TPM`) is a blend of :ref:`General Program Mode <general_mode>` and :ref:`Single Function Mode <single_mode>`. `TPM` differs from Single Function Mode in that it permits writing template expressions that refer to other metadata fields, use nested functions, modify variables, and do arithmetic. It differs from `General Program Mode` in that the template is contained between ``{`` and ``}`` characters and doesn't begin with the word ``program:``. The program portion of the template is a General Program Mode expression list.
ja: `テンプレートプログラムモード` (`TPM`) は、 :ref:`一般プログラムモード <general_mode>` and :ref:`単関数モード <single_mode>` を組み合わせたものです。 `TPM` は、他の書誌フィールドを参照し、ネストされた関数を使用し、変数を変更し、算術演算を実行するテンプレート式を記述できるという点で、単関数モードとは異なります。このテンプレートが ``{`` と ``}`` 文字の間に置かれ、``program:`` という部分で始まらないという点で、`一般プログラムモード` とは異なります。テンプレートのプログラム部分は、一般プログラムモードの式リストです。
nl: `Sjabloon Programma Modus` (`SPM`) is een mengeling van :ref:`Algemene Programma Modus <general_mode>` en :ref:`Eén Functie Modus <single_mode>`. `TPM` verschilt van Eén Functie Modus in dat het toelaat sjabloon expressies te schrijven die verwijzen naar andere metadata velden, geneste functies gebruikt, variabelen wijzigt, en rekenkunde doet. Het verschilt van `Algemene Programma Modus` in dat de sjabloon gevat wordt tussen ``{`` en ``}`` karakters en niet begint met het woord ``program:``. Het programma deel van de sjabloon is een Algemene Programma Modus expressie lijst.
ta: `வார்ப்புரு நிரல் பயன்முறை` (` TPM`) என்பது ஒரு கலவையாகும்: குறிப்பு: `பொது நிரல் பயன்முறை <பொது_மோட்>` மற்றும்: குறிப்பு: `ஒற்றை செயல்பாட்டு பயன்முறை <ஒற்றை_மோட்>`. `TPM` ஒற்றை செயல்பாட்டு பயன்முறையிலிருந்து வேறுபடுகிறது, இது பிற மெட்டாடேட்டா புலங்களைக் குறிக்கும் வார்ப்புரு வெளிப்பாடுகளை எழுத அனுமதிக்கிறது, உள்ளமைக்கப்பட்ட செயல்பாடுகளைப் பயன்படுத்துகிறது, மாறிகளை மாற்றியமைத்தல் மற்றும் எண்கணிதத்தை செய்கிறது. இது `பொது நிரல் பயன்முறையிலிருந்து` வேறுபடுகிறது, இதில் வார்ப்புரு` `{` `மற்றும்` `}` `` `` நிரல்: `` என்ற வார்த்தையுடன் தொடங்குவதில்லை. வார்ப்புருவின் நிரல் பகுதி ஒரு பொதுவான நிரல் பயன்முறை வெளிப்பாடு பட்டியல்.
zh_cn: “模板程序模式”(“TPM”) 是“通用程序模式 <general_mode>”和“单功能模式 <single_mode>”的混合。 “TPM”与单函数模式的不同之处在于它允许编写引用其他元数据字段的模板表达式、使用嵌套函数、修改变量和进行算术。 它与“通用程序模式”的不同之处在于，模板包含在“{”和“}”字符之间，并且不以单词“program:”开头。 模板的程序部分是通用程序模式表达式列表。

source: Example: assume you want a template to show the series for a book if it has one, otherwise show the value of a custom field #genre. You cannot do this in the :ref:`Single Function Mode <single_mode>` because you cannot make reference to another metadata field within a template expression. In `TPM` you can, as the following expression demonstrates::
ja: 例: テンプレートで、ある本がシリーズものならシリーズを表示し、そうでなければカスタムフィールド #genre の値を表示したいと仮定します。:ref:`単関数モード <single_mode>` ではテンプレートの式の中からは別の書誌フィールドを参照できないため、この処理は実現できません。 `TPM` でなら可能です。次の式のようにします::
ta: எடுத்துக்காட்டு: ஒரு புத்தகத்திற்கான தொடரை ஒன்று இருந்தால் ஒரு வார்ப்புரு காட்ட வேண்டும் என்று வைத்துக் கொள்ளுங்கள், இல்லையெனில் தனிப்பயன் புலத்தின் மதிப்பைக் காட்டுங்கள். இதை நீங்கள் செய்ய முடியாது: ref: `ஒற்றை செயல்பாட்டு பயன்முறை <ஒற்றை_மோட்>` ஏனெனில் ஒரு வார்ப்புரு வெளிப்பாட்டிற்குள் மற்றொரு மெட்டாடேட்டா புலத்தைக் குறிப்பிட முடியாது. `TPM` இல், பின்வரும் வெளிப்பாடு நிரூபிக்கிறபடி ::
zh_cn: 示例：假设您希望模板显示一本书的系列，如果有，否则显示自定义字段 #genre 的值。 您无法在“单函数模式 <single_mode>”中执行此操作，因为您无法引用模板表达式中的另一个元数据字段。 在“TPM”中，您可以，如以下表达式所示：

source: The example shows several things:
ja: 例からはいくつかのことがわかります:
nl: Het voorbeeld toont meerdere dingen:
ta: எடுத்துக்காட்டு பல விஷயங்களைக் காட்டுகிறது:
zh_cn: 该示例展示了以下几点：

source: `TPM` is used if the expression begins with ``:'`` and ends with ``'}``. Anything else is assumed to be in :ref:`Single Function Mode <single_mode>`.
ta: வெளிப்பாடு ``: '`` உடன் தொடங்கி ``'} `` உடன் முடிவடைந்தால் `டிபிஎம்` பயன்படுத்தப்படுகிறது. வேறு எதுவும் இருக்க வேண்டும் என்று கருதப்படுகிறது: குறிப்பு: `ஒற்றை செயல்பாட்டு பயன்முறை <ஒற்றை_மோட்>`.
zh_cn: 如果表达式以 :' 开头并以 '} 结尾，则使用 TPM（模板程序模式）。除此之外的任何内容都将被视为处于 :ref:`Single Function Mode<single_mode>`下

source: the variable ``$`` stands for the field named in the template: the expression is operating upon, ``#series`` in this case.
ja: 変数 ``$`` は、テンプレートで指定されたフィールドを表します。式は操作対象で、この場合は ``#series`` です。
nl: de variabele ``$`` staat voor het veld benoemd in de sjabloon: de expressie werkt op, ``#series`` in dit geval.
ta: மாறி `` $ `` என்பது வார்ப்புருவில் பெயரிடப்பட்ட புலத்தைக் குறிக்கிறது: வெளிப்பாடு இந்த விஷயத்தில் ``#தொடர்`` இயங்குகிறது.

source: functions must be given all their arguments. There is no default value. For example, the standard built-in functions must be given an additional initial parameter indicating the source field.
ja: 関数にはすべての引数を指定する必要があります。デフォルト値はありません。たとえば標準のビルトイン関数には、ソースフィールドを示す追加の初期パラメータを指定する必要があります。
nl: functies moeten al hun argumenten krijgen. Er is geen standaard waarde. Bv. de standaard ingebouwde functies moeten een extra initiële parameter krijgen die het bronveld aangeeft.
ta: செயல்பாடுகளுக்கு அவற்றின் அனைத்து வாதங்களும் வழங்கப்பட வேண்டும். இயல்புநிலை மதிப்பு இல்லை. எடுத்துக்காட்டாக, நிலையான உள்ளமைக்கப்பட்ட செயல்பாடுகளுக்கு மூல புலத்தைக் குறிக்கும் கூடுதல் ஆரம்ப அளவுரு வழங்கப்பட வேண்டும்.

source: white space is ignored and can be used anywhere within the expression.
ja: 空白は無視され、式の中のどこでも使用できます。
nl: spaties worden genegeerd en kunnen eender waar in de expressie gebruikt worden
ta: வெள்ளை இடம் புறக்கணிக்கப்படுகிறது மற்றும் வெளிப்பாட்டிற்குள் எங்கும் பயன்படுத்தலாம்.
zh_cn: 空格将被忽略，并可以用于表达式中的任何位置。

source: constant strings are enclosed in matching quotes, either ``'`` or ``"``.
ja: 定数文字列は対になる引用符、``'`` または ``"`` のいずれかで囲まれます。
nl: constante strings zijn omringd door overeenkomende aanhalingstekens, ofwel ``'`` ofwel ``"``.
ta: பொருந்தக்கூடிய மேற்கோள்களில் நிலையான சரங்கள் இணைக்கப்பட்டுள்ளன, `` '`` அல்லது `` "` `.
zh_cn: 常量字符串需封闭在成对的引号中，使用单引号 ' 或双引号 " 均可。

source: All the functions listed under `Single Function Mode` and `General Program Mode` can be used in `TPM`.
ja: `単関数モード` および `一般プログラムモード` にリストされている関数はすべて `TPM` で使用できます。
nl: Alle functies opgelijst onder `Eén Functie Modus` en `Algemene Programma Modus` kunnen gebruikt worden in `TPM`.
ta: `ஒற்றை செயல்பாட்டு பயன்முறை` மற்றும்` பொது நிரல் பயன்முறை` ஆகியவற்றின் கீழ் பட்டியலிடப்பட்டுள்ள அனைத்து செயல்பாடுகளையும் `TPM` இல் பயன்படுத்தலாம்.

source: In `TPM`, using ``{`` and ``}`` characters in string literals can lead to errors or unexpected results because they confuse the template processor. It tries to treat them as template expression boundaries, not characters. In some but not all cases you can replace a ``{`` with ``[[`` and a ``}`` with `]]`. Generally, if your program contains ``{`` and ``}`` characters then you should use `General Program Mode`.
ja: `TPM` では、文字列リテラルで ``{`` および ``}`` 文字を使用するとテンプレートプロセッサが混乱するため、エラーや予期しない結果が発生する可能性があります。それらを文字ではなく、テンプレート式の境界として処理しようとするのです。必ずしもすべてのケースでうまく行くわけではありませんが、``{`` を ``[[`` に、そして ``}`` を `]]` に置き換えることができます。一般に、プログラムに ``{`` および ``}`` 文字が含まれている場合は、`一般プログラムモード` を使用すべきです。
nl: In `TPM`, met ``{`` en ``}`` karakters in string literals kan leiden tot fouten of onverwachte resultaten omdat ze de sjabloonprocessor in verwarring brengen. Het probeert ze te behandelen als sjabloon expressie grenzen, niet karakters. In sommige maar niet alle gevallen kan u een ``{`` vervangen door ``[[`` en een ``}`` door `]]`. In het algemeen, als uw programma ``{`` en ``}`` karakters bevat, moet u `Algemene Programma Modus` gebruiken.
ta: `TPM` இல்,` `{` `மற்றும்` `}` `ஆகியவற்றைப் பயன்படுத்தி சரம் எழுத்தாளர்களில் எழுத்துக்கள் பிழைகள் அல்லது எதிர்பாராத முடிவுகளுக்கு வழிவகுக்கும், ஏனெனில் அவை வார்ப்புரு செயலியைக் குழப்புகின்றன. இது அவற்றை வார்ப்புரு வெளிப்பாடு எல்லைகளாக கருத முயற்சிக்கிறது, எழுத்துக்கள் அல்ல. சில ஆனால் எல்லா நிகழ்வுகளிலும் நீங்கள் ஒரு `` `` `[` `மற்றும் ஒரு` `}` ``] `உடன் மாற்றலாம். பொதுவாக, உங்கள் நிரலில் `` {`` மற்றும் ``} `` எழுத்துக்கள் இருந்தால், நீங்கள் `பொது நிரல் பயன்முறையை` பயன்படுத்த வேண்டும்.

source: As with `General Program Mode`, for functions documented under :ref:`Single Function Mode <single_mode>` you must supply the value the function is to act upon as the first parameter in addition to the documented parameters. In `TPM` you can use ``$`` to access the value specified by the ``lookup name`` for the template expression.
ja: `一般プログラムモード` と同様に、:ref:`単関数モード <single_mode>` で書かれた関数の場合、書かれているパラメータに加えて、関数が最初のパラメータとして機能する値を指定する必要があります。 `TPM` では、 ``$`` を使用して、テンプレート式の ``ルックアップ名`` で指定された値にアクセスできます。
ta: `பொது நிரல் பயன்முறையைப் போலவே, ஆவணப்படுத்தப்பட்ட செயல்பாடுகளுக்கு: ref:` ஒற்றை செயல்பாட்டு பயன்முறை <ஒற்றை_மோட்> `ஆவணப்படுத்தப்பட்ட அளவுருக்களுக்கு கூடுதலாக முதல் அளவுருவாக செயல்படும் மதிப்பை நீங்கள் வழங்க வேண்டும். `TPM` இல், வார்ப்புரு வெளிப்பாட்டிற்காக` `தேடல் பெயர்`` ஆல் குறிப்பிடப்பட்ட மதிப்பை அணுக` `$` `பயன்படுத்தலாம்.

source: Python Template Mode
ta: பைதான் வார்ப்புரு பயன்முறை
zh_cn: Python 模板模式

source: Python Template Mode (PTM) lets you write templates using native python and the `calibre API <https://manual.calibre-ebook.com/develop.html#api-documentation-for-various-parts-of-calibre>`_. The database API will be of most use; further discussion is beyond the scope of this manual. PTM templates are faster and can do more complicated operations but you must know how to write code in python using the calibre API.
ta: பைதான் வார்ப்புரு பயன்முறை (பி.டி.எம்) சொந்த பைதான் மற்றும் `காலிபர் ஏபிஐ <https://manual.calibre-ebook.com/develop.html#api- ஆவணப்படுத்தல்-ஃபார்-வெரிட்டஸ்-பார்ட்ஸ்-கலிபிரே>` _. தரவுத்தள ஏபிஐ மிகவும் பயன்பாட்டில் இருக்கும்; மேலும் விவாதம் இந்த கையேட்டின் எல்லைக்கு அப்பாற்பட்டது. பி.டி.எம் வார்ப்புருக்கள் வேகமானவை, மேலும் சிக்கலான செயல்பாடுகளைச் செய்ய முடியும், ஆனால் காலிபர் ஏபிஐ பயன்படுத்தி பைத்தானில் குறியீட்டை எவ்வாறு எழுதுவது என்பது உங்களுக்குத் தெரிந்திருக்க வேண்டும்.

source: A PTM template begins with:
ta: ஒரு பி.டி.எம் வார்ப்புரு தொடங்குகிறது:
zh_cn: PTM 模板以以下内容开头：

source: You can add the above text to your template using the context menu, usually accessed with a right click. The comments are not significant and can be removed. You must use python indenting.
ta: சூழல் மெனுவைப் பயன்படுத்தி மேலே உள்ள உரையை உங்கள் வார்ப்புருவில் சேர்க்கலாம், வழக்கமாக வலது கிளிக் மூலம் அணுகலாம். கருத்துகள் குறிப்பிடத்தக்கவை அல்ல மற்றும் அகற்றப்படலாம். நீங்கள் பைத்தானை உள்தள்ளலைப் பயன்படுத்த வேண்டும்.
zh_cn: 你可以通过右键点击调出的上下文菜单（右键菜单）将上述文本添加到模板中。其中的注释并不重要，可以删除。但你必须使用 Python 缩进规范。

source: The context object supports ``str(context)`` that returns a string of the context's contents, and ``context.attributes`` that returns a list of the attribute names in the context.
ta: சூழல் பொருள் `` str (சூழல்) `` ஆகியவற்றை ஆதரிக்கிறது, இது சூழலின் உள்ளடக்கங்களின் ஒரு சரத்தை வழங்குகிறது, மற்றும் `` சூழல்.
zh_cn: context 对象支持使用 str(context) 来返回其包含内容的字符串，同时也支持使用 context.attributes 来返回该上下文中所有属性名称的列表。

source: The ``context.funcs`` attribute allows calling Built-in and User template functions, and Stored GPM/Python templates, so that you can execute them directly in your code. The functions are retrieved using their names. If the name conflicts with a Python keyword, add an underscore to the end of the name. Examples:
ta: `` Context.funcs`` பண்புக்கூறு உள்ளமைக்கப்பட்ட மற்றும் பயனர் வார்ப்புரு செயல்பாடுகளை அழைக்க அனுமதிக்கிறது, மேலும் ஜிபிஎம்/பைதான் வார்ப்புருக்கள் சேமித்து வைக்கப்பட்டுள்ளது, இதன் மூலம் அவற்றை உங்கள் குறியீட்டில் நேரடியாக இயக்க முடியும். செயல்பாடுகள் அவற்றின் பெயர்களைப் பயன்படுத்தி மீட்டெடுக்கப்படுகின்றன. பெயர் பைதான் முக்கிய சொல்லுடன் முரண்பட்டால், பெயரின் முடிவில் அடிக்கோடிட்டு சேர்க்கவும். எடுத்துக்காட்டுகள்:
zh_cn: ``context.funcs`` 属性允许调用内置和用户模板函数以及存储的 GPM/Python 模板，以便您可以直接在代码中执行它们。 使用函数的名称来检索函数。 如果名称与 Python 关键字冲突，请在名称末尾添加下划线。 例子：

source: Here is an example of a PTM template that produces a list of all the authors for a series. The list is stored in a `Column built from other columns, behaves like tags`. It shows in :guilabel:`Book details` and has the :guilabel:`on separate lines` checked (in :guilabel:`Preferences->Look & feel->Book details`). That option requires the list to be comma-separated. To satisfy that requirement the template converts commas in author names to semicolons then builds a comma-separated list of authors. The authors are then sorted, which is why the template uses author_sort.
ta: ஒரு தொடருக்கான அனைத்து ஆசிரியர்களின் பட்டியலையும் உருவாக்கும் PTM வார்ப்புருவின் எடுத்துக்காட்டு இங்கே. பட்டியல் மற்ற நெடுவரிசைகளிலிருந்து கட்டப்பட்ட `நெடுவரிசையில் சேமிக்கப்படுகிறது, குறிச்சொற்கள் போன்ற செயல்படுகிறது. இது காட்டுகிறது: கிலாபெல்: `புத்தக விவரங்கள்` மற்றும் தி: கிலாபெல்:` தனி வரிகளில்` சரிபார்க்கப்பட்டது (இல்: கிலாபெல்: `விருப்பத்தேர்வுகள்-> தோற்றம் & உணர்வு-> புத்தக விவரங்கள்`). அந்த விருப்பத்திற்கு பட்டியல் கமாவால் பிரிக்கப்பட வேண்டும். அந்த தேவையை பூர்த்தி செய்ய வார்ப்புரு கம்மாக்களை ஆசிரியர் பெயர்களில் அரைக்காற்புள்ளிகளாக மாற்றுகிறது, பின்னர் கமாவால் பிரிக்கப்பட்ட ஆசிரியர்களின் பட்டியலை உருவாக்குகிறது. பின்னர் ஆசிரியர்கள் வரிசைப்படுத்தப்படுகிறார்கள், அதனால்தான் வார்ப்புரு எழுத்தாளர்_சார்ட்டைப் பயன்படுத்துகிறது.
zh_cn: 以下是 PTM 模板的示例，该模板生成一个系列的所有作者的列表。 该列表存储在“从其他列构建的列，行为类似于标签”中。 它显示在“书籍详细信息”中，并选中“在单独的行上”（在“首选项->外观->书籍详细信息”中）。 该选项要求列表以逗号分隔。 为了满足该要求，模板将作者姓名中的逗号转换为分号，然后构建以逗号分隔的作者列表。 然后对作者进行排序，这就是模板使用author_sort的原因。
