Repository: debian-calibre/calibre
Catalog: translations/manual/*/template_lang.po
Languages: ja, nl, ta, zh_cn

source: The calibre template language
ja: calibre テンプレート言語
nl: De calibre sjabloontaal
ta: காலிபர் வார்ப்புரு மொழி
zh_cn: calibre 模板语言

source: The calibre template language is a calibre-specific language used throughout calibre for tasks such as specifying file paths, formatting values, and computing the value for user-specified columns. Examples:
ja: calibre テンプレート言語は、ファイルパスの指定、値の整形、ユーザ指定の列の値の計算などのタスクのために calibre 全体で使用される calibre 固有の言語です。例を挙げると:
nl: De calibre sjabloontaal is een calibre-eigen taal gebruikt doorheen calibre voor taken zoals specificeren van bestandspaden, opmaken van waarden en berekenen van de waarde voor gebruiker-gespecificeerde kolommen. Voorbeelden:
ta: காலிபர் வார்ப்புரு மொழி என்பது கோப்பு பாதைகளைக் குறிப்பிடுவது, மதிப்புகளை வடிவமைத்தல் மற்றும் பயனர் குறிப்பிட்ட நெடுவரிசைகளுக்கான மதிப்பைக் கணக்கிடுதல் போன்ற பணிகளுக்கு காலிபர் முழுவதும் பயன்படுத்தப்படும் ஒரு காலிபர்-குறிப்பிட்ட மொழியாகும். எடுத்துக்காட்டுகள்:
zh_cn: calibre模板语言是calibre特定的语言，用于在calibre中执行任务，例如指定文件路径、格式化值和计算用户指定列的值。示例:

source: Specify the folder structure and file names when saving files from the calibre library to the disk or e-book reader.
ja: calibre ライブラリからディスクまたは電子書籍リーダにファイルを保存するときに、フォルダ構造とファイル名を指定します。
nl: Specificeer de mappenstructuur en bestandsnamen bij opslaan van bestanden van de calibre bibliotheek naar de schijf of e-boekreader.
ta: காலிபர் நூலகத்திலிருந்து வட்டு அல்லது மின் புத்தக வாசகருக்கு கோப்புகளைச் சேமிக்கும்போது கோப்புறை அமைப்பு மற்றும் கோப்பு பெயர்களைக் குறிப்பிடவும்.
zh_cn: 在将文件从calibre书库保存到磁盘或电子书阅读器时，指定文件夹结构和文件名。

source: Define rules for adding icons and colors to the calibre book list.
ja: calibre の本のリストにアイコンと色を追加するためのルールを定義します。
nl: Definieer regels voor toevoegen van iconen en kleuren aan calibre's boekenlijst.
ta: காலிபர் புத்தக பட்டியலில் ஐகான்கள் மற்றும் வண்ணங்களைச் சேர்ப்பதற்கான விதிகளை வரையறுக்கவும்.
zh_cn: 定义规则以将图标和颜色添加到calibre图书列表中。

source: Define `virtual columns` that contain data from other columns.
ja: 他の列からのデータを含む `仮想列` を定義します。
nl: Definieer `virtuele kolommen` die data bevatten van andere kolommen.
ta: மற்ற நெடுவரிசைகளிலிருந்து தரவைக் கொண்ட `மெய்நிகர் நெடுவரிசைகளை` வரையறுக்கவும்.
zh_cn: 定义包含来自其他列的数据的“虚拟列”。

source: Advanced library searching.
ja: 高度なライブラリ検索。
nl: Geavanceerd bibliotheek zoeken.
ta: மேம்பட்ட நூலக தேடல்.
zh_cn: 高级书库搜索。

source: Advanced metadata search and replace.
ja: 高度なメタデータの検索と置換。
nl: Geavanceerd metadata zoeken en vervangen.
ta: மேம்பட்ட மெட்டாடேட்டா தேடல் மற்றும் மாற்றவும்.
zh_cn: 高级元数据搜索和替换。

source: The language is built around the notion of a `template`, which specifies which book metadata to use, computations on that metadata, and how it is to be formatted.
ja: この言語は、使用する本の書誌、その書誌の計算、およびそのフォーマット方法を指定する `テンプレート` の概念に基づいて構築されています。
nl: De taal is gebouwd rond het concept van een `sjabloon` die specificeert welke metadata te gebruiken, berekeningen op die metadata en hoe het opgemaakt moet worden.
ta: ஒரு `வார்ப்புரு` என்ற கருத்தைச் சுற்றி மொழி கட்டப்பட்டுள்ளது, இது எந்த புத்தக மெட்டாடேட்டாவைப் பயன்படுத்த வேண்டும், அந்த மெட்டாடேட்டாவில் கணக்கீடுகள் மற்றும் அது எவ்வாறு வடிவமைக்கப்பட வேண்டும் என்பதைக் குறிப்பிடுகிறது.
zh_cn: 该语言是围绕“模板”的概念构建的，它指定要使用的图书元数据、元数据的计算以及如何格式化。

source: Basic templates
ja: 基本テンプレート
nl: Basis sjablonen
ta: அடிப்படை வார்ப்புருக்கள்
zh_cn: 基本模板

source: A basic template consists one or more ``template expressions``. A ``template expression`` consists of text and names in curly brackets (``{}``) that is replaced by the corresponding metadata from the book being processed. For example, the default template in calibre used for saving books to device has 4 ``template expressions``::
ja: 基本テンプレートは、ひとつ以上の ``テンプレート表現`` で構成されます。``テンプレート表現`` は、中括弧 (``{}``) 内のテキストと名前で構成され、処理中の本の対応する書誌に置き換えられます。たとえば、本をデバイスに保存するために使用される calibre のデフォルトのテンプレートには、次の 4 つのテンプレート式があります。
nl: Een basissjabloon bestaat uit één of meer ``template expressions``. Een ``template expression`` bestaat uit tekst en namen tussen accolades (``{}``) die wordt vervangen door de overeenkomende metadata van het boek in verwerking. Bv. de standaard sjabloon in calibre gebruikt voor boeken naar toestel opslaan heeft vier ``template expressions``::
ta: ஒரு அடிப்படை வார்ப்புரு ஒன்று அல்லது அதற்கு மேற்பட்ட `` வார்ப்புரு வெளிப்பாடுகள்`` கொண்டுள்ளது. ஒரு `` வார்ப்புரு வெளிப்பாடு`` சுருள் அடைப்புக்குறிக்குள் உரை மற்றும் பெயர்களைக் கொண்டுள்ளது (`` {} ``) இது செயலாக்கப்படும் புத்தகத்திலிருந்து தொடர்புடைய மெட்டாடேட்டாவால் மாற்றப்படுகிறது. எடுத்துக்காட்டாக, சாதனத்தில் புத்தகங்களைச் சேமிக்கப் பயன்படுத்தப்படும் காலிபரில் உள்ள இயல்புநிலை வார்ப்புருவில் 4 `` வார்ப்புரு வெளிப்பாடுகள்` ::
zh_cn: 基本模板由一个或多个“模板表达式”组成。 “模板表达式”由大括号 (“{}”) 中的文本和名称组成，并由正在处理的书籍中的相应元数据替换。 例如，calibre 中用于将书籍保存到设备的默认模板有 4 个“模板表达式”：

source: For the book "The Foundation" by "Isaac Asimov" the will become::
ja: "Isaac Asimov" の本 "The Foundation" の場合、次のようになります::
nl: Voor het boek "The Foundation" door "Isaac Asimov" wordt dit::
ta: "ஐசக் அசிமோவ்" எழுதிய "அறக்கட்டளை" புத்தகத்திற்கு விருப்பம் ::

source: The slashes are not ``template expressions`` because they are in between in ``{}``. Such text is left where it appears. For example, if the template is::
ja: スラッシュは ``{}`` の間にあるため、``テンプレート表現`` ではありません。そのようなテキストは、それが表示される場所に残されます。たとえば、テンプレートが次の場合::
nl: De schuine strepen zijn geen ``template expressions`` omdat ze tussen ``{}`` staan. Zulke tekst blijft waar ie is. Bv., als de sjabloon is::
ta: ஸ்லாஷ்கள் `` வார்ப்புரு வெளிப்பாடுகள்` அல்ல, ஏனென்றால் அவை `` {} `` `க்கு இடையில் உள்ளன. அத்தகைய உரை தோன்றும் இடத்தில் விடப்படுகிறது. உதாரணமாக, வார்ப்புரு இருந்தால் ::

source: then for "The Foundation" the template produces::
ja: "The Foundation" にテンプレートは次を生成します::
nl: dan voor "The Foundation" produceert de sjabloon::
ta: "அறக்கட்டளை" க்கு வார்ப்புரு உருவாக்குகிறது ::
zh_cn: 那么对于“The Foundation”，模板会生成：

source: A ``template expression`` can access all the metadata available in calibre, including custom columns (columns you create yourself), by using a column's ``lookup name``. To find the lookup name for a `column` (sometimes called `fields`), hover your mouse over the column header in calibre's book list. Lookup names for custom columns always begin with ``#``. For series type columns there is an additional field named ``#lookup name_index`` that is the series index for that book in the series. For example, if you have a custom series column named ``#myseries``, there will also be a column named ``#myseries_index``. The standard series column's index is named ``series_index``.
ja: ``テンプレート表現`` は、列の ``ルックアップ名`` を使用して、カスタム列 (自分で作成した列) を含む、calibre で使用可能なすべての書誌にアクセスできます。`列` (`フィールド` と呼ばれることもあります) のルックアップ名を見つけるには、マウスを calibre の本リストの列ヘッダに合わせます。カスタム列のルックアップ名は常に ``#`` で始まります。シリーズタイプの列の場合、シリーズ内のその本のシリーズインデックスである ``#lookup name_index`` という名前の追加フィールドがあります。たとえば、``#myseries`` という名前のカスタムシリーズ列がある場合、``#myseries_index`` という名前の列もあります。標準のシリーズ列のインデックスの名前は ``series_index`` です。
nl: Een ``template expression`` heeft toegang tot alle metadata in calibre, inbegrepen aangepaste kolommen (kolommen die u zelf creëerde), door de kolom z'n ``lookup name`` te gebruiken. Om een `kolom` z'n lookup name te vinden (soms `velden` genaamd), zweef met uw muis over de kolom header in calibre's boekenlijst. Lookup names voor aangepaste kolommen beginnen altijd met ``#``. Voor reeks type kolommen is er een bijkomend veld genaamd ``#lookup name_index`` wat de serie index is voor dat boek in de serie. Bv., als u een aangepaste serie hebt genaamd ``#myseries`` dan zal er ook een kolom zijn genaamd ``#myseries_index``. De standaard serie kolom index heet ``series_index``.
ta: ஒரு நெடுவரிசையின் `` தேடல் பெயர்`` ஐப் பயன்படுத்தி தனிப்பயன் நெடுவரிசைகள் (உங்களை உருவாக்கும் நெடுவரிசைகள்) உட்பட, காலிபரில் கிடைக்கும் அனைத்து மெட்டாடேட்டாவையும் ஒரு `` வார்ப்புரு வெளிப்பாடு`` அணுகலாம். `நெடுவரிசை` (சில நேரங்களில்` புலங்கள்` என்று அழைக்கப்படுகிறது) க்கான தேடல் பெயரைக் கண்டுபிடிக்க, காலிபரின் புத்தக பட்டியலில் நெடுவரிசை தலைப்புக்கு மேல் உங்கள் சுட்டியைச் செல்லுங்கள். தனிப்பயன் நெடுவரிசைகளுக்கான தேடல் பெயர்கள் எப்போதும் ``#`` உடன் தொடங்குகின்றன. தொடர் வகை நெடுவரிசைகளுக்கு `` #lookup name_index`` என்ற கூடுதல் புலம் உள்ளது, இது தொடரில் அந்த புத்தகத்திற்கான தொடர் குறியீடாகும். எடுத்துக்காட்டாக, உங்களிடம் ``#MySeries`` என்ற தனிப்பயன் தொடர் நெடுவரிசை இருந்தால், ``#myseries_index`` என்ற நெடுவரிசையும் இருக்கும். நிலையான தொடர் நெடுவரிசையின் குறியீட்டுக்கு `` Sitery_index`` என்று பெயரிடப்பட்டுள்ளது.
zh_cn: “模板表达式”可以通过使用列的“查找名称”来访问 calibre 中可用的所有元数据，包括自定义列（您自己创建的列）。 要查找“列”（有时称为“字段”）的查找名称，请将鼠标悬停在 calibre 图书列表中的列标题上。 自定义列的查找名称始终以“#”开头。 对于系列类型列，有一个名为“#lookup name_index”的附加字段，它是该系列中该书的系列索引。 例如，如果您有一个名为“#myseries”的自定义系列列，那么还将有一个名为“#myseries_index”的列。 标准系列列的索引名为“series_index”。

source: In addition to the standard column based fields, you also can use:
ja: 標準の列ベースのフィールドに加えて、次のものも使用できます:
nl: Naast de kolom gebaseerde velden, kunt u gebruik maken van:
ta: நிலையான நெடுவரிசை அடிப்படையிலான புலங்களுக்கு கூடுதலாக, நீங்கள் பயன்படுத்தலாம்:
zh_cn: 除了基于标准列的字段之外，您还可以使用：

source: ``{formats}`` - A list of formats available in the calibre library for a book
ja: ``{formats}`` - calibre ライブラリで利用可能な本の形式のリスト
nl: ``{formats}`` - Een lijst van formaten beschikbaar in de calibre bibliotheek voor een boek
ta: `` {வடிவங்கள்} `` - ஒரு புத்தகத்திற்கான காலிபர் நூலகத்தில் கிடைக்கும் வடிவங்களின் பட்டியல்
zh_cn: ``{formats}`` - calibre 书库中书籍可用的格式列表

source: ``{identifiers:select(isbn)}`` - The ISBN of the book
ja: ``{identifiers:select(isbn)}`` - 本の ISBN
nl: ``{identifiers:select(isbn)}`` - De ISBN van het boek
ta: `` {அடையாளங்காட்டிகள்: புத்தகத்தின் ஐ.எஸ்.பி.என்
zh_cn: ``{identifiers:select(isbn)}`` - 书籍的 ISBN

source: If the metadata for the field for a given book is not defined then the field in the template is replaced by the empty string (``''``). For example, consider the following template::
ja: 特定の本のフィールドの書誌が定義されていない場合、テンプレートのフィールドは空の文字列 (``''``) に置き換えられます。たとえば、次のテンプレートについて考えてみましょう::
nl: Als de metadata voor het veld voor een bepaald boek niet gedefinieerd is wordt het veld in de sjabloon vervangen door de lege string (``''``). Bv. overweeg volgende sjabloon::
ta: கொடுக்கப்பட்ட புத்தகத்திற்கான புலத்திற்கான மெட்டாடேட்டா வரையறுக்கப்படாவிட்டால், வார்ப்புருவில் உள்ள புலம் வெற்று சரத்தால் மாற்றப்படும் (`` '' ``). எடுத்துக்காட்டாக, பின்வரும் வார்ப்புருவைக் கவனியுங்கள் ::
zh_cn: 如果某本书的字段元数据未定义，则模板中的该字段将被替换为空字符串（“'''”）。例如，请考虑以下模板：

source: If Asimov's book "Second Foundation" is in the series "Foundation" then the template produces::
ja: Asimov の本 "Second Foundation" がシリーズ "Foundation" に含まれている場合、テンプレートは次のように生成します::
nl: Als Asimov's boek "Second Foundation" in de serie "Foundation" is dan geeft de sjabloon::
ta: அசிமோவின் "இரண்டாவது அறக்கட்டளை" புத்தகம் "அறக்கட்டளை" என்ற தொடரில் இருந்தால், வார்ப்புரு உருவாக்குகிறது ::
zh_cn: 如果Asimov的书《Second Foundation》属于《Foundation》丛书，那么模板将生成：

source: If a series has not been entered for the book then the template produces::
ja: 本のシリーズが入力されていない場合、テンプレートは次のように生成します::
nl: Als er voor een boek geen serie is ingevoerd geeft de sjabloon::
ta: புத்தகத்திற்கு ஒரு தொடர் உள்ளிடப்படவில்லை என்றால், வார்ப்புரு உருவாக்குகிறது ::
zh_cn: 如果尚未输入该书的丛书，则模板将生成：

source: The template processor automatically removes multiple slashes and leading or trailing spaces.
ja: テンプレートプロセッサは、複数のスラッシュと先頭または末尾のスペースを自動的に削除します。
nl: De sjabloonverwerker verwijdert automatisch meerdere schuine strepen en voorloop en volg spaties.
ta: வார்ப்புரு செயலி தானாக பல ஸ்லாஷ்கள் மற்றும் முன்னணி அல்லது பின்தங்கிய இடங்களை நீக்குகிறது.
zh_cn: 模板处理器会自动去除多余的斜杠以及开头和结尾的空格。

source: Advanced formatting
ja: 高度な整形
nl: Geavanceerde opmaak
ta: மேம்பட்ட வடிவமைப்பு
zh_cn: 高级格式

source: In addition to metadata substitution, templates can conditionally include additional text and control how substituted data is formatted.
ja: 書誌の置換に加えて、テンプレートには条件付きで追加のテキストを含め、置換されたデータの整形方法を制御できます。
nl: Bovenop metadatasubstitutie kunnen sjablonen voorwaardelijk extra tekst opnemen en de opmaak van gesubstitueerde gegevens controleren.
ta: மெட்டாடேட்டா மாற்றீட்டிற்கு கூடுதலாக, வார்ப்புருக்கள் நிபந்தனையுடன் கூடுதல் உரையை உள்ளடக்கியது மற்றும் மாற்று தரவு எவ்வாறு வடிவமைக்கப்படுகிறது என்பதைக் கட்டுப்படுத்தலாம்.
zh_cn: 除了元数据替换之外，模板还可以有条件地包含附加文本，并控制替换数据的格式。

source: **Conditionally including text**
ja: **条件つきでテキストを含める**
nl: **Voorwaardelijk tekst opnemen**
ta: ** உரை உட்பட நிபந்தனையுடன் **
zh_cn: **有条件地包含文本**

source: Sometimes you want text to appear in the output only if a field is not empty. A common case is ``series`` and ``series_index`` where you want either nothing or the two values separated by a hyphen. calibre handles this case using a special ``template expression`` syntax.
ja: フィールドが空でない場合にのみ、出力にテキストを表示したいというような場合があります。よくあるケースは ``series`` と ``series_index` で、何も必要ないか、ハイフンで区切られた 2 つの値が必要です。 calibre は、特殊な ``テンプレート表現`` の構文を使用してこのケースを処理します。
nl: Soms wilt u dat tekst enkel in de uitvoer verschijnt als een veld niet leeg is. Een veel voorkomend geval is ``series`` en ``series_index`` waar u ofwel niets wil of de twee waarden gescheiden door een streepje. calibre doet dit via een speciale ``template expression`` syntaxis.
ta: சில நேரங்களில் ஒரு புலம் காலியாக இல்லாவிட்டால் மட்டுமே வெளியீட்டில் உரை தோன்ற வேண்டும். ஒரு பொதுவான வழக்கு `` தொடர்`` மற்றும் `` தொடர்_இண்டெக்ஸ்`` அங்கு நீங்கள் எதுவும் விரும்பவில்லை அல்லது ஒரு ஹைபனால் பிரிக்கப்பட்ட இரண்டு மதிப்புகள். ஒரு சிறப்பு `` வார்ப்புரு வெளிப்பாடு`` தொடரியல் பயன்படுத்தி இந்த வழக்கை காலிபர் கையாளுகிறார்.
zh_cn: 有时，您希望仅当字段不为空时文本才出现在输出中。 常见的情况是“series”和“series_index”，其中您不需要任何内容或用连字符分隔两个值。 calibre 使用特殊的“模板表达式”语法来处理这种情况。

source: For example and using the above Foundation example, assume you want the template to produce `Foundation - 3 - Second Foundation`. This template produces that output:
ja: たとえば、上記の Foundation の例を使用して、テンプレートで `Foundation - 3 - Second Foundation` を生成するとします。このテンプレートはその出力を生成します:
nl: Bv. met het Foundation voorbeeld van boven, veronderstel dat u wilt dat de sjabloon `Foundation - 3 - Second Foundation` geeft. Deze sjabloon geeft die uitvoer:
ta: எடுத்துக்காட்டாக, மேலே உள்ள அறக்கட்டளை எடுத்துக்காட்டைப் பயன்படுத்தி, வார்ப்புரு `அறக்கட்டளை - 3 - இரண்டாவது அடித்தளம்` ஐ உருவாக்க வேண்டும் என்று வைத்துக் கொள்ளுங்கள். இந்த வார்ப்புரு அந்த வெளியீட்டை உருவாக்குகிறது:
zh_cn: 例如，使用上面的 Foundation 示例，假设您希望模板生成“Foundation - 3 - Second Foundation”。此模板将生成以下输出：

source: ``{series} - {series_index} - {title}``
ta: `{தொடர்} - {sitery_index} - {தலைப்பு}` `

source: However, if a book has no series the template will produce `- - the title`, which is probably not what you want. Generally, people want the result be the title without the extraneous hyphens. You can accomplish this using the following template syntax:
ja: ただし本にシリーズがない場合、テンプレートは `- - タイトル` を生成することになりますが、これはおそらくあなたが望むものではないでしょう。一般的に人々は、意味のないハイフンのないただのタイトルとなることを望むものです。これは、次のテンプレート構文を使用すれば達成できます:
nl: Alhoewel, als een boek geen deel van een serie is, geeft de sjabloon `- - de titel`, wat waarschijnlijk niet is wat u wilt. Gewoonlijk willen de mensen als resultaat de titel zonder extra streepjes. Dit kan met de volgende sjabloon syntaxis:
ta: இருப்பினும், ஒரு புத்தகத்தில் தொடர் இல்லை என்றால், வார்ப்புரு ` - - தலைப்பு` ஐ உருவாக்கும், இது நீங்கள் விரும்பாதது அல்ல. பொதுவாக, மக்கள் முடிவு வெளிப்புற ஹைபன்கள் இல்லாமல் தலைப்பாக இருக்க விரும்புகிறார்கள். பின்வரும் வார்ப்புரு தொடரியல் பயன்படுத்தி இதை நீங்கள் நிறைவேற்றலாம்:
zh_cn: 但是，如果一本书没有系列，模板将生成“- - 标题”，这可能不是您想要的。 一般来说，人们希望结果是没有无关连字符的标题。 您可以使用以下模板语法来完成此操作：

source: ``{field:|prefix_text|suffix_text}``
ta: `` {புலம்: | முன்னொட்டு_டெக்ஸ்ட் | பின்னொட்டு_டெக்ஸ்ட்} ``

source: This ``template expression`` says that if ``field`` has the value `XXXX` then the result will be `prefix_textXXXXXsuffix_text`. If ``field`` is empty (has no value) then the result will be the empty string (nothing) because the prefix and suffix are ignored. The prefix and suffix can contain blanks.
ja: この ``テンプレート表現`` は ``field`` の値が `XXXX` の場合、結果は `prefix_textXXXXXsuffix_text` になることを示しています。``field`` が空 (値がない) 場合、プレフィックスとサフィックスが無視されるため、結果は空の文字列 (なし) となります。プレフィックスとサフィックスには空白を含めることができます。
nl: Deze ``template expression`` zegt dat als ``field`` de waarde `XXXX` heeft, het resultaat `prefix_textXXXXXsuffix_text` zal zijn. Als ``field`` leeg is (heeft geen waarde) dan zal het resultaat de lege string zijn (niets) omdat voor- en achtervoegsel genegeerd worden. Het voor- en achtervoegsel kunnen lege plekken hebben.
ta: இந்த `` வார்ப்புரு வெளிப்பாடு`` கூறுகிறது `` புலம்` `xxxx` மதிப்பு இருந்தால், இதன் விளைவாக` முன்னொட்டு `` புலம்`` காலியாக இருந்தால் (மதிப்பு இல்லை), இதன் விளைவாக வெற்று சரம் (ஒன்றுமில்லை) இருக்கும், ஏனெனில் முன்னொட்டு மற்றும் பின்னொட்டு புறக்கணிக்கப்படும். முன்னொட்டு மற்றும் பின்னொட்டு வெற்றிடங்களைக் கொண்டிருக்கலாம்.
zh_cn: 这个“模板表达式”表示，如果“field”的值为“XXXX”，那么结果将为“prefix_textXXXXXsuffix_text”。 如果“field”为空（没有值），那么结果将是空字符串（什么也没有），因为前缀和后缀被忽略。 前缀和后缀可以包含空格。

source: **Do not use subtemplates (`{ ... }`) or functions (see below) in the prefix or the suffix.**
ja: **プレフィックスとサフィックスには、サブテンプレート (`{ ... }`) や関数 (下を参照) を使用しないでください。**
nl: **Gebruik geen subsjablonen (`{ ... }`) of functies (zie onder) in het voor- of achtervoegsel.**
ta: ** முன்னொட்டு அல்லது பின்னொட்டில் சப்டெம்பிளேட்டுகள் (`{...}`) அல்லது செயல்பாடுகளை (கீழே காண்க) பயன்படுத்த வேண்டாம். **
zh_cn: **不要在“前缀”（prefix）或“后缀”（suffix）中使用子模板（`{ ... }`）或函数（见下文）。**

source: Using this syntax, we can solve the above no-series problem with the template::
ja: この構文を使用すると、テンプレートで上記のシリーズなしの問題を解決できます。
nl: Met deze syntaxis kunnen we het geen-serie probleem boven oplossen met de sjabloon::
ta: இந்த தொடரியல் பயன்படுத்தி, வார்ப்புருவில் மேலே உள்ள தொடர் சிக்கலை நாம் தீர்க்க முடியும் ::
zh_cn: 使用这种语法，我们可以通过以下模板来解决上述提到的“无丛书名”问题::

source: The hyphens will be included only if the book has a series index, which it has only if it has a series. Continuing the Foundation example again, the template will produce `Foundation - 1 - Second Foundation`.
ja: ハイフンは、本にシリーズインデックスがある場合にのみ含まれます。シリーズインデックスはシリーズがある場合にのみ含まれます。 Foundationの例を再び続けると、テンプレートは `Foundation - 1 - Second Foundation` を生成します。
nl: De streepjes komen er enkel bij als het boek een serie index heeft, die het enkel heeft als het deel van een serie is. Verder weer met het Foundation voorbeeld, de sjabloon geeft `Foundation - 1 - Second Foundation`.
ta: புத்தகத்தில் தொடர் குறியீடு இருந்தால் மட்டுமே ஹைபன்கள் சேர்க்கப்படும், அதில் ஒரு தொடர் இருந்தால் மட்டுமே உள்ளது. அறக்கட்டளை உதாரணத்தைத் தொடர்ந்து, வார்ப்புரு `அறக்கட்டளை - 1 - இரண்டாவது அடித்தளத்தை` உருவாக்கும்.
zh_cn: 仅当该书具有系列索引时才会包含连字符，而该索引仅当它具有系列时才包含。 再次继续 Foundation 示例，模板将生成“Foundation - 1 - Second Foundation”。

source: Notes:
ja: メモ:
nl: Aantekeningen:
ta: குறிப்புகள்:
zh_cn: 注意:

source: You must include the colon after the ``lookup name`` if you are using a prefix or a suffix.
ja: プレフィックスやサフィックスを使用している場合は、``ルックアップ名`` の後にコロンを含める必要があります。
nl: U moet een dubbel punt zetten na de ``lookup name`` als u een voor- of achtervoegsel gebruikt.
ta: நீங்கள் ஒரு முன்னொட்டு அல்லது பின்னொட்டைப் பயன்படுத்துகிறீர்கள் என்றால் `` தேடல் பெயர்`` க்குப் பிறகு நீங்கள் பெருங்குடலை சேர்க்க வேண்டும்.
zh_cn: 如果使用前缀或后缀，则必须在“查找名称”后面包含冒号。

source: You must either use either no or both ``|`` characters. Using one, as in ``{field:| - }``, is not allowed.
ja: ``|`` の文字は、使用しないか両方使用するかのどちらかです。``{field:| - }`` のようなひとつだけの使用は許されません。
nl: U moet ofwel beide ofwel geen ``|`` karakters gebruiken. Eén gebruiken, zoals in ``{field:| - }``, is niet toegelaten.
ta: நீங்கள் இல்லை அல்லது இரண்டையும் பயன்படுத்த வேண்டும் `` | `` `எழுத்துக்கள். ஒன்றைப் பயன்படுத்துதல், `` {புலம்: | -} ``, அனுமதிக்கப்படவில்லை.
zh_cn: 你必须要么完全不使用 ``|`` 字符，要么同时使用两个。像 ``{field:| - }``这样只使用一个 | 是不被允许的。

source: It is OK to provide no text for either the prefix or the suffix, such as in ``{series:|| - }``. The template ``{title:||}`` is the same as ``{title}``.
ja: プレフィックスやサフィックスにテキストを指定せず、``{series:|| - }`` にしてもかまいません。テンプレート `{title:||}`` は ``{title}`` と同じです。
nl: Het is oké om geen tekst te voorzien voor voor- of achtervoegsel, zoals in ``{series:|| - }``. De sjabloon ``{title:||}`` is hetzelfde als ``{title}``.
ta: `` {தொடர்: || போன்ற முன்னொட்டு அல்லது பின்னொட்டுக்கு எந்த உரையையும் வழங்குவது சரி -} ``. `` {தலைப்பு: ||} `` வார்ப்புரு `` {தலைப்பு} `` போன்றது.
zh_cn: 可以不为前缀或后缀提供任何文本，例如 ``{series:|| - }``是允许的。模板 ``{title:||}`` 与 ``{title:||}`` 是等效的。

source: **Formatting**
ja: **書式設定**
nl: **Opmaak**
ta: ** வடிவமைத்தல் **
zh_cn: **格式化**

source: Suppose you want the ``series_index`` to be formatted as three digits with leading zeros. This does the trick:
ja: ``series_index`` を先行ゼロ付きの 3 桁に整形したいとします。次のようにすればそうできます:
nl: Veronderstel dat u ``series_index`` opgemaakt wilt als drie cijfers met voorloopnullen. Dit doet de truc:
ta: `` Sitery_Index`` ஐ முன்னணி பூஜ்ஜியங்களுடன் மூன்று இலக்கங்களாக வடிவமைக்க விரும்புகிறீர்கள் என்று வைத்துக்கொள்வோம். இது தந்திரம் செய்கிறது:
zh_cn: 假设你希望将 ``series_index``格式化为三位数，并在前面补零。这段代码就能实现这个效果：

source: ``{series_index:0>3s}`` - Three digits with leading zeros
ja: ``{series_index:0>3s}`` - 先行ゼロ付きの 3 桁
nl: ``{series_index:0>3s}`` - Drie cijfers met voorloopnullen
ta: `{sitery_index: 0> 3s}` ` - முன்னணி பூஜ்ஜியங்களுடன் மூன்று இலக்கங்கள்
zh_cn: ``{series_index:0>3s}`` - 三位数，前面补零

source: For trailing zeros, use:
ja: 後置ゼロには、次を使います:
nl: Voor volgnullen, gebruik:
ta: பூஜ்ஜியங்களைப் பின்தொடர்வதற்கு, பயன்படுத்தவும்:
zh_cn: 若要在后面补零，请使用：

source: ``{series_index:0<3s}`` - Three digits with trailing zeros
ja: ``{series_index:0<3s}`` - 後置ゼロ付きの 3 桁
nl: ``{series_index:0<3s}`` - Drie cijfers met volgnullen
ta: `{sitery_index: 0 <3s}` ` - பூஜ்ஜியங்களுடன் மூன்று இலக்கங்கள்
zh_cn: ``{series_index:0<3s}`` - - 三位数，后面补零

source: If you use series indices with fractional values, e.g., 1.1, you might want the decimal points to line up. For example, you might want the indices 1 and 2.5 to appear as 01.00 and 02.50 so that they will sort correctly on a device that does lexical sorting. To do this, use:
ja: 1.1 などの小数値のシリーズインデックスを使用する場合は、小数点の位置を揃えたい場合があります。たとえば、インデックス 1 と 2.5 を 01.00 と 02.50 として表示して、辞書順に並べ替えを行うデバイスで正しく並べ替えられるようにすることができます。これを行うには、次を使用します:
nl: Als u reeksindexen gebruikt met fractionele waarden, bv. 1,1, hebt u de komma's misschien graag uitgelijnd. Bv. u hebt misschien graag dat indexen 1 en 2,5 eruit zien als 01,00 en 02,50 zodat ze correct sorteren op een toestel dat lexicaal sorteert. Om dit te doen, gebruik:
ta: பகுதியளவு மதிப்புகளுடன் தொடர் குறியீடுகளைப் பயன்படுத்தினால், எ.கா., 1.1, தசம புள்ளிகள் வரிசைப்படுத்த வேண்டும் என்று நீங்கள் விரும்பலாம். எடுத்துக்காட்டாக, 1 மற்றும் 2.5 குறியீடுகள் 01.00 மற்றும் 02.50 ஆகத் தோன்ற வேண்டும் என்று நீங்கள் விரும்பலாம், இதனால் அவை லெக்சிக்கல் வரிசையாக்கத்தை செய்யும் சாதனத்தில் சரியாக வரிசைப்படுத்தும். இதைச் செய்ய, பயன்படுத்தவும்:
zh_cn: 如果您使用带有小数值的系列索引，例如 1.1，您可能希望小数点对齐。 例如，您可能希望索引 1 和 2.5 显示为 01.00 和 02.50，以便它们在进行词法排序的设备上正确排序。 为此，请使用：

source: If you want only the first two letters of the data, use:
ja: データの最初の 2 文字だけが必要な場合は、次を使用します:
nl: Als u enkel de twee eerste letters van de data wil, gebruik:
ta: தரவின் முதல் இரண்டு எழுத்துக்களை மட்டுமே நீங்கள் விரும்பினால், பயன்படுத்தவும்:
zh_cn: 如果你只想保留数据的前两个字母，请使用：

source: ``{author_sort:.2}`` - Only the first two letters of the author sort name
ja: ``{author_sort:.2}`` - 著者読みの最初の 2 文字のみ
nl: ``{author_sort:.2}`` - Enkel de eerste twee letters van de auteursorteernaam
ta: `` {எழுத்தாளர்_சார்ட்: .2} `` - ஆசிரியரின் முதல் இரண்டு எழுத்துக்கள் மட்டுமே
zh_cn: ``{author_sort:.2}`` - 仅显示作者排序名称（author sort name）的前两个字母
