Repository: debian-calibre/calibre
Catalog: translations/manual/*/template_lang.po
Languages: ja, nl, ta, zh_cn

source: Logical and (``&&``). This operator returns '1' if both the left-hand and right-hand expressions are True, or the empty string ``''`` if either is False. It is associative, evaluates left to right, and does `short-circuiting <https://chortle.ccsu.edu/java5/Notes/chap40/ch40_2.html>`_.
ja: 論理積 (``&&``)。この演算子は、左辺と右辺の両方の式が True のときに '1' を返し、どちらかが False なら空の文字列 ``''`` を返します。これは連想的で、左から右に評価し、 `短絡評価 <https://chortle.ccsu.edu/java5/Notes/chap40/ch40_2.html>`_ を行います。
nl: Logisch en (``&&``). Deze operator geeft '1' terug als zowel de linker- als de rechter-kant expressies Waar zijn, of de lege string ``''`` als een van beide Vals is. Het is associatief, evalueert van links naar rechts en doet aan `kort-sluiten <https://chortle.ccsu.edu/java5/Notes/chap40/ch40_2.html>`_.
ta: தர்க்கரீதியான மற்றும் (`` && ``). இடது கை மற்றும் வலது கை வெளிப்பாடுகள் இரண்டும் உண்மையாக இருந்தால், அல்லது வெற்று சரம் `''` `ஆகியவை பொய்யானதாக இருந்தால் இந்த ஆபரேட்டர் '1' ஐ வழங்குகிறது. இது துணை, இடமிருந்து வலமாக மதிப்பீடு செய்கிறது, மேலும் `குறுகிய சுற்று <https://chortle.ccsu.edu/java5/notes/chap40/ch40_2.html>` _.
zh_cn: 逻辑与 (&&)。如果左侧和右侧表达式均为“真”（True），则此运算符返回 '1'；如果其中任何一个为“假”（False），则返回空字符串 ''。该运算符具有结合性，按从左至右的顺序求值，并支持`短路计算 (short-circuiting) <https://chortle.ccsu.edu/java5/Notes/chap40/ch40_2.html>`_。

source: Logical or (``||``). This operator returns ``'1'`` if either the left-hand or right-hand expression is True, or ``''`` if both are False. It is associative, evaluates left to right, and does `short-circuiting <https://chortle.ccsu.edu/java5/Notes/chap40/ch40_2.html>`_. It is an `inclusive or`, returning ``'1'`` if both the left- and right-hand expressions are True.
ja: 論理和 (``||``)。この演算子は、左辺または右辺の式のいずれかが True であれば ``'1'``を返し、両方とも False なら ``''`` を返します。これは連想的で、左から右に評価し、 `短絡評価 <https://chortle.ccsu.edu/java5/Notes/chap40/ch40_2.html>`_ を行います。 これは `包含的論理和` で、左辺または右辺の式の両方が True のときに ``'1'`` を返します。
nl: Logische of (``||``). Deze operator geeft ``'1'`` terug als ofwel de linker- ofwel de rechterkant expressie Waar is, of ``''`` als beide Vals zijn. Hij is associatief, evalueert van links naar rechts en doet aan `kort-sluiten <https://chortle.ccsu.edu/java5/Notes/chap40/ch40_2.html>`_. Het is een `inclusieve of`, geeft ``'1'`` terug als zowel de linker- en rechterkant expressies Waar zijn.
ta: தர்க்கரீதியான அல்லது (`` || ``). இந்த ஆபரேட்டர் `` '1'`` இடது கை அல்லது வலது கை வெளிப்பாடு உண்மையாக இருந்தால், அல்லது இரண்டும் பொய்யானதாக இருந்தால் ``' '`` `` `` `` `` `. இது துணை, இடமிருந்து வலமாக மதிப்பீடு செய்கிறது, மேலும் `குறுகிய சுற்று <https://chortle.ccsu.edu/java5/notes/chap40/ch40_2.html>` _. இது ஒரு `உள்ளடக்கிய அல்லது`, இடது மற்றும் வலது கை வெளிப்பாடுகள் இரண்டும் உண்மையாக இருந்தால்` `'1'` திரும்பும்.
zh_cn: 逻辑或 (``||``)。 如果左侧表达式或右侧表达式为 True，则此运算符返回 ``'1'``；如果均为 False，则返回 ``''``。 它是关联的，从左到右求值，并进行“短路”<https://chortle.ccsu.edu/java5/Notes/chap40/ch40_2.html>`_。 它是一个“包含或”，如果左侧和右侧表达式都为 True，则返回“'1””。

source: **Field references**
ja: **フィールド参照**
nl: **Veldreferenties**
ta: ** புல குறிப்புகள் **
zh_cn: **字段引用**

source: A ``field_reference`` evaluates to the value of the metadata field named by lookup name that follows the ``$`` or ``$$``. Using ``$`` is equivalent to using the ``field()`` function. Using ``$$`` is equivalent to using the ``raw_field`` function. Examples::
ja: ``field_reference`` は ``$`` または ``$$`` に続くルックアップ名で指定された書誌フィールドの値に評価されます。``$`` の使用は ``field()`` 関数の使用と同等です。``$$`` の使用は ``raw_field`` 関数の使用と同等です。例::
nl: Een ``field_reference`` evalueert naar de waarde van het metadata veld genoemd bij lookup name dat volgt op ``$`` or ``$$``. Gebruik van ``$`` is equivalent aan gebruik van de ``field()`` functie. Gebruik van ``$$`` is equivalent aan gebruik van de ``raw_field`` functie. Bv.::
ta: `` `` `அல்லது` `$$` `` `` `ஆகியவற்றைப் பின்தொடரும் தேடல் பெயரால் பெயரிடப்பட்ட மெட்டாடேட்டா புலத்தின் மதிப்பை ஒரு` `புலம்_பிறப்புக்கு` மதிப்பீடு செய்கிறது. `` $ `` பயன்படுத்துவது `` புலம் () `` செயல்பாட்டைப் பயன்படுத்துவதற்கு சமம். `` $$ `` பயன்படுத்துவது `` ரா_ஃபீல்ட்`` செயல்பாட்டைப் பயன்படுத்துவதற்கு சமம். எடுத்துக்காட்டுகள் ::

source: **If expressions**
ja: **if 文**
nl: **If expressies**
ta: ** வெளிப்பாடுகள் என்றால் **
zh_cn: **If 表达式**

source: ``If`` expressions first evaluate the ``condition``. If the ``condition`` is True (a non-empty value) then the ``expression_list`` in the ``then`` clause is evaluated. If it is False then if present the ``expression_list`` in the ``elif`` or ``else`` clause is evaluated. The ``elif`` and ``else`` parts are optional. The words ``if``, ``then``, ``elif``, ``else``, and ``fi`` are reserved; you cannot use them as identifier names. You can put newlines and white space wherever they make sense. The ``condition`` is a ``top_expression`` not an ``expression_list``; semicolons are not allowed. The ``expression_lists`` are semicolon-separated sequences of ``top_expressions``. An ``if`` expression returns the result of the last ``top_expression`` in the evaluated ``expression_list``, or the empty string if no expression list was evaluated.
ja: ``If`` 文は最初に ``condition`` を評価します。``condition`` が True (空でない値) であれば、``then`` 句の中にある ``expression_list`` が評価されます。False なら ``elif`` または ``else`` 句の中に ``expression_list`` があればそれが評価されます。``elif`` と ``else`` の部分はオプションです。``if``, ``then``, ``elif``, ``else``, および ``fi`` は予約語です。識別子の名前として使用することはできません。 意味のあるところならどこにでも改行と空白を置くことができます。``condition`` は ``top_expression`` であって ``expression_list`` ではありません。セミコロンは使用できません。``expression_lists`` は ``top_expressions`` のセミコロン区切りのシーケンスです。``if`` 文は評価した ``expression_list`` の中で最後の ``top_expression`` を返し、評価したものがなければ空の文字列を返します。
nl: ``If`` expressies evalueren eerst de ``condition``. Als de ``condition`` Waar is (een niet-lege waarde) wordt de ``expression_list`` in de ``then`` clausule geëvalueerd. Als ze Onwaar is wordt, indien aanwezig, de ``expression_list`` in de ``elif`` of ``else`` clausule geëvalueerd. De ``elif`` en ``else`` delen zijn optioneel. De woorden ``if``, ``then``, ``elif``, ``else``, en ``fi`` zijn gereserveerd; U kan ze niet gebruiken als identificator namen. U kan nieuwe regels en spaties zetten overal waar het zin heeft. De ``condition`` is een ``top_expression`` geen ``expression_list``; puntkomma's zijn niet toegelaten. De ``expression_lists`` zijn puntkomma gescheiden reeksen met ``top_expressions``. Een ``if`` expressie geeft het resultaat terug van de laatste ``top_expression`` in de geëvalueerde ``expression_list``, of de lege string als geen expressie lijst werd geëvalueerd.
ta: `` If` `வெளிப்பாடுகள் முதலில்` `நிபந்தனையை`` மதிப்பீடு செய்கின்றன. `` நிபந்தனை`` உண்மையாக இருந்தால் (காலியாக இல்லாத மதிப்பு) பின்னர் `` பின்னர்`` பிரிவில் உள்ள `` வெளிப்பாடு_லிஸ்ட்`` மதிப்பீடு செய்யப்படுகிறது. அது தவறானது என்றால், `` எலிஃப்`` அல்லது `` வேறு`` பிரிவு மதிப்பீடு செய்யப்பட்டால் `` எக்ஸ்பிரஷன்_லிஸ்ட்` வழங்கினால். `` Elif`` மற்றும் `` வேறு`` பாகங்கள் விருப்பமானவை. `` If``, `` பின்னர்``, `` elif``, `` வேறு``, மற்றும் `` fi`` ஆகிய சொற்கள் ஒதுக்கப்பட்டுள்ளன; நீங்கள் அவற்றை அடையாளங்காட்டி பெயர்களாகப் பயன்படுத்த முடியாது. புதிய லைன்களையும் வெள்ளை இடத்தையும் அவர்கள் எங்கு அர்த்தப்படுத்தினாலும் நீங்கள் வைக்கலாம். `` நிபந்தனை`` என்பது ஒரு `` டாப்_எக்ஸ்பிரஷன்`` ஒரு `` வெளிப்பாடு_லிஸ்ட்``; அரைக்காற்புள்ளிகள் அனுமதிக்கப்படவில்லை. `` எக்ஸ்பிரஷன்_லிஸ்ட்கள்`` என்பது `` டாப்_எக்ஸ்பிரஸ்ஷன்கள்`` இன் அரைக்காற்புள்ளியால் பிரிக்கப்பட்ட காட்சிகள். ஒரு `` if`` வெளிப்பாடு மதிப்பிடப்பட்ட `` எக்ஸ்பிரஷன்_லிஸ்ட்`` அல்லது வெளிப்பாடு பட்டியல் மதிப்பீடு செய்யப்படாவிட்டால் வெற்று சரம் ஆகியவற்றில் கடைசி `` டாப்_எக்ஸ்பிரஷன்`` இன் முடிவை வழங்குகிறது.
zh_cn: ``If`` 表达式首先评估``condition``。 如果“condition”为 True（非空值），则评估“then”子句中的“expression_list”。 如果为 False，则评估“elif”或“else”子句中的“expression_list”。 ``elif`` 和 ``else`` 部分是可选的。 单词“if”、“then”、“elif”、“else”和“fi”被保留； 您不能将它们用作标识符名称。 您可以在任何有意义的地方放置换行符和空格。 “condition”是“top_expression”，而不是“expression_list”； 不允许使用分号。 “表达式列表”是以分号分隔的“top_表达式”序列。 ``if`` 表达式返回已计算的 ``expression_list`` 中最后一个 ``top_expression`` 的结果，如果没有计算表达式列表，则返回空字符串。

source: Examples::
ja: 例::
nl: Voorbeelden::
ta: எடுத்துக்காட்டுகள் ::
zh_cn: 示例::

source: Nested ``if`` example::
ja: 入れ子になった ``if`` の例::
nl: Genest ``if`` voorbeeld::
ta: உள்ளமை `` if`` எடுத்துக்காட்டு ::
zh_cn: 嵌套 if 示例::

source: As said above, an ``if`` produces a value. This means that all the following are equivalent::
ja: 上で説明したように ``if`` は値を生成します。これは、次のすべてが同等であることを意味します::
nl: Zoals boven gezegd, een ``if`` geeft een waarde. Dat betekent dat al de volgenden equivalent zijn::
ta: மேலே கூறியது போல், ஒரு `` if`` ஒரு மதிப்பை உருவாக்குகிறது. இதன் பொருள் பின்வருபவை அனைத்தும் சமமானவை ::
zh_cn: 如上所述，if 语句会产生一个值。这意味着以下所有写法都是等效的::

source: As a last example, this program returns the value of the ``series`` column if the book has a series, otherwise the value of the ``title`` column::
ja: 最後の例として、このプログラムは、本にシリーズがある場合は ``シリーズ`` 列の値を返し、そうでない場合は ``タイトル`` 列の値を返します::
nl: Als laatste voorbeeld, dit programma geeft de waarde van de ``series`` kolom terug als het boek van een serie is, anders de waarde van de ``title`` kolom::
ta: கடைசி எடுத்துக்காட்டு, இந்த நிரல் புத்தகத்தில் ஒரு தொடர் இருந்தால் `` தொடர்` நெடுவரிசையின் மதிப்பை வழங்குகிறது, இல்லையெனில் `` தலைப்பு` நெடுவரிசையின் மதிப்பு ::

source: **For expressions**
ja: **for 文**
nl: **For expressies**
ta: ** வெளிப்பாடுகளுக்கு **
zh_cn: **For表达式**

source: The ``for`` expression iterates over a list of values, processing them one at a time. The ``list_expression`` must evaluate either to a metadata field ``lookup name`` e.g., ``tags`` or ``#genre``, or to a list of values. The :ref:`range() function <range_function>` (see below) generates a list of numbers. If the result is a valid ``lookup name`` then the field's value is fetched and the separator specified for that field type is used. If the result isn't a valid lookup name then it is assumed to be a list of values. The list is assumed to be separated by commas unless the optional keyword ``separator`` is supplied, in which case the list values must be separated by the result of evaluating the ``separator_expr``. A separator cannot be used if the list is generated by ``range()``. Each value in the list is assigned to the specified variable then the ``expression_list`` is evaluated. You can use ``break`` to jump out of the loop, and ``continue`` to jump to the beginning of the loop for the next iteration.
ja: ``for`` 文は値のリストを反復処理し、一度にひとつずつ処理します。 ``list_expression`` は ``tags`` や ``#genre`` などの書誌フィールド ``ルックアップ名``、または値のリストのいずれかに評価される必要があります。:ref:`range() 関数 <range_function>` (下を参照) は数値のリストを生成します。 結果が有効な ``ルックアップ名`` であればフィールドの値がフェッチされ、そのフィールドタイプに指定されたセパレータが使用されます。結果が有効なルックアップ名でない場合は、値のリストであると見なされます。オプションのキーワード ``separator`` が指定されていない限り、リストはコンマで区切られていると見なされます。指定されている場合、リスト値は、 ``separator_expr``の評価結果で区切る必要があります。``range()`` で生成されたリストには区切り文字は使用できません。リスト内の各値は指定された変数に割り当てられ、``expression_list`` が評価されます。``break`` を使ってループから抜けることもでき、``continue`` を使うと次の反復のためにループの先頭に移動します。
ta: `` `வெளிப்பாடு மதிப்புகளின் பட்டியலை மீண்டும் செயல்படுத்துகிறது, அவற்றை ஒரு நேரத்தில் செயலாக்குகிறது. `` பட்டியல்_எக்ஸ்பிரஷன்`` ஒரு மெட்டாடேட்டா புலம் `` தேடல் பெயர்`` எ.கா., `` குறிச்சொற்கள்``` அல்லது `#வகை`` அல்லது மதிப்புகளின் பட்டியலுக்கு மதிப்பீடு செய்ய வேண்டும். தி: ரெஃப்: `ரேஞ்ச் () செயல்பாடு <range_function>` (கீழே காண்க) எண்களின் பட்டியலை உருவாக்குகிறது. இதன் விளைவாக செல்லுபடியாகும் `` தேடல் பெயர்`` என்றால், புலத்தின் மதிப்பு பெறப்பட்டு, அந்த புல வகைக்கு குறிப்பிடப்பட்ட பிரிப்பான் பயன்படுத்தப்படுகிறது. முடிவு சரியான தேடல் பெயர் இல்லையென்றால், அது மதிப்புகளின் பட்டியல் என்று கருதப்படுகிறது. விருப்பமான முக்கிய சொல் `` பிரிப்பான்`` வழங்கப்படாவிட்டால், பட்டியல் காற்புள்ளிகளால் பிரிக்கப்படுவதாக கருதப்படுகிறது, இந்த விஷயத்தில் `` பிரிப்பான்_எக்ஸ்பிஆர்`` மதிப்பிட்டதன் விளைவாக பட்டியல் மதிப்புகள் பிரிக்கப்பட வேண்டும். பட்டியல் `` வரம்பு () `` ஆல் உருவாக்கப்பட்டால் ஒரு பிரிப்பான் பயன்படுத்த முடியாது. பட்டியலில் உள்ள ஒவ்வொரு மதிப்பும் குறிப்பிட்ட மாறிக்கு ஒதுக்கப்படுகிறது, பின்னர் `` எக்ஸ்பிரஷன்_லிஸ்ட்`` மதிப்பீடு செய்யப்படுகிறது. வளையத்திலிருந்து வெளியேற நீங்கள் `` பிரேக்`` ஐப் பயன்படுத்தலாம், மேலும் அடுத்த மறு செய்கைக்காக வளையத்தின் தொடக்கத்திற்கு செல்ல `` தொடரவும்.

source: Example: This template removes the first hierarchical name for each value in Genre (``#genre``), constructing a list with the new names::
ja: 例: このテンプレートは、ジャンル (``#genre``) の各値の最初の階層名を削除し、新しい名前でリストを作成します::
nl: Voorbeeld: Deze sjabloon verwijdert de eerste hiërarchische naam voor elke waarde in Genre (``#genre``), een lijst opbouwend met de nieuwe namen::
ta: எடுத்துக்காட்டு: இந்த வார்ப்புரு வகையின் ஒவ்வொரு மதிப்புக்கும் முதல் படிநிலை பெயரை நீக்குகிறது (``#வகை``), புதிய பெயர்களுடன் ஒரு பட்டியலை உருவாக்குகிறது ::
zh_cn: 示例：此模板会移除“类型 (#genre)”字段中每个值的第一个层级名称，并用处理后的新名称构建一个列表：

source: If the original Genre is `History.Military, Science Fiction.Alternate History, ReadMe` then the template returns `Military, Alternate History, ReadMe`. You could use this template in calibre's :guilabel:`Edit metadata in bulk -> Search & replace` with :guilabel:`Search for` set to ``template`` to strip off the first level of the hierarchy and assign the resulting value to Genre.
ja: 元のジャンルが `History.Military, Science Fiction.Alternate History, ReadMe` の場合、テンプレートは `Military, Alternate History, ReadMe` を返します。このテンプレートを calibre の :guilabel:`書誌を一括編集 -> 検索と置換` で :guilabel:`検索` に ``template`` を設定して階層の最初のレベルを取り除き、結果の値をジャンルに割り当てます。
nl: Als het originele Genre `History.Military, Science Fiction.Alternate History, ReadMe` is dan geeft de sjabloon `Military, Alternate History, ReadMe` terug. U kan deze sjabloon gebruiken in calibre's :guilabel:`Metadata bewerken in bulk -> Zoeken & vervangen` met :guilabel:`Zoeken naar` ingesteld op ``template`` om het eerste niveau van de hiërarchie te verwijderen en de resulterende waarde aan Genre toe te wijzen.
ta: அசல் வகை `வரலாறு. இராணுவம், அறிவியல் புனைகதை. மாற்றியமைத்தல் வரலாறு என்றால், ரீட்மே` பின்னர் வார்ப்புரு` இராணுவம், மாற்று வரலாறு, ரீட்மே` ஐ வழங்குகிறது. இந்த வார்ப்புருவை நீங்கள் காலிபர்: கிலாபெல்: `மெட்டாடேட்டாவை மொத்தமாகத் திருத்து -> தேடல் & மாற்றவும்` உடன்: கிலாபெல்:` தேடலைத் தேடுங்கள் `` வார்ப்புரு`` ஐத் தேடுங்கள் வரிசைக்கு முதல் மட்டத்தை அகற்றவும், அதன் விளைவாக மதிப்பை ஒதுக்கவும் வகைக்கு.
zh_cn: 如果原始类型是“History.Military, Science Fiction.Alternate History, ReadMe”，则模板将返回“Military, Alternate History, ReadMe”。 您可以在 calibre 的“批量编辑元数据 -> 搜索和替换”中使用此模板，并将“搜索”设置为“模板”，以剥离层次结构的第一级并将结果值分配给类型。

source: Note: the last line in the template, ``new_tags``, isn't strictly necessary in this case because ``for`` returns the value of the last top_expression in the expression list. The value of an assignment is the value of its expression, so the value of the ``for`` statement is what was assigned to ``new_tags``.
ja: 注: この場合、テンプレートの最後の行である ``new_tags`` は必ずしも必要ではありません。これは、``for`` が式リストの最後の top_expression の値を返すためです。割り当ての値はその式の値であるため、``for`` 文の値は ``new_tags`` に割り当てられたものです。
nl: Merk op: de laatste regel in de sjabloon, ``new_tags``, is niet strikt nodig in dit geval omdat ``for`` de waarde van de laatste top_expression terug geeft in de expressie lijst. De waarde van een opdracht is de waarde van zijn expressie, dus de waarde van het ``for`` bericht is wat was toegewezen aan ``new_tags``.
ta: குறிப்பு: வார்ப்புருவின் கடைசி வரி, `` புதிய_டாக்ஸ்``, இந்த விஷயத்தில் கண்டிப்பாக அவசியமில்லை, ஏனெனில் `` `` `` `வெளிப்பாடு பட்டியலில் கடைசி டாப்_எக்ஸ்பிரஷனின் மதிப்பை வழங்குகிறது. ஒரு வேலையின் மதிப்பு அதன் வெளிப்பாட்டின் மதிப்பு, எனவே `` `` அறிக்கையின் மதிப்பு `` புதிய_டேக்ஸ்`` க்கு ஒதுக்கப்பட்டது.
zh_cn: 注意：在这种情况下，模板中的最后一行“new_tags”并不是绝对必要的，因为“for”返回表达式列表中最后一个 top_expression 的值。 赋值的值是其表达式的值，因此“for”语句的值就是分配给“new_tags”的值。

source: **Function definition**
ja: **関数の定義**
ta: ** செயல்பாட்டு வரையறை **
zh_cn: **函数定义**

source: If you have code in a template that repeats then you can put that code into a local function. The ``def`` keyword starts the definition. It is followed by the function name, the argument list, then the code in the function. The function definition ends with the ``fed`` keyword.
ja: テンプレートの中に繰り返されるコードがある場合は、そのコードをローカル関数に配置できます。``def`` キーワードで定義を開始します。その後に関数名、引数リスト、関数内のコードが続きます。関数定義は ``fed`` キーワードで終了します。
ta: மீண்டும் மீண்டும் வரும் ஒரு வார்ப்புருவில் குறியீடு இருந்தால், அந்த குறியீட்டை உள்ளூர் செயல்பாட்டில் வைக்கலாம். `` Def`` முக்கிய சொல் வரையறையைத் தொடங்குகிறது. அதைத் தொடர்ந்து செயல்பாட்டு பெயர், வாத பட்டியல், பின்னர் செயல்பாட்டில் உள்ள குறியீடு. செயல்பாட்டு வரையறை `` ஃபெட்`` முக்கிய சொல்லுடன் முடிகிறது.

source: Arguments are positional. When a function is called the supplied arguments are matched left to right against the defined parameters, with the value of the argument assigned to the parameter. It is an error to provide more arguments than defined parameters. Parameters can have default values, such as ``a = 25``. If an argument is not supplied for that parameter then the default value is used, otherwise the parameter is set to the empty string.
ja: 引数はキーワード引数です。関数が呼び出されると、指定された引数が定義されたパラメータに対して左から右に照合され、引数の値がパラメータに割り当てられます。定義されたパラメータよりも多くの引数を指定するとエラーになります。パラメータには、``a = 25`` などのデフォルト値を設定できます。そのパラメータに引数が指定されていない場合はデフォルト値が使用され、それ以外の場合はパラメータが空の文字列に設定されます。
ta: வாதங்கள் நிலை. ஒரு செயல்பாடு என அழைக்கப்படும் போது, வழங்கப்பட்ட வாதங்கள் வரையறுக்கப்பட்ட அளவுருக்களுக்கு எதிராக இடமிருந்து வலமாக பொருந்துகின்றன, அளவுருவுக்கு ஒதுக்கப்பட்ட வாதத்தின் மதிப்பு. வரையறுக்கப்பட்ட அளவுருக்களைக் காட்டிலும் அதிகமான வாதங்களை வழங்குவது பிழை. அளவுருக்கள் `` a = 25`` போன்ற இயல்புநிலை மதிப்புகளைக் கொண்டிருக்கலாம். அந்த அளவுருவுக்கு ஒரு வாதம் வழங்கப்படாவிட்டால், இயல்புநிலை மதிப்பு பயன்படுத்தப்படுகிறது, இல்லையெனில் அளவுரு வெற்று சரத்திற்கு அமைக்கப்படுகிறது.
zh_cn: 参数是立场性的。 调用函数时，提供的参数会从左到右与定义的参数进行匹配，并将参数的值分配给参数。 提供的参数多于定义的参数是错误的。 参数可以有默认值，例如“a = 25”。 如果没有为该参数提供参数，则使用默认值，否则该参数将设置为空字符串。

source: The ``return`` statement can be used in a local function.
ja: ``return`` 文はローカル関数の中で使用できます。
ta: `` திரும்ப`` அறிக்கையை உள்ளூர் செயல்பாட்டில் பயன்படுத்தலாம்.
zh_cn: return 语句可以在局部函数中使用。

source: A function must be defined before it can be used.
ja: 関数は、使用する前に定義する必要があります。
ta: ஒரு செயல்பாடு பயன்படுத்தப்படுவதற்கு முன்பு வரையறுக்கப்பட வேண்டும்.
zh_cn: 函数必须先定义才能使用。

source: Example: This template computes an approximate duration in years, months, and days from a number of days. The function ``to_plural()`` formats the computed values. Note that the example also uses the ``&`` operator::
ja: 例: このテンプレートは、日数から年、月、日でおおよその期間を計算します。関数 `to_plural()`` は、計算された値を整形します。ただしこの例では``&`` 演算子も使用してます::eo
ta: எடுத்துக்காட்டு: இந்த வார்ப்புரு பல நாட்களிலிருந்து ஆண்டுகள், மாதங்கள் மற்றும் நாட்களில் தோராயமான காலத்தைக் கணக்கிடுகிறது. `` To_plural () `` கணக்கிடப்பட்ட மதிப்புகளை வடிவமைக்கிறது. எடுத்துக்காட்டு `` & `` ஆபரேட்டர் ::
zh_cn: 示例：此模板根据总天数计算出大概的年、月、日时长。其中 to_plural() 函数用于格式化计算出的数值（处理复数形式）。请注意，此示例还使用了字符串连接符 &::

source: **Relational operators**
ja: **関係演算子**
nl: **Relationele operatoren**
ta: ** தொடர்புடைய ஆபரேட்டர்கள் **
zh_cn: **关系运算符**

source: Relational operators return ``'1'`` if the comparison is true, otherwise the empty string ('').
ja: 関係演算子は、比較が真なら ``'1'``を返し、そうでなければ空の文字列 ('') を返します。
nl: Relationele operatoren geven ``'1'`` terug als de vergelijking waar is, anders de lege string ('').
ta: தொடர்புடைய ஆபரேட்டர்கள் ஒப்பீடு உண்மையாக இருந்தால் `` '1'`` திருப்பித் தருகின்றன, இல்லையெனில் வெற்று சரம் (' ').

source: There are two forms of relational operators: string comparisons and numeric comparisons.
ja: 関係演算子は 2 種類あり、それは文字列比較と数値比較です。
nl: Er zijn twee soorten relationele operatoren: string vergelijkingen en numerieke vergelijkingen.
ta: தொடர்புடைய ஆபரேட்டர்களின் இரண்டு வடிவங்கள் உள்ளன: சரம் ஒப்பீடுகள் மற்றும் எண் ஒப்பீடுகள்.
zh_cn: 关系运算符有两种形式：字符串比较和数值比较。

source: String comparisons do case-insensitive string comparison using lexical order. The supported string comparison operators are ``==``, ``!=``, ``<``, ``<=``, ``>``, ``>=``, ``in``, and ``inlist``. For the ``in`` operator, the result of the left hand expression is interpreted as a regular expression pattern. The ``in`` operator is True if the value of left-hand regular expression matches the value of the right hand expression. The ``inlist`` operator is true if the left hand regular expression matches any one of the items in the right hand list where the items in the list are separated by commas. The matches are case-insensitive.
ja: 文字列の比較では、大文字と小文字を区別しない文字列比較を辞書順で行います。サポートされている文字列比較演算子は、``==``, ``!=``, ``<``, ``<=``, ``>``, ``>=``, ``in``, および ``inlist`` です。 ``in`` 演算子の場合、左側の式の結果は正規表現パターンとして解釈されます。左側の正規表現の値が右側の式の値とマッチする場合、``in`` 演算子は True です。左側の正規表現が、リスト内の項目がカンマで区切られている右側のリスト内の項目のいずれかにマッチする場合、``inlist`` 演算子は True です。マッチには大文字と小文字は区別されません。
nl: String vergelijkingen doen hoofdletterongevoelige string vergelijking in lexicale volgorde. De ondersteunde vergelijkingsoperatoren zijn ``==``, ``!=``, ``<``, ``<=``, ``>``, ``>=``, ``in``, en ``inlist``. Voor de ``in`` operator wordt het resultaat van de linkse expressie geïnterpreteerd als een reguliere expressie patroon. De ``in`` operator is Waar als de waarde van de linkse reguliere expressie overeenkomt met de waarde van de rechtse reguliere expressie. De ``inlist`` operator is Waar als de linkse reguliere expressie overeenkomt met eender welk item in de rechtse lijst waar de items in de lijst gescheiden zijn door komma's. De overeenkomsten zijn hoofdletterongevoelige.
ta: சரம் ஒப்பீடுகள் லெக்சிகல் வரிசையைப் பயன்படுத்தி வழக்கு-உணர்வற்ற சரம் ஒப்பீடு செய்கின்றன. ஆதரிக்கப்படும் சரம் ஒப்பீட்டு ஆபரேட்டர்கள் `` == ``, ``! `, மற்றும்` `inlist``. `` இன்` ஆபரேட்டருக்கு, இடது கை வெளிப்பாட்டின் விளைவாக ஒரு வழக்கமான வெளிப்பாடு வடிவமாக விளக்கப்படுகிறது. இடது கை வழக்கமான வெளிப்பாட்டின் மதிப்பு வலது கை வெளிப்பாட்டின் மதிப்புடன் பொருந்தினால் `` இன்`` ஆபரேட்டர் உண்மை. இடது கை வழக்கமான வெளிப்பாடு வலது கை பட்டியலில் உள்ள எந்தவொரு உருப்படிகளையும் கம்மாக்களால் பிரிக்கக்கூடியதாக இருந்தால் `` inlist`` ஆபரேட்டர் உண்மை. போட்டிகள் வழக்கு-உணர்வற்றவை.

source: The numeric comparison operators are ``==#``, ``!=#``, ``<#``, ``<=#``, ``>#``, ``>=#``. The left and right expressions must evaluate to numeric values with two exceptions: both the string value "None" (undefined field) and the empty string evaluate to the value zero.
ja: 数値比較演算子は、``==#``, ``!=#``, ``<#``, ``<=#``, ``>#``, ``>=#`` です。左と右の式は、2 つの例外を除いて数値に評価される必要があります。文字列値 "None" (未定義のフィールド) と空の文字列の両方が値ゼロに評価されます。
nl: De numerieke vergelijkingsoperatoren zijn ``==#``, ``!=#``, ``<#``, ``<=#``, ``>#``, ``>=#``. De links en rechts expressies moeten evalueren naar numerieke waarden met twee uitzonderingen: zowel de string waarde "None" (niet gedefinieerd veld) en de lege string evalueren naar de waarde nul.
ta: எண் ஒப்பீட்டு ஆபரேட்டர்கள் `` ==#``, ``! . இடது மற்றும் வலது வெளிப்பாடுகள் இரண்டு விதிவிலக்குகளுடன் எண் மதிப்புகளுக்கு மதிப்பீடு செய்ய வேண்டும்: சரம் மதிப்பு "எதுவுமில்லை" (வரையறுக்கப்படாத புலம்) மற்றும் வெற்று சரம் ஆகிய இரண்டும் மதிப்பு பூஜ்ஜியத்திற்கு மதிப்பீடு செய்கின்றன.
zh_cn: 数值比较运算符包括 ==#、!=#、<#、<=#、># 和 >=#。左侧和右侧的表达式必须计算为数值，但有两个例外：字符串值 "None"（未定义字段）和空字符串都会被视为数值 0。

source: ``program: field('series') == 'foo'`` returns ``'1'`` if the book's series is 'foo', otherwise ``''``.
ja: ``program: field('series') == 'foo'`` は本のシリーズが 'foo' であれば ``'1'`` を返し、そうでなければ ``''`` を返します。
nl: ``program: field('series') == 'foo'`` geett ``'1'`` terug als het boek z'n serie 'foo' is, anders ``''``.
ta: `` நிரல்: புலம் ('தொடர்') == 'foo'`` புத்தகத்தின் தொடர்' foo 'என்றால் ``' 1'` திரும்பும், இல்லையெனில் `` '' ``.
