Repository: debian-calibre/calibre
Catalog: translations/manual/*/template_lang.po
Languages: ja, nl, ta, zh_cn

source: ``MMMM :`` the long localized month name (e.g. "January" to "December").
ja: ``MMMM :`` ローカライズされた月の正式名 (例: "January" to "December").
nl: ``MMMM :`` de voluit gelokaliseerde maandnaam (bv. "januari" tot "december").
ta: `` எம்.எம்.எம்: `` நீண்ட உள்ளூர்மயமாக்கப்பட்ட மாத பெயர் (எ.கா. "ஜனவரி" முதல் "டிசம்பர்" வரை).

source: ``yy :`` the year as two digit number (00 to 99).
ja: ``yy :`` 2 桁の数字としての年 (00 から 99)
nl: ``yy :`` het jaar als tweecijferig getal (00 tot 99).
ta: `` yy: `` ஆண்டு இரண்டு இலக்க எண்ணாக (00 முதல் 99 வரை).

source: ``yyyy :`` the year as four digit number.
ja: ``yyyy :`` 4 桁の数字としての年
nl: ``yyyy :`` het jaar als viercijferig getal.
ta: `` yyyy: `` ஆண்டு நான்கு இலக்க எண்ணாக.

source: ``h :`` the hours without a leading 0 (0 to 11 or 0 to 23, depending on am/pm)
ja: ``h :`` 先行ゼロのない時間 (am/pm に応じて 0 から 11 または 0 から 23)
nl: ``h :`` de uren zonder voorloopnul (0 tot 11 of 0 tot 23, afhankelijk van am/pm)
ta: `` எச்: `` ஒரு முன்னணி 0 (0 முதல் 11 அல்லது 0 முதல் 23 வரை, AM/PM ஐப் பொறுத்து)

source: ``hh :`` the hours with a leading 0 (00 to 11 or 00 to 23, depending on am/pm)
ja: ``hh :`` 先行ゼロ付きの時間 (am/pm に応じて 00 から 11 または 00 から 23)
nl: ``hh :`` de uren met voorloopnul (00 tot 11 of 00 tot 23, afhankelijk van am/pm)
ta: `` HH: `` ஒரு முன்னணி 0 (00 முதல் 11 அல்லது 00 முதல் 23 வரை, AM/PM ஐப் பொறுத்து)

source: ``m :`` the minutes without a leading 0 (0 to 59)
ja: ``m :`` 先行ゼロのない分 (0 から 59)
nl: ``m :`` de minuten zonder voorloopnul (0 tot 59)
ta: `` எம்: `` ஒரு முன்னணி 0 (0 முதல் 59 வரை) இல்லாமல் நிமிடங்கள்

source: ``mm :`` the minutes with a leading 0 (00 to 59)
ja: ``mm :`` 先行ゼロ付きの分 (00 から 59)
nl: ``mm :`` de minuten met voorloopnul (00 tot 59)
ta: `` மிமீ: `` ஒரு முன்னணி 0 (00 முதல் 59 வரை) கொண்ட நிமிடங்கள்

source: ``s :`` the seconds without a leading 0 (0 to 59)
ja: ``s :`` 先行ゼロのない秒 (0 から 59)
nl: ``s :`` de seconden zonder voorloopnul (0 tot 59)
ta: `` என்பது: `` ஒரு முன்னணி 0 (0 முதல் 59 வரை) இல்லாமல் விநாடிகள்

source: ``ss :`` the seconds with a leading 0 (00 to 59)
ja: ``ss :`` 先行ゼロ付きの秒 (00 から 59)
nl: ``ss :`` de seconden met voorloopnul (00 tot 59)
ta: `` எஸ்.எஸ்: `` ஒரு முன்னணி 0 (00 முதல் 59 வரை) வினாடிகள்

source: ``ap :`` use a 12-hour clock instead of a 24-hour clock, with 'ap' replaced by the localized string for am or pm.
ja: ``ap :`` 24時間制ではなく12時間制を使用し、 'ap' を午前または午後のローカライズされた文字列に置き換えます。
nl: ``ap :`` gebruik een 12-uur klok i.p.v. een 24-uur klok, met 'ap' vervangen door de gelokaliseerde string voor am of pm.
ta: `` AP: `` 24 மணி நேர கடிகாரத்திற்கு பதிலாக 12 மணிநேர கடிகாரத்தைப் பயன்படுத்தவும், 'AP' உடன் AM அல்லது PM க்கு உள்ளூர்மயமாக்கப்பட்ட சரத்தால் மாற்றப்பட்டது.

source: ``AP :`` use a 12-hour clock instead of a 24-hour clock, with 'AP' replaced by the localized string for AM or PM.
ja: ``AP :`` 24時間制ではなく12時間制を使用し、'AP' を AM または PM のローカライズされた文字列に置き換えます。
nl: ``AP :`` gebruik een 12-uur klok i.p.v. een 24-uur klok, met 'AP' vervangen door de gelokaliseerde string voor AM of PM.
ta: `` AP: `` 24 மணி நேர கடிகாரத்திற்கு பதிலாக 12 மணிநேர கடிகாரத்தைப் பயன்படுத்தவும், 'AP' உடன் AM அல்லது PM க்கு உள்ளூர்மயமாக்கப்பட்ட சரத்தால் மாற்றப்பட்டது.

source: ``iso :`` the date with time and timezone. Must be the only format present.
ja: ``iso :`` 時間とタイムゾーンのある日付。単独で使用すること。
nl: ``iso :`` de datum met tijd en tijdzone. Moet als enige formaat aanwezig zijn.
ta: `` ஐஎஸ்ஓ: `` நேரம் மற்றும் நேர மண்டலத்துடன் தேதி. ஒரே வடிவமாக இருக்க வேண்டும்.

source: ``to_number :`` convert the date & time into a floating point number (a `timestamp`)
ja: ``to_number :`` 日付と時刻を浮動小数点数 (`タイムスタンプ`) に変換します
nl: ``to_number :`` converteer de datum & tijd in een floating point getal (een `tijdstempel`)
ta: `` to_number: `` தேதி மற்றும் நேரத்தை மிதக்கும் புள்ளி எண்ணாக மாற்றவும் (ஒரு `நேர முத்திரை)

source: ``from_number :`` convert a floating point number (a `timestamp`) into an ``iso`` formatted date. If you want a different date format then add the desired formatting string after ``from_number`` and a colon (``:``). Example: ``from_number:MMM dd yyyy``
ja: ``from_number :`` 浮動小数点数 (`タイムスタンプ`) を ``iso`` 書式の日付に変換します。別の日付書式が必要な場合は、``from_number`` とコロン (``:``)の後に目的の書式文字列を追加します。例: ``from_number:MMM dd yyyy``
nl: ``from_number :`` converteer een floating point getal (een `tijdstempel`) in een ``iso`` opgemaakte datum. Als u een ander datumformaat wilt, voeg de gewenste opmaakstring toe na ``from_number`` en een dubbel punt (``:``). Bv: ``from_number:MMM dd yyyy``
ta: `` from_number: `` ஒரு மிதக்கும் புள்ளி எண்ணை (ஒரு `நேர முத்திரை) ஒரு` `ஐசோ`` வடிவமைக்கப்பட்ட தேதியாக மாற்றவும். நீங்கள் வேறு தேதி வடிவமைப்பை விரும்பினால், விரும்பிய வடிவமைப்பு சரத்தை `` from_number`` மற்றும் ஒரு பெருங்குடலுக்கும் (``: ``) சேர்க்கவும். எடுத்துக்காட்டு: `` from_number: mmm dd yyyy``

source: You might get unexpected results if the date you are formatting contains localized month names, which can happen if you changed the date format tweaks to contain ``MMMM``. In this case, instead of using the ``field()`` function as in::
ja: 整形する日付にローカライズされた月の名前が含まれていると、予期しない結果が生じる可能性があります。これは、日付書式の tweak を ``MMMM`` を含むように変更した場合に発生する可能性があります。この場合、代わりに ``field()`` 関数を次のように使用します::
nl: U kan onverwachte resultaten krijgen bij opmaken van een datum met gelokaliseerde maandnamen. Dit kan gebeuren als u de datumopmaak tweaks veranderde om ``MMMM`` te bevatten. In dit geval, i.p.v. de ``field()`` functie te gebruiken zoals in::
ta: நீங்கள் வடிவமைக்கும் தேதியில் உள்ளூர்மயமாக்கப்பட்ட மாத பெயர்களைக் கொண்டிருந்தால் நீங்கள் எதிர்பாராத முடிவுகளைப் பெறலாம், இது தேதி வடிவ மாற்றங்களை `` எம்.எம்.எம்.எம்`` கொண்டிருக்கும். இந்த வழக்கில், `` புலம் () `` செயல்பாட்டைப் பயன்படுத்துவதற்குப் பதிலாக ::

source: use the ``raw_field()`` function as in::
ja: 次のように ``raw_field()`` 関数を使用します::
nl: gebruik de ``raw_field()`` functie zoals in::
ta: `` ரா_ஃபீல்ட் () `` செயல்பாட்டைப் பயன்படுத்தவும் ::

source: ``format_date_field(field_name, format_string)`` -- format the value in the field ``field_name``, which must be the lookup name of date field, either standard or custom. See ``format_date()`` for the formatting codes. This function is much faster than format_date and should be used when you are formatting the value in a field (column). It can't be used for computed dates or dates in string variables. Examples::
ta: `` format_date_field (field_name, format_string) `` - புலத்தில் மதிப்பை வடிவமைக்கவும் `` field_name``, இது தேதி புலத்தின் தேடல் பெயராக இருக்க வேண்டும், தரநிலை அல்லது தனிப்பயன். வடிவமைப்பு குறியீடுகளுக்கு `` format_date () `` ஐப் பார்க்கவும். இந்த செயல்பாடு format_date ஐ விட மிக வேகமாக உள்ளது மற்றும் நீங்கள் ஒரு புலத்தில் (நெடுவரிசை) மதிப்பை வடிவமைக்கும்போது பயன்படுத்தப்பட வேண்டும். கணக்கிடப்பட்ட தேதிகள் அல்லது சரம் மாறிகளில் தேதிகளுக்கு இதைப் பயன்படுத்த முடியாது. எடுத்துக்காட்டுகள் ::

source: ``formats_modtimes(date_format_string)`` -- return a comma-separated list of colon-separated items ``FMT:DATE`` representing modification times for the formats of a book. The ``date_format_string`` parameter specifies how the date is to be formatted. See the ``format_date()`` function for details. You can use the ``select`` function to get the modification time for a specific format. Note that format names are always uppercase, as in EPUB.
ja: ``formats_modtimes(date_format_string)`` -- コロンで区切られたアイテムのコンマ区切りのリストを返します。 ``FMT:DATE`` は、本の形式の変更時刻を表します。 ``date_format_string`` パラメータは、日付の整形方法を指定します。詳しくは ``format_date()`` 関数を参照してください。``select`` 関数を使用すると、特定の形式の変更時刻を取得できます。 EPUB のように、形式名は常に大文字となります。
nl: ``formats_modtimes(date_format_string)`` -- geeft een komma-gescheiden lijst van door streepjes gescheiden items terug die de wijzigingsdata van de formaten van een boek weergeven. De ``date_format_string`` parameter geeft aan hoe de datum geformatteerd moet worden. Zie de ``format_date()`` functie voor details. U kunt de ``select`` functie gebruiken om de wijzigingsdatum van een specifiek formaat op te vragen. Let op dat formaatnamen altijd in hoofdletters zijn, zoals EPUB.
ta: `` `` formats_modtimes (date_format_string) ``-ஒரு புத்தகத்தின் வடிவங்களுக்கான மாற்றியமைக்கும் நேரங்களைக் குறிக்கும் கோலால் பிரிக்கப்பட்ட பொருட்களின் கமாவால் பிரிக்கப்பட்ட பட்டியலைக் குறிக்கும். `` Date_format_string`` அளவுரு தேதி எவ்வாறு வடிவமைக்கப்பட வேண்டும் என்பதைக் குறிப்பிடுகிறது. விவரங்களுக்கு `` format_date () `` செயல்பாட்டைக் காண்க. ஒரு குறிப்பிட்ட வடிவமைப்பிற்கான மாற்ற நேரத்தைப் பெற நீங்கள் `` தேர்ந்தெடுக்கப்பட்ட`` செயல்பாட்டைப் பயன்படுத்தலாம். வடிவமைப்பு பெயர்கள் எப்போதும் EPUB இல் உள்ளதைப் போல பெரிய எழுத்துக்கள் என்பதை நினைவில் கொள்க.

source: ``formats_paths()`` -- return a comma-separated list of colon-separated items ``FMT:PATH`` giving the full path to the formats of a book. You can use the select function to get the path for a specific format. Note that format names are always uppercase, as in EPUB.
ja: ``formats_paths()`` -- コロンで区切られたアイテムのコンマ区切りのリストを返します。``FMT:PATH`` は、本の形式へのフルパスを示します。 select 関数を使用すると、特定の形式のパスを取得できます。 EPUB のように、形式名は常に大文字となります。
nl: ``formats_paths()`` -- geeft een komma gescheiden lijst van streepjes gescheiden ``FMT:PATH`` items terug met het volledige pad naar de formaten van een boek. U kunt de select functie gebruiken om het pad naar een specifiek formaat te krijgen. Let op dat formaatnamen altijd in hoofdletters zijn, zoals EPUB.
ta: `` `formats_paths ()` `-ஒரு புத்தகத்தின் வடிவங்களுக்கான முழு பாதையையும் கொடுக்கும் பெருங்குடல்-பிரிக்கப்பட்ட பொருட்களின் கமாவால் பிரிக்கப்பட்ட பொருட்களின் பட்டியலைத் தரவும். ஒரு குறிப்பிட்ட வடிவமைப்பிற்கான பாதையைப் பெற நீங்கள் தேர்ந்தெடுக்கப்பட்ட செயல்பாட்டைப் பயன்படுத்தலாம். வடிவமைப்பு பெயர்கள் எப்போதும் EPUB இல் உள்ளதைப் போல பெரிய எழுத்துக்கள் என்பதை நினைவில் கொள்க.

source: ``formats_sizes()`` -- return a comma-separated list of colon-separated ``FMT:SIZE`` items giving the sizes in bytes of the formats of a book. You can use the select function to get the size for a specific format. Note that format names are always uppercase, as in EPUB.
ja: ``formats_sizes()`` -- コロンで区切られたFMT：SIZEアイテムのコンマ区切りのリストを返し、本の形式のサイズをバイト単位で示します。 select 関数を使用して、特定の形式のサイズを取得できます。 EPUB のように、形式名は常に大文字となります。
nl: ``formats_sizes()`` -- geeft een komma gescheiden lijst van streepjes gescheiden ``FMT:PATH`` items met de grootte van de formaten van een boek in bytes. U kunt de select functie gebruiken om de grootte van een specifiek formaat te krijgen. Let op dat formaatnamen altijd in hoofdletters zijn, zoals EPUB.
ta: `` `formats_sizes ()` `-ஒரு புத்தகத்தின் வடிவங்களின் பைட்டுகளில் அளவைக் கொடுக்கும் கோலால் பிரிக்கப்பட்ட` `எஃப்எம்டி: அளவு`` உருப்படிகளின் கமாவால் பிரிக்கப்பட்ட பட்டியலைத் தரவும். ஒரு குறிப்பிட்ட வடிவமைப்பிற்கான அளவைப் பெற நீங்கள் தேர்ந்தெடுக்கப்பட்ட செயல்பாட்டைப் பயன்படுத்தலாம். வடிவமைப்பு பெயர்கள் எப்போதும் EPUB இல் உள்ளதைப் போல பெரிய எழுத்துக்கள் என்பதை நினைவில் கொள்க.

source: ``fractional_part(x)`` -- returns the value after the decimal point. For example, ``fractional_part(3.14)`` returns ``0.14``. Throws an exception if ``x`` is not a number.
ja: ``fractional_part(x)`` -- 小数点以下の値を返します。たとえば ``fractional_part(3.14)`` は ``0.14`` を返します。``x`` が数値でない場合、例外をスローします。
nl: ``fractional_part(x)`` -- geeft de waarde na het decimale punt. Bv. ``fractional_part(3.14)`` geeft ``0.14`` terug. Gooit een uitzondering als ``x`` geen getal is.
ta: `` Fractional_Part (x) `` - தசம புள்ளிக்குப் பிறகு மதிப்பை வழங்குகிறது. எடுத்துக்காட்டாக, `` பின்னம்_பார்ட் (3.14) `` திரும்பும் `` 0.14``. `` X`` ஒரு எண் இல்லையென்றால் விதிவிலக்கை வீசுகிறது.

source: ``get_link(field_name, field_value)`` -- fetch the link for field ``field_name`` with value ``field_value``. If there is no attached link, return the empty string. Examples:
ta: `` get_link (field_name, field_value) `` - `` field_name` `` field_value`` உடன் புலத்திற்கான இணைப்பைப் பெறுங்கள். இணைக்கப்பட்ட இணைப்பு இல்லை என்றால், வெற்று சரத்தை திருப்பி விடுங்கள். எடுத்துக்காட்டுகள்:

source: The following returns the link attached to the tag ``Fiction``::
ta: `` புனைகதை`` என்ற குறிச்சொல்லுடன் இணைக்கப்பட்ட இணைப்பை பின்வருபவை வழங்குகிறது

source: This template makes a list of the links for all the tags associated with a book in the form ``value:link, ...``::
ta: இந்த வார்ப்புரு `` மதிப்பு: இணைப்பு, ... `` ::

source: ``has_cover()`` -- return ``'Yes'`` if the book has a cover, otherwise the empty string.
ja: ``has_cover()`` -- 本に表紙があれば ``'Yes'`` を返し、そうでなければ空の文字列を返します。
nl: ``has_cover()`` -- geeft ``'Yes'`` terug als het boek een omslag heeft, anders de lege string.
ta: `` has_cover () `` - புத்தகத்தில் ஒரு கவர் இருந்தால் `` 'ஆம்'`` திரும்பவும், இல்லையெனில் வெற்று சரம்.

source: ``has_extra_files([pattern])`` -- returns the count of extra files, otherwise '' (the empty string). If the optional parameter ``pattern`` (a regular expression) is supplied then the list is filtered to files that match ``pattern`` before the files are counted. The pattern match is case insensitive. See also the functions ``extra_file_names()``, ``extra_file_size()`` and ``extra_file_modtime()``. This function can be used only in the GUI.
ta: `` has_extra_files ([முறை]) `` - கூடுதல் கோப்புகளின் எண்ணிக்கையை வழங்குகிறது, இல்லையெனில் '' (வெற்று சரம்). விருப்ப அளவுரு `` முறை`` (ஒரு வழக்கமான வெளிப்பாடு) வழங்கப்பட்டால், கோப்புகள் கணக்கிடப்படுவதற்கு முன்பு `` முறை`` பொருந்தக்கூடிய கோப்புகளுக்கு பட்டியல் வடிகட்டப்படுகிறது. முறை போட்டி என்பது உணர்ச்சியற்றது. `` எக்ஸ்ட்ரா_ஃபைல்_பேன்ஸ் () ``, `` எக்ஸ்ட்ரா_ஃபைல்_சிஸ் () `` `மற்றும்` `எக்ஸ்ட்ரா_ஃபைல்_மோட் டைம் ()` `ஆகிய செயல்பாட்டுகளையும் காண்க. இந்த செயல்பாட்டை GUI இல் மட்டுமே பயன்படுத்த முடியும்.

source: ``identifier_in_list(val, id_name [, found_val, not_found_val])`` -- treat ``val`` as a list of identifiers separated by commas. An identifier has the format ``id_name:value``. The ``id_name`` parameter is the id_name text to search for, either ``id_name`` or ``id_name:regexp``. The first case matches if there is any identifier matching that id_name. The second case matches if id_name matches an identifier and the regexp matches the identifier's value. If ``found_val`` and ``not_found_val`` are provided then if there is a match then return ``found_val``, otherwise return ``not_found_val``. If ``found_val`` and ``not_found_val`` are not provided then if there is a match then return the ``identifier:value`` pair, otherwise the empty string (``''``).
ta: `` அடையாளங்காட்டி_இன்_லிஸ்ட் (VAL, ID_NAME [, find_val, not_found_val]) `` - காற்புள்ளிகளால் பிரிக்கப்பட்ட அடையாளங்காட்டிகளின் பட்டியலாக `` வால்`` க்கு சிகிச்சையளிக்கவும். ஒரு அடையாளங்காட்டிக்கு `` ஐடி_நேம்: மதிப்பு`` வடிவத்தைக் கொண்டுள்ளது. `` Id_name`` அளவுரு என்பது `` id_name`` அல்லது `` id_name: regexp`` தேட வேண்டிய ID_NAME உரை. ID_NAME உடன் பொருந்தக்கூடிய அடையாளங்காட்டி ஏதேனும் இருந்தால் முதல் வழக்கு பொருந்துகிறது. ID_NAME ஒரு அடையாளங்காட்டியுடன் பொருந்தினால் இரண்டாவது வழக்கு பொருந்துகிறது மற்றும் REGEXP அடையாளங்காட்டியின் மதிப்புடன் பொருந்துகிறது. `` Fent_val`` மற்றும் `` not_found_val`` வழங்கப்பட்டால், ஒரு பொருத்தம் இருந்தால், `` find_val`` ஐத் தரவும், இல்லையெனில் `` not_found_val`` ஐத் தரவும். `` Fent_val`` மற்றும் `` not_found_val`` வழங்கப்படாவிட்டால், ஒரு பொருத்தம் இருந்தால், `` அடையாளங்காட்டி: மதிப்பு`` ஜோடியைத் திருப்பித் தரவும், இல்லையெனில் வெற்று சரம் (`` '' ``).

source: ``is_marked()`` -- check whether the book is `marked` in calibre. If it is then return the value of the mark, either ``'true'`` (lower case) or a comma-separated list of named marks. Returns ``''`` (the empty string) if the book is not marked. This function works only in the GUI.
ja: ``is_marked()`` -- 本が calibre でマークされているかどうかを確認します。マークされていればマークの値を返します。マークの値は ``'true'`` (小文字) または名前付きマークのコンマ区切りリストのいずれかです。本がマークされていない場合は、 ``''`` (空の文字列) を返します。この機能は GUI でのみ機能します。
nl: ``is_marked()`` -- controleer of het boek `gemarkeerd` is in calibre. Indien ja, geef de waarde van de markering terug, ofwel ``'true'`` (kleine letters) of een kommagescheiden lijst van benoemde markeringen. Geeft ``''`` (de lege string) terug als het boek niet gemarkeerd is. Deze functie werkt enkel in de GUI.
ta: `` is_marked () `` - புத்தகம் `குறிக்கப்பட்டதா` காலிபரில் உள்ளதா என்பதைச் சரிபார்க்கவும். அது இருந்தால், அடையாளத்தின் மதிப்பை, `` 'உண்மை'`` (கீழ் வழக்கு) அல்லது பெயரிடப்பட்ட மதிப்பெண்களின் கமாவால் பிரிக்கப்பட்ட பட்டியல். புத்தகம் குறிக்கப்படாவிட்டால் `` '' `` (வெற்று சரம்) திரும்பும். இந்த செயல்பாடு GUI இல் மட்டுமே செயல்படுகிறது.

source: ``language_codes(lang_strings)`` -- return the `language codes <https://www.loc.gov/standards/iso639-2/php/code_list.php>`_ for the language names passed in `lang_strings`. The strings must be in the language of the current locale. ``Lang_strings`` is a comma-separated list.
ja: ``language_codes(lang_strings)`` -- `lang_strings`で渡された言語名の `言語コード <https://www.loc.gov/standards/iso639-2/php/code_list.php>`_ を返します。文字列は、現在のロケールの言語でなくてはなりません。``Lang_strings`` はコンマ区切りのリストです。
nl: ``language_codes(lang_strings)`` -- geef de `taalcodes <https://www.loc.gov/standards/iso639-2/php/code_list.php>`_ terug voor de taalnamen doorgegeven in `lang_strings`. De strings moeten in de taal van de huidige locale zijn. ``Lang_strings`` is een kommagescheiden lijst.
ta: `` மொழி_ குறியீடுகள் (lang_strings) ``-`மொழி குறியீடுகளைத் திருப்பி விடுங்கள் சரங்கள் தற்போதைய இடத்தின் மொழியில் இருக்க வேண்டும். `` Lang_strings`` என்பது கமாவால் பிரிக்கப்பட்ட பட்டியல்.

source: ``list_contains(value, separator, [ pattern, found_val, ]* not_found_val)`` -- (Alias of ``in_list``) Interpreting the value as a list of items separated by ``separator``, evaluate the ``pattern`` against each value in the list. If the ``pattern`` matches any value then return ``found_val``, otherwise return ``not_found_val``. The ``pattern`` and ``found_value`` can be repeated as many times as desired, permitting returning different values depending on the search. The patterns are checked in order. The first match is returned. Aliases: ``in_list()``, ``list_contains()``
ja: ``list_contains(value, separator, [ pattern, found_val, ]* not_found_val)`` -- (in_list の別名) 値を ``separator`` で区切られた項目のリストとして解釈し、リスト内の各値に対して ``pattern`` を評価します。``pattern`` がいずれかの値とマッチすれば ``found_val`` を返し、そうでなければ ``not_found_val`` を返します。``pattern`` と ``found_value`` は必要な回数だけ繰り返すことができ、検索によって異なる値を返すことができます。patterm は順番にチェックされます。最初のマッチが返されます。別名: ``in_list()``, ``list_contains()``
nl: ``list_contains(value, separator, [ pattern, found_val, ]* not_found_val)`` -- (Alias van ``in_list``) Interpreteert de waarde als een lijst met items gescheiden door ``separator``, evalueert het ``pattern`` tegen elke waarde in de lijst. Als het ``pattern`` overeen komt met een waarde komt ``found_val`` terug, anders ``not_found_val``. De ``pattern`` en ``found_value`` kunnen zo vaak als gewenst herhaald worden, toelatend verschillende waarden terug te geven, afhankelijk van de zoekopdracht. De patterns worden op volgorde gecontroleerd. De eerste overeenkomst wordt terug gegeven. Aliassen: ``in_list()``, ``list_contains()``
ta: `` list_contains (மதிப்பு, பிரிப்பான், [முறை, ஃபவுண்ட்_வல்,]* not_found_val) `` - (`` in_list``` இன் மாற்றுப்பெயர்) `` பிரிப்பான்`` ஆல் பிரிக்கப்பட்ட பொருட்களின் பட்டியலாக மதிப்பை விளக்குகிறது, `` `` ` பட்டியலில் உள்ள ஒவ்வொரு மதிப்பிற்கும் எதிராக மாதிரி``. `` முறை` `எந்த மதிப்பையும் பொருத்தினால்,` `find_val`` ஐத் தரவும், இல்லையெனில்` `not_found_val`` ஐத் தரவும். `` முறை`` மற்றும் `` ஃபென்ட்_வல்யூ`` ஆகியவற்றை விரும்பிய பல முறை மீண்டும் மீண்டும் செய்யலாம், தேடலைப் பொறுத்து வெவ்வேறு மதிப்புகளைத் தர அனுமதிக்கிறது. வடிவங்கள் வரிசையில் சரிபார்க்கப்படுகின்றன. முதல் போட்டி திரும்பியது. மாற்றுப்பெயர்கள்: `` in_list () ``, `` list_contains () ``

source: ``list_count(value, separator)`` -- interprets ``value`` as a list of items separated by ``separator``, returning the count of items in the list. Aliases: ``count()``, ``list_count()``
ja: ``list_count(value, separator)`` -- ``value`` を ``separator`` で区切られた項目のリストとして解釈し、リスト内の項目の数を返します。別名: ``count()``, ``list_count()``
nl: ``list_count(value, separator)`` -- interpreteert ``value`` als een lijst met items gescheiden door ``separator``, geeft het aantal items in de lijst terug. Aliassen: ``count()``, ``list_count()``
ta: `` list_count (மதிப்பு, பிரிப்பான்) `` - `` பிரிப்பான்`` ஆல் பிரிக்கப்பட்ட பொருட்களின் பட்டியலாக `` மதிப்பு` ஆகியவற்றை விளக்குகிறது, பட்டியலில் உள்ள உருப்படிகளின் எண்ணிக்கையைத் திருப்பித் தருகிறது. மாற்றுப்பெயர்கள்: `` கவுண்ட் () ``, `` பட்டியல்_கவுண்ட் () ``

source: ``list_count_matching(list, pattern, separator)`` -- interprets ``list`` as a list of items separated by ``separator``, returning the number of items in the list that match the regular expression ``pattern``. Aliases: ``list_count_matching()``, ``count_matching()``
ja: ``list_count_matching(list, pattern, separator)`` -- ``list`` を ``separator`` で区切られた項目のリストとして解釈し、正規表現 ``pattern`` にマッチするリスト内の項目の数を返します。別名: ``list_count_matching()``, ``count_matching()``
nl: ``list_count_matching(list, pattern, separator)`` -- interpreteert ``lijst`` als een lijst met items gescheiden door ``separator``, geeft het aantal items in de lijst terug die overeenkomen met de reguliere expressie ``pattern``. Aliassen: ``list_count_matching()``, ``count_matching()``
ta: `` list_count_matching (பட்டியல், முறை, பிரிப்பான்) `` - `` பிரிப்பான்`` ஆல் பிரிக்கப்பட்ட பொருட்களின் பட்டியலாக `` பட்டியல்`` ஐ விளக்குகிறது, வழக்கமான வெளிப்பாட்டுடன் பொருந்தக்கூடிய பட்டியலில் உள்ள உருப்படிகளின் எண்ணிக்கையை திருப்பி அனுப்புகிறது `. மாற்றுப்பெயர்கள்: `` list_count_matching () ``, `` count_matching () ``

source: ``list_difference(list1, list2, separator)`` -- return a list made by removing from ``list1`` any item found in ``list2`` using a case-insensitive comparison. The items in ``list1`` and ``list2`` are separated by separator, as are the items in the returned list.
ja: ``list_difference(list1, list2, separator)`` -- 大文字と小文字を区別しない比較を使用して、``list2`` で見つかった項目を ``list1`` から削除して作成されたリストを返します。 ``list1`` と ``list2`` の項目、および返されたリストの項目は、いずれも separator で区切られます。
nl: ``list_difference(list1, list2, separator)`` -- geeft een lijst terug gemaakt door uit ``list1`` alle item te verwijderen gevonden in ``list2`` waarbij niet hoofdlettergevoelig wordt vergeleken. De items in ``list1`` en ``list2`` zijn gescheiden door separator, net zoals de items in de teruggegeven lijst.
ta: `` list_difference (பட்டியல் 1, பட்டியல் 2, பிரிப்பான்) ``-வழக்கு-உணர்வற்ற ஒப்பீட்டைப் பயன்படுத்தி `` பட்டியல் 2`` இல் காணப்படும் எந்தவொரு பொருளையும் `` பட்டியல் 1`` இலிருந்து அகற்றுவதன் மூலம் செய்யப்பட்ட பட்டியலைத் திருப்பி விடுங்கள். `` பட்டியல் 1`` மற்றும் `பட்டியல் 2`` ஆகியவற்றில் உள்ள உருப்படிகள் பிரிப்பானால் பிரிக்கப்படுகின்றன, திரும்பிய பட்டியலில் உள்ள உருப்படிகள்.

source: ``list_equals(list1, sep1, list2, sep2, yes_val, no_val)`` -- return ``yes_val`` if ``list1`` and `list2` contain the same items, otherwise return ``no_val``. The items are determined by splitting each list using the appropriate separator character (``sep1`` or ``sep2``). The order of items in the lists is not relevant. The comparison is case-insensitive.
ja: ``list_equals(list1, sep1, list2, sep2, yes_val, no_val)`` -- ``list1`` と `list2` に同じ項目が含まれていれば ``yes_val`` を返し、そうでなければ ``no_val`` を返します。項目は、適切な区切り文字 (``sep1`` または ``sep2``) を使用して各リストを分割することによって決定されます。リスト内の項目の順序は関係ありません。比較では大文字と小文字は区別されません。
nl: ``list_equals(list1, sep1, list2, sep2, yes_val, no_val)`` -- geef ``yes_val`` terug als ``list1`` en `list2` dezelfde items bevatten, anders ``no_val``. De items worden bepaald door iedere lijst te splitsen met het juiste scheidingsteken (``sep1`` or ``sep2``). De volgorde van items in de lijst is niet relevant. De vergelijking is hoofdletterongevoelig.
ta: `` பட்டியல்_இகல்கள் (பட்டியல் 1, செப் 1, பட்டியல் 2, செப் 2, ஆம்_வல், இல்லை_வல்) `` - `` பட்டியல் 1`` மற்றும் `பட்டியல் 2` ஆகியவற்றைக் கொண்டிருந்தால்` `ஆம்_வல்`` திரும்பவும், இல்லையெனில் `` இல்லை_வல்`` திரும்பவும். பொருத்தமான பிரிப்பான் எழுத்துக்குறியைப் பயன்படுத்தி ஒவ்வொரு பட்டியலையும் பிரிப்பதன் மூலம் உருப்படிகள் தீர்மானிக்கப்படுகின்றன (`` sep1`` அல்லது `` sep2``). பட்டியல்களில் உள்ள பொருட்களின் வரிசை பொருந்தாது. ஒப்பீடு வழக்கு-உணர்வற்றது.
