Repository: debian-calibre/calibre
Catalog: translations/manual/*/template_lang.po
Languages: ja, nl, ta, zh_cn

source: The slash and the hyphen appear only if series is not empty.
ja: スラッシュとハイフンは、シリーズが空でない場合にのみ表示されます。
ta: தொடர் காலியாக இல்லாவிட்டால் மட்டுமே ஸ்லாஷ் மற்றும் ஹைபன் தோன்றும்.
zh_cn: 斜杠和连字符仅在‘丛书’（series）不为空时才会出现。

source: The lookup function lets us do even fancier processing. For example, assume that if a book has a series, then we want the folder structure `series/series index - title.fmt`. If the book does not have a series then we want the folder structure `genre/author_sort/title.fmt`. If the book has no genre then we want to use 'Unknown'. We want two completely different paths, depending on the value of series.
ja: ルックアップ関数を使用すると、さらに高度な処理を実行できます。たとえば、本にシリーズがあるときにはフォルダ構造を `series/series index - title.fmt` にしたいと仮定します。そして本にシリーズがない場合は、フォルダ構造を `genre/author_sort/title.fmt` にしたいものとします。その本にジャンルがない場合は 'Unknown' を使用します。series の値に応じて、2つの完全に異なるパスが必要です。
ta: தேடல் செயல்பாடு ஆர்வமுள்ள செயலாக்கத்தை கூட செய்ய அனுமதிக்கிறது. எடுத்துக்காட்டாக, ஒரு புத்தகத்தில் ஒரு தொடர் இருந்தால், கோப்புறை கட்டமைப்பை `தொடர்/தொடர் குறியீட்டு - title.fmt` வேண்டும் என்று வைத்துக் கொள்ளுங்கள். புத்தகத்தில் ஒரு தொடர் இல்லையென்றால், `வகை/எழுத்தாளர்_சார்ட்/தலைப்பு. Fmt` என்ற கோப்புறை கட்டமைப்பை நாங்கள் விரும்புகிறோம். புத்தகத்தில் எந்த வகையும் இல்லை என்றால், நாம் 'தெரியாத' பயன்படுத்த விரும்புகிறோம். தொடரின் மதிப்பைப் பொறுத்து இரண்டு முற்றிலும் மாறுபட்ட பாதைகளை நாங்கள் விரும்புகிறோம்.
zh_cn: 查找功能让我们可以进行更高级的处理。 例如，假设一本书有一个系列，那么我们需要文件夹结构“系列/系列索引 - title.fmt”。 如果这本书没有系列，那么我们需要文件夹结构“genre/author_sort/title.fmt”。 如果这本书没有类型，那么我们想使用“未知”。 我们想要两条完全不同的路径，具体取决于系列的值。

source: To accomplish this, we:
ja: これを達成するには:
nl: Om dit te bereiken:
ta: இதை நிறைவேற்ற, நாங்கள்:
zh_cn: 为了实现这一目标，我们需要：

source: Create a composite field (give it lookup name #aa) containing ``{series}/{series_index} - {title}``. If the series is not empty, then this template will produce `series/series_index - title`.
ja: ``{series}/{series_index} - {title}`` を含む複合フィールドを作成します (ルックアップ名 #aa を指定します)。シリーズが空でなければ、このテンプレートは `series/series_index - title` を生成します。
ta: `` {தொடர்}/{sitery_index} - {தலைப்பு} `` ஆகியவற்றைக் கொண்ட ஒரு கலப்பு புலத்தை உருவாக்கவும் (#AA க்கு #AA ஐ கொடுங்கள்). தொடர் காலியாக இல்லாவிட்டால், இந்த வார்ப்புரு `தொடர்/தொடர்_இண்டெக்ஸ் - தலைப்பு` ஐ உருவாக்கும்.
zh_cn: 创建一个复合列（其搜索代号设为 #aa），内容为 {series}/{series_index} - {title}。如果‘丛书’（series）不为空，该模板将生成 series/series_index - title。

source: Create a composite field (give it lookup name #bb) containing ``{#genre:ifempty(Unknown)}/{author_sort}/{title}``. This template produces `genre/author_sort/title`, where an empty genre is replaced with `Unknown`.
ja: ``{#genre:ifempty(Unknown)}/{author_sort}/{title}`` を含む複合フィールドを作成します (ルックアップ名 #bb を指定します)。このテンプレートは `genre/author_sort/title` を生成し、空のジャンルは `Unknown` に置き換えられます。
ta: `` {#Genre: ifempty (அறியப்படாத)}/{auther_sort}/{title} `` கொண்ட ஒரு கலப்பு புலத்தை உருவாக்கவும் (#BB க்கு #BB ஐ கொடுங்கள்) உருவாக்கவும். இந்த வார்ப்புரு `வகை/ஆசிரியர்_சார்ட்/தலைப்பு` ஐ உருவாக்குகிறது, அங்கு வெற்று வகை` தெரியாத` உடன் மாற்றப்படுகிறது.
zh_cn: 创建一个包含“{#genre：ifempty（Unknown）}/{Author_sort}/{title}'的复合字段（为其查找名称#bb）。此模板生成“genre/Author_sort/title”，其中空的genre被“Unknown”替换。

source: Set the save template to ``{series:lookup(.,#aa,#bb}``. This template chooses composite field ``#aa`` if series is not empty and composite field ``#bb`` if series is empty. We therefore have two completely different save paths, depending on whether or not `series` is empty.
ja: 保存するテンプレートを ``{series:lookup(.,#aa,#bb}`` に設定します。このテンプレートは、シリーズが空でない場合は合成フィールド ``#aa`` を選択し、シリーズが空の場合は合成フィールド ``#bb`` を選択します。したがってシリーズが空かどうかによって、2 つの完全に異なる保存パスを持つことになります。
ta: சேமி வார்ப்புருவை `` {தொடர்: தேடல் (.,#Aa,#bb} `` `` `. காலியாக உள்ளது. எனவே `தொடர் 'காலியாக உள்ளதா இல்லையா என்பதைப் பொறுத்து எங்களிடம் முற்றிலும் மாறுபட்ட இரண்டு சேமிப்பு பாதைகள் உள்ளன.

source: Tips
ja: ヒント
ta: உதவிக்குறிப்புகள்
zh_cn: 技巧与建议

source: Use the Template Tester to test templates. Add the tester to the context menu for books in the library and/or give it a keyboard shortcut.
ja: テンプレートテスタを使用してテンプレートをテストします。テスタをライブラリ内の本のコンテキストメニューに追加するか、キーボードショートカットを指定します。
ta: வார்ப்புருக்களை சோதிக்க வார்ப்புரு சோதனையாளரைப் பயன்படுத்தவும். நூலகத்தில் உள்ள புத்தகங்களுக்கான சூழல் மெனுவில் சோதனையாளரைச் சேர்த்து/அல்லது விசைப்பலகை குறுக்குவழியைக் கொடுங்கள்.
zh_cn: 使用‘模板测试器’来测试模板。您可以将测试器添加到书籍的右键上下文菜单中，或者为其设置键盘快捷键。

source: Templates can use other templates by referencing composite columns built with the desired template. Alternatively, you can use Stored Templates.
ja: テンプレートは、他のテンプレートを使用できます。それをするには、使用したいテンプレートの作成した複合列を参照します。または、保存済みテンプレートを使用することもできます。
ta: விரும்பிய வார்ப்புருவுடன் கட்டமைக்கப்பட்ட கலப்பு நெடுவரிசைகளைக் குறிப்பிடுவதன் மூலம் வார்ப்புருக்கள் பிற வார்ப்புருக்களைப் பயன்படுத்தலாம். மாற்றாக, நீங்கள் சேமிக்கப்பட்ட வார்ப்புருக்களைப் பயன்படுத்தலாம்.
zh_cn: 模板可以通过引用基于所需模板构建的‘复合列’来调用其他模板。或者，您也可以使用‘存档模板’。

source: In a plugboard, you can set a field to empty (or whatever is equivalent to empty) by using the special template ``{}``. This template will always evaluate to an empty string.
ja: 書誌の置換に加えて、テンプレートには条件付きで追加のテキストを含め、置換されたデータの整形方法を制御できます。
ta: ஒரு பிளக் போர்டில், சிறப்பு வார்ப்புருவைப் பயன்படுத்தி `{}` `` பயன்படுத்துவதன் மூலம் ஒரு புலத்தை காலியாக (அல்லது காலியாக எதுவுமில்லை) அமைக்கலாம். இந்த வார்ப்புரு எப்போதும் வெற்று சரத்திற்கு மதிப்பீடு செய்யும்.
zh_cn: 在元数据处理规则中，您可以使用特殊模板 {} 将某个字段设置为空（或等同于空的值）。该模板的结果始终为一个空字符串。

source: The technique described above to show numbers even if they have a zero value works with the standard field series_index.
ja: ゼロ値であっても数値を表示する上記の手法は、標準フィールド series_index で機能します。
ta: எண்களைக் காட்ட மேலே விவரிக்கப்பட்ட நுட்பம் பூஜ்ஜிய மதிப்பு இருந்தாலும் அவை நிலையான புலம் தொடர்_இண்டெக்ஸுடன் வேலை செய்கின்றன.
zh_cn: 上述用于即使数值为零也显示数字的技巧，同样适用于标准字段 series_index（丛书编号）。

source: Function reference
ja: 関数リファレンス
nl: Functie referentie
ta: செயல்பாடு குறிப்பு

source: ``{series_index:0>5.2f}`` - Five characters consisting of two digits with leading zeros, a decimal point, then 2 digits after the decimal point.
ja: ``{series_index:0>5.2f}`` - 先行ゼロ付きの 2 桁、小数点、および小数点以下 2 桁で構成される 5 文字。
nl: ``{series_index:0>5.2f}`` - Vijf karakters bestaande uit twee cijfers met voorloopnullen, een komma en twee cijfers na de komma.
zh_cn: ``{series_index:0>5.2f}`` - 总共五个字符：前面补零的两位整数，一个小数点，和小数点后两位数字。

source: **Do not use subtemplates (`{ ... }`) as function arguments.** Instead, use :ref:`Template Program Mode <template_mode>` and :ref:`General Program Mode <general_mode>`.
ja: **サブテンプレート (`{ ... }`) を関数の引数として使用しないでください。**代わりに :ref:`テンプレートプログラムモード <template_mode>` および :ref:`一般プログラムモード <general_mode>` を使用してください。
nl: **Gebruik geen subsjablonen (`{ ... }`) als functie argumenten.** In plaats daarvan, gebruik :ref:`Sjabloon Programma Modus <template_mode>` en :ref:`Algemene Programma Modus <general_mode>`.
zh_cn: **请勿将子模板（{ ... }）作为函数参数使用。** 取而代之，请使用 :ref:`模板程序模式<template_mode>` 或 :ref:`通用程序模式<general_mode>`。

source: ``check_yes_no("#bool", 1, 0, 1)`` returns ``'yes'`` if the yes/no field ``#bool`` is either True or undefined (neither True nor False).
ja: ``check_yes_no("#bool", 1, 0, 1)`` は、yes/no フィールド ``#bool`` が True または未定義 (True でも False でもない) ときに ``'yes'`` を返します。
nl: ``check_yes_no("#bool", 1, 0, 1)`` geeft ``'yes'`` terug als het yes/no veld ``#bool`` ofwel Waar is ofwel ongedefinieerd (noch Waar noch Vals).

source: The additional information is a Python dictionary containing pairs ``variable_name: variable_value`` where the values must be strings. The template can access the dict, creating template local variables named ``variable_name`` containing the value ``variable_value``. The user cannot change the name so it is best to use names that won't collide with other template local variables, for example by prefixing the name with an underscore.
ja: 追加情報は、値が文字列である変数 ``variable_name: variable_value`` のペアを含む Python 辞書です。テンプレートは辞書にアクセスして、値 ``variable_value`` を含む ``variable_name`` という名前のテンプレートローカル変数を作成できます。ユーザはこの名前を変更できないため、名前の前にアンダースコアを付けるなどして、他のテンプレートローカル変数と衝突しない名前を使用することをお勧めします。

source: This dict is passed to the template processor (the ``formatter``) using the named parameter ``global_vars=your_dict``. The full method signature is::
ja: この辞書は、名前付きパラメータ ``global_vars=your_dict`` を使用してテンプレートプロセッサ (`フォーマッタ``) に渡されます。完全なメソッドシグネチャは次のとおりです::
nl: Deze dict wordt doorgegeven aan de sjabloonverwerker (de ``formatter``) met de benoemde parameter ``global_vars=your_dict``. De volledige methodehandtekening is::

source: You access the additional information (the ``globals`` dict) in a template using the template function::
ja: テンプレートの追加情報 (``グローバル辞書``) にアクセスにはテンプレート関数を使用します::
nl: U hebt toegang tot de bijkomende informatie (de ``globals`` dict) in een sjabloon met de sjabloon functie::

source: A template can set a value in the ``globals`` dict using the template function::
ja: テンプレートは、テンプレート関数を使用して ``グローバル`` 辞書に値を設定できます。

source: This function sets the ``globals`` dict key:value pair ``id:value`` where ``value`` is the value of the template local variable ``id``. If that local variable doesn't exist then ``value`` is set to the result of evaluating ``expression``.
ja: この関数は、グローバル辞書 key:value ペアに ``id:value`` を設定します。ここで、``value`` はテンプレートローカル変数 ``id`` の値です。そのローカル変数が存在しない場合、``value`` に ``expression`` の評価結果を設定します。

source: For the book "The Foundation" by "Isaac Asimov" the template will become::
zh_cn: 对于 "Isaac Asimov"的作品 "The Foundation" ，该模板将变为::

source: The slashes are not ``template expressions`` because they are not in between ``{}``. Such text is left where it appears. For example, if the template is::
zh_cn: 斜杠并非``模板表达式``，因为它们不在 ``{}``之间。此类文本将保留在原处。例如，如果模板为::

source: Notes on calling functions in Single Function Mode:
zh_cn: 关于在“单函数模式”下调用函数的注意事项：

source: When functions are used in Single Function Mode, the first parameter, ``value``, is automatically replaced by the content of the field specified in the template. For example, when the template ``{title:capitalize()}`` is processed, the content of the ``title`` field is passed as the parameter ``value`` to the capitalize function.
zh_cn: 在“单函数模式”下使用函数时，第一个参数 ``value`` 会自动被模板中指定的字段内容所替换。例如，当处理模板`` {title:capitalize()}`` 时，``title`` 字段的内容会作为 ``value`` 参数传递给 capitalize 函数。

source: In the function documentation, the notation ``[something]*`` means that ``something`` can be repeated zero or more times. The notation ``[something]+`` means that the ``something`` is repeated one or more times (must exist at least one time).
zh_cn: 在函数文档中，标记 ``[something]*``表示 something可重复零次或多次。标记 ``[something]+``表示 ``something``重复一次或多次（必须至少存在一次）。

source: Some functions use regular expressions. In the template language regular expression matching is case-insensitive.
zh_cn: 某些函数会使用正则表达式。在模板语言中，正则表达式的匹配是不区分大小写的。

source: Functions are documented in :ref:`template_functions_reference`. The documentation tells you what arguments the functions require and what the functions do. For example, here is the documentation of the :ref:`ff_ifempty` function.
zh_cn: 函数的详细说明可参阅 :ref:`template_functions_reference`函数。该文档会说明各函数所需的参数及其功能。例如，以下是 :ref:`ff_ifempty`函数的说明。

source: You see that the function requires two arguments, ``value`` and ``text_if_empty``. However, because we are using Single Function Mode, we omit the ``value`` argument, passing only ``text_if_empty``. For example, this template::
zh_cn: 您可以看到该函数需要两个参数：value 和 text_if_empty。但是，由于我们使用的是“单函数模式”，因此可以省略 value 参数，仅传递 text_if_empty。例如，使用如下模板：

source: shows the tags for a book, if any. If it has no tags then it show `No tags on this book`.
zh_cn: 显示书籍的标签（如果有的话）。如果书籍没有标签，则显示 No tags on this book。

source: The following functions are usable in Single Function Mode because their first parameter is ``value``.
zh_cn: 由于下列函数的第一个参数均为 value，因此它们都可以在“单函数模式”下使用：

source: Comments are lines starting with a '#' character, possibly preceded by blanks or tabs.
zh_cn: 注释是以 # 字符开头的行，其前面可以包含空格或制表符（tabs）。

source: A ``field_reference`` evaluates to the value of the metadata field named by lookup name that follows the ``$`` or ``$$``. Using ``$`` is equivalent to using the :ref:`ff_field` function. Using ``$$`` is equivalent to using the :ref:`ff_raw_field` function. Examples::
zh_cn: field_reference（字段引用）的求值结果是 $ 或 $$ 之后所接“查找名称”（lookup name）对应的元数据字段值。使用 $ 等同于使用 :ref:`ff_field` 函数；使用 $$ 则等同于使用 :ref:`ff_raw_field` 函数。示例如下::

source: For example, this program returns the value of the ``series`` column if the book has a series, otherwise the value of the ``title`` column::
zh_cn: 例如，如果书籍有关联的丛书，此程序将返回 series（丛书）列的值，否则返回 title（书名）列的值::

source: The ``for`` expression iterates over a list of values, processing them one at a time. The ``list_expression`` must evaluate either to a metadata field ``lookup name`` e.g., ``tags`` or ``#genre``, or to a list of values. The :ref:`ff_range` generates a list of numbers. If the result is a valid ``lookup name`` then the field's value is fetched and the separator specified for that field type is used. If the result isn't a valid lookup name then it is assumed to be a list of values. The list is assumed to be separated by commas unless the optional keyword ``separator`` is supplied, in which case the list values must be separated by the result of evaluating the ``separator_expr``. A separator cannot be used if the list is generated by ``range()``. Each value in the list is assigned to the specified variable then the ``expression_list`` is evaluated. You can use ``break`` to jump out of the loop, and ``continue`` to jump to the beginning of the loop for the next iteration.
zh_cn: for 表达式会迭代一个值列表，并逐个处理这些值。其中 list_expression（列表表达式）必须求值为元数据字段的“查找名称”（如 tags 或 #genre），或者求值为一个值列表。:ref:ff_range 函数可用于生成数字列表。如果求值结果是一个有效的“查找名称”，系统将获取该字段的值，并使用该字段类型指定的默认分隔符。如果结果不是有效的查找名称，则将其视为普通的值列表。除非提供了可选关键字 separator（分隔符），否则默认列表以逗号分隔；若提供了该关键字，则列表值必须以 separator_expr 的求值结果进行分隔。注意，如果列表是由 range() 生成的，则不能使用自定义分隔符。列表中的每个值都会被分配给指定的变量，然后执行 expression_list（表达式列表）。你可以使用 break 跳出循环，或使用 continue 跳回循环开头进行下一次迭代。

source: **with expressions**
zh_cn: **with表达式**

source: The ``with`` expression:
zh_cn: ``with`` 表达式:

source: changes the current book to the book with calibre book id (an integer) produced by valuating the ``top_expression``.
zh_cn: 将当前书籍切换为由 top_expression 求值生成的 Calibre 书籍 ID（整数）所对应的书籍。

source: runs the ``expression_list``.
zh_cn: 运行 ``expression_list``.

source: then resets the current book back to what it was.
zh_cn: 随后将当前书籍重置回其原本的状态。

source: The ``with`` expression returns the result of the last ``top_expression`` in the evaluated ``expression_list``, or the empty string if no expression list was evaluated.
zh_cn: with 表达式返回所执行的 expression_list 中最后一个 top_expression 的计算结果；如果没有执行任何表达式列表，则返回空字符串。

source: For example, this template returns a list of the titles of each book selected in the GUI::
zh_cn: 示例：此模板会返回一个列表，其中包含当前在GUI中所选中的每本书的书名：

source: **Return stmt**
zh_cn: **Return 语句**

source: Return the value of the ``expression``. If executed in a function then it returns the value of the expression to the caller. If executed in the outermost context (the template) then it sets the value of the template to the value of the expression and exits the template.
zh_cn: 返回 expression（表达式）的值。如果在函数内部执行，它会将该值返回给调用者。如果在最外层上下文（即模板本身）中执行，它会将模板的最终值设定为该表达式的值并退出模板。

source: If you have repeated code in a template then you can put that code into a local function. The ``def`` keyword starts the definition. It is followed by the function name, the argument list, then the code in the function. The function definition ends with the ``fed`` keyword.
zh_cn: 如果你在模板中有重复的代码，可以将其放入一个局部函数中。def 关键字标志着定义的开始，其后依次是函数名、参数列表以及函数体内的代码。函数定义以 fed 关键字结束。

source: Relational operators return ``'1'`` if the comparison is true, otherwise the empty string (``''``).
zh_cn: 如果比较结果为真（true），关系运算符将返回 '1'；否则返回空字符串（''）。

source: String comparisons do case-insensitive string comparison using lexical order. The supported string comparison operators are ``==``, ``!=``, ``<``, ``<=``, ``>``, ``>=``, ``in``, ``inlist``, and ``inlist_field``. For the ``in``, ``inlist``, and ``inlist_field`` operators, the result of the left hand expression is interpreted as a regular expression pattern. They are true if the value of left-hand regular expression matches the value of the right hand expression. The regular expressions are case-insensitive.
zh_cn: 字符串比较使用词典顺序进行不区分大小写的比较。支持的字符串比较运算符包括 ==、!=、<、<=、>、>=、in、inlist 以及 inlist_field。对于 in、inlist 和 inlist_field 运算符，左侧表达式的结果被视为正则表达式模式；如果左侧的正则表达式与右侧表达式的值匹配，则结果为真。这些正则表达式同样不区分大小写。

source: The ``inlist`` operator is true if the left hand regular expression matches any one of the items in the right hand list where the items in the list are separated by commas. The ``inlist_field`` operator is true if the left hand regular expression matches any of the items in the field (column) named by the right hand expression, using the separator defined for the field. NB: the ``inlist_field`` operator requires the right hand expression to evaluate to a field name, while the ``inlist`` operator requires the right hand expression to evaluate to a string containing a comma-separated list. Because of this difference, ``inlist_field`` is substantially faster than ``inlist`` because no string conversions or list constructions are done.
zh_cn: 如果左侧的正则表达式匹配右侧列表中的任何一项（列表项以逗号分隔），则 inlist 运算符为真。如果左侧的正则表达式匹配由右侧表达式命名的字段（列）中的任何一项，则 inlist_field 运算符为真，匹配时使用该字段定义的专用分隔符。注意：inlist_field 要求右侧表达式的计算结果为一个“字段名”，而 inlist 要求右侧表达式的结果为一个“包含逗号分隔列表的字符串”。由于这种差异，inlist_field 的执行速度明显快于 inlist，因为它不需要进行字符串转换或列表构建。

source: ``program: field('series') == 'foo'`` returns ``'1'`` if the book's series is `foo`, otherwise ``''``.
zh_cn: program: field('series') == 'foo' 如果书籍的丛书名为 foo，则返回 '1'，否则返回空字符串（''）。

source: ``program: 'science' inlist $#genre`` returns ``'1'`` if any of the values retrieved from the book's genres match the regular expression ``science``, e.g., `Science`, `History of Science`, `Science Fiction` etc., otherwise ``''``.
zh_cn: program: 'science' inlist $#genre 如果从书籍的“类型（genre）”列中获取的任何一个值匹配正则表达式 science，则返回 '1'，否则返回空字符串（''）。例如，它能匹配 Science、History of Science、Science Fiction等。

source: ``program: '^science$' inlist $#genre`` returns ``'1'`` if any of the book's genres exactly match the regular expression ``^science$``, e.g., `Science`, otherwise ``''``. The genres `History of Science` and `Science Fiction` don't match.
zh_cn: program: '^science$' inlist $#genre 如果书籍的“类型（genre）”列中有任何一项与正则表达式 ^science$ 完全匹配（例如 Science），则返回 '1'，否则返回空字符串（''）。这种情况下，History of Science 和 Science Fiction 将不会匹配。

source: ``program: 'asimov' inlist $authors`` returns ``'1'`` if any author matches the regular expression ``asimov``, e.g., `Asimov, Isaac` or `Isaac Asimov`, otherwise ``''``.
zh_cn: program: 'asimov' inlist $authors 如果作者列表中的任何一位作者匹配正则表达式 asimov（例如 Asimov, Isaac 或 Isaac Asimov），则返回 '1'，否则返回空字符串（''）。

source: ``program: 'asimov' inlist_field 'authors'`` returns ``'1'`` if any author matches the regular expression ``asimov``, e.g., `Asimov, Isaac` or `Isaac Asimov`, otherwise ``''``.
zh_cn: program: 'asimov' inlist_field 'authors' 如果作者列中的任何一位作者匹配正则表达式 asimov（例如 Asimov, Isaac 或 Isaac Asimov），则返回 '1'，否则返回空字符串（''）。

source: ``program: 'asimov$' inlist_field 'authors'`` returns ``'1'`` if any author matches the regular expression ``asimov$``, e.g., `Isaac Asimov`, otherwise ``''``. It doesn't match `Asimov, Isaac` because of the ``$`` anchor in the regular expression.
zh_cn: program: 'asimov$' inlist_field 'authors' 如果作者列中的任何一位作者匹配正则表达式 asimov$（例如 Isaac Asimov），则返回 '1'，否则返回空字符串（''）。由于正则表达式中使用了 $ 锚点，它不会匹配 Asimov, Isaac。

source: ``program: if field('series') != 'foo' then 'bar' else 'mumble' fi`` returns ``'bar'`` if the book's series is not `foo`. Otherwise it returns ``'mumble'``.
zh_cn: program: if field('series') != 'foo' then 'bar' else 'mumble' fi 如果书籍的丛书名不是 foo，则返回 'bar'；否则返回 'mumble'。

source: ``program: if field('series') == 'foo' || field('series') == '1632' then 'yes' else 'no' fi`` returns ``'yes'`` if series is either `foo` or `1632`, otherwise ``'no'``.
zh_cn: program: if field('series') == 'foo' || field('series') == '1632' then 'yes' else 'no' fi 如果丛书名是 foo 或 1632，则返回 'yes'，否则返回 'no'。

source: ``program: if '^(foo|1632)$' in field('series') then 'yes' else 'no' fi`` returns ``'yes'`` if series is either `foo` or `1632`, otherwise ``'no'``.
zh_cn: program: if '^(foo|1632)$' in field('series') then 'yes' else 'no' fi 如果丛书名是 foo 或 1632，则返回 'yes'，否则返回 'no'。

source: **Functions in General Program Mode**
zh_cn: **通用程序模式中的函数**

source: See :ref:`template_functions_reference` for the list of functions built into the template language.
zh_cn: 关于模板语言内置的函数列表，请参阅:ref:`template_functions_reference` 。

source: As opposed to :ref:`Single Function Mode <single_mode>`, in General Program Mode you must specify the first parameter ``value``.
zh_cn: 与 :ref:`Single Function Mode<single_mode>不同，在通用程序模式下，你必须指定第一个参数 value。

source: All parameters are expression_lists (see the grammar above).
zh_cn: 所有参数均为 expression_lists（表达式列表，参见上文的语法说明）。

source: If the template contains a prefix and suffix, the expression ends with ``'|`` where the ``|`` is the delimiter for the prefix. Example::
zh_cn: 如果模板包含前缀和后缀，则表达式以 '| 结尾，其中 | 是前缀的分隔符。示例如下::

source: Functions must be given all their arguments. For example, the standard built-in functions must be given the initial parameter ``value``.
zh_cn: 调用函数时必须提供其所有参数。例如，标准内置函数必须被赋予初始参数 value。

source: The variable ``$`` is usable as the ``value`` argument and stands for the value of the field named in the template, ``series`` in this case.
zh_cn: 变量 $ 可作为 value 参数使用，它代表模板中所指定字段的值（在本例中为 series 丛书字段）。

source: In `TPM`, using ``{`` and ``}`` characters in string literals can lead to errors or unexpected results because they confuse the template processor. It tries to treat them as template expression boundaries, not characters. In some but not all cases you can replace a ``{`` with ``[[`` and a ``}`` with `]]`. Advice: if your program contains ``{`` and ``}`` characters then you should use `General Program Mode`.
zh_cn: 在 TPM（模板程序模式）中，在字符串字面量中使用 { 和 } 字符可能会导致错误或意外结果，因为它们会干扰模板解析器。解析器会尝试将它们视为模板表达式的分隔边界，而不是普通字符。在某些（但非所有）情况下，你可以用 [[ 替换 {，用 ]] 替换 }。建议：如果你的程序包含 { 和 } 字符，则应使用通用程序模式。

source: Python Template Mode (PTM) lets you write templates using native Python and the `calibre API <https://manual.calibre-ebook.com/develop.html#api-documentation-for-various-parts-of-calibre>`_. The database API will be of most use; further discussion is beyond the scope of this manual. PTM templates are faster and can do more complicated operations but you must know how to write code in Python using the calibre API.
zh_cn: Python 模板模式 (PTM) 允许你使用原生 Python 语言和 `calibre API <https://manual.calibre-ebook.com/develop.html#api-documentation-for-various-parts-of-calibre>`_来编写模板。其中数据库 API（database API）最为常用；更深入的讨论超出了本手册的范围。PTM 模板运行速度更快，且能执行更复杂的逻辑操作，但前提是你必须了解如何使用 calibre API 编写 Python 代码。

source: Templates and URLs
zh_cn: 模板与 URL

source: You can use templates to construct URLs. Two cases are described here:
zh_cn: 你可以使用模板来构建 URL。这里描述了两种情况：

source: Custom column :guilabel:`Book details` search URLs
zh_cn: 自定义列：“:guilabel:图书详情”搜索 URL

source: The calibre URL scheme
zh_cn: calibre URL协议

source: **Custom column book details search URLs**
zh_cn: **自定义列：图书详情搜索 URL**

source: When you create a custom column you can provide a URL to be used in :guilabel:`Book details` using a template. For example, if you have a custom column for `Translators` you can define a URL to take you to a site for translators. Book details search URLs can be provided for `Text`, `Enumerated`, `Series`, and `Column built from other column` column types.
zh_cn: 当你创建自定义列时，可以使用模板提供一个用于“:guilabel:图书详情”面板的 URL。例如，如果你有一个名为“译者”（Translators）的自定义列，你可以定义一个 URL，点击后跳转到某个译者相关的网站。图书详情搜索 URL 适用于“文本”（Text）、“枚举”（Enumerated）、“丛书”（Series）以及“从其他列构建的列”（Column built from other column）等列类型。
