Repository: debian-calibre/calibre
Catalog: translations/manual/*/template_lang.po
Languages: ja, nl, ta, zh_cn

source: ``character(character_name)`` -- returns the character named by character_name. For example, ``character('newline')`` returns a newline character (``'\n'``). The supported character names are ``newline``, ``return``, ``tab``, and ``backslash``.
ja: ``character(character_name)`` -- character_name で指定された文字を返します。たとえば、``character('newline')`` は改行文字 (``'\n'``)を返します。サポートしている文字名は、``newline``, ``return``, ``tab``, および ``backslash`` です。
nl: ``character(character_name)`` -- geeft het karakter terug genoemd door character_name. Bv.: ``character('newline')`` geeft een nieuwe regel karakter (``'\n'``). De ondersteunde karakternamen zijn ``newline``, ``return``, ``tab`` en ``backslash``.
ta: `` எழுத்து (எழுத்து_பெயர்) `` - எழுத்துக்குறி_ பெயர் பெயரிடப்பட்ட எழுத்தை வழங்குகிறது. எடுத்துக்காட்டாக, `` எழுத்துக்குறி ('புதிய') `` ஒரு புதிய எழுத்துப்பிழை (`` '\ n'``) தருகிறது. ஆதரிக்கப்பட்ட எழுத்து பெயர்கள் `` புதிய வரி``, `` திரும்ப``, `` தாவல்``, மற்றும் `` பின்சாய்வுக்கோடானது`.

source: ``cmp(x, y, lt, eq, gt)`` -- compares ``x`` and ``y`` after converting both to numbers. Returns ``lt`` if ``x <# y``, ``eq`` if ``x ==# y``, otherwise ``gt``. This function can usually be replaced with one of the numeric compare operators (``==#``, ``<#``, ``>#``, etc).
ja: ``cmp(x, y, lt, eq, gt)`` -- ``x`` と ``y`` の両方を数値に変換した後、それらを比較します。``x <# y`` なら ``lt``、``x ==# y`` なら ``eq`` を返し、それ以外の場合は ``gt`` を返します。この関数は通常、数値比較演算子(``==#``, ``<#``, ``>#`` など)のひとつに置き換えることができます。
nl: ``cmp(x, y, lt, eq, gt)`` -- vergelijkt ``x`` en ``y`` na converteren van beiden naar getallen. Geetf ``lt`` if ``x <# y``, ``eq`` if ``x ==# y`` terug, anders ``gt``. Deze functie kan gewoonlijk vervangen worden door een van de numerieke vergelijkingsoperatoren (``==#``, ``<#``, ``>#``, enz).
ta: `` cmp (x, y, lt, eq, gt) `` - இரண்டையும் எண்களாக மாற்றிய பின் `` x`` மற்றும் `y`` ஐ ஒப்பிடுகிறது. `` Lt`` என்றால் `` x <# y``, `` eq`` என்றால் `` x ==# y`` என்றால், இல்லையெனில் `` gt``. இந்த செயல்பாடு வழக்கமாக எண் ஒப்பீட்டு ஆபரேட்டர்களில் ஒன்றோடு மாற்றப்படலாம் (`` ==#``, `` <#``, ``>#`` `` `` `` `` `` `.

source: ``connected_device_name(storage_location_key)`` -- if a device is connected then return the device name, otherwise return the empty string. Each storage location on a device has its own device name. The ``storage_location_key`` names are ``'main'``, ``'carda'`` and ``'cardb'``. This function works only in the GUI.
ja: ``connected_device_name(storage_location_key)`` -- デバイスが接続されていればデバイス名を返し、そうでない場合は空の文字列を返します。デバイスの各保管場所には、独自のデバイス名があります。``storage_location_key`` の名前は、``'main'``, ``'carda'`` および ``'cardb'``です。この機能は GUI でのみ機能します。
nl: ``connected_device_name(storage_location_key)`` -- als een toestel verbonden is, geef het toestel's naam terug, anders de lege string. Elke opslaglocatie op een toestel heeft zijn eigen toestelnaam. De ``storage_location_key`` locatienamen zijn ``'main'``, ``'carda'`` en ``'cardb'``. Deze functie werkt enkel in de GUI.
ta: `` இணைக்கப்பட்ட_டெவிஸ்_பேம் (சேமிப்பக_லோகேஷன்_கே) `` - ஒரு சாதனம் இணைக்கப்பட்டால், சாதனத்தின் பெயரைத் திருப்பி, இல்லையெனில் வெற்று சரத்தை திருப்பி விடுங்கள். ஒரு சாதனத்தில் ஒவ்வொரு சேமிப்பக இடத்திற்கும் அதன் சொந்த சாதன பெயர் உள்ளது. `` சேமிப்பு_லோகேஷன்_கே`` பெயர்கள் `` 'பிரதானம்'`, ``' கார்டா'`` மற்றும் `` 'கார்ட்பி'``. இந்த செயல்பாடு GUI இல் மட்டுமே செயல்படுகிறது.

source: ``connected_device_uuid(storage_location_key)`` -- if a device is connected then return the device uuid (unique id), otherwise return the empty string. Each storage location on a device has a different uuid. The ``storage_location_key`` location names are ``'main'``, ``'carda'`` and ``'cardb'``. This function works only in the GUI.
ja: ``connected_device_uuid(storage_location_key)`` -- デバイスが接続されていればデバイスのuuid (一意のID) を返します。それ以外の場合は、空の文字列を返します。デバイスの保存場所ごとに異なる uuid がついています。``storage_location_key`` の名前は、``'main'``, ``'carda'`` および ``'cardb'``です。この機能は GUI でのみ機能します。
nl: ``connected_device_uuid(storage_location_key)`` -- als een toestel verbonden is, geef het toestel's uuid (unique id) terug, anders de lege string. Elke opslaglocatie op een toestel heeft een ander uuid. De ``storage_location_key`` locatienamen zijn ``'main'``, ``'carda'`` en ``'cardb'``. Deze functie werkt enkel in de GUI.
ta: `` இணைக்கப்பட்ட_டெவிஸ்_யூயிட் (சேமிப்பக_லோகேஷன்_கே) `` - ஒரு சாதனம் இணைக்கப்பட்டால், சாதனத்தை UUID (தனித்துவமான ஐடி) திருப்பி, இல்லையெனில் வெற்று சரத்தை திருப்பி விடுங்கள். ஒரு சாதனத்தில் உள்ள ஒவ்வொரு சேமிப்பக இடமும் வெவ்வேறு UUID ஐக் கொண்டுள்ளன. `` சேமிப்பிடம்_லோகேஷன்_கே`` இருப்பிட பெயர்கள் `` 'பிரதானம்'`, ``' 'கார்டா'`` மற்றும் ``' கார்ட்ப்'``. இந்த செயல்பாடு GUI இல் மட்டுமே செயல்படுகிறது.

source: ``current_library_name()`` -- return the last name on the path to the current calibre library.
ja: ``current_library_name()`` -- 現在の calibre ライブラリへのパスの最後の名前を返します。
nl: ``current_library_name()`` -- geeft de laatste naam op het pad naar de huidige calibre bibliotheel terug.
ta: `` current_library_name () `` - தற்போதைய காலிபர் நூலகத்திற்கு பாதையில் கடைசி பெயரைத் தரவும்.

source: ``current_library_path()`` -- return the full path to the current calibre library.
ja: ``current_library_path()`` -- 現在の calibre ライブラリへのフルパスを返します。
nl: ``current_library_path()`` -- geeft het volledige pad naar de huidige calibre bibliotheek terug.
ta: `` Current_library_path () `` - தற்போதைய காலிபர் நூலகத்திற்கு முழு பாதையையும் திருப்பி விடுங்கள்.

source: ``current_virtual_library_name()`` -- return the name of the current virtual library if there is one, otherwise the empty string. Library name case is preserved. Example: ``program: current_virtual_library_name()``. This function works only in the GUI.
ja: ``current_virtual_library_name()`` -- 現在の仮想ライブラリがある場合はその名前を返します。ない場合は空の文字列を返します。ライブラリ名の大文字小文字は保持されます。例: ``program: current_virtual_library_name()``。この機能はGUIでのみ機能します。
nl: ``current_virtual_library_name()`` -- geeft de naam van de huidige virtuele bibliotheek als er een is, anders de lege string. Bibliotheeknaam hoofdlettergebruik wordt behouden. Bv.: ``program: current_virtual_library_name()``. Deze functie werkt enkel in de GUI.
ta: . நூலக பெயர் வழக்கு பாதுகாக்கப்படுகிறது. எடுத்துக்காட்டு: `` நிரல்: நடப்பு_வீர்டுவல்_லிபிரரி_பெயர் () ``. இந்த செயல்பாடு GUI இல் மட்டுமே செயல்படுகிறது.

source: ``date_arithmetic(date, calc_spec, fmt)`` -- Calculate a new date from ``date`` using ``calc_spec``. Return the new date formatted according to optional ``fmt``: if not supplied then the result will be in ISO format. The calc_spec is a string formed by concatenating pairs of ``vW`` (``valueWhat``) where ``v`` is a possibly-negative number and W is one of the following letters:
ja: ``date_arithmetic(date, calc_spec, fmt)`` -- ``calc_spec`` を使用して ``date`` から新しい日付を計算します。オプションの ``fmt`` に従って整形された新しい日付を返します。指定されていない場合、結果は ISO 書式になります。 calc_specは、``vW`` (``valueWhat``) のペアを連結して形成された文字列です。ここで、``v`` は負の可能性のある数値であり、Wは次のいずれかの文字です:
nl: ``date_arithmetic(date, calc_spec, fmt)`` -- Bereken een nieuwe datum van ``date`` met ``calc_spec``. Geef de nieuwe datum terug geformatteerd volgens optioneel ``fmt``: indien niet voorzien zal het resultaat in ISO formaat zijn. De calc_spec is een string gevormd door aaneengeregen paren van ``vW`` (``valueWhat``) waar ``v`` een mogelijk-negatief getal is en W een van de volgende letters:
ta: `` date_arithmetic (தேதி, calc_spec, fmt) `` - `` calc_spec`` ஐப் பயன்படுத்தி `` தேதி` இலிருந்து புதிய தேதியைக் கணக்கிடுங்கள். விருப்பமான `` FMT`` இன் படி புதிய தேதியை வடிவமைக்கவும்: வழங்கப்படாவிட்டால், முடிவு ISO வடிவத்தில் இருக்கும். Calc_spec என்பது `` vw`` (`` `` `` `` v``) இணைக்கும் ஜோடிகளை ஒன்றிணைப்பதன் மூலம் உருவாக்கப்பட்ட ஒரு சரம், அங்கு `v`` என்பது எதிர்மறையான எண் மற்றும் W என்பது பின்வரும் கடிதங்களில் ஒன்றாகும்:

source: ``s``: add ``v`` seconds to ``date``
ja: ``s``: ``date`` に ``v`` 秒を加算
nl: ``s``: voeg ``v`` seconden toe aan ``date``
ta: `` எஸ்``: `` தேதி`` வினாடிகளை `` வி`` சேர்க்கவும்

source: ``m``: add ``v`` minutes to ``date``
ja: ``m``: ``date`` に ``v`` 分を加算
nl: ``m``: voeg ``v`` minuten toe aan ``date``
ta: `` m``: `` தேதி`` நிமிடங்களுக்கு `` வி`` நிமிடங்களைச் சேர்க்கவும்

source: ``h``: add ``v`` hours to ``date``
ja: ``h``: ``date`` に ``v`` 時間を加算
nl: ``h``: voeg ``v`` uren toe aan ``date``
ta: `` h``: `` தேதி`` மணிநேரம் `v`` மணிநேரங்களைச் சேர்க்கவும்

source: ``d``: add ``v`` days to ``date``
ja: ``d``: ``date`` に ``v`` 日を加算
nl: ``d``: voeg ``v`` dagen toe aan ``date``
ta: `` டி``: `` தேதி`` நாட்களை `` வி`` சேர்க்கவும்

source: ``w``: add ``v`` weeks to ``date``
ja: ``w``: ``date`` に ``v`` 週間を加算
nl: ``w``: voeg ``v`` weken toe aan ``date``
ta: `` w``: `` V`` வாரங்களை `` தேதி`` சேர்க்கவும்

source: ``y``: add ``v`` years to ``date``, where a year is 365 days.
ja: ``y``: ``date`` に ``v`` 年を加算、ただし 1 年は 365 日
nl: ``y``: voeg ``v`` jaren toe aan ``date``, waar een jaar is 365 dagen.
ta: `` y``: ஒரு வருடம் 365 நாட்கள் இருக்கும் `` தேதி` `` v`` ஆண்டுகளைச் சேர்க்கவும்.

source: Example: ``'1s3d-1m'`` will add 1 second, add 3 days, and subtract 1 minute from ``date``.
ja: 例: ``'1s3d-1m'`` は ``date`` に 1 秒を加算、3 日を加算、1 分を減算します。
nl: Voorbeeld: ``'1s3d-1m'`` voegt 1 seconde, 3 dagen toe en trekt 1 minuut af van ``date``.
ta: எடுத்துக்காட்டு: `` '1S3D-1M'``` 1 வினாடிகளைச் சேர்த்து, 3 நாட்கள் சேர்த்து, `` தேதி`` இலிருந்து 1 நிமிடத்தைக் கழிக்கும்.

source: ``days_between(date1, date2)`` -- return the number of days between ``date1`` and ``date2``. The number is positive if ``date1`` is greater than ``date2``, otherwise negative. If either ``date1`` or ``date2`` are not dates, the function returns the empty string.
ja: ``days_between(date1, date2)`` -- rdate1とdate2の間の日数を返します。 ``date1`` が ``date2``より大きい場合、数値は正であり、それ以外の場合は負です。``date1`` または ``date2``のいずれかが日付でない場合、関数は空の文字列を返します。
nl: ``days_between(date1, date2)`` -- geeft het aantal dagen tussen ``date1`` en ``date2`` terug. Het aantal is positief als ``date1`` groter is dan ``date2``, anders negatief. Als ofwel ``date1`` ofwel ``date2`` geen datum is, wordt de lege string terug gegeven.
ta: `` நாட்கள்_பெட்வீன் (தேதி 1, தேதி 2) `` - `` தேதி 1`` மற்றும் `` தேதி 2`` க்கு இடையில் நாட்களின் எண்ணிக்கையைத் திருப்பித் தரவும். `` தேதி 1`` ஐ விட அதிகமாக இருந்தால் எண் நேர்மறையானது, இல்லையெனில் எதிர்மறையானது. `` தேதி 1`` அல்லது `` தேதி 2`` தேதிகள் இல்லையென்றால், செயல்பாடு வெற்று சரத்தை வழங்குகிறது.

source: ``divide(x, y)`` -- returns ``x / y``. Throws an exception if either ``x`` or ``y`` are not numbers. This function can usually be replaced by the ``/`` operator.
ja: ``divide(x, y)`` -- ``x / y`` を返します。``x`` または ``y`` のいずれかが数値でない場合、例外をスローします。この関数は通常、 ``/`` 演算子で置き換えることができます。
nl: ``divide(x, y)`` -- returns ``x / y``. Gooit een uitzondering als ofwel ``x`` ofwel ``y`` geen getallen zijn. Deze functie kan gewoonlijk vervangen worden door de ``/`` operator.
ta: `` பிரிக்கவும் (x, y) `` - `` x / y`` ஐத் தருகிறது. `` X`` அல்லது `` y`` எண்கள் இல்லையென்றால் விதிவிலக்கை வீசுகிறது. இந்த செயல்பாட்டை வழக்கமாக ``/`` ஆபரேட்டரால் மாற்றலாம்.

source: ``eval(string)`` -- evaluates the string as a program, passing the local variables. This permits using the template processor to construct complex results from local variables. In :ref:`Template Program Mode <template_mode>`, because the `{` and `}` characters are interpreted before the template is evaluated you must use `[[` for the `{` character and `]]` for the ``}`` character. They are converted automatically. Note also that prefixes and suffixes (the `|prefix|suffix` syntax) cannot be used in the argument to this function when using :ref:`Template Program Mode <template_mode>`.
ja: ``eval(string)`` -- 文字列をプログラムとして評価し、ローカル変数を渡します。これにより、テンプレートプロセッサを使用して、ローカル変数から複雑な結果を作成できます。:ref:`テンプレートプログラムモード <template_mode>`では、テンプレートが評価される前に `{` および `}` の文字が解釈されるため、``}`` の文字には `[[` 、 ``}`` の文字には `]]` を使用する必要があります。これは自動的に変換されます。:ref:`テンプレートプログラムモード <template_mode>` を使用している場合、この関数の引数にプレフィックスとサフィックス (`|prefix|suffix` 構文) を使用できないことにも注意してください。
nl: ``eval(string)`` -- evalueert de string als een programma, de lokale variabelen doorgevend. Dit laat toe complexe resultaten te bouwen van lokale variabelen met de sjabloonprocessor. In :ref:`Template Program Mode <template_mode>`, omdat de `{` en `}` karakters geïnterpreteerd worden voor de sjabloon wordt geëvalueerd, moet u `[[` gebruiken voor het `{` karakter en `]]` voor het ``}`` karakter. Ze worden automatisch omgezet. Merk ook op dat voor- en achtervoegsel (de `|prefix|suffix` syntaxis) niet gebruikt kunnen worden in het argument bij deze functie bij gebruik van :ref:`Template Program Mode <template_mode>`.
ta: `` எவால் (சரம்) `` - சரம் ஒரு நிரலாக மதிப்பிடுகிறது, உள்ளூர் மாறிகளைக் கடந்து செல்கிறது. உள்ளூர் மாறிகளிலிருந்து சிக்கலான முடிவுகளை உருவாக்க வார்ப்புரு செயலியைப் பயன்படுத்த இது அனுமதிக்கிறது. இல்: குறிப்பு: `வார்ப்புரு நிரல் பயன்முறை <வார்ப்புரு_மோட்>`, ஏனெனில் `{` மற்றும் `}` எழுத்துக்கள் வார்ப்புரு மதிப்பிடப்படுவதற்கு முன்பு விளக்கப்படுகின்றன, நீங்கள் `[` {`எழுத்துக்கு மற்றும்`]] `பயன்படுத்த வேண்டும் ``} `` எழுத்து. அவை தானாக மாற்றப்படுகின்றன. முன்னொட்டுகள் மற்றும் பின்னொட்டுகள் (`| முன்னொட்டு | பின்னொட்டு` தொடரியல்) பயன்படுத்தும் போது இந்த செயல்பாட்டிற்கான வாதத்தில் பயன்படுத்த முடியாது என்பதையும் நினைவில் கொள்க: ref:` வார்ப்புரு நிரல் பயன்முறை <emplatue_mode> `.

source: ``extra_file_size(file_name)`` -- returns the size in bytes of the extra file ``file_name`` in the book's ``data/`` folder if it exists, otherwise ``-1``. See also the functions ``has_extra_files()``, ``extra_file_names()`` and ``extra_file_modtime()``. This function can be used only in the GUI.
ta: `` extrage_file_size (file_name) ``-புத்தகத்தின் `` தரவு/`` கோப்புறை இருந்தால், இல்லையெனில் `` -1`` என்ற கூடுதல் கோப்பின் பைட்டுகளில் அளவை வழங்குகிறது, இல்லையெனில் `` -1``. `` Has_extra_files () ``, `` எக்ஸ்ட்ரா_ஃபைல்_நேம்ஸ் () `` மற்றும் `` கூடுதல்_பீல்_மோடி டைம் () `` ஆகிய செயல்பாடுகளையும் காண்க. இந்த செயல்பாட்டை GUI இல் மட்டுமே பயன்படுத்த முடியும்.

source: ``extra_file_modtime(file_name, format_string)`` -- returns the modification time of the extra file ``file_name`` in the book's ``data/`` folder if it exists, otherwise ``-1``. The modtime is formatted according to ``format_string`` (see ``format_date()`` for details). If ``format_string`` is the empty string, returns the modtime as the floating point number of seconds since the epoch. See also the functions ``has_extra_files()``, ``extra_file_names()`` and ``extra_file_size()``. The epoch is OS dependent. This function can be used only in the GUI.
ta: `` extral_file_modtime (file_name, fill_name, format_string) ``-புத்தகத்தின் `` தரவு/`` கோப்புறையில் `` File_name`` இன் மாற்றும் நேரத்தை வழங்குகிறது, இல்லையெனில் `` -1``. மோடம் `` format_string`` இன் படி வடிவமைக்கப்பட்டுள்ளது (விவரங்களுக்கு `` format_date () `` ஐப் பார்க்கவும்). `` Format_string`` என்றால் வெற்று சரம் என்றால், சகாப்தத்திலிருந்து மிதக்கும் புள்ளி எண்ணாக மோடத்தை வழங்குகிறது. `` Has_extra_files () `` `,` `கூடுதல்_பீல்_நேம்கள் ()` `மற்றும்` `கூடுதல்_பீல்_சிஸ் ()` `ஆகியவற்றையும் காண்க. சகாப்தம் OS சார்ந்தது. இந்த செயல்பாட்டை GUI இல் மட்டுமே பயன்படுத்த முடியும்.

source: ``extra_file_names(sep [, pattern])`` returns a ``sep``-separated list of extra files in the book's ``data/`` folder. If the optional parameter ``pattern``, a regular expression, is supplied then the list is filtered to files that match ``pattern``. The pattern match is case insensitive. See also the functions ``has_extra_files()``, ``extra_file_modtime()`` and ``extra_file_size()``. This function can be used only in the GUI.
ta: `` எக்ஸ்ட்ரா_ஃபைல்_நேம்ஸ் (செப் [, முறை]) `` புத்தகத்தின் `` தரவு/`` கோப்புறையில் கூடுதல் கோப்புகளின் `` செப்``-பிரிக்கப்பட்ட பட்டியலை வழங்குகிறது. விருப்ப அளவுரு `` முறை``, ஒரு வழக்கமான வெளிப்பாடு வழங்கப்பட்டால், பட்டியல் `` முறை`` பொருந்தக்கூடிய கோப்புகளுக்கு வடிகட்டப்படுகிறது. முறை போட்டி என்பது உணர்ச்சியற்றது. `` Has_extra_files () ``, `` கூடுதல்_பீல்_மோட் டைம் () `` `மற்றும்` `எக்ஸ்ட்ரா_ஃபைல்_சிஸ் ()` `செயல்பாடுகளையும் காண்க. இந்த செயல்பாட்டை GUI இல் மட்டுமே பயன்படுத்த முடியும்.

source: ``field(lookup_name)`` -- returns the value of the metadata field with lookup name ``lookup_name``.
ja: ``field(lookup_name)`` -- ルックアップ名 ``lookup_name`` の書誌フィールドの値を返します。
nl: ``field(lookup_name)`` -- geeft de waarde terug van het metadata veld met opzoeknaam ``lookup_name``.
ta: `` புலம் (தேடல்_பெயர்) `` - மெட்டாடேட்டா புலத்தின் மதிப்பை தேடல் பெயருடன் `` goodup_name`` உடன் வழங்குகிறது.

source: ``field_exists(field_name)`` -- checks if a field (column) with the lookup name ``field_name`` exists, returning ``'1'`` if so and the empty string if not.
ja: ``field_exists(field_name)`` -- ルックアップ名 ``field_name`` のフィールド（列）が存在するかどうかを確認し、存在すれば ``'1'`` を返し、存在しない場合は空の文字列を返します。
nl: ``field_exists(field_name)`` -- controleert of een veld (kolom) met de lookup naam ``field_name`` bestaat, geeft ``'1'`` indien ja en de lege string indien niet.
ta: `` field_exists (field_name) `` - தேடல் பெயருடன் ஒரு புலம் (நெடுவரிசை) `` field_name`` இருக்கிறதா என்பதை சரிபார்க்கிறது, அப்படியானால் `` '1'` மற்றும் வெற்று சரம் இல்லையென்றால் திரும்பப் பெறுகிறது.

source: ``finish_formatting(val, fmt, prefix, suffix)`` -- apply the format, prefix, and suffix to a value in the same way as done in a template like ``{series_index:05.2f| - |- }``. This function is provided to ease conversion of complex single-function- or template-program-mode templates to `GPM` Templates. For example, the following program produces the same output as the above template::
ja: ``finish_formatting(val, fmt, prefix, suffix)`` -- ``{series_index:05.2f| - |- }`` のようなテンプレートで行われるのと同じ方法で、フォーマット、プレフィックス、およびサフィックスを値に適用します。この関数は、複雑な単関数モードやテンプレートプログラムモードのテンプレートから `GPM` テンプレートへの変換を容易にするために提供されています。たとえば次のプログラムは、上記のテンプレートと同じ出力を生成します::
nl: ``finish_formatting(val, fmt, prefix, suffix)`` -- pas het formaat, voor- en achtervoegsel toe op een waarde op dezelfde manier als in een sjabloon zoals ``{series_index:05.2f| - |- }``. Deze functie is voorzien om conversie te vergemakkelijken van ingewikkelde één-functie- of sjabloon-programma-modus sjablonen naar `GPM` Sjablonen. Bv. het volgende programma geeft dezelfde output als bovenstaande sjabloon::
ta: `` FINT_FORMATTING (VAL, FMT, முன்னொட்டு, பின்னொட்டு) `` - `{sitery_index: 05.2f | போன்ற ஒரு டெம்ப்ளேட்டில் செய்ததைப் போலவே ஒரு மதிப்புக்கு வடிவம், முன்னொட்டு மற்றும் பின்னொட்டைப் பயன்படுத்துங்கள் - |-} ``. சிக்கலான ஒற்றை-செயல்பாடு- அல்லது வார்ப்புரு-நிரல்-முறை வார்ப்புருக்களை `ஜிபிஎம்` வார்ப்புருக்களாக மாற்றுவதற்கு இந்த செயல்பாடு வழங்கப்படுகிறது. எடுத்துக்காட்டாக, பின்வரும் நிரல் மேலே உள்ள வார்ப்புருவின் அதே வெளியீட்டை உருவாக்குகிறது ::

source: Another example: for the template ``{series:re(([^\s])[^\s]+(\s|$),\1)}{series_index:0>2s| - | - }{title}`` use::
ja: 別の例: テンプレート ``{series:re(([^\s])[^\s]+(\s|$),\1)}{series_index:0>2s| - | - }{title}`` には次を使用します::
nl: Nog een voorbeeld: voor de sjabloon ``{series:re(([^\s])[^\s]+(\s|$),\1)}{series_index:0>2s| - | - }{title}`` gebruik::
ta: மற்றொரு எடுத்துக்காட்டு: வார்ப்புருவுக்கு `{தொடர்: மறு (([^\ s]) [^\ s]+(\ s | $), \ 1)} {sitery_index: 0> 2s | - | -} {தலைப்பு} `` பயன்பாடு ::

source: ``first_matching_cmp(val, [ cmp, result, ]* else_result)`` -- compares ``val < cmp`` in sequence, returning the associated result for the first comparison that succeeds. Returns else_result if no comparison succeeds. Example::
ja: ``first_matching_cmp(val, [ cmp, result, ]* else_result)`` -- ``val < cmp`` を順番に比較し、成功した最初の比較に関連づけられた結果を返します。比較が成功しなかった場合は else_result を返します。例::
nl: ``first_matching_cmp(val, [ cmp, result, ]* else_result)`` -- vergelijkt ``val < cmp`` in volgorde, het geassocieerde resultaat teruggevend voor de eerste vergelijking die klopt. Geeft else_result terug als geen vergelijking klopt. Bv::
ta: `` `first_matching_cmp (val, [cmp, result,]* else_result)` ` - வரிசையில்` `val <cmp`` ஐ ஒப்பிடுகிறது, வெற்றிபெறும் முதல் ஒப்பீட்டிற்கு தொடர்புடைய முடிவைத் திருப்பித் தருகிறது. எந்த ஒப்பீடும் வெற்றிபெறவில்லை என்றால் வேறு_ -ரீசால்ட் திரும்பும். உதாரணமாக::

source: returns ``"large"``. The same example with a first value of 16 returns ``"giant"``.
ja: これは ``"large"`` を返します。同じ例で最初の値を 16 にすると ``"giant"`` を返します。
nl: geeft ``"large"`` terug. Hetzelfde voorbeeld met een eerste warde van 16 geeft ``"giant"`` terug.
ta: `` "பெரிய" `` ஐத் தருகிறது. 16 முதல் மதிப்புடன் அதே எடுத்துக்காட்டு `` "ஜெயண்ட்" `` `.

source: ``first_non_empty(value [, value]*)`` -- returns the first ``value`` that is not empty. If all values are empty, then the empty string is returned. You can have as many values as you want.
ja: ``first_non_empty(value [, value]*)`` -- 空ではない最初の ``value`` を返します。すべての値が空の場合、空の文字列が返されます。必要なだけの数の value を渡すことができます。
nl: ``first_non_empty(value [, value]*)`` -- geeft de eerste ``value`` terug welke niet leeg is. Als alle waardes leeg zijn, wordt de lege string terug gegeven. U kan zo veel waardes opgeven als u wilt.
ta: `` `first_non_empty (மதிப்பு [, மதிப்பு]*)` ` - காலியாக இல்லாத முதல்` `மதிப்பு`` ஐ வழங்குகிறது. எல்லா மதிப்புகளும் காலியாக இருந்தால், வெற்று சரம் திரும்பும். நீங்கள் விரும்பும் பல மதிப்புகளை நீங்கள் கொண்டிருக்கலாம்.

source: ``floor(x)`` -- returns the largest integer less than or equal to ``x``. Throws an exception if ``x`` is not a number.
ja: ``floor(x)`` -- ``x`` 以下の最大の整数を返します。``x`` が数値でない場合、例外をスローします。
nl: ``floor(x)`` -- geeft de grootste integer terug kleiner dan of gelijk aan ``x``. Gooit een uitzondering als ``x`` geen getal is.
ta: `` மாடி (x) `` - `` x`` ஐ விட குறைவாகவோ அல்லது சமமாகவோ மிகப்பெரிய முழு எண்ணை வழங்குகிறது. `` X`` ஒரு எண் இல்லையென்றால் விதிவிலக்கை வீசுகிறது.

source: ``format_date(val, format_string)`` -- format the value, which must be a date string, using the format_string, returning a string. The formatting codes are:
ja: ``format_date(val, format_string)`` -- format_string を使用して、文字列を返す値を整形します。これは日付文字列である必要があります。書式コードは次のとおりです:
nl: ``format_date(val, format_string)`` -- maak de waarde op, die een datumstring moet zijn, met behulp van format_string, geef een string terug. De opmaakcodes zijn:
ta: `` format_date (val, format_string) `` - மதிப்பை வடிவமைக்கவும், இது ஒரு தேதி சரமாக இருக்க வேண்டும், வடிவத்தைப் பயன்படுத்தி, ஒரு சரத்தை திருப்பி விடுங்கள். வடிவமைப்பு குறியீடுகள்:

source: ``d :`` the day as number without a leading zero (1 to 31)
ja: ``d :`` 先行ゼロのない数値としての日 (1から31)
nl: ``d :`` de dag als getal zonder voorloopnul (1 to 31)
ta: `` டி: `` ஒரு முன்னணி பூஜ்ஜியமில்லாத நாளாக (1 முதல் 31 வரை)

source: ``dd :`` the day as number with a leading zero (01 to 31)
ja: ``dd :`` 先行ゼロ付きの数値としての日 (01 to 31)
nl: ``dd :`` de dag als getal met voorloopnul (01 to 31)
ta: `` டி.டி: `` ஒரு முன்னணி பூஜ்ஜியத்துடன் கூடிய நாள் (01 முதல் 31 வரை)

source: ``ddd :`` the abbreviated localized day name (e.g. "Mon" to "Sun").
ja: ``ddd :`` ローカライズされた曜日の省略名 (例: "Mon" から "Sun").
nl: ``ddd :`` de afgekorte gelokaliseerde dag naam (bv. "Maa" tot "Zon").
ta: `` டி.டி.டி: `` சுருக்கமாக உள்ளூர்மயமாக்கப்பட்ட நாள் பெயர் (எ.கா. "தி மோன்" முதல் "சூரியன்").

source: ``dddd :`` the long localized day name (e.g. "Monday" to "Sunday").
ja: ``dddd :`` ローカライズされた曜日の正式名 (例: "Monday" から "Sunday").
nl: ``dddd :`` de voluit gelokaliseerde dag naam (bv. "Maandag" tot "Zondag").
ta: `` dddd: `` நீண்ட உள்ளூர்மயமாக்கப்பட்ட நாள் பெயர் (எ.கா. "திங்கள்" முதல் "ஞாயிறு" வரை).

source: ``M :`` the month as number without a leading zero (1 to 12).
ja: ``M :`` 先行ゼロのない数値としての月 (1 から 12).
nl: ``M :`` de maand als getal zonder voorloopnul (1 to 12)
ta: `` எம்: `` மாதம் ஒரு முன்னணி பூஜ்ஜியம் இல்லாத எண்ணாக (1 முதல் 12 வரை).

source: ``MM :`` the month as number with a leading zero (01 to 12)
ja: ``MM :`` 先行ゼロ付きの数値としての月 (01 から 12)
nl: ``MM :`` de maand als getal met voorloopnul (01 to 12)
ta: `` மிமீ: `` ஒரு முன்னணி பூஜ்ஜியத்துடன் கூடிய மாதமாக (01 முதல் 12 வரை)

source: ``MMM :`` the abbreviated localized month name (e.g. "Jan" to "Dec").
ja: ``MMM :`` ローカライズされた月の省略名 (例: "Jan" から "Dec").
nl: ``MMM :`` de afgekorte gelokaliseerde maandnaam (bv. "jan" tot "dec").
ta: `` எம்.எம்.எம்: `` சுருக்கமாக உள்ளூர்மயமாக்கப்பட்ட மாத பெயர் (எ.கா. "ஜனவரி" முதல் "டிசம்பர்" வரை).
