Repository: debian-calibre/calibre
Catalog: translations/manual/*/template_lang.po
Languages: ja, nl, ta, zh_cn

source: The output in :guilabel:`Book details` looks like this:
ta: வெளியீடு: கிலாபெல்: `புத்தக விவரங்கள்` இது போல் தெரிகிறது:
zh_cn: “:guilabel:图书详情”面板中的输出效果如下：

source: E-book conversion dialog
ja: 電子書籍変換ダイアログ
nl: E-boek conversie dialoog
ta: மின் புத்தக மாற்று உரையாடல்
zh_cn: 电子书转换对话

source: Stored templates
ja: 保存済みテンプレート
nl: Opgeslagen sjablonen
ta: சேமிக்கப்பட்ட வார்ப்புருக்கள்
zh_cn: 保存的模板

source: Both :ref:`General Program Mode <general_mode>` and :ref:`Python Template Mode <python_mode>` support saving templates and calling those templates from another template, much like calling stored functions. You save templates using :guilabel:`Preferences->Advanced->Template functions`. More information is provided in that dialog. You call a template the same way you call a function, passing positional arguments if desired. An argument can be any expression. Examples of calling a template, assuming the stored template is named ``foo``:
ta: இரண்டும்: குறிப்பு: `பொது நிரல் பயன்முறை <பொது_மோட்>` மற்றும்: குறிப்பு: `பைதான் வார்ப்புரு பயன்முறை <பைதான்_மோட்>` சேமிப்பு வார்ப்புருக்கள் மற்றும் அந்த வார்ப்புருக்களை மற்றொரு வார்ப்புருவில் இருந்து அழைப்பதை ஆதரிக்கவும், சேமிக்கப்பட்ட செயல்பாடுகளை அழைப்பது போன்றது. பயன்படுத்தி வார்ப்புருக்களைச் சேமிக்கிறீர்கள்: கிலாபெல்: `விருப்பத்தேர்வுகள்-> மேம்பட்ட-> வார்ப்புரு செயல்பாடுகள்`. அந்த உரையாடலில் மேலும் தகவல்கள் வழங்கப்பட்டுள்ளன. நீங்கள் ஒரு செயல்பாட்டை அழைப்பது போலவே ஒரு வார்ப்புருவை அழைக்கிறீர்கள், விரும்பினால் நிலை வாதங்களை கடந்து செல்கிறீர்கள். ஒரு வாதம் எந்த வெளிப்பாடாகவும் இருக்கலாம். ஒரு வார்ப்புருவை அழைப்பதற்கான எடுத்துக்காட்டுகள், சேமிக்கப்பட்ட வார்ப்புருவுக்கு `` foo`` என்று பெயரிடப்பட்டுள்ளது என்று கருதுகிறது:
zh_cn: “通用程序模式 <general_mode>”和“Python 模板模式 <python_mode>”都支持保存模板并从另一个模板调用这些模板，就像调用存储的函数一样。 您可以使用“首选项->高级->模板功能”保存模板。 该对话框中提供了更多信息。 您可以像调用函数一样调用模板，并根据需要传递位置参数。 参数可以是任何表达式。 调用模板的示例，假设存储的模板名为“foo”：

source: ``foo()`` -- call the template passing no arguments.
ja: ``foo()`` -- 引数を渡さずにテンプレートを呼び出します。
nl: ``foo()`` -- roep de sjabloon aan zonder argumenten door te geven.
ta: `` foo () `` - எந்த வாதங்களையும் கடந்து செல்லும் வார்ப்புருவை அழைக்கவும்.
zh_cn: foo() —— 调用该模板函数且不传递任何参数。

source: ``foo(a, b)`` call the template passing the values of the two variables ``a`` and ``b``.
ja: ``foo(a, b)`` は、2 つの変数 ``a`` と ``b`` の値を渡すテンプレートを呼び出します。
nl: ``foo(a, b)`` roep de sjabloon aan met doorgeven van de waardes van de twee variabelen ``a`` en ``b``.
ta: `` foo (a, b) `` இரண்டு மாறிகளின் மதிப்புகளை கடந்து செல்லும் வார்ப்புருவை அழைக்கவும் `` a`` மற்றும் `` b``.
zh_cn: foo(a, b) —— 调用该模板函数并传递变量 a 和 b 的值。

source: ``foo(if field('series') then field('series_index') else 0 fi)`` -- if the book has a ``series`` then pass the ``series_index``, otherwise pass the value ``0``.
ja: ``foo(if field('series') then field('series_index') else 0 fi)`` -- 本に ``series`` があれば ``series_index`` を渡し、そうでなければ値 ``0`` を渡します。
nl: ``foo(if field('series') then field('series_index') else 0 fi)`` -- als het boek een ``series`` heeft, passeer de ``series_index``, anders de waarde ``0``.
ta: `` ஃபூ (புலம் ('தொடர்') பின்னர் புலம் ('சீரிஸ்_இண்டெக்ஸ்') வேறு 0 fi) `` - புத்தகத்தில் `` தொடர்`` இருந்தால் `` sitery_index`` ஐ கடந்து செல்லுங்கள், இல்லையெனில் மதிப்பை அனுப்பவும் ` `0``.
zh_cn: foo(if field('series') then field('series_index') else 0 fi) —— 如果书籍有“丛书，则传递其“丛书编号”（series_index）；否则传递值 0。

source: In GPM you retrieve the arguments passed in the call to the stored template using the ``arguments`` function. It both declares and initializes local variables, effectively parameters. The variables are positional; they get the value of the parameter given in the call in the same position. If the corresponding parameter is not provided in the call then ``arguments`` assigns that variable the provided default value. If there is no default value then the variable is set to the empty string. For example, the following ``arguments`` function declares 2 variables, ``key``, ``alternate``::
ta: ஜி.பி.எம்மில் நீங்கள் `` வாதங்கள்`` செயல்பாட்டைப் பயன்படுத்தி சேமிக்கப்பட்ட வார்ப்புருவுக்கான அழைப்பில் அனுப்பப்பட்ட வாதங்களை மீட்டெடுக்கிறீர்கள். இது உள்ளூர் மாறிகள், திறம்பட அளவுருக்களை அறிவித்து துவக்குகிறது. மாறிகள் நிலை; அழைப்பில் கொடுக்கப்பட்ட அளவுருவின் மதிப்பை அவர்கள் அதே நிலையில் பெறுகிறார்கள். தொடர்புடைய அளவுரு அழைப்பில் வழங்கப்படாவிட்டால், `` வாதங்கள்`` அந்த மாறியை வழங்கிய இயல்புநிலை மதிப்பை ஒதுக்குகிறது. இயல்புநிலை மதிப்பு இல்லை என்றால், மாறி வெற்று சரத்திற்கு அமைக்கப்படுகிறது. எடுத்துக்காட்டாக, பின்வரும் `` வாதங்கள்`` செயல்பாடு 2 மாறிகள், `` விசை``, `` மாற்று`` ::
zh_cn: 在 GPM 中，您可以使用“arguments”函数检索在调用存储模板时传递的参数。 它声明并初始化局部变量，即有效的参数。 变量是位置变量； 他们在同一位置获取调用中给出的参数值。 如果调用中未提供相应的参数，则“arguments”会为该变量分配提供的默认值。 如果没有默认值，则该变量将设置为空字符串。 例如，以下“arguments”函数声明 2 个变量“key”、“alternate”：

source: Examples, again assuming the stored template is named ``foo``:
ja: 例として、保存されたテンプレートの名前が今回も ``foo`` であると仮定します:
nl: Voorbeelden, er weer vanuit gaand dat de opgeslagen sjabloon ``foo`` heet:
ta: எடுத்துக்காட்டுகள், மீண்டும் சேமிக்கப்பட்ட வார்ப்புருவை `` foo`` என்று பெயரிட்டதாகக் கருதினால்:
zh_cn: 示例（同样假设存档模板名称为 foo）:

source: ``foo('#myseries')`` -- argument ``key`` is assigned the value ``'myseries'`` and the argument ``alternate`` is assigned the default value ``'series'``.
ja: ``foo('#myseries')`` -- 引数 ``key`` には値 ``'myseries'`` が割り当てられ、引数 ``alternate`` にはデフォルト値 ``'series'`` が割り当てられます。
nl: ``foo('#myseries')`` -- argument ``key`` krijgt de waarde ``'myseries'`` toegewezen en het argument ``alternate`` krijgt de standaard waarde ``'series'`` toegewezen.
ta: `` foo ('#myseries') `` - வாதம் `` key`` மதிப்பு `` 'myseries'`` மற்றும் `` மாற்று`` இயல்புநிலை மதிப்பு ``' தொடர்'````````` ' .
zh_cn: foo('#myseries') —— 参数 key 被赋值为 'myseries'，而参数 alternate 则被赋予默认值 'series'。

source: ``foo('series', '#genre')`` the variable ``key`` is assigned the value ``'series'`` and the variable ``alternate`` is assigned the value ``'#genre'``.
ja: ``foo('series', '#genre')`` 変数 ``key`` には値 ``'series'`` が割り当てられ、変数 ``alternate`` には値 ``'#genre'`` が割り当てられます。
nl: ``foo('series', '#genre')`` de variabele ``key`` krijgt de waarde ``'series'`` toegewezen en de variabele ``alternate`` de waarde ``'#genre'``.
ta: `` foo ('தொடர்', '#genre') `` `மாறி` `KEY`` மதிப்பை` `'தொடர்'`` மற்றும்` `மாற்று`` என்ற மதிப்பை ஒதுக்கப்படுகிறது` `#Genre '``.
zh_cn: foo('series', '#genre') —— 变量 key 被赋值为 'series'，变量 alternate 被赋值为 '#genre'。

source: ``foo()`` -- the variable ``key`` is assigned the empty string and the variable ``alternate`` is assigned the value ``'series'``.
ja: ``foo()`` -- 変数 ``key`` には空の文字列が割り当てられ、変数 ``alternate`` には値 ``'series'`` が割り当てられます。
nl: ``foo()`` -- de variabele ``key`` krijgt de lege string toegewezen en de variabele ``alternate`` de waarde ``'series'``.
ta: `` foo () `` - மாறி `` KEY`` வெற்று சரம் ஒதுக்கப்படுகிறது மற்றும் `` மாற்று`` என்ற மாறி `` 'தொடர்'`` என்ற மதிப்பை ஒதுக்குகிறது.
zh_cn: foo() —— 变量 key 被赋值为空字符串，而变量 alternate 则被赋予值 'series'。

source: In PTM the arguments are passed in the ``arguments`` parameter, which is a list of strings. There isn't any way to specify default values. You must check the length of the ``arguments`` list to be sure that the number of arguments is what you expect.
ta: PTM இல் வாதங்கள் `` வாதங்கள்` `அளவுருவில் அனுப்பப்படுகின்றன, இது சரங்களின் பட்டியல். இயல்புநிலை மதிப்புகளைக் குறிப்பிட எந்த வழியும் இல்லை. வாதங்களின் எண்ணிக்கை நீங்கள் எதிர்பார்ப்பது என்பதை உறுதிப்படுத்த `` வாதங்கள்` பட்டியலின் நீளத்தை நீங்கள் சரிபார்க்க வேண்டும்.
zh_cn: 在PTM中，参数在“arguments”参数中传递，该参数是字符串列表。没有任何方法可以指定默认值。您必须检查“参数”列表的长度，以确保参数的数量符合您的期望。

source: An easy way to test stored templates is using the ``Template tester`` dialog. For ease of access give it a keyboard shortcut in :guilabel:`Preferences->Advanced->Keyboard shortcuts->Template tester`. Giving the ``Stored templates`` dialog a shortcut will help switching more rapidly between the tester and editing the stored template's source code.
ja: 保存済みテンプレートをテストする簡単な方法は、 ``テンプレートテスタ`` ダイアログを使用することです。アクセスしやすくするには、:guilabel:`環境設定->高度な設定->キーボードショートカット->テンプレートテスタ` でキーボードショートカットを指定します。 ``保存済みテンプレート`` ダイアログにショートカットを指定すると、テスタをすばやく切り替えたり、保存されたテンプレートのソースコードを編集したりするのに役立ちます。
ta: சேமிக்கப்பட்ட வார்ப்புருக்களை சோதிக்க ஒரு எளிதான வழி `` வார்ப்புரு சோதனையாளர்` உரையாடலைப் பயன்படுத்துகிறது. அணுகலின் எளிமைக்கு இதற்கு ஒரு விசைப்பலகை குறுக்குவழியைக் கொடுங்கள்: கிலாபெல்: `விருப்பத்தேர்வுகள்-> மேம்பட்ட-> விசைப்பலகை குறுக்குவழிகள்-> வார்ப்புரு சோதனையாளர்`. `` சேமிக்கப்பட்ட வார்ப்புருக்கள்` `உரையாடலை ஒரு குறுக்குவழியைக் கொடுப்பது சோதனையாளருக்கு இடையில் விரைவாக மாறவும், சேமிக்கப்பட்ட வார்ப்புருவின் மூலக் குறியீட்டைத் திருத்தவும் உதவும்.
zh_cn: 测试存储模板的一种简单方法是使用“模板测试器”对话框。 为了便于访问，请在“首选项->高级->键盘快捷键->模板测试器”中为其提供键盘快捷键。 为“存储的模板”对话框提供快捷方式将有助于在测试器和编辑存储的模板的源代码之间更快地切换。

source: Providing additional information to templates
ja: テンプレートに追加情報を与える
nl: Bijkomende informatie voor sjablonen voorzien
ta: வார்ப்புருக்களுக்கு கூடுதல் தகவல்களை வழங்குதல்
zh_cn: 为模板提供额外信息

source: A developer can choose to pass additional information to the template processor, such as application-specific book metadata or information about what the processor is being asked to do. A template can access this information and use it during the evaluation.
ja: 開発者は、アプリケーション固有の本の書誌やプロセッサに要求されていることに関する情報など、追加情報をテンプレートプロセッサに渡すことを選択できます。テンプレートはこの情報にアクセスして、評価中に使用できます。
ta: பயன்பாட்டு-குறிப்பிட்ட புத்தக மெட்டாடேட்டா போன்ற வார்ப்புரு செயலிக்கு கூடுதல் தகவல்களை அனுப்ப ஒரு டெவலப்பர் தேர்வு செய்யலாம் அல்லது செயலி என்ன செய்யக் கேட்கப்படுகிறது என்பது பற்றிய தகவல்கள். ஒரு வார்ப்புரு இந்த தகவலை அணுகலாம் மற்றும் மதிப்பீட்டின் போது அதைப் பயன்படுத்தலாம்.
zh_cn: 开发人员可以选择将附加信息传递给模板处理器，例如应用程序特定的书籍元数据或有关处理器被要求执行什么的信息。模板可以访问此信息并在评估期间使用它。

source: **Developer: how to pass additional information**
ja: **開発者: 追加情報の渡し方**
nl: **Ontwikkelaar: hoe bijkomende informatie doorgeven**
ta: ** டெவலப்பர்: கூடுதல் தகவல்களை எவ்வாறு அனுப்புவது **
zh_cn: **开发者：如何传递额外信息**

source: The additional information is a Python dictionary containing pairs ``variable_name: variable_value`` where the values must be strings. The template can access the dictionary, creating template local variables named ``variable_name`` containing the value ``variable_value``. The user cannot change the name so it is best to use names that won't collide with other template local variables, for example by prefixing the name with an underscore.
ta: கூடுதல் தகவல்கள் `` மாறி_பெயர்: மாறி_ மதிப்புள்ள ஜோடிகளைக் கொண்ட பைதான் அகராதி ஆகும், அங்கு மதிப்புகள் சரங்களாக இருக்க வேண்டும். வார்ப்புரு அகராதியை அணுகலாம், `` Variang_value`` மதிப்பைக் கொண்ட `` varian_name`` என்ற பெயரிடப்பட்ட வார்ப்புரு உள்ளூர் மாறிகள் உருவாக்கலாம். பயனரால் பெயரை மாற்ற முடியாது, எனவே பிற வார்ப்புரு உள்ளூர் மாறிகளுடன் மோதாத பெயர்களைப் பயன்படுத்துவது சிறந்தது, எடுத்துக்காட்டாக பெயரை அடிக்கோடிட்டுக் காட்டுவதன் மூலம்.
zh_cn: 附加信息是一个包含“变量名：变量值”对的 Python 字典，其中值必须是字符串。 模板可以访问字典，创建名为“variable_name”的模板局部变量，其中包含值“variable_value”。 用户无法更改名称，因此最好使用不会与其他模板局部变量冲突的名称，例如在名称前添加下划线。

source: This dictionary is passed to the template processor (the ``formatter``) using the named parameter ``global_vars=your_dict``. The full method signature is::
ta: இந்த அகராதி பெயரிடப்பட்ட அளவுருவைப் பயன்படுத்தி `` உலகளாவிய_வார்ஸ் = உங்கள்_டிக்ட்`` ஐப் பயன்படுத்தி வார்ப்புரு செயலிக்கு (`` ஃபார்மேட்டர்``) அனுப்பப்படுகிறது. முழு முறை கையொப்பம் ::
zh_cn: 该字典通过命名参数 global_vars=your_dict 传递给模板处理器（即 formatter）。完整的方法签名如下::

source: **Template writer: how to access the additional information**
ja: **テンプレート作者: 追加情報のアクセス方法**
nl: **Sjabloon schrijver: hoe toegang krijgen tot de bijkomende informatie**
ta: ** வார்ப்புரு எழுத்தாளர்: கூடுதல் தகவல்களை எவ்வாறு அணுகுவது **
zh_cn: **模板编写者：如何访问额外信息**

source: You access the additional information (the ``globals`` dictionary) in a template using the template function::
ta: வார்ப்புரு செயல்பாட்டைப் பயன்படுத்தி ஒரு வார்ப்புருவில் கூடுதல் தகவலை (`` குளோபல்ஸ்` அகராதி) அணுகலாம் ::
zh_cn: 您可以在模板中使用以下模板函数来访问额外信息（即 globals 字典）::

source: where ``id`` is any legal variable name. This function checks whether the additional information provided by the developer contains the name. If it does then the function assigns the provided value to a template local variable with that name. If the name is not in the additional information and if an ``expression`` is provided, the ``expression`` is evaluated and the result is assigned to the local variable. If neither a value nor an expression is provided, the function assigns the empty string (``''``) to the local variable.
ja: ここで、``id`` は任意の有効な変数名です。この関数は、開発者から提供された追加情報に名前が含まれているかどうかを確認します。その場合、関数は提供された値をその名前のテンプレートローカル変数に割り当てます。名前が追加情報に含まれておらず、式が指定されている場合、式が評価され、結果がローカル変数に割り当てられます。値も式も指定されていない場合、関数は空の文字列 (``''``) をローカル変数に割り当てます。
ta: `` ஐடி`` என்பது ஏதேனும் சட்டப்பூர்வ மாறி பெயர். டெவலப்பர் வழங்கிய கூடுதல் தகவல்களில் பெயர் உள்ளதா என்பதை இந்த செயல்பாடு சரிபார்க்கிறது. அவ்வாறு செய்தால், செயல்பாடு அந்த பெயருடன் ஒரு வார்ப்புரு உள்ளூர் மாறிக்கு வழங்கப்பட்ட மதிப்பை ஒதுக்குகிறது. பெயர் கூடுதல் தகவலில் இல்லை என்றால், `` வெளிப்பாடு`` வழங்கப்பட்டால், `` வெளிப்பாடு`` மதிப்பீடு செய்யப்பட்டு, இதன் விளைவாக உள்ளூர் மாறிக்கு ஒதுக்கப்படுகிறது. ஒரு மதிப்பு அல்லது வெளிப்பாடு வழங்கப்படாவிட்டால், செயல்பாடு உள்ளூர் மாறிக்கு வெற்று சரத்தை (`` '' ``) ஒதுக்குகிறது.
zh_cn: 其中“id”是任何合法的变量名称。 该函数检查开发者提供的附加信息中是否包含该名称。 如果是，则该函数将提供的值分配给具有该名称的模板局部变量。 如果附加信息中没有该名称，并且提供了“表达式”，则计算“表达式”并将结果分配给局部变量。 如果既没有提供值也没有提供表达式，函数会将空字符串 (``''``) 分配给局部变量。

source: A template can set a value in the ``globals`` dictionary using the template function::
ta: ஒரு வார்ப்புரு வார்ப்புரு செயல்பாட்டைப் பயன்படுத்தி `` குளோபல்ஸ்` `அகராதியில் ஒரு மதிப்பை அமைக்க முடியும் ::
zh_cn: 模板可以使用以下模板函数在 globals 字典中设置值::

source: This function sets the ``globals`` dictionary key:value pair ``id:value`` where ``value`` is the value of the template local variable ``id``. If that local variable doesn't exist then ``value`` is set to the result of evaluating ``expression``.
ta: இந்த செயல்பாடு `` குளோபல்ஸ்` அகராதி விசையை அமைக்கிறது: மதிப்பு ஜோடி `` ஐடி: மதிப்பு`` அங்கு `` மதிப்பு`` என்பது வார்ப்புரு உள்ளூர் மாறியின் மதிப்பு `` ஐடி``. அந்த உள்ளூர் மாறி இல்லை என்றால், `` வெளிப்பாடு`` மதிப்பிடுவதன் விளைவாக `` மதிப்பு`.
zh_cn: 此函数用于设置“全局范围”词典，key:value配对``id:value`` ，其中“value”是模板局部变量“id”的值。如果该局部变量不存在，则将“value”设置为“表达式”的求值结果。

source: Notes on the difference between modes
ja: モード間の違いに関する注意事項
ta: முறைகளுக்கு இடையிலான வேறுபாடு குறித்த குறிப்புகள்
zh_cn: 关于不同模式之间差异的注释

source: The three program modes, :ref:`Single Function Mode <single_mode>` (SFM), :ref:`Template Program Mode <template_mode>` (`TPM`), and :ref:`General Program Mode <general_mode>` (`GPM`), work differently. SFM is intended to be 'simple' so it hides a lot of programming language bits.
ja: 3つのプログラムモード、 :ref:`単関数モード <single_mode>` (SFM), :ref:`テンプレートプログラムモード <template_mode>` (`TPM`), and :ref:`一般プログラムモード <general_mode>` (`GPM`)は、それぞれ動作が異なります。 SFMは「シンプル」を目指しているため、多くのプログラミング言語情報を隠します。
ta: மூன்று நிரல் முறைகள்,: குறிப்பு: `ஒற்றை செயல்பாட்டு பயன்முறை <ஒற்றை_மோட்>` (எஸ்.எஃப்.எம்),: குறிப்பு: `வார்ப்புரு நிரல் பயன்முறை <டெம்ப்ளேட்_மோட்>` (`டிபிஎம்`), மற்றும்: குறிப்பு:` பொது நிரல் பயன்முறை <பொது_மோட்> `( `ஜிபிஎம்`), வித்தியாசமாக வேலை செய்யுங்கள். எஸ்.எஃப்.எம் 'எளிமையானது' என்று கருதப்படுகிறது, எனவே இது நிறைய நிரலாக்க மொழி பிட்களை மறைக்கிறது.
zh_cn: 三种程序模式：:ref:`Single Function Mode <single_mode>` (SFM), :ref:`Template Program Mode<template_mode> ` (`TPM`), 以及 :ref:`General Program Mode<general_mode> ` (`GPM`),的工作方式各不相同。SFM 旨在保持‘简单’，因此它隐藏了许多编程语言的细节。

source: Differences:
ja: 相違点:
nl: Verschillen:
ta: வேறுபாடுகள்:
zh_cn: 差异:

source: In SFM the value of the column is always passed as an 'invisible' first argument to a function included in the template.
ja: SFM では、列の値は常に「非表示」の最初の引数としてテンプレートに含まれる関数に渡されます。
ta: SFM இல், நெடுவரிசையின் மதிப்பு எப்போதும் வார்ப்புருவில் சேர்க்கப்பட்டுள்ள ஒரு செயல்பாட்டிற்கு 'கண்ணுக்கு தெரியாத' முதல் வாதமாக அனுப்பப்படுகிறது.
zh_cn: 在单函数模式（SFM）中，列的值总是作为‘不可见’的第一个参数，传递给模板中所包含的函数。

source: SFM doesn't support the difference between variables and strings; all values are strings.
ja: SFMは、変数と文字列の違いをサポートしていません。すべての値は文字列です。
ta: SFM மாறிகள் மற்றும் சரங்களுக்கு இடையிலான வேறுபாட்டை ஆதரிக்காது; அனைத்து மதிப்புகளும் சரங்கள்.
zh_cn: SFM 不支持变量与字符串之间的区别；所有值都被视为字符串。

source: The following SFM template returns either the series name or the string "no series"::
ja: 次のSFMテンプレートは、シリーズ名か文字列 "no series" のいずれかを返します::
ta: பின்வரும் SFM வார்ப்புரு தொடர் பெயர் அல்லது "தொடர் இல்லை" என்ற சரத்தை வழங்குகிறது ::
zh_cn: 以下 SFM 模板会返回丛书名称，或者返回字符串“no series”::

source: The equivalent template in `TPM` is ::
ja: `TPM` で同等のテンプレートは ::
nl: De soortgelijke sjabloon in `SPM` is::
ta: `TPM` இல் சமமான வார்ப்புரு ::
zh_cn: 在 TPM（模板程序模式）中，等效的模板为::

source: The equivalent template in `GPM` is::
ja: `GPM` で同等のテンプレートは::
nl: De soortgelijke sjabloon in `APM` is::
ta: `ஜி.பி.எம்` இல் சமமான வார்ப்புரு ::
zh_cn: 在 GPM（通用程序模式）中，等效的模板为::

source: The first argument to ``ifempty`` is the value of the field ``series``. The second argument is the string ``no series``. In SFM the first argument, the value of the field, is automatically passed (the invisible argument).
ja: ``ifempty`` の最初の引数は、フィールド ``series`` の値です。 2 番目の引数は文字列 ``no series`` です。 SFMでは、最初の引数であるフィールドの値が自動的に渡されます (非表示の引数)。
ta: `` Ifempty`` க்கான முதல் வாதம் புலத்தின் மதிப்பு `` தொடர்``. இரண்டாவது வாதம் சரம் `` இல்லை தொடர்``. SFM இல் முதல் வாதம், புலத்தின் மதிப்பு தானாகவே அனுப்பப்படுகிறது (கண்ணுக்கு தெரியாத வாதம்).
zh_cn: ifempty 的第一个参数是 series 字段的值。第二个参数是字符串 no series。在单函数模式（SFM）中，第一个参数（即字段的值）是自动传递的（即不可见参数）。

source: Several template functions, for example ``booksize()`` and ``current_library_name()``, take no arguments. Because of the 'invisible argument' you cannot use these functions in SFM.
ja: ``booksize()`` や ``current_library_name()`` などのテンプレート関数には引数を受け取らないものがいくつかあります。 「目に見えない引数」を使用するせいで、SFMではこれらの関数は使用できません。
ta: பல வார்ப்புரு செயல்பாடுகள், எடுத்துக்காட்டாக `` புத்தகங்களை () `` மற்றும் `` நடப்பு_லிபரி_பேம் () ``, எந்த வாதங்களும் எடுக்கவில்லை. 'கண்ணுக்கு தெரியாத வாதம்' காரணமாக இந்த செயல்பாடுகளை SFM இல் பயன்படுத்த முடியாது.
zh_cn: 一些模板函数（例如 booksize() 和 current_library_name()）不接受任何参数。由于存在‘不可见参数’，您无法在单函数模式（SFM）中使用这些函数。

source: Nested functions, where a function calls another function to compute an argument, cannot be used in SFM. For example this template, intended to return the first 5 characters of the series value uppercased, won't work in SFM::
ja: 関数が別の関数を呼び出して引数を計算する入れ子関数は、SFMでは使用できません。たとえば、大文字のシリーズ値の最初の 5 文字を​​返すことを目的としたこのテンプレートは、SFMでは機能しません::
ta: ஒரு வாதத்தை கணக்கிட மற்றொரு செயல்பாட்டை ஒரு செயல்பாடு அழைக்கும் உள்ளமைக்கப்பட்ட செயல்பாடுகள், SFM இல் பயன்படுத்த முடியாது. எடுத்துக்காட்டாக, இந்த வார்ப்புரு, தொடர் மதிப்பின் முதல் 5 எழுத்துக்களைத் திருப்பித் தரும் நோக்கம் கொண்டது, SFM இல் வேலை செய்யாது ::
zh_cn: 嵌套函数，指其中一个函数调用另一个函数来计算参数，不能在SFM中使用。例如，此模板旨在返回升级后的系列值的前5个字符，在SFM中不起作用：

source: `TPM` and `GPM` support nested functions. The above template in `TPM` would be::
ja: `TPM` と`GPM` は、入れ子の関数をサポートします。 `TPM` の上記のテンプレートは次のようになります。
ta: `TPM` மற்றும்` gpm` ஆகியவை உள்ளமைக்கப்பட்ட செயல்பாடுகளை ஆதரிக்கின்றன. `TPM` இல் உள்ள வார்ப்புரு ::
zh_cn: TPM 和 GPM 支持嵌套函数。上述模板在 TPM（模板程序模式）中应为::

source: In `GPM` it would be::
ja: `GPM` では次のようになります::
ta: `ஜிபிஎம்` இல் ::
zh_cn: 在 GPM（通用程序模式）中，它应为::

source: As noted in the above :ref:`Template Program Mode <template_mode>` section, using ``{`` and ``}`` characters in `TPM` string literals can lead to errors or unexpected results because they confuse the template processor. It tries to treat them as template boundaries, not characters. In some but not all cases you can replace a ``{`` with ``[[`` and a ``}`` with `]]`. Generally, if your program contains ``{`` and ``}`` characters then you should use `General Program Mode`.
ja: 上記のテンプレートプログラムモードのセクションで説明したように、TPM文字列リテラルで{および}文字を使用すると、テンプレートプロセッサが混乱するため、エラーや予期しない結果が発生する可能性があります。それらを文字ではなくテンプレート境界として処理しようとします。すべてではありませんが ``{`` を ``[[`` に、そして ``}`` を `]]` に置き換えることができる場合もあります。一般的に、プログラムに ``{`` や ``}`` の文字が含まれている場合には `一般プログラムモード` を使用すべきです。
ta: மேலே குறிப்பிட்டுள்ளபடி: Ref: `வார்ப்புரு நிரல் பயன்முறை <template_mode>` பிரிவு, `` {`` மற்றும் ``} `` `டிபிஎம்` சரம் இலக்கிய எழுத்துக்கள் பிழைகள் அல்லது எதிர்பாராத முடிவுகளுக்கு வழிவகுக்கும், ஏனெனில் அவை வார்ப்புரு செயலி குழப்பத்தை ஏற்படுத்துகின்றன . இது அவர்களை வார்ப்புரு எல்லைகளாக கருத முயற்சிக்கிறது, எழுத்துக்கள் அல்ல. சில ஆனால் எல்லா நிகழ்வுகளிலும் நீங்கள் ஒரு `` `` `[` `மற்றும் ஒரு` `}` ``] `உடன் மாற்றலாம். பொதுவாக, உங்கள் நிரலில் `` {`` மற்றும் ``} `` எழுத்துக்கள் இருந்தால், நீங்கள் `பொது நிரல் பயன்முறையை` பயன்படுத்த வேண்டும்.
zh_cn: 如上面“模板程序模式 1”部分所述，在“TPM”字符串文字中使用“{”和“}”字符可能会导致错误或意外结果，因为它们会混淆模板处理器。 它尝试将它们视为模板边界，而不是字符。 在某些情况下，但不是所有情况下，您可以将 ``{`` 替换为 ``[[`` ，将 ``}`` 替换为 `]]` 。 一般来说，如果您的程序包含“{”和“}”字符，那么您应该使用“通用程序模式”。

source: User-defined Python template functions
ja: ユーザ定義の Python テンプレート関数
ta: பயனர் வரையறுக்கப்பட்ட பைதான் வார்ப்புரு செயல்பாடுகள்
zh_cn: 用户自定义 Python 模板函数

source: You can add your own Python functions to the template processor. Such functions can be used in any of the three template programming modes. The functions are added by going to :guilabel:`Preferences -> Advanced -> Template functions`. Instructions are shown in that dialog.
ja: テンプレートプロセッサに独自の Python 関数を追加できます。このような関数は、3つのテンプレートプログラミングモードのいずれでも使用できます。関数は :guilabel:`環境変数 -> 高度な設定 -> テンプレート関数` に行って追加します。手順はそのダイアログに表示されます。
ta: உங்கள் சொந்த பைதான் செயல்பாடுகளை வார்ப்புரு செயலியில் சேர்க்கலாம். இத்தகைய செயல்பாடுகளை மூன்று வார்ப்புரு நிரலாக்க முறைகளில் பயன்படுத்தலாம். செல்வதன் மூலம் செயல்பாடுகள் சேர்க்கப்படுகின்றன: கிலாபெல்: `விருப்பத்தேர்வுகள் -> மேம்பட்ட -> வார்ப்புரு செயல்பாடுகள்`. அந்த உரையாடலில் வழிமுறைகள் காட்டப்பட்டுள்ளன.

source: Special notes for save/send templates
ja: テンプレートの保存/送信に関する特記事項
nl: Extra opmerkingen voor opslaan/versturen van sjablonen
ta: வார்ப்புருக்கள் சேமிக்க/அனுப்ப சிறப்பு குறிப்புகள்
zh_cn: 关于保存/发送模板的特别说明

source: Special processing is applied when a template is used in a `save to disk` or `send to device` template. The values of the fields are cleaned, replacing characters that are special to file systems with underscores, including slashes. This means that field text cannot be used to create folders. However, slashes are not changed in prefix or suffix strings, so slashes in these strings will cause folders to be created. Because of this, you can create variable-depth folder structure.
ja: あるテンプレートが `ディスクに保存` や `デバイスに送信` テンプレートの中で使用される場合、特別な処理が適用されます。フィールドの値がクリーンアップされ、ファイルシステムに固有の文字がスラッシュを含むアンダースコアに置き換えられます。これは、フィールドテキストはフォルダの作成には使用できないことを意味します。ただし、プレフィックス文字列またはサフィックス文字列ではスラッシュが変更されないため、これらの文字列にスラッシュを含めると、フォルダが作成されます。このため、深さが可変のフォルダ構造を作成できます。
ta: ஒரு வார்ப்புரு `சேமி வட்டுக்கு` அல்லது` சாதனத்திற்கு அனுப்புங்கள்` வார்ப்புருவில் பயன்படுத்தப்படும்போது சிறப்பு செயலாக்கம் பயன்படுத்தப்படுகிறது. புலங்களின் மதிப்புகள் சுத்தம் செய்யப்படுகின்றன, கோப்பு முறைமைகளுக்கு சிறப்பு வாய்ந்த எழுத்துக்களை மாற்றியமைக்கின்றன, அவை ஸ்லாஷ்கள் உட்பட அடிக்கோடிட்டுக் காட்டுகின்றன. கோப்புறைகளை உருவாக்க புல உரையை பயன்படுத்த முடியாது என்பதே இதன் பொருள். இருப்பினும், முன்னொட்டு அல்லது பின்னொட்டு சரங்களில் ஸ்லாஷ்கள் மாற்றப்படவில்லை, எனவே இந்த சரங்களில் உள்ள குறைப்புக்கள் கோப்புறைகளை உருவாக்கும். இதன் காரணமாக, நீங்கள் மாறி-ஆழமான கோப்புறை கட்டமைப்பை உருவாக்கலாம்.

source: For example, assume we want the folder structure `series/series_index - title`, with the caveat that if series does not exist, then the title should be in the top folder. The template to do this is::
ja: たとえば、フォルダの構造を `series/series_index - title` としたいが、シリーズが存在しない場合はタイトルを最上位のフォルダに配置したいと仮定します。これを行うためのテンプレートは次のとおりです::
ta: எடுத்துக்காட்டாக, `தொடர்/தொடர்_இண்டெக்ஸ் - தலைப்பு` என்ற கோப்புறை அமைப்பு வேண்டும் என்று வைத்துக் கொள்ளுங்கள், தொடர் இல்லை என்றால், தலைப்பு சிறந்த கோப்புறையில் இருக்க வேண்டும். இதைச் செய்வதற்கான வார்ப்புரு ::
zh_cn: 例如，假设我们想要构建 `series/series_index - title` 这样的文件夹结构，但有一个前提条件：如果‘丛书’（series）不存在，则书名应直接放在根目录（最顶层文件夹）下。实现这一点的模板为::
