Repository: debian-calibre/calibre
Catalog: translations/manual/*/template_lang.po
Languages: ja, nl, ta, zh_cn

source: ``subitems(start_index, end_index)`` -- This function breaks apart lists of tag-like hierarchical items such as genres. It interprets the value as a comma-separated list of tag-like items, where each item is a period-separated list. It returns a new list made by extracting from each item the components from ``start_index`` to ``end_index``, then merging the results back together. Duplicates are removed. The first subitem in a period-separated list has an index of zero. If an index is negative then it counts from the end of the list. As a special case, an end_index of zero is assumed to be the length of the list.
ja: ``subitems(start_index, end_index)`` -- この関数は、ジャンルのようなタグに似た回想項目を分買いします。値はタグに似たカンマ区切りのリスト項目と解釈されます。ここでの項目は、ピリオド区切りのリストです。各項目から ``start_index`` から ``end_index`` までの要素を抽出して作った新しいリストを返し、その結果を一緒にマージします。重複は削除されます。ピリオド区切りのリストにある最初のサブ項目のインデックスはゼロです。インデックスが負の値であれば、リストの後ろから数えます。特殊なケースとして、ゼロの end_index はリストの長さと解釈されます。
nl: ``subitems(start_index, end_index)`` -- Deze functie wordt gebruikt om lijsten van label-like hiërarchische items zoals genres op te delen. Het interpreteert de waarde als een komma gescheiden lijst label-like items, waar elk item een punt gescheiden lijst is. Geeft een nieuwe lijst terug van elk de componenten van ``start_index`` tot ``end_index`` af te trekken en vervolgens de resultaten terug te combineren. Dubbels worden verwijderd. Het eerste sub-item in een punt gescheiden lijst heeft een index van nul. Als een index negatief is, dan telt het vanaf het einde van de lijst. Als speciaal geval wordt een end_index van nul verondersteld de lengte van de lijst te zijn.
ta: `` சப்யிடெம்கள் (start_index, end_index) ``-இந்த செயல்பாடு வகைகள் போன்ற குறிச்சொல் போன்ற படிநிலை உருப்படிகளின் பட்டியல்களை உடைக்கிறது. இது மதிப்பை குறிச்சொல் போன்ற உருப்படிகளின் கமாவால் பிரிக்கப்பட்ட பட்டியலாக விளக்குகிறது, அங்கு ஒவ்வொரு உருப்படியும் காலத்தால் பிரிக்கப்பட்ட பட்டியல். ஒவ்வொரு உருப்படியிலிருந்தும் `` start_index`` இலிருந்து `` END_INDEX`` வரையிலான கூறுகளை பிரித்தெடுப்பதன் மூலம் இது ஒரு புதிய பட்டியலை வழங்குகிறது, பின்னர் முடிவுகளை மீண்டும் ஒன்றிணைக்கிறது. நகல்கள் அகற்றப்படுகின்றன. காலத்தால் பிரிக்கப்பட்ட பட்டியலில் முதல் துணை சமநிலை பூஜ்ஜியத்தின் குறியீட்டைக் கொண்டுள்ளது. ஒரு குறியீடு எதிர்மறையாக இருந்தால், அது பட்டியலின் முடிவில் இருந்து கணக்கிடப்படுகிறது. ஒரு சிறப்பு விஷயமாக, பூஜ்ஜியத்தின் END_INDEX என்பது பட்டியலின் நீளமாக கருதப்படுகிறது.

source: Examples:
ja: 例:
nl: Voorbeelden:
ta: எடுத்துக்காட்டுகள்:
zh_cn: 例如：

source: Assuming a #genre column containing `A.B.C`:
ja: #genre 列に `A.B.C` が含まれていると仮定すると:
nl: Een #genre kolom veronderstellend met `A.B.C`:
ta: `A.B.C` கொண்ட #Genre நெடுவரிசையை அனுமானித்து:

source: ``{#genre:subitems(0,1)}`` returns "A"
ja: ``{#genre:subitems(0,1)}`` は "A" を返します
nl: ``{#genre:subitems(0,1)}`` geeft "A" terug
ta: `` {#genre: subitems (0,1)} `` திரும்பும் "a"

source: ``{#genre:subitems(0,2)}`` returns "A.B"
ja: ``{#genre:subitems(0,2)}`` は "A.B" を返します
nl: ``{#genre:subitems(0,2)}`` geeft "A.B" terug
ta: `` {#genre: subitems (0,2)} `` "A.B" ஐத் தருகிறது

source: ``{#genre:subitems(1,0)}`` returns "B.C"
ja: ``{#genre:subitems(1,0)}`` は "B.C" を返します
nl: ``{#genre:subitems(1,0)}`` geeft "B.C" terug
ta: `` {#genre: subitems (1,0)} `` `" B.C "ஐத் தருகிறது

source: Assuming a #genre column containing "A.B.C, D.E":
ja: #genre 列に "A.B.C, D.E" が含まれていると仮定すると:
nl: Een #genre kolom veronderstellend met "A.B.C, D.E":
ta: "A.B.C, D.E" கொண்ட #ஜென்ரே நெடுவரிசையை அனுமானித்து:

source: ``{#genre:subitems(0,1)}`` returns "A, D"
ja: ``{#genre:subitems(0,1)}`` は "A, D" を返します
nl: ``{#genre:subitems(0,1)}`` geeft "A, D" terug
ta: `` {#genre: subitems (0,1)} `` திரும்பும் "a, d"

source: ``{#genre:subitems(0,2)}`` returns "A.B, D.E"
ja: ``{#genre:subitems(0,2)}`` は "A.B, D.E" を返します
nl: ``{#genre:subitems(0,2)}`` geeft "A.B, D.E" terug
ta: `` {#genre: subitems (0,2)} `` திரும்பும் "A.B, D.E"

source: ``sublist(start_index, end_index, separator)`` -- interpret the value as a list of items separated by ``separator``, returning a new list made from the items from ``start_index`` to ``end_index``. The first item is number zero. If an index is negative, then it counts from the end of the list. As a special case, an end_index of zero is assumed to be the length of the list.
ja: ``sublist(start_index, end_index, separator)`` -- 値を ``separator`` で区切られた項目のリストとして解釈し、項目の ``start_index`` から ``end_index`` で作られた新しいリストを返します。項目の最初の番号はゼロです。インデックスが負の値であれば、リストの後ろから数えます。特殊なケースとして、ゼロの end_index はリストの長さと解釈されます。
nl: ``sublist(start_index, end_index, separator)`` -- interpreteert de waarde als een itemlijst gescheiden door ``separator``, geeft een nieuwe lijst terug, gemaakt van de items van ``start_index`` tot ``end_index``. Het eerstet item is nummer zero. Als een index negatief is, dan telt hij van het einde van de lijst. Als een speciaal geval: een end_index van nul is wordt verondersteld de lengte van de lijst te zijn.
ta: `` சப்ளிஸ்ட் (start_index, end_index, பிரிப்பான்) `` - `` பிரிப்பான்`` ஆல் பிரிக்கப்பட்ட பொருட்களின் பட்டியலாக மதிப்பை விளக்கவும், `` start_index`` முதல் `` எண்ட்_இண்டெக்ஸ்` வரை உருப்படிகளிலிருந்து தயாரிக்கப்பட்ட புதிய பட்டியலைத் திருப்பி விடுங்கள் . முதல் உருப்படி எண் பூஜ்ஜியம். ஒரு குறியீடு எதிர்மறையாக இருந்தால், அது பட்டியலின் முடிவில் இருந்து கணக்கிடப்படுகிறது. ஒரு சிறப்பு விஷயமாக, பூஜ்ஜியத்தின் END_INDEX என்பது பட்டியலின் நீளமாக கருதப்படுகிறது.

source: Examples assuming that the tags column (which is comma-separated) contains "A, B ,C":
ja: タグ列 (カンマ区切り) に "A, B ,C" が含まれていると仮定した例:
nl: Voorbeelden veronderstellen dat de labelkolom (die komma gescheiden is) "A, B ,C" bevat:
ta: குறிச்சொற்கள் நெடுவரிசை (இது கமாவால் பிரிக்கப்பட்டுள்ளது) "A, B, C" ஐக் கொண்டுள்ளது என்று கருதும் எடுத்துக்காட்டுகள்:

source: ``{tags:sublist(0,1,\,)}`` returns "A"
ja: ``{tags:sublist(0,1,\,)}`` は "A" を返します
nl: ``{tags:sublist(0,1,\,)}`` geeft "A" terug
ta: `` {குறிச்சொற்கள்: சப்லிஸ்ட் (0,1, \,)} `` "ஏ" ஐத் தருகிறது

source: ``{tags:sublist(-1,0,\,)}`` returns "C"
ja: ``{tags:sublist(-1,0,\,)}`` は "C" を返します
nl: ``{tags:sublist(-1,0,\,)}`` geeft "C" terug
ta: `` {குறிச்சொற்கள்: சப்லிஸ்ட் (-1,0, \,)} `` "சி" ஐத் தருகிறது

source: ``{tags:sublist(0,-1,\,)}`` returns "A, B"
ja: ``{tags:sublist(0,-1,\,)}`` は "A, B" を返します
nl: ``{tags:sublist(0,-1,\,)}`` geeft "A, B" terug
ta: `` {குறிச்சொற்கள்: sublist (0, -1, \,)} `` "a, b" ஐத் தருகிறது

source: ``swap_around_articles(separator)`` -- returns the value with articles moved to the end. The value can be a list, in which case each item in the list is processed. If the value is a list then you must provide the ``separator``. If no ``separator`` is provided then the value is treated as being a single value, not a list. The `articles` are those used by calibre to generate the ``title_sort``.
ja: ``swap_around_articles(separator)`` -- 記事を最後に移動した値を返します。値はリストにすることもでき、その場合にはリスト内の各項目が処理されます。値がリストのときには、``separator`` を指定する必要があります。``separator`` の指定がなければ値はリストではなく単一の値として扱われます。`記事` は ``title_sort`` を生成するために calibre によって使用される記事です。
nl: ``swap_around_articles(separator)`` -- geeft de waarde terug met artikelen naar het einde verplaatst. De waarde kan een lijst zijn, in welk geval elk item van de lijst verwerkt is. Als de waarde een lijst is dan moet u de ``separator`` voorzien. Als geen ``separator`` voorzien is, wordt de waarde behandeld als één enkele waarde, niet een lijst. De `artikelen` zijn diegenen gebruikt door calibre om de ``title_sort`` te genereren.
ta: `` SWAP_AROUND_ARTICLES (பிரிப்பான்) `` - கட்டுரைகளுடன் மதிப்பை இறுதிவரை மாற்றுகிறது. மதிப்பு ஒரு பட்டியலாக இருக்கலாம், இந்த விஷயத்தில் பட்டியலில் உள்ள ஒவ்வொரு உருப்படியும் செயலாக்கப்படும். மதிப்பு ஒரு பட்டியல் என்றால், நீங்கள் `` பிரிப்பான்`` ஐ வழங்க வேண்டும். `` பிரிப்பான்`` வழங்கப்பட்டால், மதிப்பு ஒரு பட்டியல் அல்ல, ஒரு பட்டியல் அல்ல. `கட்டுரைகள்` என்பது` `தலைப்பு_சார்ட்`` உருவாக்க காலிபர் பயன்படுத்துகிறது.

source: ``swap_around_comma()`` -- given a value of the form ``B, A``, return ``A B``. This is most useful for converting names in LN, FN format to FN LN. If there is no comma in the value then the function returns the value unchanged.
ja: ``swap_around_comma()`` -- `B, A`` の形式の値を指定すると ``A B`` を返します。これは「姓, 名」の形式の名前を「名 姓」に変換するのに最適です。値の中にカンマがなければ、関数は値を変更せずに返します。
nl: ``swap_around_comma()`` -- gegeven een waarde in de vorm ``B, A``, wordt ``A B``. Dit is heel nuttig voor het omzetten van namen in AN, VN formaat naar VN AN. Als er geen komma is, wordt de waarde onveranderd teruggegeven.
ta: `` swap_around_comma () `` - `` b, a`` என்ற படிவத்தின் மதிப்பைக் கொடுத்தால் `` a b``. LN, FN வடிவத்தில் பெயர்களை FN LN ஆக மாற்ற இது மிகவும் பயனுள்ளதாக இருக்கும். மதிப்பில் கமா இல்லை என்றால், செயல்பாடு மதிப்பை மாற்றாமல் வழங்குகிறது.

source: ``switch([pattern, value,]+ else_value)`` -- for each ``pattern, value`` pair, checks if the value matches the regular expression ``pattern`` and if so returns the associated ``value``. If no ``pattern`` matches, then ``else_value`` is returned. You can have as many ``pattern, value`` pairs as you wish. The first match is returned.
ja: ``switch([pattern, value,]+ else_value)`` -- ``pattern, value`` のペアごとに値が正規表現 ``pattern`` にマッチするか確認し、マッチすれば対応する ``value`` を返します。``pattern`` にマッチするものがなければ ``else_value`` を返します。``pattern, value`` のペアは好きなだけ繰り返すことができます。最初にマッチしたものが返されます。
nl: ``switch([pattern, value,]+ else_value)`` -- voor ieder ``pattern, value`` paar, controleert of het waarde overeen komt met de reguliere expressie ``pattern`` en indien zo geeft de geassocieerde``value`` terug. Als geen ``pattern`` overeenkomt, wordt ``else_value`` teruggegeven. U kan zoveel ``pattern, value`` paren hebben als u wilt. De eerste overeenkomst wordt teruggegeven.
ta: `` சுவிட்ச் ([முறை, மதிப்பு,]+ else_value) `` - ஒவ்வொரு `` வடிவத்திற்கும், மதிப்பு` ஜோடிக்கும், மதிப்பு வழக்கமான வெளிப்பாட்டுடன் `` முறை`` உடன் பொருந்துமா என்பதைச் சரிபார்க்கிறது, அப்படியானால் அதனுடன் தொடர்புடைய `` மதிப்பை வழங்குகிறது ``. `` பேட்டர்ன்`` பொருந்தவில்லை என்றால், `` Else_Value`` திரும்பியது. நீங்கள் விரும்பும் பல `` முறை, மதிப்பு` `ஜோடிகளைக் கொண்டிருக்கலாம். முதல் போட்டி திரும்பியது.

source: ``test(text if not empty, text if empty)`` -- return ``text if not empty`` if the value is not empty, otherwise return ``text if empty``.
ja: ``test(text if not empty, text if empty)`` -- 値が空でなければ ``text if not empty`` を返し、空なら ``text if empty`` を返します。
nl: ``test(text if not empty, text if empty)`` -- geef ``text if not empty`` terug als de waarde niet leeg is, geef anders ``text if empty`` terug.
ta: `` சோதிக்கவும் (காலியாக இல்லாவிட்டால் உரை, காலியாக இருந்தால் உரை) `` - `` காலியாக இல்லாவிட்டால் உரையை திருப்பி விடுங்கள்`` மதிப்பு காலியாக இல்லாவிட்டால், இல்லையெனில் `` காலமாக இருந்தால் உரையை திருப்பி விடுங்கள்``.

source: ``titlecase()`` -- returns the value of the field in title case.
ja: ``titlecase()`` -- フィールドの値をタイトルケースにして返します。
nl: ``titlecase()`` -- geeft de waarde van het veld terug in elk woord met hoofdletter.
ta: `` டைட்ட்லெஸ்கேஸ் () `` - தலைப்பு வழக்கில் புலத்தின் மதிப்பை வழங்குகிறது.

source: ``transliterate()`` -- Return a string in a latin alphabet formed by approximating the sound of the words in the source field. For example, if the source field is ``Фёдор Миха́йлович Достоевский`` this function returns ``Fiodor Mikhailovich Dostoievskii``.
ja: ``transliterate()`` --ソースフィールドの単語の音を近似することによって形成されたラテンアルファベットの文字列を返します。たとえば、ソースフィールドが ``Фёдор Миха́йлович Достоевский`` の場合、この関数は ``Fiodor Mikhailovich Dostoievskii`` を返します。
nl: ``transliterate()`` -- Geeft een string in een Latijns alfabet terug, gevormd door benaderen van de klank van de woorden in het bron veld. Bij voorbeeld, wanneer het bron veld ``Фёдор Миха́йлович Достоевский`` is, geeft deze functie ``Fiodor Mikhailovich Dostoievskii`` terug.
ta: `` மொழிபெயர்ப்பு () `` - மூல புலத்தில் உள்ள சொற்களின் ஒலியை தோராயமாக மதிப்பிடுவதன் மூலம் உருவாகும் ஒரு லத்தீன் எழுத்துக்களில் ஒரு சரத்தைத் திருப்பி விடுங்கள். எடுத்துக்காட்டாக, மூல புலம் `` фёдор миха́йлович достоевский`` `` `ஃபியோடோர் மிகைலோவிச் டோஸ்டோயீவ்ஸ்கி``` `` `ஃபியோடர் மிகைலோவிச் டோஸ்டோயீஸ்கி`.

source: ``uppercase()`` -- returns the value of the field in upper case.
ja: ``uppercase()`` -- フィールドの値を大文字にして返します。
nl: ``uppercase()`` -- geeft de waarde van het veld terug in hoofdletter.
ta: `` பெரிய எழுத்து () `` - மேல் வழக்கில் புலத்தின் மதிப்பை வழங்குகிறது.

source: **Using functions and formatting in the same template**
ja: **同じテンプレートで関数と書式を使用する**
nl: **Functies en opmaak gebruiken in dezelfde sjabloon**
ta: ** அதே வார்ப்புருவில் செயல்பாடுகளையும் வடிவமைப்பையும் பயன்படுத்துதல் **
zh_cn: 在同一个模板中同时使用函数和格式化

source: Suppose you have an integer custom column ``#myint`` that you want displayed with leading zeros, as in ``003``. One way to do this is to use a format of ``0>3s``. However, by default if a number (integer or float) equals zero then the value is displayed as the empty string so zero values will produce the empty string, not ``000``. If you want to see ``000`` values then you use both the format string and the ``ifempty`` function to change the empty value back to a zero. The template would be::
ja: 整数のカスタム列 ``#myint`` を ``003`` のように先行ゼロ付きで表示したいと仮定します。これを実現する方法のひとつは ``0>3s`` という書式を使用することです。ただしデフォルトでは数値 (整数または浮動小数点) がゼロに等しい場合には、その値は空の文字列として表示されるため、値ゼロは ``000`` ではなく空の文字列となります。値を ``000`` と表示したいのであれば、書式文字列と ``ifempty`` 関数を両方使用して空の値をゼロに戻してやります。そのテンプレートは次のようになるでしょう::
nl: Veronderstel, u hebt een aangepaste kolom met gehele getallen ``#myint`` die u wilt weergeven met voorloopnullen, zoals in ``003``. Een manier om dit te doen is met het formaat ``003``. Hoewel, standaard, als een getal (geheel of decimaal) gelijk is aan nul wordt de waarde getoond als de lege string dus nul waardes geven de lege string, niet ``000``. Als u ``000`` waardes wilt zien, gebruikt u zowel de formaat string als de ``ifempty`` functie om de lege waarde terug op nul te zetten. De sjabloon wordt::
ta: `003`` இல் உள்ளதைப் போல, முன்னணி பூஜ்ஜியங்களுடன் நீங்கள் காட்ட விரும்பும் ஒரு முழு எண்ணும் தனிப்பயன் நெடுவரிசை` `#myint`` உங்களிடம் உள்ளது என்று வைத்துக்கொள்வோம். இதைச் செய்வதற்கான ஒரு வழி `0> 3s`` வடிவத்தைப் பயன்படுத்துவது. இருப்பினும், இயல்பாக ஒரு எண் (முழு எண் அல்லது மிதவை) பூஜ்ஜியத்திற்கு சமமாக இருந்தால், மதிப்பு வெற்று சரமாக காட்டப்படும், எனவே பூஜ்ஜிய மதிப்புகள் வெற்று சரத்தை உருவாக்கும், `000`` அல்ல. நீங்கள் `` 000`` மதிப்புகளைக் காண விரும்பினால், வெற்று மதிப்பை மீண்டும் பூஜ்ஜியமாக மாற்ற வடிவமைப்பு சரம் மற்றும் `` ifempty`` செயல்பாடு இரண்டையும் பயன்படுத்துகிறீர்கள். வார்ப்புரு ::
zh_cn: 假设您有一个整数自定义列“#myint”，您希望显示前导零，如“003”。 实现此目的的一种方法是使用“0>3s”的格式。 但是，默认情况下，如果数字（整数或浮点数）等于零，则该值将显示为空字符串，因此零值将生成空字符串，而不是“000”。 如果您想查看“000”值，则可以使用格式字符串和“ifempty”函数将空值更改回零。 模板将是：

source: Note that you can use the prefix and suffix as well. If you want the number to appear as ``[003]`` or ``[000]``, then use the template::
ja: プレフィックスとサフィックスも使用できます。もし数字を ``[003]`` や ``[000]`` のように表示したいのであれば、次のテンプレートを使用します::
nl: Merk op dat u zowel het voor- als het achtervoegsel kan gebruiken. Als u wil dat het getal verschijnt als ``[003]`` of ``[000]``, gebruik dan de sjabloon::
ta: நீங்கள் முன்னொட்டு மற்றும் பின்னொட்டையும் பயன்படுத்தலாம் என்பதை நினைவில் கொள்க. எண் `` [003] `` அல்லது `` [000] `` என தோன்ற விரும்பினால், வார்ப்புருவைப் பயன்படுத்தவும் ::
zh_cn: 请注意，您也可以同时使用前缀和后缀。如果您希望数字显示为 [003] 或 [000]，请使用如下模板：

source: General Program Mode
ja: 一般プログラムモード
nl: Algemene Programma Modus
ta: பொது நிரல் பயன்முறை
zh_cn: 通用程序模式

source: `General Program Mode` (`GPM`) replaces `template expressions` with a program written in the `template language`. The syntax of the language is defined by the following grammar::
ja: `一般プログラムモード` (`GPM`) は `テンプレート表現` を `テンプレート言語` で記述したプログラムに置き換えます。言語の構文は、次の文法で定義されます::
nl: `Algemene Programma Modus` (`APM`) vervangt `sjabloonexpressies` door een programma geschreven in de `sjabloontaal`. De syntaxis van de taal is gedefinieerd door de volgende grammatica::
ta: `பொது நிரல் பயன்முறை` (` ஜிபிஎம்`) `வார்ப்புரு வெளிப்பாடுகளை`` வார்ப்புரு மொழியில்` இல் எழுதப்பட்ட ஒரு நிரலுடன் மாற்றுகிறது. மொழியின் தொடரியல் பின்வரும் இலக்கணத்தால் வரையறுக்கப்படுகிறது ::
zh_cn: “通用程序模式 (GPM)”会将“模板表达式”替换为一段使用“模板语言”编写的程序。该语言的语法由以下文法定义：

source: a ``top_expression`` always has a value. The value of an ``expression_list`` is the value of the last ``top_expression`` in the list. For example, the value of the expression list ``1;2;'foobar';3`` is ``3``.
ja: ``top_expression`` には常に値があります。``expression_list`` の値は、リストの最後の ``top_expression`` の値です。たとえば、式リストの値 ``1;2;'foobar';3`` は ``3`` です。
nl: een ``top_expression`` heeft altijd een waarde. De waarde van een ``expression_list`` is de waarde van de laatste ``top_expression`` in de lijst. Bv. de waarde van de expressielijst ``1;2;'foobar';3`` is ``3``.
ta: ஒரு `` Top_Expression`` எப்போதும் ஒரு மதிப்பைக் கொண்டுள்ளது. `` எக்ஸ்பிரஷன்_லிஸ்ட்`` இன் மதிப்பு என்பது பட்டியலில் உள்ள கடைசி `` டாப்_எக்ஸ்பிரஷன்`` மதிப்பு. எடுத்துக்காட்டாக, வெளிப்பாடு பட்டியலின் மதிப்பு `` 1; 2; 'foobar'; 3`` என்பது `` 3``.
zh_cn: top_expression（顶层表达式）始终具有一个值。expression_list（表达式列表）的值是列表中最后一个 top_expression 的值。例如，表达式列表 1;2;'foobar';3 的值是 3。

source: In a logical context, any non-empty value is ``True``
ja: 論理的なコンテキストでは、空でない値はすべて ``True``
nl: In een logische context is elke niet-lege waarde ``True``
ta: ஒரு தர்க்கரீதியான சூழலில், எந்தவொரு காலியாக இல்லாத மதிப்பும் `` உண்மை``
zh_cn: 在逻辑语境中，任何非空值（non-empty value）均被视为 True（真）。

source: In a logical context, the empty value is ``False``
ja: 論理的なコンテキストでは、空の値はすべて ``False``
nl: In een logische context is de lege waarde ``False``
ta: ஒரு தர்க்கரீதியான சூழலில், வெற்று மதிப்பு `` பொய்``
zh_cn: 在逻辑语境中，空值（empty value）被视为 False（假）。

source: Strings and numbers can be used interchangeably. For example, ``10`` and ``'10'`` are the same thing.
ja: 文字列と数字は同じ意味で使用できます。たとえば ``10`` と ``'10'`` は同じものです。
nl: Strings en getallen kunnen door elkaar gebruikt worden. Bv. ``10`` en ``'10'`` zijn identiek.
ta: சரங்கள் மற்றும் எண்களை ஒன்றுக்கொன்று மாற்றாகப் பயன்படுத்தலாம். எடுத்துக்காட்டாக, `` 10`` மற்றும் `` '10'` ஒரே விஷயம்.
zh_cn: 字符串和数字可以互换使用。例如，10 和 '10' 是完全相同的。

source: Comments are lines starting with a '#' character. Comments beginning later in a line are not supported.
ja: コメントは '#' 文字で始まる行です。行の途中から始まるコメントはサポートされていません。
nl: Commentaar zijn regels die beginnen met '#'. Commentaar verder in de regel wordt niet ondersteund.
ta: கருத்துகள் '#' எழுத்துடன் தொடங்கும் வரிகள். பின்னர் ஒரு வரியில் தொடங்கும் கருத்துகள் ஆதரிக்கப்படவில்லை.

source: **Operator precedence**
ja: **演算子の優先順位**
nl: **Operator voorrang**
ta: ** ஆபரேட்டர் முன்னுரிமை **
zh_cn: 运算符优先级

source: The operator precedence (order of evaluation) from highest (evaluated first) to lowest (evaluated last) is:
ja: 演算子の優先順位 (評価する順) の最高 (最初に評価) から最低 (最後に評価) までは、次のとおりです:
nl: De operator voorrang (volgorde van evalueren) van hoogste (eerst geëvalueerd) naar laagste (laatst geëvalueerd) is:
ta: ஆபரேட்டர் முன்னுரிமை (மதிப்பீட்டின் வரிசை) மிக உயர்ந்த (முதலில் மதிப்பீடு செய்யப்பட்டது) முதல் மிகக் குறைந்த (கடைசியாக மதிப்பீடு செய்யப்பட்டது):
zh_cn: 运算符优先级（求值顺序）从最高（最先求值）到最低（最后求值）依次为：

source: Function calls, constants, parenthesized expressions, statement expressions, assignment expressions, field references.
ja: 関数呼び出し、定数、括弧で囲まれた式、比較演算式、代入式、フィールド参照。
nl: Functie aanroep, constanten, uitdrukkingen tussen haakjes, instructie-expressies, opdracht-expressies, veldreferenties.
ta: செயல்பாட்டு அழைப்புகள், மாறிலிகள், அடைப்புக்குறிப்பு வெளிப்பாடுகள், அறிக்கை வெளிப்பாடுகள், ஒதுக்கீட்டு வெளிப்பாடுகள், புல குறிப்புகள்.
zh_cn: 函数调用、常量、括号表达式、语句表达式、赋值表达式、字段引用。

source: Unary plus (``+``) and minus (``-``). These operators evaluate right to left.
ja: 単項プラス (``+``) およびマイナス (``-``)。これらの演算子は右から左に評価します。
nl: Unary plus (``+``) en min (``-``). Deze operatoren evalueren van rechts naar links.
ta: யுனரி பிளஸ் (``+``) மற்றும் கழித்தல் (`` -``). இந்த ஆபரேட்டர்கள் வலமிருந்து இடமாக மதிப்பீடு செய்கிறார்கள்.
zh_cn: 一元正号 (+) 和一元负号 (-)。这些运算符按从右至左的顺序求值。

source: These and all the other arithmetic operators return integers if the expression results in a fractional part equal to zero. For example, if an expression returns ``3.0`` it is changed to ``3``.
ja: これらおよび他のすべての算術演算子は、式の小数部がゼロならば整数を返します。たとえば式が ``3.0`` を返す場合、それは ``3`` に変更されます。
nl: Deze en alle andere rekenkundige operatoren geven integers terug als het resultaat van de expressie een fractioneel deel gelijk aan nul is. Bv. als een expressie ``3.0`` terug geeft, wordt dit veranderd in ``3``.
ta: வெளிப்பாடு பூஜ்ஜியத்திற்கு சமமான ஒரு பகுதியளவு காரணமாக இருந்தால் இந்த மற்றும் பிற எண்கணித ஆபரேட்டர்கள் முழு எண்களைத் தருகின்றன. எடுத்துக்காட்டாக, ஒரு வெளிப்பாடு `` 3.0`` திரும்பினால் அது `` 3`` என மாற்றப்படுகிறது.
zh_cn: 这些运算符以及所有其他算术运算符，在表达式结果的小数部分为零时，都会返回整数。例如，如果表达式的结果为 3.0，它将被转换为 3。

source: Multiply (``*``) and divide (``/``). These operators are associative and evaluate left to right. Use parentheses if you want to change the order of evaluation.
ja: 乗算 (``*``) と除算 (``/``)。これらの演算子は結合性があり、左から右に評価します。評価の順序を変更する場合は、括弧を使用してください。
nl: Vermenigvuldigen (``*``) en delen (``/``). Deze operatoren zijn associatief en evalueren van links naar rechts. Gebruik haakjes als u de volgorde van evaluatie wilt veranderen.
ta: பெருக்கி (``*``) பிரிக்கவும் (``/``). இந்த ஆபரேட்டர்கள் துணை மற்றும் இடமிருந்து வலமாக மதிப்பீடு செய்கிறார்கள். மதிப்பீட்டின் வரிசையை மாற்ற விரும்பினால் அடைப்புக்குறிப்புகள் பயன்படுத்தவும்.
zh_cn: 乘法 (*) 和除法 (/)。这些运算符具有结合性，且按从左至右的顺序求值。如果您想改变求值顺序，请使用括号。

source: Add (``+``) and subtract (``-``). These operators are associative and evaluate left to right.
ja: 加算 (``+``) と減算 (``-``)。これらの演算子は結合性があり、左から右に評価します。
nl: Optellen (``+``) en aftrekken (``-``). Deze operatoren zijn associatief en evalueren van links naar rechts.
ta: (``+``) சேர்த்து கழிக்கவும் (`` -``). இந்த ஆபரேட்டர்கள் துணை மற்றும் இடமிருந்து வலமாக மதிப்பீடு செய்கிறார்கள்.
zh_cn: 加法 (+) 和减法 (-)。这些运算符具有结合性，且按从左至右的顺序求值。

source: Numeric and string comparisons. These operators return ``'1'`` if the comparison succeeds, otherwise the empty string (``''``). Comparisons are not associative: ``a < b < c`` is a syntax error.
ja: 数値と文字列の比較。これらの演算子は、比較が成功した場合は ``'1'`` を返し、それ以外の場合は空の文字列 (``''``)を返します。比較は連想的ではありません。 ``a < b < c`` は構文エラーです。
nl: Numerieke en string vergelijkingen. Deze operatoren geven ``'1'`` terug als de vergelijking door gaat, anders de lege string (``''``). Vergelijkingen zijn niet associatief: ``a < b < c`` is een syntaxis fout.
ta: எண் மற்றும் சரம் ஒப்பீடுகள். இந்த ஆபரேட்டர்கள் ஒப்பீடு வெற்றி பெற்றால் `` '1'`` திருப்பித் தருகின்றன, இல்லையெனில் வெற்று சரம் (``' '``). ஒப்பீடுகள் துணை அல்ல: `` a <b <c`` என்பது ஒரு தொடரியல் பிழை.
zh_cn: 数值与字符串比较。如果比较成功，这些运算符返回 '1'，否则返回空字符串 ('')。比较运算符不具备结合性：例如 a < b < c 是语法错误。

source: String concatenation (``&``). The ``&`` operator returns a string formed by concatenating the left-hand and right-hand expressions. Example: ``'aaa' & 'bbb'`` returns ``'aaabbb'``. The operator is associative and evaluates left to right.
ja: 文字列の連結 (``&``)。``&`` 演算子は、左辺と右辺の式を連結して形成された文字列を返します。例: ``'aaa' & 'bbb'`` は ``'aaabbb'`` を返します。演算子は結合性があり、左から右に評価します。
ta: சரம் ஒருங்கிணைப்பு (`` & ``). `` & `` ஆபரேட்டர் இடது கை மற்றும் வலது கை வெளிப்பாடுகளை ஒருங்கிணைப்பதன் மூலம் உருவாக்கப்பட்ட ஒரு சரத்தை வழங்குகிறது. எடுத்துக்காட்டு: `` 'aaa' & 'BBB'``` `' 'aaabbb'``. ஆபரேட்டர் துணை மற்றும் இடமிருந்து வலமாக மதிப்பீடு செய்கிறார்.
zh_cn: 字符串拼接 (&)。& 运算符返回由左侧表达式和右侧表达式连接而成的字符串。例如：'aaa' & 'bbb' 返回 'aaabbb'。该运算符具有结合性，且按从左至右的顺序求值。

source: Unary logical not (``!``). This operator returns ``'1'`` if the expression is False (evaluates to the empty string), otherwise ``''``.
ja: 単項論理否定 (``!``)。この演算子は、式が False (空の文字列に評価される) なら ``'1'``を返し、そうでなければ ``''``を返します。
nl: Unary logisch niet (``!``). Deze operator geeft ``'1'`` terug als de expressie Vals is (evalueert naar de lege string), anders ``''``.
ta: Unary logalor not (``! ``). இந்த ஆபரேட்டர் வெளிப்பாடு தவறானது என்றால் `` '1'`` திருப்பித் தருகிறது (வெற்று சரத்தை மதிப்பிடுகிறது), இல்லையெனில் ``' '``.
zh_cn: 一元逻辑非 (!)。如果表达式为“假”（求值为空字符串），则此运算符返回 '1'；否则返回 ''（空字符串）。
