Repository: debian-calibre/calibre
Catalog: translations/manual/*/template_lang.po
Languages: ja, nl, ta, zh_cn

source: ``list_intersection(list1, list2, separator)`` -- return a list made by removing from ``list1`` any item not found in ``list2``, using a case-insensitive comparison. The items in ``list1`` and ``list2`` are separated by separator, as are the items in the returned list.
ja: ``list_intersection(list1, list2, separator)`` -- 大文字と小文字を区別しない比較を使用して、``list2`` にない項目を ``list1`` から 削除して作成されたリストを返します。 ``list1`` と ``list2`` の項目、および返されたリストの項目は、いずれも separator で区切られます。
nl: ``list_intersection(list1, list2, separator)`` -- geeft een lijst terug gemaakt door uit ``list1`` alle item te verwijderen niet gevonden in ``list2`` waarbij niet hoofdlettergevoelig wordt vergeleken. De items in ``list1`` en ``list2`` zijn gescheiden door separator, net zoals de items in de teruggegeven lijst.
ta: `` list_intersection (பட்டியல் 1, பட்டியல் 2, பிரிப்பான்) ``-ஒரு வழக்கு-உணர்திறன் ஒப்பீட்டைப் பயன்படுத்தி `` பட்டியல் 2`` இல் காணப்படாத `` பட்டியல் 1`` இலிருந்து அகற்றுவதன் மூலம் செய்யப்பட்ட பட்டியலைத் திருப்பி விடுங்கள். `` பட்டியல் 1` மற்றும் `` பட்டியல் 2`` ஆகியவற்றில் உள்ள உருப்படிகள் பிரிப்பானால் பிரிக்கப்படுகின்றன, திரும்பிய பட்டியலில் உள்ள உருப்படிகள்.

source: ``list_join(with_separator, list1, separator1 [, list2, separator2]*)`` -- return a list made by joining the items in the source lists (``list1`` etc) using ``with_separator`` between the items in the result list. Items in each source ``list[123...]`` are separated by the associated ``separator[123...]``. A list can contain zero values. It can be a field like ``publisher`` that is single-valued, effectively a one-item list. Duplicates are removed using a case-insensitive comparison. Items are returned in the order they appear in the source lists. If items on lists differ only in letter case then the last is used. All separators can be more than one character.
ja: ``list_join(with_separator, list1, separator1 [, list2, separator2]*)`` -- ソースリスト (``list1`` など) の項目と結果リストの項目を ``with_separator`` を使用して結合して作成されたリストを返します。各ソース ``list[123...]`` の項目は、対応する``separator[123...]`` で区切られています。リストにはゼロ値を含めることができます。これは、値をひとつしか持たない、事実上 1 項目のリストである ``publisher`` のようなフィールドにすることができます。重複は、大文字と小文字を区別しない比較を使用して削除します。項目は、ソースリストに表示されている順序で返されます。リストの項目が大文字と小文字の違いしかない場合は、最後のものが使用されます。区切り文字はすべて、複数の文字にすることができます。
ta: `` list_join (with_separator, list1, spripator1 [, list2, splator2]**) `` - மூல பட்டியல்களில் (`` பட்டியல் 1`` போன்றவை) உருப்படிகளில் சேருவதன் மூலம் செய்யப்பட்ட பட்டியலைத் தரவும் `` with_separator` ` முடிவு பட்டியலில். ஒவ்வொரு மூலத்திலும் உள்ள உருப்படிகள் `` பட்டியல் [123 ...] `` தொடர்புடைய `` பிரிப்பான் [123 ...] `` ஆகியவற்றால் பிரிக்கப்படுகின்றன. ஒரு பட்டியலில் பூஜ்ஜிய மதிப்புகள் இருக்கலாம். இது ஒற்றை மதிப்புள்ள `` வெளியீட்டாளர்` போன்ற ஒரு துறையாக இருக்கலாம், திறம்பட ஒரு உருப்படி பட்டியல். வழக்கு-உணர்வற்ற ஒப்பீட்டைப் பயன்படுத்தி நகல்கள் அகற்றப்படுகின்றன. மூல பட்டியல்களில் அவை தோன்றும் வரிசையில் உருப்படிகள் திருப்பித் தரப்படுகின்றன. பட்டியல்களில் உள்ள உருப்படிகள் கடித வழக்கில் மட்டுமே வேறுபடுகின்றன என்றால், கடைசியாக பயன்படுத்தப்படுகிறது. அனைத்து பிரிப்பான்களும் ஒன்றுக்கு மேற்பட்ட எழுத்துக்களாக இருக்கலாம்.

source: Example::
ja: 例::
nl: Voorbeeld::
ta: உதாரணமாக::

source: You can use ``list_join`` on the results of previous calls to ``list_join`` as follows::
ja: 次のように ``list_join`` への以前の呼び出しの結果に ``list_join`` を使用できます::
ta: முந்தைய அழைப்புகளின் முடிவுகளில் `` பட்டியல்_ஜோயின்`` பின்வருமாறு `` பட்டியல்_ஜோயின்`` ஐப் பயன்படுத்தலாம் ::

source: You can use expressions to generate a list. For example, assume you want items for ``authors`` and ``#genre``, but with the genre changed to the word "Genre: " followed by the first letter of the genre, i.e. the genre "Fiction" becomes "Genre: F". The following will do that::
ja: 式を使用してリストを生成できます。たとえば ``authors`` と `` #genre`` の項目が必要だと仮定して、しかしジャンルが "Genre: " の後にそのジャンルの頭文字をつけた単語に変更されるとします。つまりジャンル "Fiction" は "Genre: F" になります。次のようにするとそれを行います::
ta: பட்டியலை உருவாக்க நீங்கள் வெளிப்பாடுகளைப் பயன்படுத்தலாம். எடுத்துக்காட்டாக, `` ஆசிரியர்கள்`` மற்றும் ``#வகை`` ஆகியவற்றிற்கான உருப்படிகளை நீங்கள் விரும்புகிறீர்கள் என்று வைத்துக் கொள்ளுங்கள், ஆனால் வகையை "வகை:" என்ற வார்த்தையாக மாற்றியதால், வகையின் முதல் கடிதத்தைத் தொடர்ந்து, அதாவது "புனைகதை" வகை ஆகிறது " வகை: எஃப் ". பின்வருபவை அதைச் செய்யும் ::

source: ``list_re(src_list, separator, include_re, opt_replace)`` -- Construct a list by first separating ``src_list`` into items using the ``separator`` character. For each item in the list, check if it matches ``include_re``. If it does then add it to the list to be returned. If ``opt_replace`` is not the empty string then apply the replacement before adding the item to the returned list.
ja: ``list_re(src_list, separator, include_re, opt_replace)`` -- 最初に ``src_list`` を ``separator`` を使用して項目に分割することにより、リストを作成します。リスト内の各項目について、``include_re`` とマッチするかどうかを確認します。マッチすれば、返されるリストに追加します。 `opt_replace`` が空の文字列でなければ、返されたリストに項目を追加する前に置換を適用します。
nl: ``list_re(src_list, separator, include_re, opt_replace)`` -- maak een lijst door eerst ``src_list`` te scheiden in items met het ``separator`` karakter. Voor elk item in de lijst, controleer of het overeenkot met ``include_re``. Indien ja, voeg het toe aan de terug te geven lijst. Als ``opt_replace`` niet de lege string is, pas de vervanging dan toe vóór het item aan de teruggegeven lijst toe te voegen.
ta: `` list_re (src_list, பிரிப்பான், அடங்கும்_ரே, opt_replace) `` - முதலில் `` src_list`` ஐ `` பிரிப்பான்`` எழுத்தைப் பயன்படுத்தி உருப்படிகளாக பிரிப்பதன் மூலம் ஒரு பட்டியலை உருவாக்குங்கள். பட்டியலில் உள்ள ஒவ்வொரு பொருளுக்கும், இது `` சேர்க்கவும்_ரே`` உடன் பொருந்துமா என்று சரிபார்க்கவும். அவ்வாறு செய்தால், அதை திருப்பித் தர வேண்டிய பட்டியலில் சேர்க்கவும். `` Opt_replace`` வெற்று சரம் இல்லையென்றால், திரும்பிய பட்டியலில் உருப்படியைச் சேர்ப்பதற்கு முன் மாற்றீட்டைப் பயன்படுத்துங்கள்.

source: ``list_re_group(src_list, separator, include_re, search_re [, template_for_group]*)`` -- Like list_re except replacements are not optional. It uses ``re_group(item, search_re, template ...)`` when doing the replacements.
ja: ``list_re_group(src_list, separator, include_re, search_re [, template_for_group]*)`` -- 置換がオプションではないことを除いて、list_reと同様です。置換を行うときに ``re_group(item, search_re, template ...)`` を使用します。
nl: ``list_re_group(src_list, separator, include_re, search_re [, template_for_group]*)`` -- zoals list-re behalve vervanging is niet optioneel. Het gebruikt ``re_group(item, search_re, template ...)`` bij het vervangen.
ta: `` list_re_group (src_list, பிரிப்பான், சேர்த்தல்_ரே, தேடல்_ரே [, வார்ப்புரு_ஃபோர்_ குழுமம்]*) `` - பட்டியல்_இது போன்ற மாற்றீடுகள் விருப்பமல்ல. இது `` re_ குழு (உருப்படி, தேடல்_ரே, வார்ப்புரு ...) `` மாற்றீடுகளைச் செய்யும்போது பயன்படுத்துகிறது.

source: ``list_remove_duplicates(list, separator)`` -- return a list made by removing duplicate items in ``list``. If items differ only in case then the last is returned. The items in ``list`` are separated by ``separator``, as are the items in the returned list.
ja: ``list_remove_duplicates(list, separator)`` -- ``list`` 内の重複項目を削除して作成されたリストを返します。項目に大文字と小文字しか違いがない場合、最後のものが返されます。``list`` 内の項目、および返されたリスト内の項目は、いずれも ``separator`` で区切られます。
nl: ``list_remove_duplicates(list, separator)`` -- geef een lijst terug gemaakt door uit ``list`` alle duplicaten te verwijderen. Als items enkel verschillen in hoofdlettergebruik wordt het laatste teruggegeven. De items in ``lijst`` zijn gescheiden door ``separator``, net zoals de items in de teruggegeven lijst.
ta: `` list_remove_duplicates (பட்டியல், பிரிப்பான்) `` - `` பட்டியல்`` இல் நகல் உருப்படிகளை அகற்றுவதன் மூலம் செய்யப்பட்ட பட்டியலைத் தரவும். உருப்படிகள் மட்டுமே வேறுபடுகின்றன என்றால், கடைசியாக திரும்பப் பெறப்படும். `` பட்டியல்`` இல் உள்ள உருப்படிகள் `` பிரிப்பான்`` ஆல் பிரிக்கப்படுகின்றன, திரும்பிய பட்டியலில் உள்ள உருப்படிகள்.

source: ``list_sort(list, direction, separator)`` -- return ``list`` sorted using a case-insensitive lexical sort. If ``direction`` is zero, ``list`` is sorted ascending, otherwise descending. The list items are separated by ``separator``, as are the items in the returned list.
ja: ``list_sort(list, direction, separator)`` -- 大文字と小文字を区別せず辞書順に並べ替えられた ``list`` を返します。方向がゼロの場合、リストは昇順に並べ替えられ、そうでない場合は降順並べ替えられますます。``list`` の項目と、返されたリストの項目は、いずれも ``separator`` で区切られます。
nl: ``list_sort(list, direction, separator)`` -- geeft ``list`` terug gesorteerd met een hoofdletter ongevoelige lexicale sortering. Als ``direction`` nul is, wordt ``list`` oplopend gesorteerd, anders aflopend. De lijstitems worden gescheiden door ``separator``, zowel als de items in de teruggegeven lijst.
ta: `` list_sort (பட்டியல், திசை, பிரிப்பான்) ``-ஒரு வழக்கு-உணர்வற்ற லெக்சிக்கல் வகையைப் பயன்படுத்தி வரிசைப்படுத்தப்பட்ட `` பட்டியல்`. `` திசை`` பூஜ்ஜியமாக இருந்தால், `` பட்டியல்`` வரிசைப்படுத்தப்படுகிறது, இல்லையெனில் இறங்குகிறது. பட்டியல் உருப்படிகள் `` பிரிப்பான்`` ஆல் பிரிக்கப்படுகின்றன, திரும்பிய பட்டியலில் உள்ள உருப்படிகள்.

source: ``list_split(list_val, sep, id_prefix)`` -- splits ``list_val`` into separate values using ``sep``, then assigns the values to local variables named ``id_prefix_N`` where N is the position of the value in the list. The first item has position 0 (zero). The function returns the last element in the list.
ja: ``list_split(list_val, sep, id_prefix)`` -- ``sep`` を区切り文字として使用して ``list_val`` を個別の値に分割し、``id_prefix_N`` という名前のローカル変数に値を割り当てます。N はリスト内の値の位置です。最初の項目の位置は 0 (ゼロ) です。この関数は、リストの最後の要素を返します。
nl: ``list_split(list_val, sep, id_prefix)`` -- splitst ``list_val`` in aparte waardes met ``sep``, wijst dan de waardes toe an lokale variabelen genaamd ``id_prefix_N`` waar N de positie is van de waarde in de lijst. Het eerste item heeft positie 0 (zero). De functie geeft het laatste element in de lijst.
ta: `` list_val, sep, id_prefix) `` - `` sep`` ஐப் பயன்படுத்தி `` பட்டியல்_வல்`` ஐப் பயன்படுத்தி `` பட்டியல்_வல்`` ஐப் பிரித்து, `` ஐடி_பிரெஃபிக்ஸ்_.என்` என்ற பெயரில் உள்ள உள்ளூர் மாறிகளுக்கு மதிப்புகளை ஒதுக்குகிறது பட்டியலில் மதிப்பு. முதல் உருப்படிக்கு நிலை 0 (பூஜ்ஜியம்) உள்ளது. செயல்பாடு பட்டியலில் கடைசி உறுப்பை வழங்குகிறது.

source: is equivalent to::
ja: これは次と同等です::
nl: is gelijkwaardig aan::
ta: அதற்கு சமம் ::

source: ``list_union(list1, list2, separator)`` -- return a list made by merging the items in ``list1`` and ``list2``, removing duplicate items using a case-insensitive comparison. If items differ in case, the one in ``list1`` is used. The items in ``list1`` and ``list2`` are separated by ``separator``, as are the items in the returned list. Aliases: ``merge_lists()``, ``list_union()``
ja: ``list_union(list1, list2, separator)`` -- ``list1`` と ``list2`` の項目をマージし、重複する項目を大文字と小文字を区別しない比較を使用して削除して作成されたリストを返します。大文字と小文字が異なる場合は、``list1`` のものを使用します。``list1`` と ``list2`` の項目と、返されたリストの項目は、いずれも ``separator`` で区切られます。別名: ``merge_lists()``, ``list_union()``
nl: ``list_union(list1, list2, separator)`` -- geeft een lijst terug gemaakt door het samenvoegen van de items in ``list1`` en ``list2``, waarbij dubbels worden verwijderd (hoofdletterongevoelig). Als items verschillen in hoofdletter-gebruik, zal de versie van ``list1`` gebruikt worden. De items in ``list1`` en ``list2`` worden gescheiden door ``separator``, zo ook de items in de teruggegeven lijst. Aliassen: ``merge_lists()``, ``list_union()``
ta: `` பட்டியல்_யூனியன் (பட்டியல் 1, பட்டியல் 2, பிரிப்பான்) ``-`` பட்டியல் 1` மற்றும் `` பட்டியல் 2`` ஆகியவற்றில் உள்ள உருப்படிகளை ஒன்றிணைப்பதன் மூலம் செய்யப்பட்ட பட்டியலைத் திருப்பி, வழக்கு-பாதுகாப்பு ஒப்பீட்டைப் பயன்படுத்தி நகல் உருப்படிகளை அகற்றவும். உருப்படிகள் வேறுபட்டால், `` பட்டியல் 1`` இல் உள்ள ஒன்று பயன்படுத்தப்படுகிறது. `` பட்டியல் 1`` மற்றும் `பட்டியல் 2`` ஆகியவற்றில் உள்ள உருப்படிகள்` `பிரிப்பான்`` ஆல் பிரிக்கப்படுகின்றன, திரும்பிய பட்டியலில் உள்ள உருப்படிகள். மாற்றுப்பெயர்கள்: `` merge_lists () ``, `` list_union () ``

source: ``mod(x, y)`` -- returns the ``floor`` of the remainder of ``x / y``. Throws an exception if either ``x`` or ``y`` is not a number.
ja: ``mod(x, y)`` -- ``x / y`` の余りの ``floor`` を返します。``x`` と ``y`` のいずれかが数値でない場合、例外をスローします。
nl: ``mod(x, y)`` -- geeft de ``vloer`` van rest van ``x / y`` terug. Gooit een uitzondering als ofwel ``x`` ofwel ``y`` geen getal is.
ta: `` mod (x, y) `` - மீதமுள்ள `` x / y``` இன் `` மாடி` 'ஐ வழங்குகிறது. `` X`` அல்லது `` y`` ஒரு எண் இல்லையென்றால் விதிவிலக்கை வீசுகிறது.

source: ``multiply(x [, y]*)`` -- returns the product of its arguments. Throws an exception if any argument is not a number. This function can usually be replaced by the ``*`` operator.
ja: ``multiply(x [, y]*)`` -- 引数の積を返します。引数が数値でない場合は、例外をスローします。この関数は通常、``*`` 演算子で置き換えることができます。
nl: ``multiply(x [, y]*)`` -- geeft het product van z'n argumenten terug. Gooit een uitzondering als eender welk argument geen getal is. Deze functie kan gewoonlijk vervangen worden door de ``*`` operator.
ta: `` பெருக்கவும் (x [, y]*) `` - அதன் வாதங்களின் உற்பத்தியை வழங்குகிறது. எந்தவொரு வாதமும் ஒரு எண்ணாக இல்லாவிட்டால் விதிவிலக்கை வீசுகிறது. இந்த செயல்பாட்டை வழக்கமாக ``*`` ஆபரேட்டரால் மாற்றலாம்.

source: ``not(value)`` -- returns the string "1" if the value is empty, otherwise returns the empty string. This function can usually be replaced with the unary not (``!``) operator.
ja: ``not(value)`` -- 値が空であれば文字列 "1" を返し、そうでなければ空の文字列を返します。この関数は通常、単項否定演算子 (``!``) に置き換えることができます。
nl: ``not(value)`` -- geeft de string "1" terug als de waarde leeg is, anders de lege string. Deze functie kan gewoonlijk vervangen worden door de unary niet (``!``) operator.
ta: `` இல்லை (மதிப்பு) `` - மதிப்பு காலியாக இருந்தால் "1" என்ற சரத்தை வழங்குகிறது, இல்லையெனில் வெற்று சரத்தை வழங்குகிறது. இந்த செயல்பாட்டை வழக்கமாக ஒற்றுமையற்ற (``! ``) ஆபரேட்டருடன் மாற்றலாம்.

source: ``ondevice()`` -- return the string ``'Yes'`` if ``ondevice`` is set, otherwise return the empty string.
ja: ``ondevice()`` -- ``ondevice`` が設定されていれば文字列 ``'Yes'`` を返し、そうでなければ空の文字列を返します。
nl: ``ondevice()`` -- geeft de string ``'Yes'`` terug als ``ondevice`` is ingesteld, anders de lege string.
ta: `` ondevice () `` - சரம் `` 'ஆம்'`` `` ondevice`` அமைக்கப்பட்டால், வெற்று சரத்தை திருப்பித் தரவும்.

source: ``or(value [, value]*)`` -- returns the string ``'1'`` if any value is not empty, otherwise returns the empty string. You can have as many values as you want. This function can usually be replaced by the ``||`` operator. A reason it cannot be replaced is if short-circuiting will change the results because of side effects.
ja: ``or(value [, value]*)`` -- 値が空でなければ文字列 ``'1'`` を返し、そうでなければ空の文字列を返します。必要なだけの数の value を渡せます。この関数は通常、``||`` 演算子に置き換えることができます。置き換えができないのは、短絡評価すると副作用により結果が変わる場合です。
ta: `` அல்லது (மதிப்பு [, மதிப்பு]*) `` - சரம் `` '1'`` ஏதேனும் மதிப்பு காலியாக இல்லாவிட்டால், வெற்று சரத்தை வழங்குகிறது. நீங்கள் விரும்பும் பல மதிப்புகளை நீங்கள் கொண்டிருக்கலாம். இந்த செயல்பாட்டை வழக்கமாக `` || `` ஆபரேட்டரால் மாற்றலாம். பக்க விளைவுகள் காரணமாக குறுகிய சுற்று முடிவுகளை மாற்றினால் அதை மாற்ற முடியாத ஒரு காரணம்.

source: ``print(a [, b]*)`` -- prints the arguments to standard output. Unless you start calibre from the command line (``calibre-debug -g``), the output will go into a black hole. The ``print`` function always returns its first argument.
ja: ``print(a [, b]*)`` -- 引数を標準出力に出力します。コマンドライン (``calibre-debug -g``) から calibre を開始しない限り、出力はブラックホールに入ります。 ``print`` 関数は、常に最初の引数を返します。
ta: `` அச்சிடு (A [, b]*) `` - வாதங்களை நிலையான வெளியீட்டிற்கு அச்சிடுகிறது. கட்டளை வரியிலிருந்து (`` கலிபிரே -டெபக் -ஜி``) நீங்கள் திறனைத் தொடங்காவிட்டால், வெளியீடு ஒரு கருந்துளைக்குள் செல்லும். `` அச்சு`` செயல்பாடு எப்போதும் அதன் முதல் வாதத்தை வழங்குகிறது.

source: ``range(start, stop, step, limit)`` -- returns a list of numbers generated by looping over the range specified by the parameters start, stop, and step, with a maximum length of limit. The first value produced is 'start'. Subsequent values ``next_v = current_v + step``. The loop continues while ``next_v < stop`` assuming ``step`` is positive, otherwise while ``next_v > stop``. An empty list is produced if ``start`` fails the test: ``start >= stop`` if ``step`` is positive. The ``limit`` sets the maximum length of the list and has a default of 1000. The parameters ``start``, ``step``, and ``limit`` are optional. Calling ``range()`` with one argument specifies ``stop``. Two arguments specify ``start`` and ``stop``. Three arguments specify ``start``, ``stop``, and ``step``. Four arguments specify ``start``, ``stop``, ``step`` and ``limit``. Examples::
ja: ``range(start, stop, step, limit)`` -- パラメータ start、stop、および step で指定された範囲をループすることによって生成された数値のリストを、長さの上限値とともに返します。生成される最初の値は 'start' です。それに続く値は ``next_v = current_v + step`` です。``step`` が正の数であれば ``next_v < stop`` の間、そうでなければ ``next_v > stop`` の間ループします。``step`` が正のとき、``start`` が ``start >= stop`` のテストに失敗すると、空のリストが生成されます。``limit`` はリストの最大長を設定し、デフォルトは1000です。パラメータ ``start``, ``step``, および ``limit`` はオプションです。引数 1 個を指定して ``range()`` を呼び出すと、``stop`` を指定します。引数 2 個は、``start`` と ``stop`` を指定します。引数 3 個は、``start``, ``stop``, および ``step``を指定します。引数 4 個は、``start``, ``stop``, ``step`` および ``limit`` を指定します。例::
ta: `` வரம்பு (தொடக்க, நிறுத்து, படி, வரம்பு) `` - அளவுருக்கள் தொடங்கி, நிறுத்து மற்றும் படி ஆகியவற்றால் குறிப்பிடப்பட்ட வரம்பில் சுழற்றுவதன் மூலம் உருவாக்கப்படும் எண்களின் பட்டியலை அதிகபட்ச நீளமான வரம்புடன் தருகிறது. தயாரிக்கப்பட்ட முதல் மதிப்பு 'தொடக்க'. அடுத்தடுத்த மதிப்புகள் `` நெக்ஸ்ட்_வி = நடப்பு_வி + படி``. `` நெக்ஸ்ட்_வி <நிறுத்தம்`` என்று கருதி லூப் தொடர்கிறது, இல்லையெனில் `` அடுத்த_வி> நிறுத்து``. `` தொடக்க` `சோதனையில் தோல்வியுற்றால் வெற்று பட்டியல் தயாரிக்கப்படுகிறது:` `start``` `படி`` நேர்மறையாக இருந்தால். `` வரம்பு`` பட்டியலின் அதிகபட்ச நீளத்தை அமைத்து 1000 இயல்புநிலையைக் கொண்டுள்ளது. ஒரு வாதத்துடன் `` வரம்பு () `` என்று அழைப்பது `` நிறுத்து`` என்பதைக் குறிப்பிடுகிறது. இரண்டு வாதங்கள் `` தொடக்க`` மற்றும் `` நிறுத்து`` ஆகியவற்றைக் குறிப்பிடுகின்றன. மூன்று வாதங்கள் `` தொடக்க``, `` நிறுத்து``, மற்றும் `` படி`` ஆகியவற்றைக் குறிப்பிடுகின்றன. நான்கு வாதங்கள் `` தொடக்க``, `` நிறுத்து``, `` படி`` மற்றும் `` வரம்பு`` ஆகியவற்றைக் குறிப்பிடுகின்றன. எடுத்துக்காட்டுகள் ::

source: ``raw_field(lookup_name [, optional_default])`` -- returns the metadata field named by ``lookup_name`` without applying any formatting. It evaluates and returns the optional second argument ``optional_default`` if the field's value is undefined (``None``).
ja: ``raw_field(lookup_name [, optional_default])`` -- 書式を適用せずに ``lookup_name`` で指定された書誌フィールドを返します。フィールドの値が未定義 (``None``) の場合、オプションの 2 番目の引数 ``optional_default`` を評価して返します。
nl: ``raw_field(lookup_name [, optional_default])`` -- geeft het metadata veld terug genoemd door ``lookup_name`` zonder toepassen van opmaak. Het evalueert en geeft het optionele tweede argument ``optional_default`` terug als de waarde va het veld niet gedefinieerd (``None``).
ta: `` RAW_FIELD (Lookup_name [, விரும்பினால்_தெபால்ட்]) `` - எந்தவொரு வடிவமைப்பையும் பயன்படுத்தாமல் `` giotup_name`` என பெயரிடப்பட்ட மெட்டாடேட்டா புலத்தை வழங்குகிறது. புலத்தின் மதிப்பு வரையறுக்கப்படவில்லை என்றால் (`` எதுவுமில்லை``) விருப்பமான இரண்டாவது வாதத்தை `` விரும்பினால்_ டெஃபால்ட்`` மதிப்பீடு செய்து வழங்குகிறது.

source: ``raw_list(lookup_name, separator)`` -- returns the metadata list named by ``lookup_name`` without applying any formatting or sorting, with the items separated by separator.
ja: ``raw_list(lookup_name, separator)`` -- 書式や並べ替えを適用せずに、``lookup_name`` で指定した書誌リストを返します。項目は``separator`` で区切られます。
nl: ``raw_list(lookup_name, separator)`` -- geeft de metadatalijst terug benoemd door ``lookup_name`` zonder toepassen van formatering of sortering, met items gescheiden door separator.
ta: `` RAW_LIST (Lookup_name, பிரிப்பான்) `` - எந்தவொரு வடிவமைப்பையும் அல்லது வரிசையாக்கத்தையும் பயன்படுத்தாமல், பிரிப்பாட்டால் பிரிக்கப்பட்ட உருப்படிகளுடன் `` Lookup_name`` என பெயரிடப்பட்ட மெட்டாடேட்டா பட்டியலை வழங்குகிறது.

source: ``re_group(value, pattern [, template_for_group]*)`` -- return a string made by applying the regular expression pattern to ``value`` and replacing each matched instance with the the value returned by the corresponding template. In :ref:`Template Program Mode <template_mode>`, like for the ``template`` and the ``eval`` functions, you use ``[[`` for ``{`` and ``]]`` for ``}``.
ja: ``re_group(value, pattern [, template_for_group]*)`` -- 正規表現パターンを`` value`` に適用し、マッチした各インスタンスを対応するテンプレートによって返される値に置き換えて作成された文字列を返します。 :ref:`テンプレートプログラムモード <template_mode>` では、``template`` 関数や ``eval`` 関数と同様に `` [[`` を `` {`` に、そして ``]]` を ``}`` に使用します。
ta: `` re_group (மதிப்பு, முறை [, டெம்ப்ளேட்_ஃபோர்_ குழுமம்]*) `` - வழக்கமான வெளிப்பாடு வடிவத்தை `` மதிப்பு`` ஐப் பயன்படுத்துவதன் மூலமும், பொருந்திய ஒவ்வொரு நிகழ்வையும் மாற்றியமைப்பதன் மூலமும் தொடர்புடைய வார்ப்புருவால் வழங்கப்பட்ட மதிப்புடன் மாற்றப்பட்ட சரத்தைத் திருப்பித் தரவும். இல்: குறிப்பு: `` வார்ப்புரு`` மற்றும் `` எவால்`` செயல்பாடுகளைப் போலவே, `வார்ப்புரு நிரல் பயன்முறை <emplatue_mode>` ``} `` க்கு.

source: The following example looks for a series with more than one word and uppercases the first word::
ja: 次の例では、複数の単語を含むシリーズを検索し、最初の単語を大文字にします::
nl: Het volgende voorbeeld zoekt naar een reeks met meer dan één woord zet het eerste woord in hoofdletters::
ta: பின்வரும் எடுத்துக்காட்டு ஒன்றுக்கு மேற்பட்ட வார்த்தைகளைக் கொண்ட ஒரு தொடரைத் தேடுகிறது மற்றும் முதல் சொல் ::

source: ``round(x)`` -- returns the nearest integer to ``x``. Throws an exception if ``x`` is not a number.
ja: ``round(x)`` -- ``x`` に最も近い整数を返します。``x`` が数値でない場合、例外をスローします。
nl: ``round(x)`` -- geeft de dichtbijgelegen integer van ``x`` terug. Gooit een uitzondering als ``x`` geen getal is.
ta: `` சுற்று (x) `` - அருகிலுள்ள முழு எண்ணை `` x`` க்கு வழங்குகிறது. `` X`` ஒரு எண் இல்லையென்றால் விதிவிலக்கை வீசுகிறது.

source: ``series_sort()`` -- returns the series sort value.
ja: ``series_sort()`` -- シリーズ読みの値を返します。
nl: ``series_sort()`` -- geeft de reekssorteerwaarde terug.
ta: `` sitery_sort () `` - தொடர் வரிசை மதிப்பை வழங்குகிறது.

source: ``strcat(a [, b]*)`` -- can take any number of arguments. Returns a string formed by concatenating all the arguments.
ja: ``strcat(a [, b]*)`` -- 任意の数の引数を渡せます。すべての引数を連結して形成された文字列を返します。
nl: ``strcat(a [, b]*)`` -- kan een willekeurig aantal parameters verwerken. Geeft een string terug bestaande uit de samengevoegde parameters
ta: `` strcat (a [, b]*) `` - எந்தவொரு வாதங்களையும் எடுக்கலாம். அனைத்து வாதங்களையும் ஒருங்கிணைப்பதன் மூலம் உருவாக்கப்பட்ட ஒரு சரத்தை வழங்குகிறது.
