Repository: debian-calibre/calibre
Catalog: translations/manual/*/typesetting_math.po
Languages: ar, cs, gl, ru, ta, zh_cn

source: Typesetting mathematics in e-books
ar: تنسيق الرياضيات في الكتب الإلكترونية
gl: Composición de matemáticas en libros electrónicos
ru: Типографика математических выражений в электронных книгах
ta: மின் புத்தகங்களில் கணிதத்தைத் தட்டச்சு செய்தல்
zh_cn: 电子书中的排版数学

source: The calibre E-book viewer has the ability to display mathematics embedded in e-books (EPUB and HTML files). You can typeset the mathematics directly with TeX or MathML or AsciiMath. The calibre E-book viewer uses the excellent `MathJax <https://www.mathjax.org>`_ library to do this. This is a brief tutorial on creating e-books with mathematics in them that work well with the calibre E-book viewer.
ar: يتمتع عارض الكتب الإلكترونية في calibre بالقدرة على عرض الرياضيات المضمنة في الكتب الإلكترونية (ملفات EPUB و HTML). يمكنك تنسيق الرياضيات مباشرة باستخدام TeX أو MathML أو AsciiMath. يستخدم عارض الكتب الإلكترونية في calibre مكتبة `MathJax <https://www.mathjax.org>`_ الممتازة للقيام بذلك. هذا دليل تعليمي موجز حول إنشاء كتب إلكترونية تحتوي على رياضيات تعمل بشكل جيد مع عارض الكتب الإلكترونية في calibre.
gl: O visor de libros electrónicos de calibre ten a capacidade de mostrar matemáticas integradas en libros electrónicos (ficheiros EPUB e HTML). Podes escribir as matemáticas directamente con TeX ou MathML ou AsciiMath. O visor de libros electrónicos de calibre usa a excelente biblioteca `MathJax <https://www.mathjax.org>`_ para facelo. Este é un breve tutorial sobre a creación de libros electrónicos con matemáticas que funcionen ben co visor de libros electrónicos de calibre.
ru: Просмотрщик электронных книг calibre умеет отображать математические выражения, встроенные в электронные книги (файлы EPUB и HTML). Вы можете набирать их с помощью TeX, или MathML, или AsciiMath. Просмотрщик эл.книг calibre использует отличную библиотеку `MathJax <https://www.mathjax.org>`_. Это краткое руководство по созданию электронных книг со встроенными формулами, которые хорошо работают в просмотрщике эл. книг calibre.
ta: காலிபர் மின்-புத்தக பார்வையாளருக்கு மின் புத்தகங்களில் (epub மற்றும் html கோப்புகள்) பதிக்கப்பட்ட கணிதத்தைக் காண்பிக்கும் திறன் உள்ளது. நீங்கள் கணிதத்தை நேரடியாக டெக்ச் அல்லது மேத்எம்எல் அல்லது அச்கிமாத் மூலம் தட்டச்சு செய்யலாம். காலிபர் மின்-புத்தக பார்வையாளர் இதைச் செய்ய சிறந்த `மேத்சாக்ச் <https://www.mathjax.org> _ நூலகத்தைப் பயன்படுத்துகிறார். கணிதத்துடன் மின் புத்தகங்களை உருவாக்குவதற்கான சுருக்கமான பயிற்சி இது, அவை காலிபர் மின் புத்தக பார்வையாளருடன் நன்றாக வேலை செய்கின்றன.
zh_cn: Calibre电子书阅读器能够显示嵌入在电子书(EPUB和HTML文件)中的数学。您可以直接使用TeX、MathML或AsciiMath来排版数学。Calibre电子书阅读器使用优秀的`MathJax<https://www.mathjax.org>`_书库来实现这一点。这是一个简短的教程，介绍如何使用数学制作电子书，并与优秀的电子书阅读器配合使用。

source: A simple HTML file with mathematics
ar: ملف HTML بسيط يحتوي على رياضيات
cs: Zjednodušený soubor HTML s matematikou
gl: Un ficheiro HTML sinxelo con matemáticas
ru: Простой HTML-файл с формулами
ta: கணிதத்துடன் ஒரு எளிய html கோப்பு
zh_cn: 带有数学公式的简单 HTML 文件

source: You can write mathematics inline inside a simple HTML file and the calibre E-book viewer will render it into properly typeset mathematics. In the example below, we use TeX notation for mathematics. You will see that you can use normal TeX commands, with the small caveat that ampersands and less than and greater than signs have to be written as &amp; &lt; and &gt; respectively.
ar: يمكنك كتابة الرياضيات مباشرة داخل ملف HTML بسيط وسيقوم عارض الكتب الإلكترونية في calibre بتحويلها إلى رياضيات منسقة بشكل صحيح. في المثال أدناه، نستخدم تدوين TeX للرياضيات. سترى أنه يمكنك استخدام أوامر TeX العادية، مع ملاحظة صغيرة وهي أن علامات العطف وعلامات أصغر من وأكبر من يجب كتابتها كـ &amp; و &lt; و &gt; على التوالي.
gl: Podes escribir matemáticas en liña dentro dun ficheiro HTML sinxelo e o visor de libros electrónicos de calibre renderao en matemáticas correctamente compuestas. No seguinte exemplo, usamos a notación TeX para as matemáticas. Verás que podes usar comandos TeX normais, coa pequena advertencia de que os signos e ampersand e os signos menores e maiores que teñen que escribirse como &amp; &lt; e &gt; respectivamente.
ru: Вы можете вписать математические выражения внутрь простого HTML-файла, а читалка calibre превратит их в правильно набранные формулы. В примере ниже для математических выражений применяется нотация TeX. Вы увидите, что можно использовать обычные команды TeX, пусть с небольшой оговоркой: амперсанды и знаки «меньше» и «больше» должны записываться как &amp;, &lt; и &gt; соответственно.
ta: நீங்கள் ஒரு எளிய html கோப்பிற்குள் கணித இன்லைன் எழுதலாம் மற்றும் காலிபர் மின்-புத்தக பார்வையாளர் அதை ஒழுங்காக தட்டச்சு கணிதத்தில் வழங்குவார். கீழேயுள்ள எடுத்துக்காட்டில், கணிதத்திற்கான டெக்ச் குறியீட்டைப் பயன்படுத்துகிறோம். நீங்கள் சாதாரண டெக்ச் கட்டளைகளைப் பயன்படுத்தலாம் என்பதை நீங்கள் காண்பீர்கள், சிறிய எச்சரிக்கையுடன் ஆம்பர்சாண்ட்ச் மற்றும் அறிகுறிகளைக் காட்டிலும் குறைவாகவும் அதிகமாகவும் &amp; & lt; மற்றும் & gt; முறையே.
zh_cn: 你可以直接在简单 HTML 文件中的段落里穿插数学公式，这样 calibre 电子书阅读器就能正确排版数学公式。在如下的例子中，我们用 TeX 的数学公式记法。如你所见，你可以使用通常的 TeX 命令，不过要注意把 & 和大于小于符号分别写成 & < 和 >。

source: The first step is to tell calibre that this will contains mathematics. You do this by adding the following snippet of code to the <head> section of the HTML file::
ar: الخطوة الأولى هي إخبار calibre بأن هذا الملف سيحتوي على رياضيات. يمكنك القيام بذلك بإضافة مقتطف الشفرة التالي إلى قسم <head> في ملف HTML::
gl: O primeiro paso é dicirlle a calibre que isto contén matemáticas. Faino engadindo o seguinte fragmento de código á sección do ficheiro HTML::
ru: Сперва необходимо сообщить calibre, что документ содержит формулы. Для этого в раздел <head> HTML-файла добавляется следующий фрагмент кода::
ta: முதல் படி இது கணிதத்தைக் கொண்டிருக்கும் என்று காலிபரிடம் சொல்வது. html கோப்பின் <head> பிரிவில் பின்வரும் குறியீட்டின் துணுக்கை சேர்ப்பதன் மூலம் இதைச் செய்கிறீர்கள் ::
zh_cn: 第一步是告诉calibre这将包含数学。您可以通过将以下代码片段添加到<head> HTML文件的章节来完成此操作：

source: That's it, now you can type mathematics just as you would in a .tex file. For example, here are Lorentz's equations::
ar: هذا كل شيء، الآن يمكنك كتابة الرياضيات تمامًا كما تفعل في ملف .tex. على سبيل المثال، إليك معادلات لورنتز::
cs: To je vše, nyní můžete psát matematiku, jak byste to udělali v souboru .tex. Například zde jsou Lorentzovy rovnice::
gl: Iso é todo, agora podes escribir matemáticas como o farías nun ficheiro .tex. Por exemplo, aquí están as ecuacións de Lorentz::
ru: И всё, теперь можно писать формулы так же, как в .tex файле. К примеру, вот уравнения Лоренца::
ta: அவ்வளவுதான், இப்போது நீங்கள் ஒரு .tex கோப்பில் இருப்பதைப் போலவே கணிதத்தையும் தட்டச்சு செய்யலாம். எடுத்துக்காட்டாக, இங்கே லோரென்ட்சின் சமன்பாடுகள் ::
zh_cn: 就是这样，现在你可以像在 .tex 文件中一样书写数学公式。例如，下列是洛伦茨方程::

source: This snippet looks like the following screen shot in the calibre E-book viewer.
ar: يبدو هذا المقتطف مثل لقطة الشاشة التالية في عارض الكتب الإلكترونية في calibre.
gl: Este fragmento parece a seguinte captura de pantalla no visor de libros electrónicos de calibre.
ru: Этот фрагмент в читалке calibre выглядит как снимок экрана ниже.
ta: இந்த துணுக்கை காலிபர் மின் புத்தக பார்வையாளரில் பின்வரும் திரை காட்சி போல் தெரிகிறது.
zh_cn: 这段代码在 calibre 电子书阅读器看起来像如下的截图这样。

source: :guilabel:`The Lorenz Equations`
ar: :guilabel:`معادلات لورنز`
cs: :guilabel:`Lorentzovy rovnice`
gl: :guilabel:`As ecuacións de Lorenz`
ru: :guilabel:`Уравнения Лоренца`
ta: : கிலாபெல்: `தி லோரென்ச் சமன்பாடுகள்`
zh_cn: `洛伦茨方程`

source: The complete HTML file, with more equations and inline mathematics is reproduced below. You can convert this HTML file to EPUB in calibre to end up with an e-book you can distribute easily to other people.
ar: يتم إعادة إنتاج ملف HTML الكامل، مع المزيد من المعادلات والرياضيات المضمنة، أدناه. يمكنك تحويل ملف HTML هذا إلى EPUB في calibre للحصول على كتاب إلكتروني يمكنك توزيعه بسهولة على أشخاص آخرين.
gl: A continuación reprodúcese o ficheiro HTML completo, con máis ecuacións e matemáticas en liña. Podes converter este ficheiro HTML a EPUB en calibre para acabar cun libro electrónico que podes distribuír facilmente a outras persoas.
ru: Ниже приведён полный HTML-файл с большим количеством уравнений и встроенной математики. Вы можете преобразовать этот HTML-файл в EPUB в calibre, чтобы в итоге получить электронную книгу, которую легко распространять среди других людей.
ta: முழுமையான html கோப்பு, அதிக சமன்பாடுகள் மற்றும் இன்லைன் கணிதத்துடன் கீழே மீண்டும் உருவாக்கப்படுகிறது. நீங்கள் மற்றவர்களுக்கு எளிதாக விநியோகிக்கக்கூடிய மின் புத்தகத்துடன் முடிவதற்கு இந்த html கோப்பை காலிபரில் epub ஆக மாற்றலாம்.
zh_cn: 完整的 HTML 文件，附带更多的方程式和行内数学公式在下面列出。你可以将此 HTML 文件在 calibre 中转成 EPUB，这样就能得到一本可以轻而易举与他人分享的电子书。

source: Here is the generated EPUB file: `mathjax.epub <_static/mathjax.epub>`_.
ar: هنا ملف EPUB الذي تم إنشاؤه: `mathjax.epub <_static/mathjax.epub>`_.
cs: Zde je vygenerovaný soubor EPUB: `mathjax.epub <_static/mathjax.epub>`_.
gl: Aquí está o ficheiro EPUB xerado: `mathjax.epub <_static/mathjax.epub>`_.
ru: Полученный EPUB-файл находится здесь: `mathjax.epub <_static/mathjax.epub>`_.
ta: உருவாக்கப்பட்ட எபப் கோப்பு இங்கே: `mathjax.epub <_static/mathjax.epub>` _.
zh_cn: 这是生成的 EPUB 文件： `mathjax.epub <_static/mathjax.epub>`_

source: The calibre E-book viewer supports MathML as well as TeX, but you must include the ``<script type="text/x-mathjax-config"></script>`` line in your HTML file otherwise the MathML will not render.
ar: يدعم عارض الكتب الإلكترونية في calibre MathML بالإضافة إلى TeX، ولكن يجب عليك تضمين السطر ``<script type=\text/x-mathjax-config\></script>`` في ملف HTML الخاص بك وإلا فلن يتم عرض MathML.

source: More information
ar: مزيد من المعلومات
cs: Více informací
gl: Máis información
ru: Дополнительная информация
ta: மேலும் செய்தி
zh_cn: 更多信息

source: Since the calibre E-book viewer uses the MathJax library to render mathematics, the best place to find out more about mathematics in e-books and get help is the `MathJax website <https://www.mathjax.org>`_.
ar: نظرًا لأن عارض الكتب الإلكترونية في calibre يستخدم مكتبة MathJax لعرض الرياضيات، فإن أفضل مكان للعثور على المزيد من المعلومات حول الرياضيات في الكتب الإلكترونية والحصول على المساعدة هو `موقع MathJax <https://www.mathjax.org>`_.
gl: Dado que o visor de libros electrónicos de calibre usa a biblioteca MathJax para renderizar matemáticas, o mellor lugar para obter máis información sobre as matemáticas nos libros electrónicos e obter axuda é o "sitio web de MathJax <https://www.mathjax.org>`_.
ru: Поскольку промотрщик эл. книг calibre для отрисовки формул использует библиотеку MathJax, лучшее место, где можно узнать больше о математике в электронных книгах и получить помощь, — это `веб-сайт MathJax <https://www.mathjax.org>`_.
ta: கணிதத்தை வழங்குவதற்காக காலிபர் மின்-புத்தக பார்வையாளர் கணிதத்தை வழங்க மேத்சாக்ச் நூலகத்தைப் பயன்படுத்துவதால், மின் புத்தகங்களில் கணிதத்தைப் பற்றி மேலும் கண்டுபிடித்து உதவி பெற சிறந்த இடம் `மேத்சாக்ச் வலைத்தளம் <https://www.mathjax.org>` _.
zh_cn: 由于优秀的电子书阅读器使用MathJax书库来呈现数学，因此是在电子书中了解更多数学知识并获得帮助的最佳场所是 `MathJax网站 <https://www.mathjax.org>`_.

source: The calibre viewer supports MathML as well as TeX, but you must include the ``<script type="text/x-mathjax-config"></script>`` line in your HTML file otherwise the MathML will not render.
zh_cn: Calibre阅读器支持MathML和TeX，但您必须在HTML文件中包含 ``<script type="text/x-mathjax-config"></script>`` 行，否则MathML将不会正常呈现。

source: Typesetting Math in ebooks
cs: Sazba matematiky v e-knihách

source: The calibre ebook viewer has the ability to display math embedded in ebooks (ePub and HTML files). You can typeset the math directly with TeX or MathML or AsciiMath. The calibre viewer uses the excellent `MathJax <http://www.mathjax.org>`_ library to do this. This is a brief tutorial on creating ebooks with math in them that work well with the calibre viewer.
cs: Prohlížeč e-knih calibre má schopnost zobrazit matematiku vloženou do e-knih (soubory ePub a HTML). Můžete sázet matematiku přímo pomocí TeX, MathML nebo AsciiMath. Prohlížeč calibre k tomuto používá vynikající knihovnu `MathJax <http://www.mathjax.org>`_. Toto je stručný kurz vytváření e-knih s matematikou, které fungují dobře s prohlížečem calibre.

source: You can write mathematics inline inside a simple HTML file and the calibre viewer will render it into properly typeset mathematics. In the example below, we use TeX notation for mathematics. You will see that you can use normal TeX commands, with the small caveat that ampersands and less than and greater than signs have to be written as &amp; &lt; and &gt; respectively.
cs: Můžete zapsat matematiku vloženou uvnitř souboru zjednodušeného HTML a prohlížeč calibre ji vykreslí se správnou sazbou matematiky. V příkladu níže používáme pro matematiku zápis TeX. Uvidíte, že můžete použít normální příkazy TeX, s malým upozorněním, že ampersandy a znaky menší než a větší než musí být zapsány jako &amp; &lt; a &gt; v uvedeném pořadí.

source: The first step is to tell calibre that this will contains maths. You do this by adding the following snippet of code to the <head> section of the HTML file::
cs: První krok je říct calibre, že toto bude obsahovat matematiku. To uděláte přidáním následujícího fragmentu kódu do oddílu <head> souboru HTML::

source: This snippet looks like the following screen shot in the calibre viewer.
cs: Tento fragment vypadá jako následující snímek obrazovky v prohlížeči calibre.

source: The complete HTML file, with more equations and inline mathematics is reproduced below. You can convert this HTML file to EPUB in calibre to end up with an ebook you can distribute easily to other people.
cs: Kompletní soubor HTML s více rovnicemi a vloženou matematikou je reprodukován níže. Tento soubor HTML můžete převést do EPUB v calibre, abyste získali e-knihu, kterou můžete snadno distribuovat ostatním lidem.

source: Since the calibre viewer uses the MathJax library to render mathematics, the best place to find out more about math in ebooks and get help is the `MathJax website <http://www.mathjax.org>`_.
cs: Protože prohlížeč calibre používá pro vykreslení matematiky knihovnu MathJax, nejlepší místo pro zjištění více o matematice v e-knihách a získání nápovědy je `Webová stránka MathJax <http://www.mathjax.org>`_.
