Repository: debian-calibre/calibre
Catalog: translations/manual/*/url_scheme.po
Languages: gl, pt_br, zh_cn

source: The calibre:// URL scheme
gl: O esquema de URL calibre://
pt_br: Esquema de URL calibre://
zh_cn: Calibre:// URL方案

source: calibre registers itself as the handler program for calibre:// URLs. So you can use these to perform actions like opening books, searching for books, etc from other programs/documents or via the command line. For example, running the following at the command line::
gl: calibre rexístrase como o programa xestor para os URL calibre://. Polo tanto, podes usalos para realizar accións como abrir libros, buscar libros, etc. desde outros programas/documentos ou a través da liña de comandos. Por exemplo, executando o seguinte na liña de comandos::
pt_br: O calibre se registra como programa padrão para abrir URLs calibre://. Assim você pode usar isto para executar ações, como abrir livros, pesquisar por livros, etc. a partir de outros programas/documentos ou por linha de comando. Por exemplo: executar o seguinte na linha de comando::
zh_cn: Calibre将自身注册为Calibre：//URL的处理程序。因此，您可以使用它们来执行从其他程序/文档或通过命令行打开书籍、搜索书籍等操作。例如，在命令行中运行以下命令：

source: Will open calibre with the library named ``Some Library``. Library names are the folder name of the library folder with spaces replaced by underscores. The special value ``_`` means the current library. The various types of URLs are documented below.
gl: Abrirá Calibre coa biblioteca chamada "Algunha biblioteca". Os nomes das bibliotecas son o nome do cartafol da biblioteca con espazos substituídos por guións baixos. O valor especial "_" indica a biblioteca actual. Os distintos tipos de URL están documentados a continuación.
pt_br: Irá abrir o calibre com a biblioteca nomeada "Some Library". Os nomes das bibliotecas são o nome da pasta da biblioteca com espaços substituídos por sublinhados. O valor especial "_" significa a biblioteca atual. Os vários tipos de URLs estão documentados abaixo.
zh_cn: 将使用名为``某些书库``的书库打开Calibre。书库名称是书库文件夹的文件夹名称，用下划线替换空格。特定值``_``表示当前书库。下面记录了各种类型的URL。

source: You can even place these links inside HTML files or Word documents or similar and the operating system will automatically run calibre to perform the specified action.
gl: Incluso podes colocar estas ligazóns dentro de ficheiros HTML ou documentos de Word ou similares e o sistema operativo executará automaticamente Calibre para realizar a acción especificada.
pt_br: Você pode inserir estes links dentro de arquivos HTML ou documentos do Word ou similares e o sistema operacional irá automaticamente abrir o calibre para executar a ação especificada.
zh_cn: 您甚至可以将这些链接放在HTML文件或Word文档或类似文件中，操作系统将自动运行Calibre来执行指定的操作。

source: Switch to a specific library
gl: Cambiar a unha biblioteca específica
pt_br: Mudar para uma biblioteca específica
zh_cn: 切换到指定书库

source: The URL syntax is::
gl: A sintaxe da URL é::
pt_br: A sintaxe da URL é::
zh_cn: URL语法为：

source: Library names are the folder name of the library with spaces replaced by underscores. The special value ``_`` means the current library. You can also use :ref:`hex encoding <hex_encoding>` for the library names, useful if the library names have special characters that would otherwise require URL encoding. Hex encoded library names look like::
gl: Os nomes das bibliotecas son o nome do cartafol da biblioteca con espazos substituídos por guións baixos. O valor especial ``_`` indica a biblioteca actual. Tamén podes usar :ref:`codificación hexadecimal<hex_encoding>` para os nomes das bibliotecas, útil se os nomes das bibliotecas teñen caracteres especiais que doutro xeito requirirían codificación de URL. Os nomes das bibliotecas codificados en hexadecimal teñen o seguinte aspecto::
pt_br: Os nomes das bibliotecas são o nome da pasta da biblioteca com espaços substituídos por sublinhado. O valor especial "_" significa a biblioteca atual. Você também pode usar :ref:`hex encoding <hex_encoding>`para nomes das bibliotecas, útil se os nomes das bibliotecas possuem caracteres especiais que, de alguma forma, exigiria codificação de URL. Os nomes de biblioteca codificados em hexadecimal se parecem com::
zh_cn: 库名称是库的文件夹名称，用下划线替换空格。特定值``_``表示当前库。您还可以对库名使用`十六进制编码<hex_encoding>`，如果库名包含需要URL编码的特殊字符，这一点很有用。十六进制编码库名称如下：

source: Where the part after the ``_hex_-`` prefix is the library name encoded as UTF-8 and every byte represented by two hexadecimal characters.
gl: Onde a parte despois do prefixo ``_hex_-`` é o nome da biblioteca codificado como UTF-8 e cada byte representado por dous caracteres hexadecimais.
pt_br: Parte onde após o prefixo `` _hex_-`` é o nome da biblioteca codificado como UTF-8 e cada byte representado por dois caracteres hexadecimais.
zh_cn: 其中，``_hex_-``前缀后面的部分是以UTF-8编码的书库名，每个字节由两个十六进制字符表示。

source: Show a specific book in calibre
gl: Mostrar un libro específico en Calibre
pt_br: Mostrar um livro específico no calibre
zh_cn: 在 calibre中显示指定的图书

source: This will show the book with ``book_id`` (a number) in calibre. The ids for books can be seen in the calibre interface by hovering over the :guilabel:`Click to open` link in the :guilabel:`Book details` panel, it is the number in brackets at the end of the path to the book folder.
gl: Isto mostrará o libro con ``book_id`` (un número) en Calibre. Os ID dos libros pódense ver na interface de Calibre pasando o cursor por riba da ligazón :guilabel:`Click to open` no panel :guilabel:`Book details`; é o número entre parénteses ao final da ruta ao cartafol do libro.
pt_br: Isso mostrará o livro com ``book_id`` (um número) no calibre. Os ids para os livros podem ser vistos na interface do calibre ao passar o mouse sobre o link :guilabel:`Clique para abrir` no painel :guilabel:`Detalhes do livro`, é o número entre colchetes no final do caminho para a pasta do livro.
zh_cn: 这将在calibre中显示带有“book_id”（数字）的书籍。 通过将鼠标悬停在“图书详细信息”面板中的“单击打开”链接上，可以在 calibre 界面中看到图书的 ID，它是图书文件夹路径末尾括号中的数字。

source: You can copy a link to the current book displayed in calibre by right clicking the :guilabel:`Book details` panel and choosing :guilabel:`Copy link to book`.
gl: Podes copiar unha ligazón ao libro actual que se mostra en Calibre facendo clic co botón dereito no panel :guilabel:`Detalles do libro` e seleccionando :guilabel:`Copiar ligazón ao libro`.
pt_br: Você pode copiar um link para o livro atual exibido no calibre clicando com o botão direito no painel "Detalhes do livro" e escolhendo "Copiar link para o livro".
zh_cn: 您可以通过右键单击“图书详细信息”面板并选择“复制图书链接”来复制 calibre 中显示的当前图书的链接。

source: If a search is active and the book is not matched by the search then the search is cleared.
gl: Se hai unha busca activa e o libro non coincide coa busca, a busca bórrase.
pt_br: Se uma pesquisa estiver ativa e o livro não for correspondido pela pesquisa, então a pesquisa é limpa.
zh_cn: 如果搜索处于活动状态并且该书籍与搜索不匹配，则搜索将被清除。

source: If a Virtual library is selected, calibre will use it when showing the book. If the book isn't found in that virtual library then the virtual library is cleared.
gl: Se se selecciona unha biblioteca virtual, Calibre usaraa ao mostrar o libro. Se o libro non se atopa nesa biblioteca virtual, a biblioteca virtual límparase.
pt_br: Se uma biblioteca virtual for selecionada, o calibre a usará ao mostrar o livro. Se o livro não for encontrado nessa biblioteca virtual, a biblioteca virtual será limpa.
zh_cn: 如果选择虚拟书库，calibre 将在显示图书时使用它。 如果在该虚拟书库中找不到该书，则该虚拟书库将被清除。

source: If you want to switch to a particular Virtual library when showing the book, use::
gl: Se queres cambiar a unha biblioteca virtual en particular ao mostrar o libro, usa::
pt_br: Se você quiser alternar para uma biblioteca virtual específica ao mostrar o livro, use::
zh_cn: 如果您想在展示图书时切换到特定的虚拟书库，请使用：

source: replacing spaces in the Virtual library name by ``%20``. If the book isn't found in that virtual library then the virtual library is ignored.
gl: substituíndo os espazos no nome da biblioteca virtual por "%20". Se o libro non se atopa nesa biblioteca virtual, esta ignórase.
pt_br: substituindo espaços no nome da biblioteca virtual por ''%20''. Se o livro não for encontrado nessa biblioteca virtual, a biblioteca virtual será ignorada.
zh_cn: 将虚拟存储书库名称中的空格替换为``%20``。如果在该虚拟书库中找不到这本书，则忽略该虚拟书库。

source: Open a specific book in the E-book viewer at a specific position
gl: Abrir un libro específico no visor de libros electrónicos nunha posición específica
pt_br: Abra um livro específico no visualizador de e-books em uma posição específica
zh_cn: 在电子书阅读器中的特定位置打开特定图书

source: Here, ``book_format`` is the format of the book, for example, ``EPUB`` or ``MOBI`` and the ``location`` is an optional location inside the book. The easiest way to get these links is to open a book in the viewer, then in the viewer controls select :guilabel:`Go to->Location` and there such a link will be given that you can copy/paste elsewhere.
gl: Aquí, ``formato_libro`` é o formato do libro, por exemplo, ``EPUB`` ou ``MOBI`` e ``localización`` é unha localización opcional dentro do libro. A forma máis sinxela de obter estas ligazóns é abrir un libro no visor e, a continuación, nos controis do visor, seleccionar :guilabel:`Ir a->Localización` e alí darase unha ligazón que podes copiar/pegar noutro lugar.
pt_br: Aqui, `` book_format`` é o formato do livro, por exemplo, `ʻEPUB`` ou ``MOBI`` e ``location`` é um local opcional dentro do livro. A maneira mais fácil de obter esses links é abrir um livro no visualizador, em seguida, nos controles do visualizador, selecione :guilabel:`Go to->Location` e lá será fornecido um link que você poderá copiar/colar em outro lugar.
zh_cn: 其中，``book_Format``是图书的格式，例如，``EPUB`或``MOBI`，而``Location``是图书内部的可选位置。获取这些链接的最简单方法是在阅读器中打开一本书，然后在阅读器控件中选择`转到->位置`，此时会给出这样一个链接，您可以将其复制/粘贴到其他地方。

source: Searching for books
gl: Buscando libros
pt_br: Procurando por livros
zh_cn: 搜索书籍

source: Here query is any valid :ref:`search expression <search_interface>`. If the search expression is complicated, :ref:`encode it as a hex string <hex_encoding>` and use ``eq`` instead. Leaving out the query will cause the current search to be cleared.
gl: Aquí a consulta é calquera :ref:`expresión de busca <search_interface>` válida. Se a expresión de busca é complicada, :ref:`codícaa como unha cadea hexadecimal <hex_encoding>` e usa ``eq`` no seu lugar. Se se omite a consulta, a busca actual será borrada.
pt_br: Aqui a consulta e qualquer :ref:`search expresion<search_interface>` válida. Se a expressão de busca for complicada, :ref:èncode it as a hex string <hex_encoding>` e use ``eq`` em vez disso. Deixar de fora a consulta fará com que a pesquisa atual seja apagada.
zh_cn: 这里的查询是任何有效的"搜索表达式<search_interface>"。如果搜索表达式比较复杂，可以"将其编码为十六进制字符串<hex_encoding>"，并使用``eq``。省略该查询将导致清除当前搜索。

source: By default, if a Virtual library is selected, calibre will clear it before doing the search to ensure all books are found. If you want to preserve the Virtual library, use::
gl: Por defecto, se se selecciona unha biblioteca virtual, Calibre borraraa antes de realizar a busca para garantir que se atopen todos os libros. Se queres conservar a biblioteca virtual, usa::
pt_br: Por padrão, se uma biblioteca virtual for selecionada, o calibre irá limpá-la antes de fazer a pesquisa para garantir que todos os livros sejam encontrados. Se você deseja preservar a biblioteca virtual, use::
zh_cn: 默认情况下，如果选择了虚拟书库，Calibre将在执行搜索之前清除该选项，以确保找到所有图书。如果要保留虚拟书库，请使用：

source: If you want to switch to a particular Virtual library, use::
gl: Se queres cambiar a unha biblioteca virtual en particular, usa::
pt_br: Se você quiser alternar para uma biblioteca virtual específica, use::
zh_cn: 如果要切换到特定的虚拟书库，请使用：

source: replacing spaces in the Virtual library name by ``%20``.
gl: substituíndo os espazos no nome da biblioteca virtual por ``%20``.
pt_br: substituindo espaços no nome da biblioteca virtual por ``%20``.
zh_cn: 将虚拟书库名称中的空格替换为``%20``。

source: If you perform a search in calibre and want to generate a link for it you can do so by right clicking the search bar and choosing :guilabel:`Copy search as URL`.
gl: Se realizas unha busca en Calibre e queres xerar unha ligazón para ela, podes facelo premendo co botón dereito na barra de busca e seleccionando :guilabel:`Copiar busca como URL`.
pt_br: Se você realizar uma busca no calibre e quiser gerar um link para ela, você pode fazer isso clicando com o botão direito na barra de pesquisa e escolhendo "Copiar busca como URL".
zh_cn: 如果您在Calibre中执行搜索，并想为其生成链接，可以通过右键单击搜索栏并选择“将搜索复制为URL”来实现。

source: Open a book details window on a book in some library
gl: Abrir unha xanela de detalles dun libro nalgunha biblioteca
pt_br: Abra uma janela de detalhes do livro em um livro em alguma biblioteca
zh_cn: 在某些书库的图书上打开图书详细信息窗口

source: This opens a book details window on the specified book from the specified library without changing the current library or the selected book.
gl: Isto abre unha xanela de detalles do libro especificado da biblioteca especificada sen modificar a biblioteca actual nin o libro seleccionado.
pt_br: Isso abre uma janela de detalhes do livro no livro especificado da biblioteca especificada sem alterar a biblioteca atual ou o livro selecionado.
zh_cn: 这将打开指定书库中指定图书的书籍详细信息窗口，而不更改当前书库或所选图书。

source: Open the notes associated with an author/series/etc.
gl: Abrir as notas asociadas a un autor/serie/etc.
pt_br: Abra as notas associadas a um autor/seri/etc.
zh_cn: 打开与作者/系列等相关的备注。

source: This opens a window showing the notes of the specified item. The easiest way to create such URLs is to show the notes you want in calibre and click the :guilabel:`Copy URL` button to copy the URL to the clipboard and paste it wherever you need.
gl: Isto abre unha xanela que mostra as notas do elemento especificado. A maneira máis sinxela de crear estes URL é mostrar as notas que queres en Calibre e premer o botón `Copiar URL` para copiar o URL ao portapapeis e pegalo onde precises.
pt_br: Isso abre uma janela mostrando as notas do item especificado. A maneira mais fácil de criar URLs desse tipo é mostrar as notas desejadas no calibre e clicar no botão :guilabel:`Copy URL` para copiar a URL para a área de transferência e colá-la onde você precisar.
zh_cn: 这将打开一个窗口，显示指定项目的注释。 创建此类 URL 的最简单方法是在 calibre 中显示您想要的注释，然后单击“复制 URL”按钮将 URL 复制到剪贴板并将其粘贴到您需要的任何位置。

source: Here ``Field_Name`` is the name of the columns such as ``authors`` or ``tags``. For user created columns, replace the leading ``#`` in the field name with an underscore, so ``#mytags`` becomes ``_mytags``.
gl: Aquí ``Nome_do_campo`` é o nome das columnas, como ``autores`` ou ``etiquetas``. Para as columnas creadas polo usuario, substitúese o ``#`` inicial do nome do campo por un guión baixo, de xeito que ``#as_meas_etiquetas`` se converta en ``_as_meas_etiquetas``.
pt_br: Aqui ``Field_Name`` é o nome das colunas, como ``authors`` ou ``tags``. Para colunas criadas pelo usuário, substitua o ``#`` inicial no nome do campo por um sublinhado, então ``#mytags`` se torna ``_mytags``.
zh_cn: 这里的“Field_Name”是列的名称，例如“authors”或“tags”。 对于用户创建的列，将字段名称中的前导“#”替换为下划线，因此“#mytags”变为“_mytags”。

source: In addition to specifying items by id using ``Item_Id`` you can also specify them by name using either ``val_Item_Name`` or ``hex_Hex_Encoded_Item_Name``. For example::
gl: Ademais de especificar elementos por id usando ``Item_Id``, tamén podes especificalos por nome usando ``val_Item_Name`` ou ``hex_Hex_Encoded_Item_Name``. Por exemplo::
pt_br: Além de especificar itens por id usando ``Item_Id``, você também pode especificá-los por nome usando ``val_Item_Name`` ou ``hex_Hex_Encoded_Item_Name``. Por exemplo:
zh_cn: 除了使用“Item_Id”通过 id 指定项目之外，您还可以使用“val_Item_Name”或“hex_Hex_Encoded_Item_Name”通过名称指定它们。 例如：

source: Hex encoding of URL parameters
gl: Codificación hexadecimal de parámetros de URL
pt_br: Codificação Hex dos parâmetros da URL
zh_cn: URL参数的十六进制编码

source: Hex encoding of URL parameters is done by first encoding the parameter as UTF-8 bytes, and then replacing each byte by two hexadecimal characters representing the byte. For example, the string ``abc`` is the bytes ``0x61 0x62 and 0x63`` in UTF-8, so the encoded version is the string: ``616263``.
gl: A codificación hexadecimal dos parámetros de URL faise codificando primeiro o parámetro como bytes UTF-8 e, a continuación, substituíndo cada byte por dous caracteres hexadecimais que representan o byte. Por exemplo, a cadea ``abc`` son os bytes ``0x61 0x62 e 0x63`` en UTF-8, polo que a versión codificada é a cadea: ``616263``.
pt_br: A codificação hex dos parâmetros da URL é feita, primeiro codificando os parâmetros como bytes UTF-8, e então substituindo cada byte por dois caracteres hexadecimais representando cada byte. Por exemplo: a string ``abc`` é os bytes ``0x61 0x62 e 0x63`` em UTF-8, assim a versão codificada é a string: ``616263``.
zh_cn: URL 参数的十六进制编码是通过首先将参数编码为 UTF-8 字节，然后将每个字节替换为表示该字节的两个十六进制字符来完成的。 例如，字符串“abc”是UTF-8中的字节“0x61 0x62和0x63”，因此编码版本是字符串：“616263”。
