Repository: debian-calibre/calibre
Catalog: translations/manual/*/viewer.po
Languages: el, ms, pl, pt_br, tr, vi

source: You can "turn pages" in a book by using the :guilabel:`Page Next` and :guilabel:`Page Previous` buttons |pni|, or by pressing the Page Down/Page Up keys. Unlike most ebook viewers, calibre does not force you to view books in paged mode. You can scroll by amounts less than a page by using the scroll bar or various customizable keyboard shortcuts.
pl: Możesz "odwracać strony" książki klikając przyciski :guilabel:`Następna strona` i :guilabel:`Poprzednia strona` |pni| albo przyciskając klawisze Page Up i Page Down. W odróżnieniu od innych czytników calibre nie wymusza wyświetlania książki strona po stronie. Możesz przewijać tekst po kawałku, kręcąc kółkiem myszy lub za pomocą innych klawiszy, które sam możesz skonfigurować.
pt_br: Você pode "virar as páginas" em um livro usando os botões :guilabel:`Page Next` e :guilabel:`Page Previous` |pni|, ou pressionando as teclas Page Down / Page Up. Diferentemente da maioria dos visualizadores de ebook, calibre não força você a visualizar livros no modo paginado. Você pode rolar pelas páginas usando a barra de rolagem ou vários atalhos de teclado customizáveis.
tr: Bir e-kitap içinde :guilabel:`Sonraki Sayfa` ve :guilabel:`Önceki Sayfa` düğmelerini |pni| kullanarak veya Page Down/Page Up tuşlarıyla "sayfaları çevirebilirsiniz". Diğer e-kitap okuyuculardan farklı olarak calibre sizi kitapları sayfalı kipte görüntülemeye zorlamaz. kaydırma çubuğunu ve özelleştirilebilir klavye kısayollarını kullanarak bir sayfadan daha az kaydırma da yapabilirsiniz.
vi: Bạn có thể lật trang bằng hai nút :guilabel:`Trang sau` và :guilabel:`Trang trước` |pni| thông qua việc nhấn hai phím Page Down/Page Up. Không như các trình xem ebook khác, calibre không buộc bạn xem sách theo trang. Bạn có thể cuộn từng đoạn văn nhỏ một bằng cách dùng thanh cuộn hoặc các phím tắt có thể tùy biến khác,

source: When you are in the middle of a book and close the viewer, it will remember where you stopped reading and return there the next time you open the book. You can also set bookmarks in the book by using the Bookmark button |bookmi|. When viewing EPUB format books, these bookmarks are actually saved in the EPUB file itself. You can add bookmarks, then send the file to a friend. When they open the file, they will be able to see your bookmarks.
pl: Jeśli zamkniesz czytnik w czasie czytania, zapamięta on miejsce, w którym przerwałeś i powróci do niego, kiedy otworzysz go następnym razem. Możesz również ustawić zakładki w książce, używając przycisku Zakładka |bookmi|. W książkach w formacie EPUB zakładki są zapamiętywane w pliku książki. Możesz zaznaczyć interesujące miejsca, a potem wysłać książkę znajomemu. Będzie on mógł skorzystać z twoich zakładek.
pt_br: Quando você estiver no meio de um livro e fechar o visualizador, ele vai lembrar onde você parou de ler e voltar para lá da próxima vez que abrir o livro. Você também pode definir marcadores no livro usando o botão Bookmark |bookmi|. Ao visualizar livros no formato ePub, esses marcadores são salvos no próprio arquivo EPUB. Você pode adicionar marcadores, em seguida, enviar o arquivo para um amigo. Quando abrir o arquivo, eles serão capazes de ver suas marcações.
tr: Bir kitabın ortasında iken görüntüleyiciyi kapatırsanız onu tekrar açtığınızda kaldığınız yer hatırlanacak ve oradan açılacaktır. Ayrıca isterseniz Yer İmi düğmesini |bookmi| kullanarak kitaplara yer imleri de ekleyebilirsiniz. EPUB biçimindeki kitapları görüntülüyorsanız yer imleri EPUB dosyasının kendisinde kaydedilir. Yer imleri kaydedebilir ve bu halini arkadaşlarınıza gönderebilirsiniz. Dosyayı açtıklarında sizin yer imlerinizi görebileceklerdir.
vi: Khi bạn đã đọc một nửa một cuốn sách và đóng calibre, nó sẽ nhớ lại vị trí mà bạn ngừng đọc và sẽ trở lại đúng vị trí đó khi bạn mở lại quyển sách ra. Bạn cũng có thể đánh dấu sách thông qua nút Bookmark |bookmi|. Khi bạn xem một file sách định dạng EPUB, những dấu sách này được lưu trong chính các file đó. Bạn có thể thêm các dấu sách rồi gửi cuốn sách đó cho bạn bè. Khi họ mở sách của bạn, họ sẽ thấy được những dấu sách mà bạn đã thêm vào.

source: If the book you are reading defines a Table of Contents, you can access it by pressing the Table of Contents button |toci|. This will bring up a list of sections in the book. You can click on any of them to jump to that portion of the book.
pl: Jeśli w książce, którą czytasz umieszczono spis treści, możesz z niego skorzystać, klikając przycisk Spis treści |toci|. Zostanie wyświetlony spis treści książki. Klikając pozycje spisu treści możesz przeskoczyć do odpowiedniego rozdziału.
pt_br: Se o livro que você está lendo possui um índice de conteúdo, você pode acessá-lo pressionando o botão Tabela de Conteúdos |toci|. Isto trará uma lista das seções no livro. Você pode clicar em qualquer um deles para ir para essa parte do livro.
tr: Eğer okuduğunuz kitapta İçindekiler bölümü varsa ona İçindekiler |toci| düğmesini kullanarak erişebilirsiniz. Bu kitabın bölümlerinin bir listesini getirecektir. Bunlardan birine tıklayarak kitabın ilgili bölümüne sıçrayabilirsiniz.
vi: Nếu file sách bạn đang đọc có Mục lục thì bạn có thể nhấn nút Mục lục |toci| để xem danh sách các phần của cuốn sách đó. Bạn có thể nhấn vào bất kỳ phần nào để di chuyển nhanh đến phần đó.

source: Ebooks, unlike paper books, have no concept of pages. Instead, as you read through the book, you will notice that your position in the book is displayed in the upper left corner in a box like this |navposi|. This is both your current position and the total length of the book. These numbers are independent of the screen size and font size you are viewing the book at, and they play a similar role to page numbers in paper books. You can enter any number you like to go to the corresponding location in the book.
pl: Ebooki, w przeciwieństwie do papierowych książek, nie mają stron. Zamiast tego, w miarę czytania, zauważysz oznaczone w lewym górnym rogu miejsce w którym czytasz - o, tak: |navposi|. To jednocześnie pozycja w książce i całkowita długość tekstu. Wartości te są niezależne od wielkości ekranu i czcionki i odgrywają podobną rolę, co strony w książce. Dzięki temu można przejść do określonego miejsca w książce.
pt_br: Ebooks, ao contrário dos livros de papel, não têm o conceito de páginas. Em vez disso, enquanto você lê o livro, você vai notar que a sua posição no livro é exibido no canto superior esquerdo em uma caixa como este |navposi|. Isto é tanto a sua posição atual como o tamanho total do livro. Estes números são independentes do tamanho da tela e tamanho da fonte que você está vendo o livro, e eles desempenham um papel semelhante ao números de página nos livros de papel. Você pode inserir qualquer número que você preferir e ir para o local correspondente no livro.
tr: E-kitaplar basılı kitaplardan farklı olarak sayfa kavramına sahip değildir. Bunun yerine kitabı okumaya devam ettiğinizde konumunuzun kitabın sol üst köşesinde böyle |navposi| görüntülendiğini görürsünüz. Bu hem mevcut konumunuzu hem de kitabın toplam boyutunu gösterir. Bu sayılar ekran ve yazıtipi boyutundan bağımsızdır ve basılı kitaplardaki sayfa numaralarına benzer bir rol üstlenirler. Buraya herhangi bir sayı girebilir ve kitapta ona karşılık gelen konuma gidebilirsiniz.
vi: Ebook khác với sách thường ở chỗ chúng không có khái niệm trang. Thay vào đó, bạn sẽ thấy tiến độ đọc của mình thông qua một hộp nhỏ ở góc phía trên bên trái như thế này |navposi|. Trong hộp này bạn sẽ thấy trang bạn đang đọc và tổng chiều dài của quyển sách. Những con số này độc lập với kích cỡ màn hình và cỡ font bạn đang sử dụng - chúng cũng có vai trò giống như số trang trong các quyển sách ngoài đời thực. Bạn có thể nhập số trang bất kì bạn muốn đi tới trong quyển sách

source: calibre also has a very handy reference mode. You can turn it on by clicking the Reference Mode button |refmi|. Once you do this, every time you move your mouse over a paragraph, calibre will display a unique number made up of the section and paragraph numbers.
pl: calibre ma również bardzo wygodny tryb odwołań. Włącza się go, klikając przycisk Tryb odwołań |refmi|. Kiedy to zrobisz, za każdym razem, kiedy umieścisz wskaźnik myszy nad akapitem calibre wyświetli unikatową liczbę, utworzoną z numeru sekcji i akapitu.
pt_br: calibre também tem um modo de referência muito útil. Você pode ativá-lo clicando no botão Modo de Referência |refmi|. Uma vez que você fizer isso, cada vez que você passar o mouse sobre um parágrafo, calibre irá exibir um número único composto pelos números de seção e parágrafo.
tr: Calibre çok bir referans kipine de sahiptir. Etkinleştirmek için Referans Kipi |refmi| düğmesine tıklayabilirsiniz. Bunu bir kere yaptıktan sonra farenizi bir paragrafın üzerine her getirişinizde calibre o bölümü ve paragrafı belirten benzersiz bir numara görüntüleyecektir.
vi: calibre cũng có một chế độ tạo tài liệu tham khảo rất hữu dụng. Bạn có thể bật chức năng này bằng cách ấn nút Tạo tài liệu tham khảo |refmi|. Một khi bạn bật chức năng này lên thì calibre sẽ hiện lên một tổ hợp số bao gồm số phần và số đoạn văn.

source: If you click on links inside the ebook to take you to different parts of the book, such as an endnote, you can use the back and forward buttons in the top left corner to return to where you were. These buttons behave just like those in a web browser.
pl: Po kliknięciu odsyłacza który przenosi cię w inne miejsce książki, na przykład do przypisu, możesz użyć przycisków do tyłu i do przodu w lewym górnym rogu by powrócić do miejsca, w którym czytasz. Przyciski te działają dokładnie tak jak odpowiadające im przyciski w przeglądarce internetowej.
pt_br: Se você clicar em links dentro do ebook para levá-lo para diferentes partes do livro, como uma nota de rodapé, você pode usar o botões voltar e avançar no canto superior esquerdo para voltar para onde você estava. Estes botões se comportam exatamente como aqueles em um navegador web.
tr: E-kitabın içinde dipnot gibi alanlardaki bağlantılara tıklayarak kitabın farklı bölümlerine giderseniz sol köşedeki geri ve ileri tuşlarını kullanarak eskiden bulunduğunuz yere gidebilirsiniz. Bu düğmeler web tarayıcısında olduğu gibi davranırlar.
vi: Nếu bạn nhấn vào các đường dẫn trỏ đến các phần khác của ebook, ví dụ như chú thích cuối, bạn có thể nhấn nút quay lại và tiến ở góc phía trên bên trái để trở lại vị trí cũ của bạn. Các nút này giống y hệt các nút trên trình duyệt web của bạn.

source: More advanced customization can be achieved by the User Stylesheet setting. This is a stylesheet you can set that will be applied to every book. Using it you can do things like have white text on a black background, change paragraph styles, text justification, etc. For examples of custom stylesheets used by calibre's users, see `the forums <http://www.mobileread.com/forums/showthread.php?t=51500>`_.
pl: Dokładniejsza konfiguracja jest możliwa dzięki
pt_br: Personalizações mais avançadas podem ser definidas pela Folha de Estilo de Usuário. Isto é uma folha de estilo que você pode definir e que será aplicada a cada livro. Através dela você pode fazer coisas como ter um texto branco sobre um fundo preto, mudar estilos de parágrafo, justificar o texto, etc. Para exemplos de folhas de estilo personalizadas usadas por usuários do calibre, veja `the forums <http://www.mobileread.com/forums/showthread.php?t=51500>`_.
tr: Daha gelişmiş özelleştirmeler Kullanıcı Stil Sayfası ayarlarından yapılabilir. Bunlar her kitaba uygulanacak değişikliklerdir. Bunları kullanarak siyah arkaplan üzerine beyaz yazı, paragraf stilini değiştirmek veya metin hizalaması gibi şeyleri değiştirebilirsiniz. calibre kullanıcılarının özelleştirmelerini `forum sayfasından <http://www.mobileread.com/forums/showthread.php?t=51500>`_ görebilirsiniz.
vi: Bạn có thể tùy biến một cách tinh vi hơn với tính năng User Stylesheet. Stylesheet này có thể được áp dụng cho tất cả các ebook của bạn. VD, bạn có thể cho chữ trắng trên nền đen, thay đổi định dạng đoạn văn hoặc căn chỉnh văn bản. Bạn có thể truy cập các trang web sau để tải về các stylesheet được tạo bởi người dùng calbre: <http://www.mobileread.com/forums/showthread.php?t=51500>`_.
