Repository: debian-calibre/calibre
Catalog: translations/manual/*/viewer.po
Languages: el, ms, pl, pt_br, tr, vi

source: The E-book viewer
el: Ο προβολέας ψηφιακών βιβλίων
ms: Pelihat E-buku

source: calibre includes a built-in E-book viewer that can view all the major e-book formats. The E-book viewer is highly customizable and has many advanced features.
el: Το calibre συμπεριλαμβάνει ένα ενσωματωμένο προβολέα ψηφιακών βιβλίων που μπορεί να δείξει όλες τις κύριες μορφές ψηφιακών βιβλίων. Ο προβολέας ψηφιακών βιβλίων είναι εξόχως προσαρμόσιμος και διαθέτει πολλά προχωρημένα χαρακτηριστικά.
ms: calibre menyertakan pelihat e-buku terbina-dalam yang dapat melihat semua format e-buku utama. Pelihat E-buku ini boleh diubahsuai dan mempunyai banyak fitur lanjutan.

source: Starting the E-book viewer
el: Εκκίνηση του προβολέα ψηφιακών βιβλίων
ms: Memulakan pelihat E-buku

source: You can view any of the books in your calibre library by selecting the book and pressing the :guilabel:`View` button. This will open up the book in the E-book viewer. You can also launch the E-book viewer by itself from the Start menu in Windows or using the command :command:`ebook-viewer` in Linux and macOS (you have to install the command line tools on macOS first by going to :guilabel:`Preferences->Advanced->Miscellaneous`).
el: Μπορείτε να δείτε οποιοδήποτε από τα βιβλία της βιβλιοθήκης calibre σας, επιλέγοντας το βιβλίο και πατώντας το κουμπί :guilabel:`Προβολή`. Αυτό θα ανοίξει το βιβλίο στον προβολέα ψηφιακών βιβλίων. Μπορείτε επίσης να εκκινήσετε τον προβολέα ψηφιακών βιβλίων ξεχωριστά από το μενού Εκκίνησης στα Windows ή χρησιμοποιώντας την εντολή :command:`ebook-viewer` σε Linux και macOS (πρέπει πρώτα να εγκαταστήσετε τα εργαλεία γραμμής εντολής στο macOS πηγαίνοντας στο :guilabel:`Επιλογές->Για προχωρημένους->Διάφορα`).
ms: Anda boleh lihat mana-mana buku di dalam pustaka calibre anda dengan memilih buku dan menekan butang :guilabel:`Lihat`. Ia akan membuka buku di dalam pelihat E-buku. Anda juga boleh lancarkan pelihat E-buku melalui Menu Mula di dalam Windows atau menggunakan perintah :command:`ebook-viewer` dalam Linux dan OS X (anda perlu memasang alat baris perintah di dalam OS X terlebih dahulu menerusi :guilabel:`Keutamaan->Lanjutan->Pelbagai`).

source: Navigating around an e-book
el: Πλοήγηση σε ένα ψηφιακό βιβλίο
ms: Menavigasi e-buku

source: You can "turn pages" in a book by using the :guilabel:`Page previous` |prev| and :guilabel:`Page next` |next| buttons, or by pressing the :guilabel:`Page down`/:guilabel:`Page up` keys. Unlike most e-book viewers, calibre does not force you to view books in paged mode. You can switch to flow mode by clicking on the scroll mode button |scroll| at the top right. You can then scroll by amounts less than a page by using the scroll bar or various customizable keyboard shortcuts.
el: Μπορείτε να "γυρίσετε σελίδες" σε ένα βιβλίο χρησιμοποιώντας τα κουμπιά :guilabel:`Προηγούμενη σελίδα` |prev| και :guilabel:`Επόμενη σελίδα` |next|, ή πατώντας τα πλήκτρα :guilabel:`Page down`/:guilabel:`Page up`. Σε αντίθεση με τους περισσότερους αναγνώστες ψηφιακών βιβλίων, το calibre δεν σας εξαναγκάζει να κοιτάτε τα βιβλία σε προβολή σελίδας. Μπορείτε να γυρίσετε σε ελεύθερη προβολή πατώντας το κουμπί κύλισης |scroll| πάνω δεξιά. Στη συνέχεια, θα μπορείτε να μετακινείτε το κείμενο σε υποδιαιρέσεις της σελίδας, με χρήση της μπάρας κύλισης ή διάφορων άλλων ρυθμιζόμενων συντομεύσεων πληκτρολογίου.
ms: Anda boleh "kalih halaman" buku dengan menggunakan butang |pni| :guilabel:`Halaman Berikutnya` dan :guilabel:`Halaman Terdahulu` , atau dengan menekan kekunci :guilabel:`Page down`/:guilabel:`Page up`. Tidak seperti kebanyakan pelihat e-buku, calibre tidak memaksa anda membaca buku dalam mod berhalaman. Anda boleh tukar ke mod aliran dengan mengklik pada butang mod tatal |scroll| di bahagian atas-kanan. Anda juga boleh tatal amaun teks kurang dari satu halaman dengan menggunakan palang tatal atau pintasan papan kekunci boleh suai.

source: Bookmarks
el: Σελιδοδείκτες
ms: Tanda buku
pl: Zakładki
pt_br: Marcadores
tr: Yer İmleri
vi: Đánh dấu

source: When you are in the middle of a book and close the viewer, it will remember where you stopped reading and return there the next time you open the book. You can also set bookmarks in the book by using the :guilabel:`Bookmark` button |bookmi|. When viewing EPUB format books, these bookmarks are actually saved in the EPUB file itself. You can add bookmarks, then send the file to a friend. When they open the file, they will be able to see your bookmarks.
el: Όταν είστε στη μέση ενός βιβλίου και κλείσετε τον προβολέα, αυτός θα θυμάται που σταματήσατε το διάβασμα και θα επιστρέψει εκεί την επόμενη φορά που θα ανοίξετε το βιβλίο. Μπορείτε επίσης να ορίσετε σελιδοδείκτες στο βιβλίο χρησιμοποιώντας το κουμπί :guilabel:`Σελιδοδείκτης` |bookmi|. Όταν βλέπετε βιβλία μορφής EPUB, οι σελιδοδείκτες αυτοί στην πραγματικότητα αποθηκεύονται στο ίδιο το αρχείο EPUB. Μπορείτε να προσθέσετε σελιδοδείκτες και μετά να στείλετε το αρχείο σε ένα φίλο σας. Όταν ανοίξουν το αρχείο θα είναι σε θέση να δουν τους σελιδοδείκτες σας.
ms: Bila anda sedang membaca buku dan kemudian anda tutup pelihat tersebut, ia akan mengingati tempat terakhir anda berhenti membaca serta kembali ke tempat tersebut bila anda membuka buku tersebut. Anda juga boleh tetapkan tanda buku dalam buku dengan menggunakan butang :guilabel:`Tanda Buku` |bookmi|. Bila membaca buku berformat EPUB, tanda buku yang sebenar disimpan dalam fail EPUB tersebut. Anda boleh menambah tanda buku, kemudian hantar fail itu kepada rakan anda. Bila mereka membuka fail tersebut, mereka dapat melihat tanda buku anda.

source: Table of Contents
el: Πίνακας Περιεχομένων
ms: Senarai Kandungan
pl: Spis treści
pt_br: Índice
tr: İçindekiler
vi: Mục lục

source: If the book you are reading defines a Table of Contents, you can access it by pressing the :guilabel:`Table of Contents` button |toci|. This will bring up a list of sections in the book. You can click on any of them to jump to that portion of the book.
el: Αν το βιβλίο που διαβάζετε ορίζει Πίνακα Περιεχομένων, μπορείτε να πάτε σε αυτόν πατώντας το κουμπί :guilabel:`Πίνακας Περιεχομένων` |toci| . Αυτό θα παρουσιάσει ένα κατάλογο με τις ενότητες του βιβλίου. Μπορείτε να επιλέξετε οποιαδήποτε εγγραφή για να μεταφερθείτε στην αντίστοιχη ενότητα του βιβλίου.
ms: Jika buku yang anda baca mempunyai Senarai Kandungan, anda boleh capai ia dengan menekan butang :guilabel:`Senarai Kandungan` |toci|. Ia akan menyenaraikan seksyen di dalam buku. Anda boleh klik mana-mana seksyen tersebut untuk melompat ke bahagian buku yang dikehendaki.

source: Navigating by location
el: Πλοήγηση με βάση τη θέση
ms: Navigasi mengikut lokasi
pl: Używanie lokacji
pt_br: Navegando por localização
tr: Konuma göre gezinme
vi: Điều hướng bằng vị trí

source: E-books, unlike paper books, have no concept of pages. Instead, as you read through the book, you will notice that your position in the book is displayed in the upper left corner in a box like this |navposi|. This is both your current position and the total length of the book. These numbers are independent of the screen size and font size you are viewing the book at, and they play a similar role to page numbers in paper books. You can enter any number you like to go to the corresponding location in the book.
el: Τα ψηφιακά βιβλία, σε αντίθεση με τα βιβλία από χαρτί, δεν διαθέτουν την έννοια της σελίδας. Παρ' όλα αυτά, καθώς διαβάζετε ένα ψηφιακό βιβλίο, θα παρατηρήσετε ότι η θέση σας στο βιβλίο εμφανίζεται στην άνω αριστερή γωνία, σε ένα κουτί όπως αυτό |navposi|. Αυτό δίνει την τρέχουσα θέση σας στο βιβλίο, όσο και το συνολικό μέγεθος του βιβλίου. Οι αριθμοί αυτοί είναι ανεξάρτητοι από το μέγεθος της οθόνης σας ή το μέγεθος της γραμματοσειράς με την οποία διαβάζετε το βιβλίο, και παίζουν παρόμοιο ρόλο με τους αριθμούς σελίδας στα βιβλία από χαρτί. Μπορείτε να εισάγετε οποιοδήποτε αριθμό θέλετε για να μεταβείτε στην αντίστοιχη θέση στο βιβλίο.
ms: E-buku, tidak seperti buku sebenar, ia tiada konsep halaman. Bila anda membaca buku , anda dapati kedudukan bacaan anda dipapar bahagian kiri atas seperti ini |navposi|. Ia merupakan kedudukan semasa dan panjang bacaan anda. Nombor ini tidak dipengaruhi oleh saiz skrin dan saiz fon buku, dan ia berperanan sebagai nombor halaman dalam buku kertas sebenar. Anda boleh masukkan apa jua nombor muka surat untuk pergi ke lokasi kandungan buku tersebut.

source: calibre also has a very handy reference mode. You can turn it on by clicking the :guilabel:`Reference mode` button |refmi|. Once you do this, every time you move your mouse over a paragraph, calibre will display a unique number made up of the section and paragraph numbers.
el: Το calibre διαθέτει επίσης μια πολύ βολική κατάσταση αναφοράς. Μπορείτε να την ενεργοποιήσετε πατώντας το κουμπί :guilabel:`Κατάσταση αναφοράς` |refmi|. Μόλις το κάνετε, κάθε φορά που μετακινείτε το ποντίκι σας πάνω από μια παράγραφο, το calibre θα εμφανίζει ένα μοναδικό αριθμό ο οποίος παράγεται από τους αριθμούς ενότητας και παραγράφου.
ms: calibre juga mempunyai mod rujukan yang sangat mudah. Anda boleh hidupkannya dengan mengklik butang :guilabel:`Mod rujukan` |refmi|. Bila anda mengaktifkannya, setiap kali anda mengalih kursor tetikus di atas perenggan, calibre akan paparkan nombor unik seksyen dan juga nombor perenggannya.

source: You can use this number to unambiguously refer to parts of the books when discussing it with friends or referring to it in other works. You can enter these numbers in the box marked Go to at the top of the window to go to a particular reference location.
el: Μπορείτε να χρησιμοποιήσετε τον αριθμό αυτό για να αναφερθείτε χωρίς καμιά αμφιβολία σε τμήματα του βιβλίου κατά τις συζητήσεις σας με φίλους, ή να αναφερθείτε σε αυτό σε άλλες εργασίες. Μπορείτε να εισάγετε τους αριθμούς αυτούς στο κουτί με την επισήμανση "Μετάβαση στην αναφορά υπ' αριθμόν..." στην κορυφή του παραθύρου για να μεταβείτε σε κάποια συγκεκριμένη θέση αναφοράς.
ms: Anda boleh guna nombor ini untuk rujuk secara jelas bahagian buku bila membincangkannya dengan rakan anda atau merujuk ia dengan lain-lain kerja. Anda boleh masukkan nombor ini dalam kotak yang bertanda Pergi ke di bahagian atas tetingkap untuk pergi ke rujukan tertentu.
pl: Liczby te są jednoznacznym odwołaniem do miejsc w książce i możesz ich użyć, dyskutując z przyjaciółmi o książce lub odwołując się do książki w innych pracach. Możesz równiez podać taką liczbę w polu oznaczonym Przejdź do..., na górze okna, by przejść do konkretnej części książki.
pt_br: Você pode usar este número para se referir de forma não equivocada a partes dos livros quando discuti-lo com os amigos ou se referindo a ele em outros trabalhos. Você pode inserir estes números na caixa marcada Ir para, na parte superior da janela para ir a um local de referência em particular.
tr: Bu numarayı arkadaşlarınızla üzerinde konuşurken veya başka işlerin içinde kaynak gösterirken kullanabilirsiniz. Bu numaraları sayfanın üzerinde bulunan Git alanına yazarak belirli bir kaynak alanına gidebilirsiniz.
vi: Bạn có thể sử dụng con số này để phần nào liên hệ nó với các phần của một cuốn sách thật khi bạn trao đổi với bạn bè hoặc nhắc đến nó trong các tác phẩm khác. Bạn có thể nhập những số này ở hộp đã đánh dấu. Trỏ chuột đến phía trên cùng của cửa sổ để đi đến vị trí đoạn tham khảo nhất định.

source: If you click on links inside the e-book to take you to different parts of the book, such as an endnote, you can use the :guilabel:`Back` and :guilabel:`Forward` buttons in the top left corner to return to where you were. These buttons behave just like those in a web browser.
el: Αν επιλέξετε συνδέσμους σε ένα ψηφιακό βιβλίο για να μεταβείτε σε διαφορετικά τμήματα του βιβλίου, όπως πχ σε μια σημείωση τέλους, μπορείτε να χρησιμοποιήσετε τα κουμπιά :guilabel:`Πίσω` και :guilabel:`Εμπρός` στην πάνω αριστερή γωνία για να επιστρέψετε στο σημείο που βρισκόσασταν. Τα κουμπιά αυτά συμπεριφέρονται ακριβώς όπως εκείνα ενός φυλλομετρητή.
ms: Jika anda klik pada pautan di dalam pautan e-buku yang menjurus ke bahagian tertentu buku, seperti nota akhir, anda juga boleh guna butang :guilabel:`Undur` dan :guilabel:`Maju` di bucu kanan atas untuk kembali ke lokasi terdahulu. Butang ini bertindak seperti dalam pelayar sesawang.

source: Customizing the look and feel of your reading experience
el: Εξατομίκευση των ρυθμίσεων όψης και αίσθησης για καλύτερη ανάγνωση
ms: Penyuaian penampilan bagi pembacaan anda
pl: Konfigurowanie wyglądu czytnika
pt_br: Personalizando a aparência e a sensação de sua experiência de leitura
tr: Okuma deneyiminizin görünümünü özelleştirmek
vi: Tùy biến trải nghiệm đọc sách của bạn

source: You can change font sizes on the fly by using the font size buttons |fontsizei|. You can also make the viewer full screen by pressing the Full Screen button |fsi|. By clicking the Preferences button |prefbi|, you can change the default fonts used by the viewer to ones you like as well as the default font size when the viewer starts up.
el: Μπορείτε να αλλάξετε μέγεθος γραμματοσειράς στη στιγμή, χρησιμοποιώντας τα κουμπιά μεγέθους γραμματοσειράς |fontsizei|. Μπορείτε επίσης να κάνετε τον προβολέα να επεκταθεί καταλαμβάνοντας όλη την οθόνη, πατώντας το κουμπί "Εναλλαγή σε πλήρη οθόνη" |fsi|. Πατώντας το κουμπί Προτιμήσεις |prefbi|, μπορείτε να αλλάξετε τις προεπιλεγμένες γραμματοσειρές που χρησιμοποιεί ο προβολέας σε όποιες σας αρέσουν, καθώς και το προεπιλεγμένο μέγεθος γραμματοσειράς κατά την εκκίνηση του προβολέα.
ms: Anda boleh terus mengubah saiz fon dengan menggunakan butang saiz fon |fontsizei|. Anda juga boleh menjadikan pelihat berskrin penuh dengan menekan butang Skrin Penuh |fsi|. Seterusnya dengan mengklik butang Keutamaan |prefbi|, anda boleh menukar fon lalai yang diguna oleh pelihat seperti saiz fon lalai ketika pelihat dimulakan.
pl: Możesz zmienić rozmiar czcionki w trakcie czytania, używając przycisków rozmiaru czcionki |fontsizei|. Możesz również przełączyć czytnik na tryb pełnoekranowy, klikając przycisk |fsi|. Klikając przycisk Ustawień |prefbi|, możesz zmienić domyślną czcionkę, używaną przez czytnik na twoją ulubioną, a także ustawić wielkość czcionki, która będzie użyta po uruchomieniu programu.
pt_br: Você pode alterar o tamanho das fontes em tempo real, usando os botões de tamanho de fonte |fontsizei|. Você também pode mudar o visor para tela cheia clicando no botão de tela cheia |fsi|. Ao clicar no botão Preferências |prefbi|, você pode alterar as fontes padrão usadas pelo visualizador para aqueles que você preferir, assim como o tamanho de fonte padrão quando o visualizador iniciar.
tr: Yazı tipi boyutlarını havada değiştirmek için yazı tipi boyutu |fontsizei| düğmesini kullanabilirsiniz. Tam ekran düğmesine |fsi| tıkladığınızda görüntüleyici tam ekran olacaktır. Tercihler düğmesine |prefbi| tıklayarak görüntüleyicinin varsayılan olarak kullandığı yazı tiplerini ve açılışta kullandıklarını istediğiniz bir tanesiyle değiştirebilirsiniz.
vi: Bạn có thể khiến font chữ to hơn hay nhỏ đi bằng cách sử dụng nút chỉnh font chữ |fontsizei|. Bạn cũng có thể xem sách toàn màn hình bằng cách nhấn vào nút Toàn Màn hình |fsil. Bằng cách ấn vào nút Tùy chọn |prefbil, bạn có thể chỉnh font hiển thị chính và cỡ font của calibre mỗi khi bạn bật nó lên

source: More advanced customization can be achieved by the :guilabel:`User stylesheet` setting. This is a stylesheet you can set that will be applied to every book. Using it you can do things like have white text on a black background, change paragraph styles, text justification, etc. For examples of custom stylesheets used by calibre's users, see `the forums <https://www.mobileread.com/forums/showthread.php?t=51500>`_.
el: Πιο προχωρημένες εξατομικεύσεις μπορούν να επιτευχθούν με τις ρυθμίσεις στο :guilabel:`Φύλλο στυλ χρήστη`. Αυτό είναι ένα φύλλο στυλ που μπορείτε να θέσετε ώστε να εφαρμόζεται σε κάθε βιβλίο. Χρησιμοποιώντας το, μπορείτε να κάνετε πράγματα σαν το να έχετε άσπρο κείμενο σε μαύρο φόντο, να αλλάξετε το στυλ των παραγράφων, την στοίχιση του κειμένου κτλ. Για παραδείγματα εξατομικευμένων φύλλων στυλ που χρησιμοποιούνται από χρήστες του calibre, δείτε `τα φόρα <https://www.mobileread.com/forums/showthread.php?t=51500>`_.
ms: Terdapat penyuaian lanjutan boleh dilakukan dengan tetapan :guilabel:`Lembaran gaya pengguna`. Lembaran gaya yang ditetapkan ini boleh dilaksana pada setiap buku. Penggunaannya membolehkan anda buat beberapa perkara seperti teks putih dalam latar belakang hitam, ubah gaya perenggan, wajaran teks, dan lain-lain. Contoh penggunaan lembaran gaya suai oleh pengguna, rujuk `forum <https://www.mobileread.com/forums/showthread.php?t=51500>`_.

source: Dictionary lookup
el: Αναζήτηση σε λεξικό
ms: Carian kamus
pl: Wyszukiwanie w słowniku
pt_br: Pesquisa no dicionário
tr: Sözlük araması
vi: Tra từ điển

source: You can look up the meaning of words in the current book by right clicking on a word. calibre uses the publicly available dictionary server at ``dict.org`` to look up words. The definition is displayed in a small box at the bottom of the screen.
el: Μπορείτε να βρείτε το νόημα των λέξεων στο τρέχον βιβλίο κάνοντας δεξί κλικ σε μια λέξη. Το calibre χρησιμοποιεί τον διαθέσιμο δημοσίως διακομιστή λεξικών στο ``dict.org`` για να αναζητήσει τις λέξεις. Ο ορισμός παρουσιάζεται σε ένα μικρό κουτί στο κάτω μέρος της οθόνης.
ms: Anda boleh mencari maksud perkataan di dalam buku dengan mengklik kanan pada perkataan tersebut. Calibre menggunakan pelayan kamus awam di ``dict.org`` untuk mencari maksud perkataan tersebut. Takrifannya dipapar dalam satu kotak kecil di bahagian bawah skrin.
pl: Możesz odszukać znaczenie słowa w bieżącej książce klikając słowo prawym przyciskiem. calibre używa do tłumaczenia ogólnodostępnego słownika ``dict.org``. Definicja jest wyświetlana w małym polu na dole ekranu.
pt_br: Você pode pesquisar o significado das palavras no livro atual clicando com o botão direito em uma palavra. calibre usa o dicionário público acessível no servidor `` dict.org`` para procurar palavras. A definição é apresentada numa pequena caixa na parte inferior da tela.
tr: Mevcut kitaptaki bir sözcüğün anlamına üzerine sağ tıklayarak bakabilirsiniz. calibre sözcük anlamları için kamuya açık bir sözlük sunucusu olan ``dict.org`` adresini kullanır. Sözcüğün tanımı ekranın altında küçük bir kutuda görüntülenecektir.
vi: Bạn có thể tra nghĩa của từ trong cuốn sách bạn đang đọc bằng cách kích chuột phải vào một từ. calibre sử dụng server từ điển công cộng dict.org để tra từ. Định nghĩa của từ sẽ được hiện trong một hộp nhỏ ở dưới cùng trong trình đọc calibre.

source: Copying text and images
el: Αντιγραφή κειμένου και εικόνων
ms: Penyalinan teks dan imej
pl: Kopiowanie tekstu i grafiki
pt_br: Copiando texto e imagens
tr: Metin ve görüntü kopyalamak
vi: Chép văn bản và hình ảnh

source: You can select text and images by dragging the content with your mouse and then right clicking to copy to the clipboard. The copied material can be pasted into another application as plain text and images.
el: Μπορείτε να επιλέξετε κείμενο και εικόνες σύροντας το περιεχόμενο με το ποντίκι σας, και μετά πατώντας το δεξί πλήκτρο του ποντικιού για να τα αντιγράψετε στο πρόχειρο. Το αντιγραμμένο υλικό μπορεί να επικολληθεί σε μια άλλη εφαρμογή ως απλό κείμενο και εικόνες.
ms: Anda boleh memilih teks dan imej dengan menyeret kandungan tersebut dengan tetikus dan kemudian klik kanan untuk salin ke papan keratan. Bahan yang telah disalin boleh ditampal dalam aplikasi lain sebagai teks dan imej.
pl: Możesz zaznaczyć tekst i obrazki zaznaczając prostokąt za pomocą myszy, a następnie kliknąć prawym przyciskiem by skopiować je do schowka. Skopiowane dane mogą zostać wklejone do innej aplikacji jako tekst i obrazki.
pt_br: Você pode selecionar texto e imagens, arrastando o conteúdo com o mouse e, em seguida, clicando com o botão direito para copiar para o clipboard. O material copiado pode ser colado em outro aplicativo como texto plano e imagens.
tr: Metin ve görüntüleri fareyi üzerlerinde sürükleyerek seçebilir ve sağ tıklayarak geçici taşıma panosuna kopyalayabilirsiniz. Kopyalanan nesneler başka bir uygulamaya düz metin veya görüntü olarak yapıştırılabilir.
vi: Bạn có thể chọn văn bản và hình ảnh bằng cách bôi đen nội dung ban cần chọn và ấn chuột phải để lưu vào clipboard. Nội dung này sau đó sẽ có thể được dán vào một ứng dụng khác dưới dạng văn bản đơn thuần và hình ảnh.

source: The Ebook Viewer
pl: Przeglądarka książek
pt_br: O visualizador de ebook
tr: E-kitap Görüntüleyici
vi: Công cụ xem Ebook

source: calibre includes a built-in ebook viewer that can view all the major ebook formats. The viewer is highly customizable and has many advanced features.
pl: calibre zawiera wbudowany czytnik, za pomocą którego można czytać książki we wszystkich głównych formatach. Ma on wiele zaawansowanych funkcji, pozwala też na szeroką konfigurację.
pt_br: O calibre inclui um visualizador de ebook que consegue ler todos os principais formatos de ebook. O visualizador é altamente customizável e possui muitas funções avançadas.
tr: calibre yaygın e-kitap biçimlerini destekleyen bir e-kitap görüntülecisini tümleşik olarak içerir. Görüntüleyici özelleştirilebilir ve pek çok gelişmiş özellik barındırır.
vi: calibre đi kèm một chương trình đọc sách điện tử có khả năng đọc được hầu hết các định dạng sách. Chương trình này có tính tùy biến cao và bao gồm nhiều tính năng nâng cao.

source: Starting the viewer
pl: Uruchamianie czytnika
pt_br: Iniciando o visualizador
tr: Görüntüleyiciyi başlatmak
vi: Đang khởi động công cụ xem sách

source: You can view any of the books in your calibre library by selecting the book and pressing the View button. This will open up the book in the ebook viewer. You can also launch the viewer by itself from the Start menu in Windows or using the command :command:`ebook-viewer` in Linux and OS X (you have to install the command line tools on OS X first by going to :guilabel:`Preferences->Advanced->Miscellaneous`).
pl: Można wyświetlić w czytniku dowolną książkę z biblioteki, zaznaczając ją i klikając przycisk Wyświetl. Spowodujet o otwarcie książki w czytniku. Można również otworzyć czytnik niezależnie, z menu Start w Windows, lub przy użyciu polecenia :command:`ebook-viewer` w Linuksie i OS X (w OS X musisz najpierw zainstalować narzędzia linii poleceń w :guilabel:`Ustawienia->Zaawansowane->Różne`).
pt_br: Você pode ver qualquer um dos livros em sua biblioteca calibre selecionando o livro e pressionando o botão View. Isto irá abrir o livro no visualizador de ebook. Você também pode iniciar o visualizador por si só a partir do menu Iniciar no Windows ou utilizando o comando :command:`ebook-viewer` no Linux e OS X (você tem que instalar as ferramentas de linha de comando no OS X primeiro, indo em :guilabel:`Preferences->Advanced->Miscellaneous`).
tr: Calibre kitaplığınızdaki herhangi bir e-kitabı seçtikten sonra Görüntüle düğmesine tıklayarak görüntülemeye başlayabilirsiniz. Bu kitabı e-kitap görüntüleyicide açacaktır. Görüntüleyiciyi Windows'ta Başlat menüsünden, Linux'ta ve OS X'te (bunun için komut satırı araçlarını :guilabel:`Tercihler->Gelişmiş->Çeşitli` yolunu takip ederek kurmuş olmanız gerekir) :command:`ebook-viewer`komutuyla da başlatabilirsiniz.
vi: Bạn có thể xem bất kỳ cuốn sách nào trong thư viện calibre của bạn bằng cách chọn sách và ấn nút Xem. Sách sẽ được mở trong công cụ xem sách. Bạn cũng có thể mở công cụ qua Start menu trong hệ điều hành Windows hoặc sử dụng lệnh :command:`ebook-viewer` trong hệ điều hành Linux and OS X (trong hệ điều hành OS X bạn phải cài đặt các công cụ đọc lệnh trước bằng cách đi tới :guilabel:`Preferences->Advanced->Miscellaneous`).

source: Navigating around an ebook
pl: Poruszanie się po książce
pt_br: Navegando em torno de um ebook
tr: Bir e-kitapta dolaşmak
vi: Điều hướng trong ebook
