Repository: debian-calibre/calibre
Catalog: translations/manual/*/virtual_libraries.po
Languages: pt_br, zh_cn

source: Virtual libraries
pt_br: Bibliotecas virtuais
zh_cn: 虚拟书库

source: In calibre, a Virtual library is a way to tell calibre to open only a subset of a normal library. For example, you might want to only work with books by a certain author, or books having only a certain tag. Using Virtual libraries is the preferred way of partitioning your large book collection into smaller sub collections. It is superior to splitting up your library into multiple smaller libraries as, when you want to search through your entire collection, you can simply go back to the full library. There is no way to search through multiple separate libraries simultaneously in calibre.
pt_br: No calibre, uma biblioteca Virtual é uma forma de fazer com que o calibre abra apenas um pequeno conjunto de uma biblioteca normal. Por exemplo, pode-se querer trabalhar apenas com livros de um certo autor, ou livros que tenham uma etiqueta. Usar bibliotecas Virtuais é a forma ideal de dividir sua coleção de livros em sub-coleções menores. É melhor do que dividir sua biblioteca em várias bibliotecas menores porque, quando se quiser pesquisar em toda a biblioteca, pode-se simplesmente voltar à visualização da biblioteca toda. Não há formas de pesquisar em várias bibliotecas separadas simultaneamente no calibre.
zh_cn: 在 calibre 中，虚拟书库是一种告诉 calibre 仅打开普通书库的子集的方法。 例如，您可能只想使用特定作者的书籍或仅具有特定标签的书籍。 使用虚拟书库是将大型图书收藏划分为较小的子收藏的首选方法。 它优于将您的图书馆分成多个较小的书库，因为当您想要搜索整个馆藏时，您可以简单地返回到整个书库。 无法在 calibre 中同时搜索多个单独的书库。

source: A Virtual library is different from a simple search. A search will only restrict the list of books shown in the book list. A Virtual library does that, and in addition it also restricts the entries shown in the :guilabel:`Tag browser` to the left. The Tag browser will only show tags, authors, series, publishers, etc. that come from the books in the Virtual library. A Virtual library thus behaves as though the actual library contains only the restricted set of books.
pt_br: Uma biblioteca Virtual é diferente de uma busca simples. Uma busca só irá restringir a lista de livros exibidos. Uma biblioteca Virtual faz isso e também ela restringe as entradas exibidas na etiqueta :guilabel:`Navegador de etiquetas` para a esquerda. O Navegador de etiquetas irá mostras apenas etiquetas, autores, séries, editoras, etc. que venham em livros na biblioteca Virtual. Uma biblioteca Virtual, assim, se comporta como se a biblioteca atual contivesse apenas um conjunto restrito de livros.
zh_cn: 虚拟书库不同于简单的搜索。 搜索只会限制图书列表中显示的图书列表。 虚拟书库可以做到这一点，此外它还限制左侧“标签浏览器”中显示的条目。 标签浏览器将仅显示来自虚拟书库中图书的标签、作者、系列、出版商等。 因此，虚拟书库的行为就像实际图书馆仅包含有限的书籍一样。

source: Creating Virtual libraries
pt_br: Criação de bibliotecas virtuais
zh_cn: 创建虚拟书库

source: |vlb| To use a Virtual library click the :guilabel:`Virtual library` button located to the left of the Search bar and select the :guilabel:`Create Virtual library` option. As a first example, let's create a Virtual library that shows us only the books by a particular author. Click the :guilabel:`Authors` link as shown in the image below and choose the author you want to use and click OK.
pt_br: |vlb| Para usar uma biblioteca Virtual clique no botão :guilabel:`Biblioteca Virtual` localizado à esquerda da Barra de Pesquisa e selecione a opção :guilabel:`Criar biblioteca Virtual`. Como primeiro exemplo, crie uma biblioteca Virtual que mostre apenas os livros de um autor específico. Clique no atalho :guilabel:`Autores` como mostrado na imagem abaixo e escolha o autor que deseja consultar e clique em OK.
zh_cn: |vlb| 要使用虚拟书库，请单击搜索栏左侧的“虚拟书库”按钮，然后选择“创建虚拟书库”选项。 作为第一个示例，让我们创建一个虚拟书库，该书库仅向我们显示特定作者的书籍。 单击下图所示的“作者”链接，选择您要使用的作者，然后单击“确定”。

source: The Create Virtual library dialog has been filled in for you. Click OK and you will see that a new Virtual library has been created, and automatically switched to, that displays only the books by the selected author. As far as calibre is concerned, it is as if your library contains only the books by the selected author.
pt_br: A janela Criar biblioteca Virtual foi preenchida para você. Clique em OK e você verá que uma nova biblioteca Virtual foi criada, e automaticamente tornada ativa, que exibe apenas os livros do autor selecionado. Para o calibre, é como se sua biblioteca contivesse apenas os livros do autor selecionado.
zh_cn: “创建虚拟书库”对话框已为您填写。 单击“确定”，您将看到一个新的虚拟书库已创建，并自动切换到仅显示所选作者的书籍。 就calibre而言，就好像您的书库仅包含所选作者的书籍一样。

source: You can switch back to the full library at any time by once again clicking the :guilabel:`Virtual library` and selecting the entry named :guilabel:`<None>`.
pt_br: Pode-se alternar para a biblioteca inteira a qualquer momento, novamente clicando em :guilabel:`Biblioteca Virtual` e selecionando a opção chamada :guilabel:`<None>`.
zh_cn: 您可以随时切换回完整的书库，方法是再次点击“虚拟书库”并选择名为“<None>”的条目。

source: Virtual libraries are based on *searches*. You can use any search as the basis of a Virtual library. The Virtual library will contain only the books matched by that search. First, type in the search you want to use in the Search bar or build a search using the :guilabel:`Tag browser`. When you are happy with the returned results, click the :guilabel:`Virtual library` button, choose :guilabel:`Create library` and enter a name for the new Virtual library. The Virtual library will then be created based on the search you just typed in. Searches are very powerful, for examples of the kinds of things you can do with them, see :ref:`search_interface`.
pt_br: Bibliotecas Virtuais são baseadas em *buscas*. Você pode usar qualquer busca como base para uma biblioteca Virtual. A biblioteca Virtual irá conter apenas os livros selecionados pela busca. Primeiro, digite o que você quer buscar na barra de Pesquisa ou crie uma busca usando a etiqueta :guilabel:`Navegador de Etiquetas`. Quando você estiver feliz com os resultados da busca, clique no botão :guilabel:`Biblioteca Virtual`, escolha :guilabel:`Criar biblioteca Virtual` e digite um nome para a nova biblioteca Virtual. A biblioteca Virtual será então criada, baseada na busca que foi digitada. Buscas são muito poderosas, para exemplos dos tipos de coisas que você pode fazer com elas, consulte :ref:`search_interface`.
zh_cn: 虚拟书库基于*搜索*。 您可以使用任何搜索作为虚拟书库的基础。 虚拟书库将仅包含与该搜索匹配的书籍。 首先，在搜索栏中输入您要使用的搜索或使用“标签浏览器”构建搜索。 当您对返回的结果感到满意时，单击“虚拟书库”按钮，选择“创建书库”并输入新虚拟书库的名称。 然后，将根据您刚刚输入的搜索创建虚拟书库。搜索非常强大，有关您可以使用它们执行的操作的示例，请参阅“search_interface”。

source: Examples of useful Virtual libraries
pt_br: Exemplos de bibliotecas virtuais úteis
zh_cn: 有用的虚拟书库示例

source: Books added to calibre in the last day::
pt_br: Livros adicionados no calibre no último dia::
zh_cn: 在最后一天添加到calibre的图书：

source: date:>1daysago
pt_br: data:>1diaatrás
zh_cn: 日期：>1天前

source: Books added to calibre in the last month::
pt_br: Livros adicionados ao calibre no último mês::
zh_cn: 上个月添加到 calibre 的书籍：

source: date:>30daysago
pt_br: data:>30diasatrás
zh_cn: 日期：>30天前

source: Books with a rating of 5 stars::
pt_br: Livros com uma classificação de 5 estrelas::
zh_cn: 评分为 5 星的书籍：

source: rating:5
pt_br: classificação:5
zh_cn: 评分：5

source: Books with a rating of at least 4 stars::
pt_br: Livros com uma classificação de pelo menos 4 estrelas::
zh_cn: 评分至少为 4 星的书籍：

source: rating:>=4
pt_br: classificação:>=4
zh_cn: 评分：>=4

source: Books with no rating::
pt_br: Livros sem classificação::
zh_cn: 没有评级的书籍：

source: rating:false
pt_br: classificação:falso
zh_cn: 评级：无

source: Periodicals downloaded by the Fetch News function in calibre::
pt_br: Periódicos baixados via função Obter Notícias no calibre::
zh_cn: calibre 中的“获取新闻”功能下载的期刊：

source: tags:=News and author:=calibre
pt_br: etiquetas:=Novidades and autor:=calibre
zh_cn: 标签：=新闻 和 作者：=calibre

source: Books with no tags::
pt_br: Livros sem etiquetas::
zh_cn: 没有标签的书籍：

source: tags:false
pt_br: etiquetas:falso
zh_cn: 标签：无

source: Books with no covers::
pt_br: Livros sem capas::
zh_cn: 没有封面的书籍：

source: cover:false
pt_br: capa:falso
zh_cn: 封面：无

source: Working with Virtual libraries
pt_br: Trabalhando com bibliotecas Virtuais
zh_cn: 使用虚拟书库

source: You can edit a previously created Virtual library or remove it, by clicking the :guilabel:`Virtual library` and choosing the appropriate action.
pt_br: Pode-se editar uma biblioteca Virtual previamente criada ou apagá-la, clicando em :guilabel:`Biblioteca Virtual` e escolhendo a ação apropriada.
zh_cn: 您可以编辑或删除以前创建的虚拟书库，方法是单击`虚拟书库`并选择适当的操作。

source: You can tell calibre that you always want to apply a particular Virtual library when the current library is opened, by going to :guilabel:`Preferences->Interface->Behavior`.
pt_br: Você pode dizer ao calibre que você sempre quer ativar uma biblioteca Virtual específica quando a biblioteca atual seja aberta, indo em :guilabel:`Preferências->Interface->Comportamento`.
zh_cn: 您可以通过“首选项->界面->行为”告诉 calibre，在打开当前书库时您始终希望应用特定的虚拟书库。

source: You can quickly use the current search as a temporary Virtual library by clicking the :guilabel:`Virtual library` button and choosing the :guilabel:`*current search` entry.
pt_br: Você pode rapidamente usar a busca atual como biblioteca Virtual temporária clicando no botão:guilabel:`Biblioteca Virtual` e escolhendo a opção :guilabel:`*busca atual` .
zh_cn: 通过单击“虚拟书库”按钮并选择“*当前搜索”条目，您可以快速将当前搜索用作临时虚拟书库。

source: You can display all available Virtual libraries as tabs above the book list. This is particularly handy if you like switching between Virtual libraries very often. Click the :guilabel:`Virtual library` button and select :guilabel:`Show Virtual libraries as tabs`. You can re-arrange the tabs by drag and drop and close ones you do not want to see. Closed tabs can be restored by right-clicking on the tab bar.
pt_br: Você pode exibir todas as bibliotecas Virtuais disponíveis como abas acima da lista de livros. Isto é particularmente útil se você goste de frequentemente alternar entre bibliotecas Virtuais. Clique no botão :guilabel:`Biblioteca Virtual` e selecione :guilabel:`Mostrar bibliotecas Virtuais como abas`. Pode-se rearranjar as abas arrastando-as e fechando as abas que você não deseja ver. Abas fechadas podem ser restauradas ao clicar com o botão direito sobre a barra de abas.
zh_cn: 您可以将所有可用的虚拟书库显示为图书列表上方的选项卡。 如果您喜欢经常在虚拟书库之间切换，这尤其方便。 单击“虚拟书库”按钮并选择“将虚拟书库显示为选项卡”。 您可以通过拖放来重新排列选项卡并关闭您不想看到的选项卡。 右键单击选项卡栏可以恢复关闭的选项卡。

source: Using Virtual libraries in searches
pt_br: Usar bibliotecas virtuais nas pesquisas
zh_cn: 在搜索中使用虚拟书库

source: You can search for books that are in a Virtual library using the ``vl:`` prefix. For example, ``vl:Read`` will find all the books in the *Read* Virtual library. The search ``vl:Read and vl:"Science Fiction"`` will find all the books that are in both the *Read* and *Science Fiction* Virtual libraries.
pt_br: Pode-se pesquisar em livros que estão em uma biblioteca Virtual usando o prefixo ``vl:``. Por exemplo, ``vl:Lidos`` irá buscar em todos os livros na biblioteca virtual *Lidos*. A busca ``vl:Lidos and vl:"Ficção Científica"`` vai buscar em todos os livros que estejam tanto na biblioteca Virtual *Lidos* quanto na *Ficção Científica*.
zh_cn: 您可以使用“vl:”前缀搜索虚拟书库中的书籍。 例如，``vl:Read`` 将查找 *Read* 虚拟书库中的所有书籍。 搜索``vl:Read 和 vl:"Science Fiction"`` 将找到 *Read* 和 *Science Fiction* 虚拟书库中的所有书籍。

source: The value following ``vl:`` must be the name of a Virtual library. If the Virtual library name contains spaces then surround it with quotes.
pt_br: O valor após ``vl:`` deve ser o nome de uma biblioteca Virtual. Se o nome da biblioteca Virtual contiver espaços, coloque-o entre aspas.
zh_cn: ``vl:`` 后面的值必须是虚拟书库的名称。 如果虚拟书库名称包含空格，则用引号将其引起来。

source: One use for a Virtual library search is in the Content server. In :guilabel:`Preferences->Sharing over the net->Require username and password` you can limit the calibre libraries visible to a user. For each visible library you can specify a search expression to further limit which books are seen. Use ``vl:"Virtual library name"`` to limit the books to those in a Virtual library.
pt_br: Um uso para uma busca em biblioteca Virtual está no servidor de Conteúdo. Em :guilabel:`Preferências->Compartilhar pela rede->Exigir usuário e senha`, pode-se limitar as bibliotecas Virtuais visíveis e um usuário. Para cada biblioteca visível, pode-se especificar uma expressão de busca para limitar ainda mais quais livros são vistos. Use ``vl:"Nome da biblioteca Virtual"`` para limitar os livros para aqueles presentes nesta biblioteca Virtual.
zh_cn: 虚拟书库搜索的一种用途是在内容服务器中。 在“首选项 -> 通过网络共享 -> 需要用户名和密码”中，您可以限制用户可见的 calibre 书库。 对于每个可见的书库，您可以指定一个搜索表达式以进一步限制可以查看的书籍。 使用 ``vl:"虚拟书库名称"`` 将书籍限制为虚拟书库中的书籍。

source: Using additional restrictions
pt_br: Usar restrições adicionais
zh_cn: 使用附加限制

source: You can further restrict the books shown in a Virtual library by using :guilabel:`Additional restrictions`. An additional restriction is saved search you previously created that can be applied to the current Virtual library to further restrict the books shown in a Virtual library. For example, say you have a Virtual library for books tagged as :guilabel:`Historical Fiction` and a saved search that shows you unread books, you can click the :guilabel:`Virtual Library` button and choose the :guilabel:`Additional restriction` option to show only unread Historical Fiction books. To learn about saved searches, see :ref:`saved_searches`.
pt_br: Pode-se restringir ainda mais os livros exibidos em uma biblioteca Virtual usando :guilabel:`Restrição adicional`. Uma restrição adicional é uma busca salva previamente criada, que pode ser aplicada à biblioteca Virtual atual para restringir ainda mais os livros mostrados na biblioteca Virtual. Por exemplo, digamos que você tenha uma biblioteca Virtual para livros marcados como :guilabel:`Ficção Histórica` e uma busca salva que mostre os livros não lidos, você pode clicar no botão :guilabel:`Biblioteca Virtual` e escolher a opção :guilabel:`Restrição adicional` para mostrar apenas os livros de Ficção Histórica que não foram lidos. Para aprender a utilizar buscas salvas, veja :ref:`saved_searches`.
zh_cn: 您可以使用“其他限制”进一步限制虚拟书库中显示的书籍。 附加限制是您之前创建的已保存搜索，可以应用于当前虚拟书库以进一步限制虚拟书库中显示的图书。 例如，假设您有一个虚拟书库，其中包含标记为“历史小说”的书籍，以及一个显示未读书籍的已保存搜索，您可以单击“虚拟书库”按钮，然后选择“其他限制”选项以仅显示 未读过的历史小说书籍。 要了解已保存的搜索，请参阅“saved_searches”。
