Repository: debian-calibre/calibre
Catalog: translations/manual/*/xpath.po
Languages: ru, sv

source: XPath tutorial
ru: XPath учебник
sv: XPath-handledning

source: In this tutorial, you will be given a gentle introduction to `XPath <https://en.wikipedia.org/wiki/XPath>`_, a query language that can be used to select arbitrary parts of `HTML <https://en.wikipedia.org/wiki/HTML>`_ documents in calibre. XPath is a widely used standard, and googling it will yield a ton of information. This tutorial, however, focuses on using XPath for e-book related tasks like finding chapter headings in an unstructured HTML document.
ru: В этом учебнике вам будет дано введение в `XPath <https://en.wikipedia.org/wiki/XPath>`_, язык запросов, который можно использовать для выбора произвольных частей `HTML <https://en.wikipedia.org/wiki/HTML>`_ в calibre. XPath является широко используемым стандартом, и при поиске в google он даст тонну информации. Однако в этом учебном пособии основное внимание уделяется использованию XPath для задач, связанных с электронными книгами, таких как поиск заголовков разделов в неструктурированном HTML-документе.
sv: I den här handledning kommer du att få en lätt introduktion till `XPath <https://sv.wikipedia.org/wiki/XPath>`_, ett frågespråk som kan användas för att välja godtyckliga delar av `HTML <https://sv.wikipedia.org/wiki/HTML>`_ dokument i calibre. XPath är en allmänt använd standard, och googla det kommer att ge en ton av information. Denna handledning, däremot fokuserar på att använda XPath för e-bok relaterade uppgifter som att hitta kapitelrubriker i ett ostrukturerad HTML-dokument.

source: Selecting by tag name
ru: Выбор по имени тега
sv: Väljer efter etikettnamn

source: The simplest form of selection is to select tags by name. For example, suppose you want to select all the ``<h2>`` tags in a document. The XPath query for this is simply::
ru: Простейшей формой выбора является выбор тегов по имени. Например, предположим, что вы хотите выбрать все теги ``<h2>`` в документе. Запрос XPath для этого просто::
sv: Den enklaste formen av val är att välja etikett efter namnet. Anta till exempel att du vill välja alla ``<h2>`` etiketter i ett dokument. XPath-förfråga till detta är helt enkelt::

source: The prefix `//` means *search at any level of the document*. Now suppose you want to search for ``<span>`` tags that are inside ``<a>`` tags. That can be achieved with::
ru: Префикс `//` означает *поиск на любом уровне документа*. Теперь предположим, что вы хотите искать теги ``<span>``, которые находятся внутри тегов ``<a>`. Этого можно достичь с помощью ::
sv: Prefixet `//` betyder *söka på alla nivåer i dokumentet*. Anta nu att du vill söka efter ``<span>`` etiketter som är inne ``<a>`` etiketter. Detta kan uppnås med::

source: If you want to search for tags at a particular level in the document, change the prefix::
ru: Если вы хотите искать по тегам на определенном уровне в документе, измените префикс::
sv: Om du vill söka efter etiketter på en viss nivå i dokumentet, ändrar prefixet::

source: This will match only ``<p>A very short e-book to demonstrate the use of XPath.</p>`` in the :ref:`sample_ebook` but not any of the other ``<p>`` tags. The ``h:`` prefix in the above examples is needed to match XHTML tags. This is because internally, calibre represents all content as XHTML. In XHTML tags have a *namespace*, and ``h:`` is the namespace prefix for HTML tags.
ru: Это будет соответствовать только ``<p> Очень короткая электронная книга, для демонстрации использования XPath.</p>`` в :ref:`sample_ebook`, но не какие-либо другие теги``<p>``. Префикс ``h:``в приведённых выше примерах необходим для соответствия тегам XHTML. Потому что внутреннее представление всего контента в calibre - в XHTML. В тегах XHTML есть *namespace*, а ``h:`` - префикс пространства имен для HTML-тегов.
sv: Detta kommer bara matcha ``<p>En mycket kort e-bok för att demonstrera användningen av XPath.</p>`` i :ref:`sample_ebook` men inte någon annan av de andra ``<p>`` etiketterna. ``h:`` prefix i ovan exempel behövs för att passa XHTML-etiketter. Detta för att internt, calibre representerar allt innehåll som XHTML. I XHTML-etiketter finns en *namnrymd*, och ``h:`` är namnrymdsprefix för HTML-etiketter.

source: Now suppose you want to select both ``<h1>`` and ``<h2>`` tags. To do that, we need a XPath construct called *predicate*. A :dfn:`predicate` is simply a test that is used to select tags. Tests can be arbitrarily powerful and as this tutorial progresses, you will see more powerful examples. A predicate is created by enclosing the test expression in square brackets::
ru: Теперь предположим, что вы хотите выбрать теги ``<h1>`` и ``<h2>``. Для этого нам нужна конструкция XPath, называемая *predicate*. A :dfn:`predicate` - это просто тест, который используется для выбора тегов. Тесты могут быть произвольно мощными, и по мере продвижения по этому учебнику вы увидите более мощные примеры. Предикат создается путем заключения тестового выражения в квадратные скобки ::
sv: Anta nu att du vill välja både ``<h1>`` och ``<h2>`` etiketter. För att göra det behöver vi en XPath konstruktion som kallas *predikat*. En : dfn: 'predikat' är helt enkelt ett test som används för att välja etiketter. Tester kan vara godtyckligt kraftfullt och som denna handledning fortskrider, kommer du att se mer kraftfulla exempel. Ett predikat skapas genom att innesluta test uttryck inom hakparenteser::

source: There are several new features in this XPath expression. The first is the use of the wildcard ``*``. It means *match any tag*. Now look at the test expression ``name()='h1' or name()='h2'``. :term:`name()` is an example of a *built-in function*. It simply evaluates to the name of the tag. So by using it, we can select tags whose names are either `h1` or `h2`. Note that the :term:`name()` function ignores namespaces so that there is no need for the ``h:`` prefix. XPath has several useful built-in functions. A few more will be introduced in this tutorial.
ru: В этом выражении XPath имеется несколько новых функций. Во-первых, это использование подстановочного символа ``*``. Это означает *соответствие любому тегу*. Теперь посмотрим на тестовое выражение ``name()='h1' or name()='h2'``. :term:`name()`является примером*built-in function* (встроенной функции). Он просто оценивает имя тега. Поэтому, используя его, мы можем выбрать теги, имена которых либо `h1`, либо` h2`. Обратите внимание, что функция :term:`name ()` игнорирует пространства имен, поэтому нет необходимости в префиксе ``h:``. XPath имеет несколько полезных встроенных функций. В этом учебнике будет представлено ещё несколько таких.
sv: Det finns flera nya funktioner i detta XPath-uttryck. Den första är användningen av tecknet ``*``. Det betyder *matchar alla etiketter*. Titta nu på prov uttrycket ``name()="h1" eller name()= 'h2'``. :term:`name()` är ett exempel på en *inbyggd funktion*. Den utvärderar endast namnet på etiketten. Så genom att använda det, kan vi välja etiketter vars namn är antingen `h1` eller `h2`. Observera att :term:`name()`-funktionen ignorerar namespaces, så att det inte finns något behov av ``h:``-prefixet. XPath har flera användbara inbyggda funktioner. Några fler kommer att introduceras i den här guiden.

source: Selecting by attributes
ru: Выбор по аттрибутам
sv: Väljer baserat på attribut

source: To select tags based on their attributes, the use of predicates is required::
ru: Чтобы выбрать теги на основе их атрибутов, необходимо использовать предикаты ::
sv: För att välja etiketter baserat på deras attribut, användning av predikat krävs::

source: Here, the ``@`` operator refers to the attributes of the tag. You can use some of the `XPath built-in functions`_ to perform more sophisticated matching on attribute values.
ru: Здесь оператор ``@``ссылается на атрибуты тега. Вы можете использовать некоторые из `XPath built-in functions`_ (встроенных функций XPath) для выполнения более сложных сопоставлений значений атрибутов.
sv: Här hänvisar ``@`` operatören attributen för etiketten. Du kan använda en del av de `XPath inbyggda funktioner` _ att utföra mer avancerad matchning på attributvärden.

source: Selecting by tag content
ru: Выбор по содержимому тега
sv: Väljer baserat på etikettinnehåll

source: Using XPath, you can even select tags based on the text they contain. The best way to do this is to use the power of *regular expressions* via the built-in function :term:`re:test()`::
ru: Используя XPath, вы даже можете выбирать теги на основе текста, который они содержат. Лучший способ сделать это - использовать силу *regular expressions* (регулярных выражений) через встроенную функцию :term:`re:test ()`::
sv: Med hjälp av XPath kan du även välja etiketter som baseras på text de innehåller. Det bästa sättet att göra detta är att använda kraften i *reguljära uttryck* via den inbyggda funktionen: term:`re:test()`::

source: Here the ``.`` operator refers to the contents of the tag, just as the ``@`` operator referred to its attributes.
ru: Здесь оператор ``.`` ссылается на содержимое тега, так же как оператор ``@``ссылается на его атрибуты.
sv: Här hänvisar ``.`` operatör till innehållet i etiketten, precis som ``@`` operatör avser dess attribut.

source: Sample e-book
ru: Пример e-book
sv: Exempel e-bok

source: XPath built-in functions
ru: Встроенные функции XPath
sv: Inbyggda XPath-funktioner

source: The name of the current tag.
ru: Имя текущего тега
sv: Namnet på den aktuella etiketten.

source: ``contains(s1, s2)`` returns `true` if s1 contains s2.
ru: ``contains(s1, s2)`` возвращает `true` если s1 содержит s2.
sv: ``contains(s1, s2)`` återger `true` om s1 innehåller s2.

source: ``re:test(src, pattern, flags)`` returns `true` if the string `src` matches the regular expression `pattern`. A particularly useful flag is ``i``, it makes matching case insensitive. A good primer on the syntax for regular expressions can be found at `regexp syntax <https://docs.python.org/2.7/library/re.html>`_
ru: `` re: test (src, pattern, flags) `` возвращает `true`, если строка` src` соответствует регулярному выражению `pattern`. Особенно полезным флагом является ``i``, что делает соответствующий регистр нечувствительным. Хороший пример синтаксиса для регулярных выражений можно найти в синтаксисе regexp <https://docs.python.org/2.7/library/re.html>`_
sv: ``re:test(src, pattern, flags)`` återger `true` om strängen `src` matchar med det reguljära uttrycks `mönster`. En särskilt användbar flaggan är ``i``, det gör matchning skiftlägesokänslig. En bra grund på syntaxen för reguljära uttryck finns på `regexp syntax <https://docs.python.org/2.7/library/re.html>`_
