Repository: debian-calibre/calibre
Catalog: translations-git/website/*.po
Languages: nl, pt, ru, sv, zh_tw

source: While not directly calibre related, a new website that catalogues unrestricted access e-books for sale was started: <a href="%(ob)s">Open books</a>. All the books on this website are for sale, but they do not have DRM, which means you actually own them after paying for them. You can convert them to different formats, fix typos in them, view them on as many devices as you like. At calibre, we believe that DRM free is the future of digital information and Open Books is a small effort to help speed that future along.
nl: Hoewel niet direct calibre verwant, werd een nieuwe webstek gestart met een catalogus van e-boeken zonder gebruiksbeperkingen te koop: <a href="%(ob)s">Open books</a>. Alle boeken op deze webstek zijn te koop maar hebben geen DRM, wat betekent dat u ze echt bezit na ervoor te betalen. U kan ze converteren naar andere formaten, schrijffouten corrigeren, ze bekijken op zoveel toestellen als u wil. Bij calibre geloven we dat DRM vrij de toekomst is van digitale informatie en Open Books is een kleine hulp om dat mee waar te maken.
pt: Apesar de não ser diretamente relacionado com o Calibre, um novo sítio que cataloga ebooks de acesso livre para venda foi iniciado: <a href="%(ob)s">Open Books</a>. Todos os livros neste sítio são para venda, mas não possuem DRM, o que significa que você realmente é dono deles após os adquirir. Pode convertê-los para formatos diferentes, corrigir erros de ortografia, visualizá-los em tantos dispositivos quantos quiser. Nós do Calibre acreditamos que livros sem DRM é o futuro da informação digital e o Open Books é um pequeno esforço para ajudar a acelerar este processo.
ru: Хотя это не связано напрямую с calibre, стартовал новый сайт, который каталогизирует электронные книги неограниченного доступа для продажи: <a href="%(ob)s">Открытые книги</a>. Все книги на этом сайте предназначены для продажи, но у них нет DRM, что означает, что вы фактически владеете ими после оплаты за них. Вы можете конвертировать их в различные форматы, исправлять опечатки в них, просматривать их на любом количестве устройств. В calibre, мы считаем, что свобода от DRM это будущее цифровой информации, а Open Books - небольшое усилие, которое поможет ускорить это будущее.
sv: Även om det inte är direkt relaterat till calibre, startades en ny webbplats som katalogiserar e-böcker för obegränsad åtkomst: till salu: <a href="%(ob)s">Open books</a>. Alla böcker på denna webbplats är till salu, men de har inte DRM, vilket innebär att du faktiskt äger dem efter att ha betalat för dem. Du kan konvertera dem till olika format, korrigera skrivfel i dem, se dem på så många enheter du vill. Vi tror på calibre att DRM-fri är framtiden för digital information och Open Books är en liten ansträngning för att påskynda framtiden.
zh_tw: 虽然与calibre没有直接关系，但一个新的网站已经启动，该网站对销售的无限制访问的电子书进行编目： <a href="%(ob)s">开放图书</a>。 该网站上的所有书籍都可以出售，但它们没有DRM，这意味着您实际上是在付款后才拥有它们。 您可以将它们转换为不同的格式， 修复其中的打字错误，在任意多个设备上查看它们。 在Calibre，我们相信免费DRM是数字信息的未来， 而"开放图书"是帮助加速这一未来的一小部分努力。

source: Some new features in 0.8
nl: Enkele nieuwe eigenschappen in 0.8
pt: Novidades no Calibre 0.8
ru: Новое в версии 0.8
sv: Några nya funktioner i 0.8
zh_tw: 0.8中的一些新功能

source: Get books
nl: Boeken downloaden
pt: Obter livros
ru: Приобрести книги
sv: Skaffa böcker
zh_tw: 取得書本

source: calibre can now search over a dozen web stores like Amazon, Barnes &amp; Noble, Waterstones, etc. for e-book editions of the book you want. The results are displayed sorted by price, so you can easily find the lowest priced edition to add to your collection. This feature, like the rest of calibre is plugin based, so look forward to new stores being added in the future.
nl: calibre kan nu meer dan een dozijn webwinkels zoals Amazon, Barnes &amp; Noble, Waterstones, etc. doorzoeken voor e-boek edities van het boek dat u wilt. De resultaten worden getoond gerangschikt volgens prijs, zodat u gemakkelijk de goedkoopste editie kan vinden om aan uw collectie toe te voegen. Deze functie, net zoals de rest van calibre is plug-in gebaseerd, dus verwacht meer winkels in de toekomst.
pt: O Calibre agora pode pesquisar em mais de uma dezena de lojas digitais como Amazon, Barnes &amp; Noble, Waterstones, etc, por edições ebook do livro que você quer. O resultados são mostrados ordenados por preço, de forma a que possa facilmente encontrar a edição com o preço mais baixo para adicionar à sua coleção. Esta função, como o resto do Calibre, é baseada em plugins pelo que pode esperar que novas lojas sejam adicionadas no futuro.
ru: calibre теперь может искать в более чем дюжине интернет-магазинов, таких как Amazon, Barnes &amp; Noble, Waterstones и др. чтобы найти электронное издание желаемой книги. Результаты отображаются отсортированными по цене, поэтому вы можете легко найти самую дешевую версию для добавления в свою коллекцию. Эта функция, как и остальное в calibre, основана на плагинах, так что ждите новых магазинов, которые будут добавлены в будущем.
sv: calibre kan nu söka över ett dussin webbutiker som Amazon, Barnes &amp; Noble, Waterstones o.s.v. för e-bokutgåvor av den bok du vill ha. Resultaten visas sorterade efter pris så att du enkelt kan hitta utgåvan med det lägsta priset och lägga till i din samling. Den här funktionen, liksom resten av calibre, är baserad på insticksmoduler, så se fram emot att nya butiker läggs till i framtiden.
zh_tw: Calibre现在可以在十几家网络商店搜索，如亚马逊、巴诺书店、Waterstone等， 寻找你想要的电子书版本。 搜索结果按价格排序显示，因此您可以轻松找到价格最低的版本 添加到您的收藏中。 这个功能，就像Calibre的其他功能一样，是基于插件的，所以期待着未来会有新的商店加入。

source: Note that if you have customized your toolbar in calibre in the past, you may not see the Get books button in the toolbar. You can go to Preferences-&gt;Toolbars &amp; menus and add it to the toolbar manually.
nl: Merk op dat als u in het verleden uw werkbalk in calibre heeft aangepast, u misschien de Verkrijg boeken knop niet ziet op de werkbalk. U kan hem in Voorkeuren-&gt;Werkbalken &amp; menus handmatig toevoegen aan de werkbalk.
pt: Note que se você personalizou sua barra de ferramentas no calibre no passado, você pode não ver o botão Obter livros na barra de ferramentas. Você pode ir em Preferências-&gt;Barra de ferramentas &amp; menus e adicione-o à barra de ferramentas manualmente.
ru: Обратите внимание, что если ранее вы уже настраивали панель инструментов calibre, кнопка «Приобрести книги» может не отобразиться на ней. Её можно добавить вручную, перейдя в «Параметры-&gt;Панели инструментов и меню».
sv: Observera att om du har anpassat ditt verktygsfält i calibre tidigare kanske du inte ser knappen Skaffa böcker i verktygsfältet. Du kan gå till Inställningar-&gt;Verktygsfält & menyer och lägga till verktygsfältet manuellt.
zh_tw: 请注意，如果您以前在Calibre中自定义了工具栏，则可能看不到工具栏中的“获取图书”按钮。 您可以转到首选项->工具栏&；菜单并手动将其添加到工具栏。

source: A search for 'Foundation asimov' with calibre's Get books
nl: Een zoek naar 'Foundation asimov' met calibre's Verkrijg boeken
pt: Uma pesquisa por 'Foundation Asimov' com a funcionalidade Obter livros do Calibre
ru: Поиск «Foundation asimov» через функцию calibre «Приобрести книги»
sv: En sökning efter "Foundation asimov" med calibres Skaffa böcker
zh_tw: 用calibre的“获取图书”搜索“阿西莫夫基金会”

source: The store page for one of the Foundation books found previously
nl: De winkel pagina voor een van de Foundation boeken eerder gevonden
pt: A página da loja para um dos livros da fundação encontrados anteriormente
ru: Страница магазина с найденной ранее книгой из цикла «Основание»
sv: Butikssidan för en av Foundation-böckerna som hittats tidigare
zh_tw: 先前找到的其中一本Foundation书籍的商店页面

source: Lots of new calibre plugins
nl: Massa's nieuwe calibre plug-ins
pt: Muitos e novos plugins Calibre
ru: Множество новых расширений
sv: Massor av nya insticksmoduler för calibre
zh_tw: 大量的新插件

source: calibre has gained dozens of new, user-contributed, plugins to enhance its already extensive feature set. These range from things like finding duplicates in your calibre library to managing collections on your Kindle from within calibre.
nl: calibre heeft tientallen nieuwe, gebruiker-bijgedragen, plug-ins om z'n al omvangrijke functielijst te vergroten. Deze gaan van dingen als het vinden van duplicaten in uw calibre bibliotheek tot het beheren van collecties op uw Kindle vanuit calibre.
pt: O calibre ganhou dezenas de novas contribuições de usuários com plugins para melhorar seu já grande conjunto de ferramentas. Estes variam de coisas como encontrar itens duplicados na sua biblioteca do calibre a gerenciar coleções no seu Kindle de dentro do calibre.
ru: calibre получила десятки новых пользовательских плагинов для расширения своего и без того обширного набора функций. Они варьируются от поиска дубликатов в вашей библиотеке до управления коллекциями на вашем Kindle из calibre.
sv: calibre har fått dussintals nya, användarbidragade insticksmoduler för att förbättra sin redan omfattande funktionsuppsättning. Dessa sträcker sig från saker som att hitta dubbletter i ditt calibre-bibliotek till att hantera samlingar på din Kindle inifrån calibre.
zh_tw: Calibre已经获得了数十个新的、用户贡献的插件，以增强其已经广泛的功能集。 这些功能的范围从在您的Calibre书库中查找重复项到在您的Calibre范围内管理 您的Kindle上的藏书。

source: Many of the plugins scratch an itch that affects only a subset of calibre users, for example, a plugin to set a cover from calibre as the screensaver on your SONY reader. If you have something that you always wanted to do in calibre, chances are, someone has written a plugin for it.
nl: Veel van de plug-ins voldoen aan iets alleen voor een subset van calibre gebruikers, bijvoorbeeld, een plug-in om een omslag uit calibre als screensaver op uw SONY reader te zetten. Als er iets is dat u altijd al wilde doen in calibre, veel kans dat er al een plug-in voor geschreven is.
pt: Muitos destes plugins satisfazem apenas uma porção dos usuários do calibre. Por exemplo, um plugin para definir uma capa do calibre como a proteção de tela para o seu leitor SONY. Se existe algo que você sempre quis no calibre, há uma chance de alguém ter criado um plugin para isso.
ru: Многие из плагинов затрагивают только часть пользователей calibre, например, плагин для установки обложки из calibre в качестве заставки на вашей читалке SONY. Если у вас есть что-то, что вы всегда хотели сделать в calibre, скорее всего, кто-то написал плагин для этого.
sv: Många av insticksmodulerna kliar en klåda som bara påverkar en delmängd av calibre-användarna, till exempel en insticksmodul för att ställa in ett omslag från calibre som skärmsläckare på din SONY-läsenhet. Om du har något som du alltid velat göra i calibre, är chansen stor att någon har skrivit en insticksmodul för det.
zh_tw: 许多插件效果只影响到calibre用户的一部分，例如，一个将Calibre中的封面设置为索尼阅读器屏幕保护程序的插件。 如果你有一些你一直想要做的事情，很有可能，有人已经为它编写了一个插件。

source: There is an easy to browse <a href="%(mr)s">Index of plugins</a>. Before adding plugins willy-nilly to calibre, you should read the <a href="%(ip)s">Introduction to plugins</a>.
nl: Er is een overzichtelijke <a href="%(mr)s">Index van plug-ins</a>. Alvorens willekeurig plug-ins aan calibre toe te voegen, leest u best <a href="%(ip)s">Introductie tot plug-ins</a>.
pt: Há um <a href="%(mr)s">Índice de plugins</a> fácil de navegar. Antes de adicionar plugins a torto e à direita ao calibre, você deve ler a <a href="%(ip)s">Introdução a plugins</a>.
ru: Это легко - просматривать <a href="%(mr)s">Индекс плагинов</a>. Перед добавлением плагинов в calibre, вы должны прочитать <a href="%(ip)s">Введение в плагины</a>.
sv: Det finns en lätt att bläddra i <a href="%(mr)s">Index av insticksmoduler</a>. Innan du lägger till insticksmoduler i calibre, bör du läsa <a href="%(ip)s">Introduktionen till insticksmoduler</a>.
zh_tw: 有一个易于浏览的<a href="%(mr)s">插件索引</a>。 在随意将插件添加到Calibre之前，您应该 阅读<a href="%(ip)s">插件简介</a>。

source: New metadata download system
nl: Nieuw metadata download systeem
pt: Novo sistema de obtenção de metadados
ru: Новая система загрузки метаданных
sv: Nytt hämtningssystem för metadata
zh_tw: 新的後設資料下載系統

source: calibre now has a new metadata download system. This is designed to improve download performance and give you greater control over exactly what calibre downloads from where. You can tell calibre that you do not want ratings and tags from Amazon or comments from Google, for example.
nl: calibre heeft nu een nieuw metadata download systeem. Dit is ontworpen om download performance te verbeteren en geeft u meer controle over wat exact calibre downloadt en van waar. U kan calibre vertellen dat u geen beoordelingen of tags wil van Amazon of commentaren van Google, bijvoorbeeld.
pt: O Calibre agora possui um novo sistema de descarregamento de metadados. Foi desenhado para melhorar a performance das transferências e fornecer-lhe a si maior controlo sobre o que o Calibre descarrega exatamente e de onde. Por exemplo, pode dizer ao Calibre que não quer avaliações e etiquetas da Amazon ou comentários do Google.
ru: calibre теперь имеет новую систему загрузки метаданных. Она разработана, чтобы улучшить производительность загрузки и дать вам больший контроль над тем что и откуда скачивает calibre. Вы можете указать calibre, что вам, например, не нужны оценки и теги от Amazon или комментарии от Google.
sv: calibre har nu ett nytt metadatahämtningssystem. Detta är utformat för att förbättra hämtningsprestandan och ge dig större kontroll över exakt vad calibre hämtar och varifrån. Du kan till exempel tala om för calibre att du inte vill ha betyg och taggar från Amazon eller kommentarer från Google.
zh_tw: calibre 现在有一个新的元数据下载系统。它能够提高下载性能，并让你更大程度地控制calibre从哪里下载以及下载什么。例如，你可以告诉 calibre，不要下载亚马逊的评级和标签，也不要下载谷歌的评论。

source: When downloading covers for a single book, calibre will now download covers from all the online sources and allow you to pick the one you like best, instead of choosing for you.
nl: Bij downloaden van omslagen voor een enkel boek, zal calibre nu omslagen downloaden van alle on-line bronnen en u er degene die u het best bevalt uit laten kiezen, in plaats van voor u te kiezen.
pt: Ao descarregar capas para um livro único, o Calibre irá agora descarregar capas de todas as fontes em linha e permitir-lhe a escolha daquela que mais gostar, em vez de ser escolhida automaticamente.
ru: При загрузке обложек для одной книги, calibre теперь будет загружать обложки из всех онлайн-источников и позволит выбрать одну которая понравится больше, вместо выбора за тебя.
sv: När du hämtar omslag för en enda bok hämtar calibre nu omslag från alla källor på nätet och låter dig välja den du gillar bäst istället för att välja åt dig.
zh_tw: 在下载书籍封面时，现在 calibre 会从所有的在线资源中下载封面，让你挑选出最喜欢的封面。

source: When downloading metadata for multiple books, the download now happens in the background, allowing you to continue working while the download is happening.
nl: Bij het downloaden van metadata voor meerdere boeken gebeurt de download nu in de achtergrond, zodat u kan verder werken terwijl de download bezig is.
pt: Ao descarregar capas para múltiplos livros, o processo agora acontece em segundo plano, permitindo-lhe trabalhar enquanto a transferência decorre.
ru: Теперь, когда скачиваются метаданные для нескольких книг, загрузка происходит в фоне, позволяя одновременно продолжать работу.
sv: När du hämtar metadata för flera böcker sker hämtningen nu i bakgrunden så att du kan fortsätta arbeta medan hämtningen pågår.
zh_tw: 同时下载多本书的元数据时，下载任务会在后台进行，用户可以在下载过程中继续其他的工作。

source: Downloading book metadata
nl: Metadata aan het downloaden
pt: A descarregar metadados
ru: Загрузка метаданных книг
sv: Hämta bokmetadata
zh_tw: 下載書本詮釋資料

source: Downloading book covers
nl: Boekomslagen downloaden
pt: A descarregar capas
ru: Загрузка обложек книг
sv: Hämta bokomslag
zh_tw: 下載書本封面詮釋資料

source: Interface improvements
nl: Interface verbeteringen
pt: Melhorias na interface
ru: Улучшения интерфейса
sv: Gränssnittsförbättringar
zh_tw: 介面改進

source: The main calibre user interface has had a makeover. It has multiple layouts, wide and narrow, selectable from Preferences-&gt;Look &amp; feel. The Edit metadata dialog (one of the most frequently used dialogs in calibre) was also redesigned with multiple selectable layouts, this time from Preferences-&gt;Behavior. In the same vein the Book details panel is now fully user customizable from Preferences-&gt;Look &amp; feel.
nl: De calibre hoofdgebruikersinterface is herontworpen. Hij heeft verschillende layouts, breed en smal, te selecteren in Voorkeuren-&gt; Uitstraling &amp; gevoel. De metadata bewerken dialoog (een van de meest gebruikte in calibre) werd ook herontworpen met keuze uit meerdere layouts, dit in Voorkeuren-&gt;Gedrag. Op dezelfde manier is het Boek detailpaneel nu volledig aanpasbaar vanuit Voorkeuren-&gt;Uitstraling &amp; gevoel.
pt: A interface de usuário principal do calibre ganhou uma maquiagem. Ela tem múltiplos layouts, largo e estreito, selecionáveis via Preferências-&gt;Aparência. O diálogo de edição de metadados (um dos mais usados no calibre) também foi redesenhado com múltiplos layouts selecionáveis, desta vez via Preferências-&gt;Comportamento. Na mesma onda o Painel de detalhes do livro é agora totalmente customizável via Preferências-&gt;Aparência.
ru: Основной пользовательский интерфейс был изменен. Он имеет несколько макетов, широких и узких, по выбору Preferences-&gt;Look &amp; feel. Диалоговое окно «Редактировать метаданные» (одно из наиболее часто используемых в calibre) также было переработано обретя несколько выбираемых макетов, на этот раз из Preferences-&gt;Behavior. В том же духе панель «Детали книги» теперь полностью настраивается пользователем из Preferences-&gt;Look &amp; feel.
sv: Huvudanvändargränssnittet i calibre har förändrats. Den har flera layouter, breda och smala, kan väljas från Inställningar-&gt;Utseende &amp; känsla. Dialogrutan Redigera metadata (en av de mest använda dialogrutorna i calibre) omformades också med flera valbara layouter, den här gången från Inställningar-&gt;Beteende. På samma sätt är bokdetaljpanelen nu helt anpassningsbar av användaren från Inställningar-&gt;Utseende &amp; känsla.
zh_tw: calibre主要用户界面进行了改头换面。它有多种布局，宽的和窄的，可以从“首选项中选择->外观和感觉”选择。 “编辑元数据”对话框(Calibre中最常用的对话框之一)也重新设计了多个可选布局，这一次是从“首选项->行为”选择。 同样，“图书详细信息”面板现在完全可以从“首选项->外观和感觉”中进行用户定制。

source: The old double toolbar in calibre was replaced by a new single "unified" toolbar, to save vertical space. You can now add a second toolbar or even a menubar and customize what icons appear in each.
nl: De oude dubbele werkbalk in calibre werd vervangen door een nieuwe enkele "verenigde" werkbalk, om verticale ruimte te besparen. U kan een tweede werkbalk toevoegen of zelfs een menubalk en aanpassen welke iconen erop komen.
pt: A velha barra de ferramentas dupla do calibre foi substituída por uma nova barra de ferramentas unificada, para economizar espaço vertical. Você pode agora adicionar uma segunda barra de ferramentas ou mesmo uma barra de menus e personalizar quais ícones aparecem em cada.
ru: Старая двойная панель инструментов в calibre была заменена новой единой «унифицированной» панелью инструментов для экономии вертикального пространства. Теперь вы можете добавить вторую панель инструментов или даже меню и настроить, какие значки появляются в каждом.
sv: Det gamla dubbla verktygsfältet i calibre ersattes av ett nytt enda "enhetligt" verktygsfält för att spara vertikalt utrymme. Du kan nu lägga till ett andra verktygsfält eller till och med en menyrad och anpassa vilka ikoner som visas i varje.
zh_tw: 为了节省垂直方向的空间，Calibre中的旧双工具栏被新的单一“统一”工具栏所取代。 现在，您可以添加第二个工具栏甚至菜单栏，并自定义每个工具栏中显示的图标。

source: Finally, the Preferences dialog, a normally neglected bit of real estate was redesigned making it easier to find just the setting you are looking for.
nl: Tenslotte, de Voorkeuren dialoog, gewoonlijk verwaarloosd vastgoed, is herontworpen om gemakkelijker juist die instelling te vinden die u zoekt.
pt: Finalmente, o diálogo de Preferências, uma área geralmente negligenciada, foi redesenhada, tornando mais fácil encontrar a configuração que está procurando.
ru: Наконец, диалоговое окно «Настройки», которое обычно игнорируется, было переработано, чтобы упростить поиск нужной настройки.
sv: Slutligen, dialogrutan Inställningar, en normalt försummade bit av skärmyta omdesignades vilket gör det lättare att hitta precis den inställning du letar efter.
zh_tw: 最后，重新设计了首选项对话框，这是一个通常被忽略的小块区域，使您可以更容易地找到您正在寻找的设置。

source: The new main interface
nl: De nieuwe hoofdinterface
pt: A nova interface
ru: Новый интерфейс
sv: Det nya huvudgränssnittet
zh_tw: 全新的主畫面

source: The new Edit metadata dialog
nl: De nieuwe Bewerk matadata dialoog
pt: O novo diálogo de edição de metadados
ru: Новый диалог Редактирование метаданных
sv: Den nya dialogrutan Redigera metadata
zh_tw: 新的元数据编辑对话框

source: The new preferences dialog
nl: De nieuwe voorkeuren dialoog
pt: O novo diálogo de preferências
ru: Новое диалоговое окно «Параметры»
sv: Den nya inställningar dialogrutan
zh_tw: 新的首选项对话框

source: Content server improvements
nl: Content server verbeteringen
pt: Melhorias no servidor de conteúdos
ru: Улучшения контент-сервера
sv: Förbättringar för innehållsservern
zh_tw: 内容服务器改进

source: The calibre Content server was completely redesigned with a "modern" (AJAX based, dynamic) user interface that allows for the browsing of your library by Tags/Series/Authors/etc.
nl: De calibre Content server werd volledig herontworpen met een "moderne" (AJAX gebaseerde, dynamische) gebruikersinterface die bladeren toelaat in uw bibliotheek op Tags/Series/Auteurs/enz.
pt: O servidor de conteúdos do Calibre foi totalmente redesenhado com uma "moderna" interface de utilizador (dinâmica, baseada em AJAX) o que permite a navegação na sua biblioteca por etiquetas/séries/autores, etc.
ru: Контент-сервер calibre был полностью переработан получив «современный» (на основе AJAX, динамический) пользовательский интерфейс, который позволяет просматривать ваши библиотеки по тегам/сериалам/авторам/и т. д.
sv: Innehållsservern för calibre designades helt om med ett "modernt" (AJAX-baserat, dynamiskt) användargränssnitt som gör det möjligt att bläddra i ditt bibliotek med taggar/serier/författare/o.s.v.
zh_tw: Calibre 内容服务器完全重新设计了“现代”（基于AJAX的、动态的）)用户界面，允许浏览按标签/系列/作者/等分类的书库

source: Content server front page
nl: Content server voorpagina
pt: Página de entrada do servidor de conteúdos
ru: Главная страница контент-сервера
sv: Innehållsserverns framsida
zh_tw: 内容服务器首页

source: The Content server book list
nl: De Content server boekenlijst
pt: A lista de livros do servidor de conteúdos
ru: Список книг контент-сервера
sv: Innehållsserverns boklista
zh_tw: 内容服务器图书列表

source: The Content server book details page
nl: De Content server boekdetails pagina
pt: A página de detalhes dos livros no servidor de conteúdo
ru: Страница описания книги на контент-сервере
sv: Innehållsserverns bokdetaljsida
zh_tw: 内容服务器图书详细信息页面
