Repository: debian-calibre/calibre
Catalog: translations-git/website/*.po
Languages: nl, pt, ru, sv, zh_tw

source: The calibre builtin E-book viewer has been completely rewritten. The new design emphasizes the book text, with no visible controls. The viewer now also shares a codebase with the in-browser viewer which will make developing new features such as the upcoming support for annotations much easier.
nl: calibre's ingebouwde e-boekreader is volledig herschreven. Het nieuwe design benadrukt de boek tekst, zonder zichtbare bediening. De viewer deelt nu ook een codebasis met de in-browser viewer wat het ontwikkelen van nieuwe functies zoals de komende ondersteuning van annotaties veel gemakkelijker maakt.
pt: O visualizador integrado do calibre foi completamente reescrito. O novo design enfatiza o texto do livro, sem controles visíveis. O visualizador agora também compartilha o código base com o visualizador do navegador, o que torna o desenvolvimento de novos recursos, como o suporte a anotações (a ser lançado em breve), muito mais fácil.
ru: Встроенная читалка электронных книг calibre была полностью переписана. Новый дизайн заостряет внимание на тексте книги, скрывая элементы управления. Кроме того, теперь она делит кодовую базу с браузерной читалкой, что значительно упростит разработку новых функций, таких как грядущая поддержка заметок.
sv: calibres inbyggda e-bokvisare har blivit helt omskriven. Den nya designen betonar boktexten, utan synliga kontroller. Visaren delar nu också en kodbas med webbläsarvisaren vilket kommer att göra att utveckla nya funktioner som det kommande stödet för noteringar mycket lättare.
zh_tw: calibre 的內建電子書閱讀器已經整個重新寫過了。新的設計更加注重於書本的文字，控制項不再直接擺在介面中了。 閱讀器現在也和瀏覽器內的閱讀器共用程式庫了，這代表未來開發新功能像是即將支援的註解功能變的更加簡單了。

source: The viewer: puts the book front and centre
nl: De viewer: plaatst het book voorop
pt: O visualizador: coloca o livro no centro das atenções
ru: Читалка ставит книгу во главу угла
sv: Visaren: sätter boken fram och centrerar
zh_tw: 閱讀器: 把書本擺在最前方

source: Easily lookup any text in any online reference
nl: Zoek gemakkelijk elke tekst op in elke on-line referentie
pt: Pesquise facilmente por qualquer texto em qualquer dicionário de referência em linha
ru: Лёгкий поиск любых текстов в любых онлайн-справочниках
sv: Enkelt slå upp någon text i någon referens på nätet
zh_tw: 能夠更輕易的利用網路上的資源查詢任何文字了

source: The viewer controls
nl: De viewer controls
pt: Os controlos do visualizador
ru: Элементы управления в читалке
sv: Visarens kontroller
zh_tw: 閱讀器控制項

source: There are a few minor backwards incompatibilities to be aware of in calibre 4, because of the replacement of <i>Qt WebKit</i> with <i>Qt WebEngine</i>.
nl: Er zijn een paar kleine incompatibiliteiten om rekening mee te houden in calibre 4, door de vervanging van <i>Qt WebKit</i> door <i>Qt WebEngine</i>.
pt: No Calibre 4 existem algumas pequenas incompatibilidades com versões anteriores devido à substituição do <i>Qt WebKit</i> pelo <i>Qt WebEngine</i>.
ru: Следует знать о нескольких небольших обратных несовместимостях в calibre 4, связанных с переходом с <i>Qt WebKit</i> на <i>Qt WebEngine</i>.
sv: Det finns några mindre bakåtkompatibiliteter att vara medveten om i calibre 4, på grund av byte av <i>Qt WebKit</i> med <i>Qt WebEngine</i>.
zh_tw: calibre 4 中有幾個關於<i> Qt WebKit </i>轉移到<i> Qt WebEngine </i>的次要的非向下相容情況要注意。

source: The Book details panel now no longer uses a full browser engine for rendering. This makes it faster and less resource intensive, however it supports less HTML and CSS, which means if you used advanced styling in your comments it may not fully work. See <a href="%(qt)s">here for the supported HTML subset</a>.
nl: Het Boekdetailpaneel gebruikt nu geen complete browser engine meer voor de rendering. Het is nu sneller en heeft minder bronnen nodig, hoewel het minder HTML en CSS ondersteunt, dus als u geavanceerde styling heeft gemaakt in uw commentaren zou dat niet meer kunnen werken. Kijk <a href="%(qt)s">hier voor de ondersteunde HTML subset</a>.
pt: O painel de Detalhes do livro não utiliza mais o motor de um navegador completo para renderização. Isto o torna mais rápido e consome menos recurso, entretanto ele suporta menos recursos HTML e CSS, o que significa que se você utilizou estilos avançados nos seus comentários, eles podem não funcionar completamente. Veja <a href="%(qt)s">aqui</a> sobre os recursos HTML suportados.
ru: Панель описания книги теперь не использует целый браузерный движок для отрисовки. Это делает её быстрее и менее ресурсоёмкой, однако поддерживается меньше возможностей HTML и CSS, а значит, если у вас было расширенное оформление комментариев, оно может работать не полностью. См. <a href="%(qt)s">здесь о поддержке подмножества HTML</a>.
sv: Bokdetaljpanelen använder inte nu längre en full webbläsarmotor för återgivning. Detta gör det snabbare och mindre resurskrävande, men den stöder mindre HTML och CSS, vilket innebär att om du använde avancerad formgivning i dina kommentarer kanske det inte fungerar fullt ut. Se <a href="%(qt)s">här för HTML-undergruppen som stöds</a>.
zh_tw: 書本的詳細資料面板現在不再完全使用瀏覽器引擎 (full browser engine) 來轉譯了。 這使的它變得更快而且減少了資源的消耗了，然而它所支援 HTML 以及 CSS 變得更少了， 這代表如果你在評論區塊使用了更進階的樣式設計，它可能不會完全地顯示了。請檢視<a href="%(qt)s">這裡來查看支援的HTML子集</a>。

source: The markup needed for header and footer templates when converting to PDF has changed. See <a href="%(pdf)s">the manual</a> for details.
nl: De markup nodig voor header en footer templates bij converteren naar PDF is veranderd. Bekijk <a href="%(pdf)s">de handleiding</a> voor details.
pt: A marcação necessária para os modelos de cabeçalho e rodapé, ao converter para PDF foi alterada. Veja <a href="%(pdf)s">o manual</a> para detalhes.
ru: Изменилась разметка шаблонов верхнего и нижнего колонтитулов для преобразования в PDF. Подробности в <a href="%(pdf)s">руководстве</a>.
sv: Markeringen som behövs för sidhuvud- och sidfotsmallar vid konvertering till PDF har ändrats. Se <a href="%(pdf)s">handboken</a> för detaljer.
zh_tw: 現在您在轉換成 PDF 時的所需要的標記語言的標頭以及頁尾範本已經變更了，詳細資訊請參閱<a href="%(pdf)s">手冊</a>

source: New in calibre 1.0
nl: Nieuw in calibre 1.0
pt: Novidades no Calibre 1.0
ru: Новое в calibre 1.0
sv: Nytt i calibre 1.0
zh_tw: Calibre 1.0中的新功能

source: calibre has reached <b>1.0</b>, seven years after it was first released and a year since the last major release. Lots of new features have been added to calibre in the last year &mdash; a grid view of book covers, a new, faster database backend, the ability to convert Microsoft Word files, tools to make changes to e-books without needing to do a full conversion, full support for font embedding and subsetting, and many more, described in detail below.
nl: calibre heeft <b>1.0</b> bereikt, zeven jaar na de eerste versie en een jaar na de laatste grote versie. Massa's nieuwe opties zijn toegevoegd aan calibre in het laatste jaar &mdash; een grid zicht op boek omslagen, een nieuwe, snellere database back-end, mogelijkheid om MS Word bestanden te converteren gereedschappen om e-boeks aan te passen zonder een volledige conversie, volledige support voor lettertype insluiten en subsets maken en veel meer, onder beschreven in detail.
pt: O calibre atingiu a versão <b>1.0</b>, sete anos após sua primeira versão e um ano depois do último grande lançamento. Muitas novas funções foram adicionadas ao calibre no último ano &mdash; um visualização de grade de capas, uma nova e mais rápida base de dados, a capacidade de converter arquivos do Word, ferramentas para fazer alterações nos e-books sem necessidade de uma conversão completa, suporte completo a incorporação de fontes e subconjuntos, e muito mais, descrito em detalhes abaixo.
ru: Калибр достиг <b>1.0</b>через семь лет после того, как он был впервые выпущен и через год после последнего основного выпуска. В прошлом году в calibre было добавлено множество новых функций: сетка обложек книг, новая, более быстрая база данных, возможность конвертировать файлы Microsoft Word, инструменты для внесения изменений в электронные книги без необходимости полного преобразования, полная поддержка встраивания и подстановки шрифтов и многое другое, подробно описанное ниже.
sv: calibre har nått <b>1.0</b>, sju år efter att den först släpptes och ett år sedan den senaste stora utgåvan. Massor av nya funktioner har lagts till i calibre under det senaste året &mdash; en rutnätvy av bokomslag, en ny, snabbare databasbackend, möjligheten att konvertera Microsoft Word-filer, verktyg för att göra ändringar i e-böcker utan att behöva göra en fullständig konvertering , fullt stöd för inbäddning och Underuppsättning av teckensnitt, och många fler, beskrivs i detalj nedan.
zh_tw: calibre已经达到了<b>1.0</b>，这是它首次发布的7年，也是上一次 主要发布的一年。去年calibre已增加了许多新功能，包括书籍封面的网 格视图、新的、更快的数据库后端、转换Microsoft Word文件的能力、 无需进行完全转换即可对电子书进行更改的工具、完全支持字体嵌入 和子集设置等，这些功能将在下面详细介绍。

source: A grid view of book covers
nl: Een grid view met boekomslagen
pt: Uma visualização em grelha das capas
ru: Сетка обложек
sv: En rutnätvy av bokomslag
zh_tw: 书籍封面的网格视图

source: calibre now has an optional "grid" view of covers, a convenient way to judge the books in your collection by their covers :) To turn it on, use the button with the icon of a grid on it in the bottom right corner of the main window.
nl: calibre heeft nu een optioneel "grid" zicht op omslagen, een goede manier om boeken in uw verzameling te beoordelen op hun uitzicht :-) Om het aan te zetten, gebruik de knop met het grid icoon in de hoek onder rechts van het hoofdvenster.
pt: O calibre agora possui uma visualização opcional de "grade" de capas, uma maneira conveniente de julgar os livros da sua coleção pela capa :) Para ativá-la, use o botão com o ícone de uma grade no canto direito inferior da janela principal.
ru: calibre теперь имеет опциональный «сеточный» вид обложек, удобный способ судить о книгах в вашей коллекции по их обложкам :) включите его, используйте кнопку со значком сетки в нижнем правом углу главного окна.
sv: calibre har nu en valfri "rutnäts"-vy av omslag, ett bekvämt sätt att bedöma böckerna i din samling efter deras omslag :) För att slå på den, använd knappen med ikonen av ett rutnät i det nedre högra hörnet av huvudfönstret.
zh_tw: Calibre现在有一个可选的封面“网格”视图，这是 一种根据封面判断藏书的便捷方式：)要打开它， 请使用主窗口右下角带有网格图标的按钮。

source: In the finest calibre tradition the view is highly customizable, you can adjust the cover size, the space between covers, choose to display the book title below the covers and even change the background color! All the customization is available via <i>Preferences-&gt;Look &amp; feel-&gt;Cover grid</i>. See the screen shots below.
nl: Volgens de beste calibre traditie is het uitzicht zeeeer aanpasbaar, u kan de omslagafmetingen bijstellen, de ruimte tussen omslagen, de titel van het boek onder de omslagen tonen en zelfs de achtergrondkleur veranderen! Alle aanpassingen zijn beschikbaar via <i>Voorkeuren-&gt;Uitstraling &amp; gevoel-&gt;Omslaggrid</i>. Zie de schermafdrukken onder.
pt: Na melhor tradição do calibre, a visualização é altamente customizável, você pode ajustar o tamanho da capa, o espaço entre capas, optar por mostrar o título do livro abaixo das capas e até mesmo mudar a cor de fundo! Todas as opções estão disponíveis via <i>Preferências-&gt;Aparência-&gt;Grade de capas</i>. Veja as capturas de tela abaixo.
ru: В лучших традициях calibre вид очень настраиваемый, Вы можете настроить размер обложки, расстояние между обложками, выберите отобразить название книги под обложками и даже изменить фоновый цвет! Все настройки доступны через <i>Предпочтения - внешний вид - сетка</i>. Смотрите на снимки экрана ниже.
sv: I den finaste calibre-traditionen är vyn mycket anpassningsbar, du kan justera omslagsstorleken, utrymmet mellan omslag, välja att visa boktiteln under omslagen och till och med ändra bakgrundsfärgen! All anpassning är tillgänglig via <i>Inställningar-&gt;Utseende &amp; känsla-&gt;Omslagsrutnät</i>. Se skärmdumparna nedan.
zh_tw: 在最好的calibre传统视图是高度可定制的，你可以调整封面大小，封面之间的空间， 选择在封面下方显示书名，甚至改变背景色！ 所有的定制都可以通过<i>“首选项”->“外观和感觉”->“封面网格”</i>进行。 请参阅下面的屏幕截图。

source: The default Cover grid, cover sizes are auto adjusted for screen size
nl: De standaard Omslag grid, omslag formaten zijn auto aangepast voor scherm grootte
pt: A grelha predefinida de capas: os tamanhos das capas são ajustados automaticamente para o tamanho do ecrã
ru: По умолчанию в сетке обложек их размеры подстраиваются под размер экрана
sv: Standard omslagsrutnätet, omslagsstorlekar justeras automatiskt för skärmstorlek
zh_tw: 默认封面网格，封面大小根据屏幕大小自动调整

source: Larger covers and titles below the cover
nl: Grotere omslagen en titels onder de omslag
pt: Capas grandes e títulos sob a capa
ru: Увеличенные обложки с названиями под ними
sv: Större omslag och titlar under omslaget
zh_tw: 较大的封面和封面下方的标题

source: A different background color
nl: Een andere achtergrondkleur
pt: Uma cor de fundo diferente
ru: Другой цвет фона
sv: En annan bakgrundsfärg
zh_tw: 不同的背景色

source: A new, faster database backend
nl: Een nieuw, sneller database backend
pt: Uma nova e mais rápida base de dados
ru: Новый, более быстрый движок базы данных
sv: En ny, snabbare databas-backend
zh_tw: 一个新的、速度更快的数据库后端

source: The database backend in calibre has been re-written from scratch. The new code is smaller, more robust and 2-3 times as fast as the old code. No pretty pictures for this, but those of you that have large book collections should appreciate the speed.
nl: De database backend in calibre is compleet herschreven. De nieuwe code is kleiner, robuuster en 2-3 keer sneller als de oude. Geen mooie foto's hiervan maar diegenen met een grote verzameling zouden de snelheid op prijs moeten stellen.
pt: A base de dados do calibre foi reescrita do zero. O novo código é menor, mais robusto e 2-3 mais rápido que o código antigo. Sem fotos bonitas para isso, mas aqueles que possuem um grande coleção de livros devem apreciar a velocidade.
ru: База данных в calibre была переписана с нуля. Новый код стал меньше, надежнее и в 2-3 раза быстрее чем старый код. Нет красивых картинок для этого, но те из вас, у которых большие коллекции книг оценят скорость.
sv: Databasens backend i calibre har skrivits om från början. Den nya koden är mindre, mer robust och 2-3 gånger så snabb som den gamla koden. Inga vackra bilder för detta, men de av er som har stora boksamlingar bör uppskatta hastigheten.
zh_tw: calibre中的数据库后端已经从头开始重新编写。 新代码更小，更健壮，速度是旧代码的2-3倍。 没有漂亮的图片，但你们中那些有大量藏书的人应该欣赏这种速度。

source: Virtual libraries
nl: Virtuele bibliotheken
pt: Bibliotecas virtuais
ru: Виртуальные библиотеки
sv: Virtuella bibliotek
zh_tw: 虛擬書庫

source: Virtual libraries allow you to easily partition your large calibre library into smaller, "virtual" libraries. A Virtual library is a way to tell calibre to open only a subset of a normal library. For example, you might want to only work with books by a certain author, or books having only a certain tag. To use this feature, click the button labeled <i>Virtual library</i> to the left of the Search bar. For details, see <a href="%(vl)s">Virtual libraries in the User Manual</a>. You can even have calibre display the Virtual libraries as tabs above the book list, as shown in the screen shots below.
nl: Virtuele bibliotheken laten u toe uw grote calibre bibliotheek gemakkelijk in kleinere, "virtuele" bibliotheken op te delen. Een Virtuele bibliotheek is een manier om calibre te zeggen enkel een subset te openen. Bv. u wil enkel werken met boeken van een bepaalde auteur, of boeken met een bepaald label. Om deze optie te gebruiken, klik op de knop <i>Virtuele bibliotheek</i> links van de zoekwerkbalk. Voor details, kijk op <a href="%(vl)s">Virtuele bibliotheken in de Handleiding</a>. U kan calibre zelfs de Virtuele bibliotheken laten tonen als tabs boven de boekenlijst, zoals getoond in de schermafdrukken onder.
pt: Bibliotecas virtuais permitem você particionar facilmente sua grande biblioteca do calibre em bibliotecas menores, "virtuais". Uma Biblioteca virtual é uma maneira de dizer ao calibre para abrir apenas um subconjunto de uma biblioteca normal. Por exemplo, apenas livros de um certo autor, ou livros tendo uma certa etiqueta. Para usar essa função, clique no botão <i>Biblioteca virtual</i> à esquerda da barra de pesquisa. Para detalhes, veja <a href="%(vl)s">Bibliotecas virtuais no Manual do Usuário</a>. O calibre pode até exibir as Bibliotecas virtuais como abas acima da lista de livros, como mostrado nas capturas de tela abaixo.
ru: Виртуальные библиотеки позволяют легко разбивать ваши большие библиотека на меньшие, «виртуальные» библиотеки. Виртуальная библиотека это способ сказать calibre, чтобы открыть только подмножество нормальной библиотеки. Например, вы можете работать с книгами только определенного автора, или книгами, имеющими только определенный тег. Чтобы использовать это нажмите кнопку с меткой <i>Виртуальная библиотека</i>, слева от панели поиска. Подробнее см. <a href="%(vl)s">Виртуальные библиотеки в руководстве пользователя</a>. Вы даже можете иметь отображать Виртуальные библиотеки в виде вкладок над списком книг, как показано на скриншотах ниже.
sv: Virtuella bibliotek gör att du enkelt kan partitionera ditt stora calibre-bibliotek i mindre "virtuella" bibliotek. Ett virtuellt bibliotek är ett sätt att tala om för calibre att endast öppna en delmängd av ett normalt bibliotek. Till exempel kanske du bara vill arbeta med böcker av en viss författare eller böcker som bara har en viss tagg. Om du vill använda den här funktionen klickar du på knappen <i>Virtuellt bibliotek</i> till till vänster om sökfältet. För mer information, se <a href="%(vl)s">Virtuella bibliotek i användarmanualen</a>. Du kan till och låta calibre visa virtuella biblioteken som flikar ovanför boklistan, som visas i skärmbilderna nedan.
zh_tw: “虚拟书库”允许您轻松地将大的calibre书库划分为更小的“虚拟”书库。 “虚拟书库”是一种告诉calibre只打开普通库的一个子集的方法。 例如，您可能希望只处理由某个作者编写的书籍，或只使用特定标记的书籍。 要使用此功能，请单击“搜索栏”左侧标记为<i>“虚拟书库”</i>的按钮。 有关详细信息，请参阅<a href="%(vl)s">用户手册中的“虚拟书库”</a>。 您甚至可以让calibre将“虚拟书库”显示为图书列表上方的选项卡，如下面的屏幕截图所示。

source: Virtual Libraries: Easily work with subsets of the full collection
nl: Virtuele Bibliotheken: Werk gemakkelijk met subsets van de volledige collectie
pt: Bibliotecas Virtuais: trabalhar facilmente com subconjuntos da coleção completa
ru: Виртуальные библиотеки: лёгкая работа с подмножествами полной коллекции
sv: Virtuella bibliotek: arbeta enkelt med delar av hela samlingen
zh_tw: 虚拟图书馆：轻松处理完整馆藏的子集

source: Another Virtual Library, notice the tabs above the books
nl: Nog een Virtuele Bibliotheek, let op de tabs boven de boeken
pt: Outra biblioteca virtual, note as abas acima dos livros
ru: Другая виртуальная библиотека (обратите внимание на вкладки над книгами)
sv: Ett annat virtuellt bibliotek, notera flikarna ovanför böckerna
zh_tw: 另一个虚拟书库，请注意图书上方的选项卡

source: Can be created from tags, authors, any search calibre is capable of
nl: Kan gecreëerd worden van tags, auteurs, elke zoekopdracht die calibre kan
pt: Pode ser criada a partir de etiquetas, autores e de qualquer pesquisa que o Calibre possa executar
ru: Может создаваться из тегов, авторов, любого способа поиска в calibre
sv: Kan skapas från taggar, författare, sökningar i calibre är kapabel till
zh_tw: 可以从标签、作者、任何搜索能力范围创建

source: Conversion of Microsoft Word documents
nl: Conversie van Microsoft Word documenten
pt: Conversão de documentos Microsoft Word
ru: Преобразование документов Microsoft Word
sv: Konvertering av Microsoft Word-dokument
zh_tw: 转换 Microsoft Word 文档

source: calibre can now convert Microsoft Word documents (.docx files, generated by Word 2007 or newer). The converter is comprehensive, with support for lists, tables, images, all types of text formatting, footnotes, endnotes and even dropcaps. A sample docx file showing the capabilities of the converter is available: <a href="%(demo)s">demo.docx</a>. Just add it to calibre and convert it to EPUB or AZW3 and see what the conversion engine is capable of.
nl: calibre can nu Microsoft Word documenten converteren (.docx bestanden, gegenereerd door Word 2007 of recenter). De converter is uitvoerig, met ondersteuning voor lijsten, tabellen, afbeeldingen, alle types tekst formattering, voetnoten, eindnoten en zelfs kapitalen. Een voorbeeld docx bestand dat de mogelijkheden van de converter toont, is beschikbaar: <a href="%(demo)s">demo.docx</a>. Voeg het gewoon toe aan calibre en converteer het naar EPUB of AZW3 en zie wat de conversie engine kan.
pt: O calibre agora pode converter documentos do Word (arquivos .docx, gerados pelo Word 2007 ou mais novo). O conversor é abrangente, com suporte para listas, tabelas, imagens, todo tipo de formatação de texto, notas de rodapé, notas de fim e mesmo capitulares. Um arquivo docx mostrando as capacidades do conversor está disponível: <a href="%(demo)s">demo.docx</a>. Apenas adicione-o ao calibre e converta-o para EPUB ou AZW3 e veja o que o mecanismo de conversão é capaz.
ru: Теперь calibre может преобразовывать документы Microsoft Word (файлы .docx, созданные в Word 2007 или новее). Конвертер всеобъемлющий, с поддержкой списков, таблиц, изображений, всех стилей оформления текста, сносок, концевых сносок и даже буквиц. Пример docx файла, показывающего возможности конвертера, доступен здесь: <a href="%(demo)s">demo.docx</a>. Просто добавьте его в calibre и преобразуйте в EPUB или AZW3, чтобы посмотреть, на что способен движок.
sv: calibre kan nu konvertera Microsoft Word-dokument (.docx-filer, skapas av Word 2007 eller nyare). Konverteraren är omfattande, med stöd för listor, tabeller, bilder, alla typer av text formatering, fotnoter, slutnoter och även dropcaps. En prov-docx- fil som visar funktionerna i konverteraren är tillgänglig: <a href="%(demo)s">demo.docx</a>. Lägg bara till den i calibre och konvertera den till EPUB eller AZW3 och se vad omvandlingsmotorn är kapabel till.
zh_tw: calibre现在可以转换Microsoft Word文档（.docx文件，由Word 2007或更新版本生成）。 该转换器功能全面，支持列表、表格、图像、所有类型的文本格式、脚注、尾注，甚至是首字母大写。 可以获得显示转换功能的示例docx文件：<a href="%(demo)s">demo.docx</a>。 只需将其添加到Calibre并将其转换为EPUB或AZW3，然后查看转换引擎的能力。

source: New metadata download sources
nl: Nieuwe metadata download bronnen
pt: Novas fontes para descarregar metadados
ru: Новые источники загрузки метаданных
sv: Nya metadatahämtningskällor
zh_tw: 新的後設資料下載來源
