Repository: debian-calibre/calibre
Catalog: translations-git/website/*.po
Languages: nl, pt, ru, sv, zh_tw

source: The up-to-date list of dependencies that the official calibre binaries are bundled with, can be seen in <a href="%(href)s">%(sj)s</a>. While calibre <i>might</i> work with versions of dependencies other than those listed there, it is not tested/supported. In addition to those dependencies various build time requirements such as pkg-config, a C/C++ compiler, etc are needed.
nl: De up-to-date lijst van afhankelijkheden waarmee de officiële binairies van calibre gebundeld zijn, is te zien op <a href="%(href)s">%(sj)s</a>. Hoewel calibre <i>kan</i> werken met andere versies van afhankelijkheden dan vermeld in de lijst, wordt het niet getest/ondersteund. Naast die afhankelijkheden zijn er verschillende vereisten tijdens het bouwen, zoals pkg-config, een C/C ++ compiler, enzovoort.
pt: A lista atualizada de dependências que são empacotadas juntamente com os binários oficiais do Calibre, pode ser vista em <a href="%(href)s">%(sj)s</a>. Embora o Calibre <i>possa</i> funcionar com outras versões das dependências listadas, tal não é testado/suportado. Além dessas dependências, são necessários vários recursos de compilação, como pkg-config, um compilador C/C++, etc.
ru: Текущий список зависимостей для официальных исполняемых файлов calibre, можно посмотреть в <a href="%(href)s">%(sj)s</a>. Хотя calibre <i>должна</i> работать и с зависимостями, версии которых отличаются от указанных, эта возможность не проверялась и не поддерживается. Кроме самих зависимостей во время сборки необходимы, например, pkg-config, компилятор C/C++ и т. д.
sv: Den aktuella listan över beroenden som medföljer de officiella calibre-binärerna kan ses i <a href="%(href)s">%(sj)s</a>. Även om calibre <i>kan</i> fungera med andra versioner av beroenden än de som listas där, testas/stöds det inte. Utöver dessa beroenden behövs olika byggtidskrav som pkg-config, en C/C++-kompilator o.s.v.
zh_tw: 官方的 calibre 二進位版已經包含了最新版相依性的清單在內，可以在<a href="%(href)s">%(sj)s</a>檢視。 雖然 calibre<i>可能</i>使用了在清單所列出以外的版本還是可以運作，但是並未經過測試、也不受支援。 另外，這些相依性在編譯期間需要使用像是 pkg-config、 C/C++ 之類的編譯器來進行作業。

source: Donate to calibre
nl: Doneer aan calibre
pt: Donativo ao Calibre
ru: Пожертвовать на calibre
sv: Donera till calibre
zh_tw: 贊助 calibre

source: calibre is a result of the efforts of many volunteers from all over the world. If you find it useful, please consider contributing to support its development. Your contribution helps keep calibre development alive. You can pay using credit cards, PayPal or Patreon.
nl: calibre is een gevolg van de inspanningen van vele vrijwilligers van over de hele wereld. Vindt u het nuttig? Overweeg a.u.b. een donatie om de ontwikkeling te ondersteunen. Uw bijdrage helpt de calibre ontwikkeling levend te houden. U kan betalen met kredietkaarten, PayPal of Patreon.
pt: O Calibre é o resultado do esforço de muitos voluntários de todo o mundo. Se você achar útil, por favor, considere contribuir para ajudar no seu desenvolvimento. A sua contribuição ajuda a manter vivo o desenvolvimento do Calibre. Pode pagar através de cartão de crédito, PayPal ou Patreon.
ru: calibre — это результат усилий многих добровольцев со всего мира. Если вы считаете программу полезной, пожалуйста, подумайте о возможности поддержать её разработку. Пожертвования помогают развитию calibre. Оплачивать можно кредитными карты, через PayPal или Patreon.
sv: calibre är ett resultat av insatser från många volontärer från hela världen. Om du tycker att det är användbart, överväg att bidra till att stödja dess utveckling. Ditt bidrag hjälper till att hålla utvecklingen av calibre vid liv. Du kan betala med kreditkort, PayPal eller Patreon.
zh_tw: calibre 是来自世界各地的许多志愿者共同努力的结果。如果你觉得它有用，请考虑捐助支持它的发展。您的捐赠有助于 calibre 保持开发的活力。您可以使用信用卡、贝宝（PayPal）或Patreon支付。

source: Thank you.
nl: Dank u.
pt: Obrigado.
ru: Спасибо.
sv: Tack.
zh_tw: 謝謝你。

source: If you would like to contribute regularly to calibre, you can become a calibre patron, by using the <a href="%(pat)s">Patreon service</a>, the <a href="%(gh)s">GitHub Sponsors service</a> or the <a href="%(librepay)s">Liberapay service</a>.
nl: Als u calibre regelmatig wil steunen, kan u calibre patroon worden door gebruik van de <a href="%(pat)s">Patreon service</a>, de <a href="%(gh)s">GitHub Sponsors service</a> of de <a href="%(librepay)s">Liberapay service</a>.
pt: Se pretender contribuir regularmente para o Calibre, você pode tornar-se um patrono do Calibre, utilizando o<a href="%(pat)s">serviço Patreon</a>, o <a href="%(gh)s">serviço GitHub Sponsors</a> ou o <a href="%(librepay)s">serviço Liberapay</a>.
ru: Если вы хотите регулярно вносить свой вклад в calibre, вы можете стать патроном, используя <a href="%(pat)s">Patreon</a>, <a href="%(gh)s">GitHub Sponsors</a> или <a href="%(librepay)s">Liberapay</a>.
sv: Om du vill bidra regelbundet till calibre kan du bli en beskyddare av calibre genom att använda <a href="%(pat)s">Patreon-</a>, <a href="%(gh)s">GitHub-sponsor-</a> eller <a href="%(librepay)s">Liberapay-tjänsten</a>.
zh_tw: 如果您想定期向 calibre 捐款，可以通过<a href="%(pat)s">Patreon 服务</a> ，<a href="%(gh)s">GitHub Sponsors 服务</a>或 <a href="%(librepay)s">Liberapay 服务</a>成为 calibre 赞助人。

source: Watch calibre in action
nl: Zie calibre in actie
pt: Ver Calibre em ação
ru: Посмотрите на calibre в действии
sv: Se calibre i aktion
zh_tw: 观看 calibre 操作

source: Click to watch calibre demo
nl: Klik om een calibre demo te zien
pt: Clique para vídeo de demonstração do Calibre
ru: Нажмите, чтобы посмотреть ролик о calibre
sv: Klicka för att se calibre-demo
zh_tw: 點擊以觀看 calibre 展示

source: calibre is the one stop solution to all your e-book needs
nl: calibre is de één-stop-oplossing voor al uw e-boekbehoeften
pt: Calibre é a solução final para todas as suas necessidades de livros digitais
ru: calibre — универсальное решение для ваших электронных книг
sv: calibre är en samlad lösning för alla dina e-bokbehov
zh_tw: Calibre是满足您所有电子书需求的一站式解决方案

source: Download calibre
pt: Descarregar Calibre
ru: Скачать calibre
sv: Hämta calibre
zh_tw: 下載 calibre

source: Get involved
nl: Help mee
pt: Colaborar
ru: Присоединиться
sv: Bli involverad
zh_tw: 加入我們的行列

source: Grand tour of calibre
nl: De grote calibre tour
pt: Visita guiada ao Calibre
ru: Видеообзор calibre
sv: Rundtur av calibre
zh_tw: calibre 大巡演

source: About
nl: Over
pt: Sobre
ru: Подробнее
sv: Om
zh_tw: 關於

source: About calibre
nl: Over calibre
pt: Sobre o Calibre
ru: О сalibre
sv: Om calibre
zh_tw: 關於 calibre

source: A brief description of calibre's many features
nl: Een korte beschrijving van calibre's vele functies
pt: Uma descrição breve das várias funcionalidades do Calibre
ru: Краткое описание возможностей calibre
sv: En kort beskrivning av calibres många funktioner
zh_tw: 一個簡單關於 calibre 眾多功能的敘述。

source: Features
nl: Eigenschappen
pt: Funcionalidades
ru: Возможности
sv: Funktioner
zh_tw: 功能

source: A history of the development of calibre
nl: Een geschiedenis van de ontwikkeling van calibre
pt: História do desenvolvimento do Calibre
ru: История создания calibre
sv: En historia över utvecklingen av calibre
zh_tw: calibre 開發的歷史

source: History
nl: Geschiedenis
pt: História
ru: История
sv: Historia
zh_tw: 歷史

source: The best ways to contact the calibre team
nl: De beste manieren om het calibre team te contacteren
pt: As melhores formas para contactar a equipa Calibre
ru: Лучшие способы связаться с командой calibre
sv: De bästa sätten att kontakta calibre-teamet
zh_tw: 聯絡 calibre 的最好方法

source: Contact
pt: Contacto
ru: Обратная связь
sv: Kontakt
zh_tw: 聯絡我們

source: A list of contributors to the calibre community
nl: Een lijst met medewerkers aan de calibre gemeenschap
pt: Uma lista de colaboradores da comunidade Calibre
ru: Список участников сообщества calibre
sv: En lista över bidragsgivare till calibre-gemenskapen
zh_tw: 對 calibre 社群的貢獻者清單

source: Contributors
nl: Medewerkers
pt: Colaboradores
ru: Участники
sv: Bidragsgivare
zh_tw: 貢獻者

source: Mentions of calibre in the press
nl: Vermeldingen van calibre in de pers
pt: Referências ao Calibre nos media
ru: Упоминания о calibre в прессе
sv: Uppmärksammanden av calibre i media
zh_tw: 提到 calibre 的媒體

source: Press
nl: Pers
pt: Imprensa
ru: Пресса
sv: Media
zh_tw: 報刊評論

source: <b>calibre is a powerful and easy to use e-book manager</b>. Users say it’s <i>outstanding</i> and a <i>must-have</i>. It’ll allow you to do nearly everything and it takes things a step beyond normal e-book software. It’s also <b>completely free</b> and <i>open source</i> and great for both <b>casual users</b> and computer experts.
nl: <b>calibre is een krachtige en eenvoudig te gebruiken e-boekmanager</b>. Gebruikers zeggen dat het <i>voortreffelijk</i> en een <i>moet hebben</i> is. Hiermee kunt u bijna alles doen en het gaat een stap verder dan de normale e-boek software. Het is ook <b>volledig gratis</b> en <i>open source</i> en geweldig voor zowel <b>normale gebruikers</b> als computerdeskundigen.
pt: O <b>Calibre é um gestor de ebooks</b> poderoso e fácil de usar. Os utilizadores dizem que é <i>impressionante</i> e um item <i>obrigatório</i>. O programa permite-lhe fazer praticamente tudo com os ebooks e eleva o seu trabalho a um nível acima de um software de ebooks normal. Também é <b>completamente grátis</b> e de <i>código aberto</i>, sendo perfeito quer para <b>utilizadores ocasionais</b> quer para especialistas em informática.
ru: <b>calibre — мощная и простая программа по управлению электронными книгами</b>. Пользователи говорят <i>«замечательная»</i> и <i>«необходимая»</i>. Она позволяет вам делать практически всё и идёт на шаг впереди обычных программ для электронных книг. Ещё она <b>полностью бесплатна</b>, с <i>открытым исходным кодом</i> и хороша как для <b>простых пользователей</b>, так и для компьютерных экспертов.
sv: <b>calibre är en kraftfull och lättanvänd e-bokhanterare</b>. Användare säger att den är <i>enastående</i> och <i>behövlig</i>. Den låter dig göra nästan allt och den tar saker ett steg utöver vanlig e-bokprogramvara. Den är också <b>helt gratis</b> och med <i>öppen källkod</i> och utmärkt för både <b>vanliga användare</b> och datorexperter.
zh_tw: <b>calibre 是一款功能强大且易于使用的电子书管理器</b>。用户表示，它很<i>出色</i> 是<i>必备的</i>。它将允许你做几乎所有的事情，而且比普通的电子书软件更加先进。它也是 <b>完全免费</b>和 <i>开源</i> 的，非常适合 <b>普通用户</b> 和计算机专家。

source: Save time on managing your e-book collection
nl: Bespaar tijd bij het beheer van uw e-boek collecties
pt: Poupe tempo na gestão dos seus livros digitais
ru: Экономьте время, управляя коллекцией электронных книг
sv: Spara tid på att hantera din e-boksamling
zh_tw: 節省管理電子書的時間

source: calibre’s user interface is designed to be as simple as possible. <b>Large buttons</b> in the main window take care of most of your needs. The vast number of calibre’s features and options is always clearly displayed under <b>intuitive tabs</b>. Its context menus are neatly sorted, so the things you’re looking for almost find themselves on their own. <b>You’re never more than three clicks away from your goal.</b> It’s the result of years of tweaking calibre’s interface based on users’ feedback. Plus, you can change many aspects of how calibre looks and feels, and try one of the three built-in library views to browse your book collection using covers, titles, tags, authors, publishers, etc.
nl: calibre’s gebruikersinterface is ontworpen om zo simpel als mogelijk te zijn. <b>Grote knoppen</b> in het hoofdvenster zorgen voor de meeste van uw noden. Het grote aantal calibre functies en opties is altijd duidelijk getoond in </b>intuitievetabs</b>. Z'n context menu's zijn netjes gesorteerd, zodat de dingen waarnaar u zoekt bijna zichzelf vinden. <b>U bent nooit meer dan drie klikken weg van uw doel.</b> Het is het resultaat van jaren tweaken aan calibre’s interface gebaseerd op gebruikers feedback. Plus, u kan vele aspecten van calibre's looks en feels veranderen en een van de drie ingebouwde bibliotheekweergaves proberen om door uw boek verzameling te bladeren via omslagen, titels, labels, auteurs, uitgevers, enz.
pt: A interface de utilizador do Calibre é desenhada para ser o mais simples possível. <b>Botões grandes</b> na janela principal tratam da maioria das suas necessidades. O vasto número de recursos e opções do Calibre é sempre claramente exibido sob <b>abas intuitivas</b>. Os seus menus de contexto são bem organizados de forma que o que você procura quase é encontrado por si mesmo. <b>Nunca está a mais de três cliques do seu objetivo.</b> É o resultado de anos ajustando a interface do Calibre baseado na opinião dos utilizadores. Além disso, você pode alterar vários aspetos da aparência do Calibre e tentar uma das três visualizações predefinidas de bibliotecas para navegar na sua coleção de livros utilizando capas, títulos, etiquetas, autores, editoras, etc.
ru: Пользовательский интерфейс calibre разработан, чтобы быть как можно проще. <b>Крупные кнопки</b> главного окна охватят большинство ваших потребностей. Огромное количество функций и опций calibre всегда чётко отображается на <b>интуитивно понятных вкладках</b>. Контекстные меню аккуратно отсортированы, так что вещи, которые вы ищете, практически сами себя находят. <b>Вы никогда не будете дальше трёх щелчков от своей цели.</b> Это результат многолетнего улучшения интерфейса calibre на основании отзывов пользователей. Кроме того, вы можете менять разные аспекты оформления calibre и попробовать любой из трёх встроенных режимов библиотеки для просмотра коллекции книг, используя обложки, названия, теги, авторов, издательства и т. д.
sv: calibres användargränssnitt är utformat för att vara så enkelt som möjligt. <b>Stora knappar</b> i huvudfönstret tar hand om de flesta av dina behov. Det stora antalet av calibres funktioner och alternativ visas alltid tydligt under <b>intuitiva flikar</b>. Dess kontextmenyer är snyggt sorterade, så att sakerna du letar efter nästan hittar sig själva. <b>Du är aldrig mer än tre klick borta från ditt mål.</b> Det är resultatet av år av justeringar av calibres gränssnitt baserat på användarnas återkoppling. Dessutom kan du ändra många aspekter av hur calibre ser ut och känns och testa en av de tre inbyggda biblioteksvyerna för att bläddra i din boksamling med omslag, titlar, taggar, författare, utgivare o.s.v.
zh_tw: calibre 的用户界面设计得尽可能简洁。主窗口中的 <b>大按钮</b> 可以满足您的大部分需求。 calibre的大量功能和选项 总是清晰地显示在<b>直观的选项卡 </b>下 它的上下文菜单排列整齐， 因此，你要查找的内容几乎都能自行找到。 <b>你离目标的距离永远不会超过三次点击。</b> 这是多年来根据用户的反馈，对calibre的界面 进行调整的结果。此外，你还可以改变calibre的 许多方面外观和感觉，并尝试三种内置书库 视图中的一种， 使用封面、标题、标签、 作者、出版商等浏览您的藏书。

source: calibre not only can <b>download all the metadata</b> for an e-book (things like title, author, publisher, ISBN, tags, cover or summary) but will also allow you to edit or create metadata in existing or new fields. That way you can track which books you’ve read and which ones you liked. You can also take advantage of the <b>advanced search and sorting</b> functions that use tags, authors, comments and more. You will find the book you were looking for in seconds!
nl: calibre kan niet alleen <b>alle de metadata downloaden</b> voor een e-boek (dingen zoals titel, auteur, uitgever, ISBN, labels, omslag of samenvatting) maar laat u ook toe metadata te creëren of bewerken in bestaande of nieuwe velden. Zo kan u bijhouden welke boeken u gelezen heeft en u bevielen. U kan ook uw voordeel doen met de <b>geavanceerde zoek en sorteer</b> functies die labels, auteurs, commentaren en meer gebruiken. U vindt het boek dat u zocht in seconden!
pt: O Calibre pode, não apenas <b>descarregar todos os metadados</b> de um ebook (dados como título, autor, editora, ISBN, etiquetas, capa ou descrição) mas também permite que você edite ou crie metadados em campos existentes ou novos. Desta forma pode acompanhar quais os livros que leu e os de quais gostou. Também pode tirar vantagem das funções de <b>pesquisa avançada e ordenação</b> em etiquetas, autores, comentários, e muito mais. Encontrará em segundos o livro que estiver à procura!
ru: calibre может не только <b>загрузить все метаданные</b> для электронной книги (например, название, автора, издательство, ISBN, теги, обложку или аннотацию), но и позволит редактировать или создать метаданные в существующих или новых полях. Так вы сможете отслеживать прочитанные и понравившиеся книги. Вы также можете воспользоваться преимуществом <b>расширенных функций поиска и сортировки</b> по тегам, авторам, комментариям и т. д. и найти искомую книгу в считанные секунды!
sv: calibre kan inte bara <b>hämta alla metadata</b> för en e-bok (sådant som titel, författare, utgivare, ISBN, taggar, omslag eller sammanfattning) men låter dig också redigera eller skapa metadata i befintliga eller nya fält. På så sätt kan du spåra vilka böcker du har läst och vilka du gillade. Du kan också dra nytta av <b>avancerade sök- och sorterings</b>funktioner som använder taggar, författare, kommentarer och mer. Du hittar boken du sökte efter på några sekunder!
zh_tw: Calibre 不僅可以下載電子書的<b>所有後設資料</b>（如標題、作者、出版商、ISBN、標籤、封面或摘要），還可以在現有或新的電子書中編輯或建立後設資料。這樣就可以追蹤哪些書讀過，哪些書喜歡。還可以利用使用標籤、作者、評論等的<b>進階搜尋和排序</b>功能。幾秒鐘內就能找到要找的那本書！

source: Use it everywhere and with anything
nl: Gebruik het overal en met alles
pt: Use-o em qualquer local e com qualquer dispositivo
ru: Пользуйтесь везде и на чём угодно
sv: Använd den överallt och med allt
zh_tw: 不論何時何地都可以使用 calibre

source: calibre supports almost <b>every single e-reader</b> and is compatible with more devices with every update. You can transfer your e-books from one device to another in seconds, <b>wirelessly</b> or with a cable. And you don’t need any additional tools to do that. calibre will send the <b>best file format</b> for your device converting it if needed, automatically.
nl: calibre ondersteunt bijna <b>elke e-reader</b> en is compatibel met meer toestellen bij elke update. U kan uw e-boeken in seconden naar een ander toestel overzetten, <b>draadloos</b> of met een kabel. En u hebt geen andere bijkomend gereedschap nodig daarvoor. calibre stuurt het <b>beste bestandsformaat</b> voor uw toestel, converterend indien nodig, automatisch.
pt: O Calibre suporta quase <b>todos os leitores digitais</b> e torna-se compatível com mais dispositivos a cada atualização. Você pode transferir os seus ebooks de um dispositivo para outro em segundos, por ligação <b>sem fios</b> ou através de um cabo. E não precisa de nenhuma ferramenta adicional para isso. O Calibre irá enviar o <b>melhor formato de livro</b> para o seu dispositivo, convertendo-o automaticamente, se necessário
ru: calibre поддерживает практически <b>все электронные читалки</b> и с каждым обновлением совместима с ещё большим количеством устройств. Вы можете передать свои электронные книги с одного устройства на другое в считанные секунды по <b>беспроводной сети</b> или кабелю, и для этого вам не понадобятся какие-либо дополнительные инструменты. calibre перешлёт <b>наилучший формат файла</b> для вашего устройства, при необходимости автоматически преобразовав его.
sv: calibre stöder nästan <b>alla e-bokläsenheter</b> och blir kompatibel med fler enheter för varje uppdatering. Du kan överföra dina e-böcker från en enhet till en annan på några sekunder, <b>trådlöst</b> eller med en kabel. Och du behöver inga ytterligare verktyg för att göra det. calibre kommer att överföra det <b>bästa filformatet</b> för din enhet och konverterar det om det behövs, automatiskt.
zh_tw: calibre 几乎支持 <b>每一款电子书阅读器</b> ，并且 每次更新都能兼容更多的设备。 您可以在几秒钟内通过<b>无线</b>或电缆将电子书 从一台设备传输到另一台设备。而且，做到这些，你不 需要任何额外的工具。如果需要的话， calibre 将根据适合设备的<b>最佳文件格式</b> 进行自动转换并发送。

source: No matter what PC, laptop or tablet you use, calibre’s got you covered. If you’re traveling and don’t have your device with you – you can take calibre on a USB stick and <b>use it wherever you are</b>. Or run the calibre Content server and read your books anywhere, on any device.
nl: Eerder welke PC, laptop of tablet u gebruikt, calibre helpt u voort. Bent u op reis en hebt u uw toestel niet bij – u kan calibre meenemen op een USB stick en <b>gebruik het waar u ook bent</b>. Of draai de calibre Content server en lees uw boeken overal, op elk toestel.
pt: Não importa se usa PC, portátil ou tablet, o Calibre cuida de si. Se estiver em viagem e sem o seu dispositivo – pode levar o Calibre num disco USB e <b>usá-lo onde quer que esteja</b>. Ou então executar o servidor de conteúdos Calibre e ler os seus livros em qualquer lado ou local
ru: Независимо от того, какой ПК, ноутбук или планшет вы используете, calibre покрывает этот сценарий. Если вы путешествуете и у вас нет вашего устройства с собой - вы можете взять calibre на флешку и использовать его, <b>где бы вы ни находились</b>. Или запустите контент-сервер calibre и прочтите ваши книги где угодно и на любом устройстве.
sv: Oavsett vilken PC, bärbar dator eller surfplatta du använder, calibre täcker dina behov. Om du reser och inte har din enhet med dig – kan du ta med dig calibre på ett USB-minne och <b>använda det var du än är</b>. Eller kör calibre-innehållsservern och läs dina böcker var som helst, på vilken enhet som helst.
zh_tw: 无论使用哪种PC、笔记本电脑或平板电脑，calibre 都能满足您的需求。如果在旅行时没有随身携带您的设备，可以随身携带U盘上的calibre ， <b>随时随地使用</b>，或连接到运行calibre 的内容服务器，在任何地方、任何设备上阅读。

source: calibre can convert dozens of file types. No matter where you got your e-book from, it’ll be ready for your device in no time. When converting, you can also automatically change the book’s style, create a table of contents or improve punctuation and margins. calibre will also detect the format that’s best suited for your device on its own, so you don’t have to bother.
nl: calibre kan tientallenbestandstypes converteren. Eerder waar u uw e-boek haalde, het is klaar voor uw toestel in geen tijd. Bij converteren kan u ook automatisch Het boek z'n stijl aanpassen, een inhoudstabel maken of interpunctie en marges verbeteren. calibre detecteert ook zelf het formaat dat het best geschikt is voor uw toestel zodat u daar niet naar moet omkijken.
pt: O Calibre pode converter dezenas de tipos de ficheiros. Não importa de onde obteve o seu ebook, ele estará pronto para o seu dispositivo rapidamente. Ao converter, você também pode alterar automaticamente o estilo do livro, criar um índice ou melhorar a pontuação e margens. O Calibre também irá detetar automaticamente o melhor formato para o seu dispositivo, de maneira que você não precise se preocupar.
ru: calibre умеет преобразовывать десятки типов файлов. Откуда бы вы ни получили электронную книгу, она будет подготовлена для вашего устройства почти мгновенно. Во время преобразования вы можете автоматически изменить стиль книги, добавить оглавление или поправить пунктуацию и поля. Также calibre самостоятельно определит наиболее подходящий для вашего устройства формат, можете об этом не беспокоиться.
sv: calibre kan konvertera dussintals filtyper. Oavsett varifrån du fick din e-bok kommer den att vara redo för din enhet på nolltid. Vid konvertering kan du också automatiskt ändra bokens formatering, skapa en innehållsförteckning eller förbättra skiljetecken och marginaler. calibre kommer också att upptäcka det format som passar bäst för din enhet på egen hand, så du behöver inte fundera på det.
zh_tw: calibre 可以转换数十种文件类型。无论从哪里买到的电子书，它很快就会为你的设备做好准备。转换时，还可以自动更改书本样式、创建目录或改进标点符号和页边距。calibre 还将自动检测最适合您的设备的格式，因此不必费心。
