Repository: debian-calibre/calibre
Catalog: translations-git/website/*.po
Languages: nl, pt, ru, sv, zh_tw

source: You can prevent the installer from asking for an install location by running it with a command line argument pointing to the directory for the install. For example:
nl: U kunt voorkomen dat het installatieprogramma een ​​installatielocatie vraagt door het uit te voeren met een opdrachtregelargument verwijzend naar de installatielocatie. Bijvoorbeeld:
pt: Pode realizar uma instalação silenciosa, e evitar que o instalador pergunte por um local de instalação, executando-o através de linha de comando apontando para a pasta de instalação. Por exemplo:
ru: Можно запретить установщику спрашивать о месте установки, запустив его с аргументом командной строки, указывающим нужный каталог. Например:
sv: Du kan förhindra installationsprogrammet från att fråga efter en installationsplats genom att köra det med ett kommandoradsargument som hänvisar till mappen för installationen. Till exempel:
zh_tw: 如果你不想讓安裝檔詢問安裝位置，請使用命令列執行並傳遞指向安裝目錄的參數給安裝檔。例如:

source: Multiple libraries
nl: Meerdere bibliotheken
pt: Bibliotecas múltiplas
ru: Несколько библиотек
sv: Flera bibliotek
zh_tw: 複數個數庫

source: calibre Portable only remembers libraries that are placed inside the portable folder. So while you can open any library located anywhere on your computer with calibre Portable, it will not be remembered on restart unless it is located in the portable folder (i.e. in the same place as the "Calibre Library" folder).
nl: calibre Draagbaar onthoudt alleen bibliotheken geplaatst in de draagbare map. Dus hoewel u elke bibliotheek eender waar op uw computer met calibre Draagbaar kunt openen, wordt deze niet onthouden bij herstarten, tenzij ze zich in de draagbare map bevindt (d.w.z. op dezelfde plaats als de map "Calibre Bibliotheek").
pt: Calibre Portable apenas memoriza bibliotecas que estejam localizadas dentro da pasta portátil. Assim, apesar de poder utilizar o Calibre Portable para abrir qualquer biblioteca no seu computador, localizada onde quer que seja, tal não será memorizado para a próxima vez que iniciar o programa. Apenas são memorizadas bibliotecas que estejam localizadas na pasta portátil (isto é, no mesmo local da pasta "BibliotecaCalibre").
ru: Переносимая версия calibre запоминает только те библиотеки, которые находятся в переносимой папке. Поэтому, хотя вы можете открыть любую библиотеку, расположенную на компьютере где угодно, calibre после перезапуска не будет её помнить, если она не находится в переносимой папке (т. е. в том же месте, что и папка «Calibre Library»).
sv: calibre Portable kommer bara ihåg bibliotek som placeras inuti den bärbara mappen. Så medan du kan öppna ett bibliotek som ligger var som helst på din dator med calibre Portable, kommer den inte att komma ihåg vid omstart om den inte finns i den bärbara mappen (d.v.s. på samma plats som mappen "Calibre Library").
zh_tw: Calibre便携版只记住放置在便携文件夹内的库。因此，虽然您可以使用Calibre Portable打开计算机上任何位置的任意库，但除非它位于便携文件夹（即与“Calibre Library”文件夹相同的位置），否则在重新启动时不会记住它。

source: calibre for Android
nl: calibre voor Android
pt: Calibre para Android
ru: calibre для Android
sv: calibre för Android
zh_tw: Android 版的 calibre

source: calibre itself does not run on phones/tablets but you can connect to calibre running on your home computer, read books and manage your library in several ways.
nl: calibre zelf werkt niet op telefoons/tablets maar u kunt verbinding maken om calibre te gebruiken op uw thuiscomputer, boeken te lezen en uw bibliotheek op verschillende manieren te beheren.
pt: O Calibre não é instalado diretamente em telemóveis/tablets, mas você pode ligar o dispositivo móvel ao Calibre em execução no seu computador, ler livros e gerir a sua biblioteca de várias formas.
ru: Сам calibre не работает на телефонах/планшетах, но вы можете подключиться к calibre на домашнем компьютере, читать книги и управлять библиотекой несколькими способами.
sv: calibre själv körs inte på telefoner/surfplattor men du kan ansluta till calibre som körs på din hemdator, läsa böcker och hantera ditt bibliotek på flera sätt.
zh_tw: calibre 本身不能运行在 安卓手机/平板 上，但可以通过多种方式连接到在您个人电脑上运行的 calibre 来阅读书籍和管理你的书库。

source: Connect with a USB cable
nl: Verbinden met een USB-kabel
pt: Ligar com um cabo USB
ru: Подключиться через кабель USB
sv: Anslut med en USB-kabel
zh_tw: 使用 USB 線材來連線

source: Simply plug in your phone/tablet into the computer with calibre running on it. It will show up in calibre as a device and you can manage the books on it.
nl: Sluit eenvoudig uw telefoon/tablet aan op de computer met calibre erop draaiend. Het wordt als toestel in calibre weergegeven en u kunt de boeken erop beheren.
pt: Basta ligar, por USB, o seu telemóvel/tablet ao computador que tenha o Calibre em execução. O seu aparelho aparecerá no Calibre como um dispositivo e poderá gerir os livros aí existentes a partir do Calibre.
ru: Подключите телефон/планшет к компьютеру с запущенным calibre. Он будет отображаться в calibre как устройство, и вы можете управлять книгами на нём.
sv: Anslut helt enkelt din telefon/surfplatta till datorn med calibre som körs på den. Den kommer att visas i calibre som en enhet och du kan hantera böckerna på den.
zh_tw: 只需将 手机/平板电脑 插入运行 calibre 的电脑即可。它将在 calibre 显示为一个设备，从而管理设备上的书籍。

source: Connect wirelessly
nl: Maak draadloos verbinding
pt: Ligar sem fios
ru: Подключиться без проводов
sv: Anslut trådlöst
zh_tw: 無線地連線

source: You can connect to calibre using just Chrome or Firefox on the phone, and manage your collection and even read books in the browser, using the calibre <i>Content server</i>. To learn how to do this, see <a href="%(m)s">the User Manual</a>.
nl: U kan met calibre verbinden met enkel Chrome of FireFox op de telefoon, en uw collectie beheren en zelfs boeken lezen in de browser, met gebruik van de calibre <i>Content server</i>. Om te leren hoe, kijk in <a href="%(m)s">de Handleiding</a>.
pt: Pode ligar-se ao Calibre usando apenas o Chrome ou o Firefox no telemóvel. Poderá gerir a sua coleção, e até ler livros no navegador, usando o <i>Servidor de conteúdos</i> do Calibre. Para saber como o fazer, veja o <a href="%(m)s">Manual de utilizador</a>.
ru: Вы также можете подключиться к calibre, используя только Chrome или Firefox на телефоне, и управлять своей коллекцией и даже читать книги в браузере, используя calibre <i>Контент-сервер</i>. Чтобы узнать, как это сделать, см. <a href="%(m)s">Руководство пользователя</a>.
sv: Du kan ansluta till calibre med bara Chrome eller Firefox på telefonen och hantera din samling och till och med läsa böcker i webbläsaren med hjälp av calibre-<i>innehållsservern</i>. För att lära dig hur du gör detta, se <a href="%(m)s">användarmanualen</a>.
zh_tw: 您可以使用手机上的Chrome或Firefox浏览器连接到Calibre， 并使用Calibre <i>内容服务器</i>在浏览器中管理您的藏书，甚至阅读书籍。 要了解如何执行此操作，请参阅 <a href="%(m)s">用户手册</a>。

source: Download for Linux
nl: Download voor Linux
pt: Descarregar para Linux
ru: Скачать для Linux
sv: Hämta för Linux
zh_tw: 下載 Linux版

source: The latest release of calibre is %(version)s. <a href="%(href)s">What&apos;s new</a>.
nl: De nieuwste versie van calibre is %(version)s. <a href="%(href)s">Wat is er nieuw</a>.
pt: A última versão do Calibre é%(version)s. <a href="%(href)s">Novidades</a>.
ru: Последний выпуск calibre %(version)s. <a href="%(href)s">Что нового</a>.
sv: Den senaste utgåvan av calibre är %(version)s. <a href="%(href)s">Vad är nytt</a>.
zh_tw: 最新的發行版本為 %(version)s. <a href="%(href)s">新鮮事</a>.

source: Please do not use your distribution provided calibre package, as those are often buggy/outdated. Instead use the Binary install described below.
nl: Gebruik a.u.b. niet het door uw distributie geleverde calibre pakket, aangezien dat vaak buggy/verouderd is. Gebruik in de plaats de onder beschreven binaire installatie.
pt: Por favor, não utilize pacotes de distribuição do Calibre externos, pois muitas vezes estão desatualizados e possuem erros. Em vez disso, utilize os instaladores binários descritos abaixo
ru: Пожалуйста, не используйте пакеты calibre, предоставляемые вашим дистрибутивом, так как они зачастую содержат ошибки или уже устарели. Вместо этого установите исполняемый файл, как описано ниже.
sv: Använd inte din distributions calibre-paket, eftersom de ofta är felaktiga/föråldrade. Använd istället den binära installationen som beskrivs nedan.
zh_tw: 請不要使用發佈者所提供的 calibre 封裝， 那些通常都有 Bug、而且過時。請使用下方所述的二進位安裝方式進行。

source: Binary install
nl: Binaire installatie
pt: Executável de instalação
ru: Установка исполняемого файла
sv: Binär installation
zh_tw: 二進位安裝

source: calibre has a binary install that includes private versions of all its dependencies. It runs on 32-bit and 64-bit Intel compatible machines. To install or upgrade, simply copy paste the following command into a terminal and press Enter:
nl: calibre heeft een binaire installatie die privéversies van al zijn afhankelijkheden bevat. Het werkt op 32-bits en 64-bits Intel-compatibele machines. Om te installeren of te upgraden, kopieer gewoon de volgende opdracht in een terminal en drukt u op Enter:
pt: O Calibre tem um instalador binário que inclui versões próprias de todas as suas dependências. Corre em máquinas Intel de 32-bit e 64-bit. Para instalar ou atualizar basta copiar e colar o seguinte comando num terminal e premir Enter:
ru: Устанавливаемый исполняемый файл calibre уже включает все необходимые зависимости. Он работает на 32- и 64-разрядных машинах, совместимых с Intel. Для установки или обновления, просто скопируйте и вставьте следующие команды в терминал и нажмите Enter:
sv: calibre har en binär installation som innehåller privata versioner av alla beroenden. Den körs på 32-bitars och 64-bitars Intel-kompatibla maskiner. För att installera eller uppgradera, helt enkelt kopiera och klistra in följande kommando i en terminal och tryck på enter:
zh_tw: calibre 的二进制安装包括了其所有依赖项的私有版本。它可以在32位和64位英特尔兼容计算机上运行。要安装或升级，只需将以下命令复制粘贴到终端并按Enter键即可：

source: While you wait for the download to complete, please consider contributing to support the development of calibre.
nl: Terwijl u wacht tot het downloaden is voltooid, overweeg aub om bij te dragen aan de ontwikkeling van calibre.
pt: Enquanto espera pela conclusão da transferência, por favor, considere contribuir e apoiar o desenvolvimento do Calibre
ru: Пока вы ждёте завершения загрузки, пожалуйста, подумайте о возможности поддержать разработку calibre.
sv: Överväg att bidra till att stöda utvecklingen av calibre medan du väntar på att hämtningen slutförs.
zh_tw: 在您等待下載完成時候，您可以考慮看看是否要贊助 calibre 的開發工作。

source: If you get an error about an untrusted certificate, that means your computer does not have any root certificates installed and so cannot download the installer securely. If you still want to proceed, pass the --no-check-certificate option to wget, like this:
nl: Als u een fout krijgt door een niet-vertrouwd certificaat betekent dit dat uw computer geen rootcertificaten geïnstalleerd heeft en dus het installatieprogramma niet veilig kan downloaden. Als u toch wilt doorgaan, geef de --no-check-certificate optie door aan wget, zoals dit:
pt: Se receber uma indicação de erro sobre um certificado não confiável, isso significa que o seu computador não possui nenhum certificado raiz instalado e portanto não pode descarregar o instalador em modo seguro. Para prosseguir em modo não seguro, passe a opção -no-check-certificate para o wget, desta forma:
ru: Если возникает ошибка с ненадёжным сертификатом, значит на вашем компьютере не установлены корневые сертификаты, и вы не можете безопасно загрузить программу установки. Если всё ещё хотите продолжить, то запустите wget с опцией --no-check-certificate, примерно так:
sv: Om du får ett felmeddelande om ett otillförlitligt certifikat betyder det att din dator inte har några rotcertifikat installerade och därför inte kan hämta installationsprogrammet på ett säkert sätt. Om du fortfarande vill fortsätta, använd flaggan --no-check-certificate med wget så här:
zh_tw: 如果出現錯誤顯示「未受信任的憑證」，這代表你的電腦可能並未安裝根憑證，所以無法安全地下載安裝檔。如果還是想要繼續，請在 wget 加上 --no-check-certificate 選項，就像這樣:

source: You must have xdg-utils, wget, xz-utils and python &ge; 3.3 installed on your system before running the installer.
nl: U moet xdg-utils, wget, xz-utils en python &ge; 3.3 op uw systeem hebben voordat u het installatieprogramma uitvoert.
pt: Deve ter os xdg-utils, wget, xz-utils e python &ge; 3.3 instalados no seu sistema antes de executar o instalador.
ru: До запуска программы установки проверьте, что в вашей системе уже есть xdg-utils, wget, xz-utils и python &ge; 3.3.
sv: Du måste ha xdg-utils, wget, xz-utils och python &ge; 3.3 installerade på ditt system innan du kör installationsprogrammet.

source: You can uninstall calibre by running <code>%(uninst)s</code>. Alternately, simply deleting the installation folder will remove 99%% of the installed files.
nl: U kan calibre deïnstalleren met <code>%(uninst)s</code>. Als alternatief, gewoon de installatiemap wissen verwijdert 99%% van de geïnstalleerde bestanden.
pt: Pode desinstalar o Calibre se executar o comando<code>%(uninst)s</code>. Em último caso, se eliminar a pasta de instalação irá remover 99 %% dos ficheiros instalados.
ru: Вы можете удалить calibre, запустив <code>%(uninst)s</code>. В качестве альтернативы, простое удаление установочной папки приведет к удалению 99 %% установленных файлов.
sv: Du kan avinstallera calibre genom att köra <code>%(uninst)s</code>. Alternativt tar du bara bort installationsmappen för att ta bort 99 %% av de installerade filerna.
zh_tw: 您可以通过运行 <code>%(uninst)s</code> 来卸载calibre。或者，只需删除安装目录就会删除 99%% 的已安装文件。

source: You need GLIBC 2.31 or higher and libstdc++.so.6.0.28 (from gcc 9.3.0) or higher to run calibre
nl: U hebt GLIBC 2.31 of hoger en libstdc ++.so.6.0.28 (vanaf gcc 9.3.0) of hoger nodig voor calibre
pt: É necessário ter o GLIBC 2.31 ou mais recente e libstdc++.so.6.0.28 (de gcc 9.3.0) ou mais recente para executar o Calibre
ru: Для запуска calibre требуются GLIBC 2.31 или выше и libstdc++.so.6.0.28 (из gcc 9.3.0) или выше.
sv: Du behöver GLIBC 2.31 eller senare och libstdc++.so.6.0.28 (från gcc 9.3.0) eller senare för att köra calibre

source: If you get an error <code>%(xcb)s</code> you are missing some needed X11-XCB libraries, such as libxcb-xinerama0, for details see <a href="%(xcb_url)s">here</a>.
nl: Als u de fout <code>%(xcb)s</code> krijgt, mist u enkele noodzakelijke X11-XCB bibliotheken, zoals libxcb-xinerama0, zie <a href="%(xcb_url)s">hier</a> voor details.
pt: Se obtiver um erro <code>%(xcb)s</code>, é porque está a faltar alguma das bibliotecas X11-XCB, como a libxcb-xinerama0. Para detalhes, veja <a href="%(xcb_url)s">aqui</a>.
ru: Если возникает ошибка <code>%(xcb)s</code>, значит у вас отсутствует несколько нужных X11-XCB библиотек, таких как libxcb-xinerama0, подробнее смотрите <a href="%(xcb_url)s">здесь</a>.
sv: Om du får ett <code>%(xcb)s</code>-fel saknar du några X11-XCB-bibliotek som behövs, t.ex. libxcb-xinerama0, för detaljer se <a href="%(xcb_url)s">här</a>.
zh_tw: 如果出现错误<code>%(xcb)s</code>则表示缺少一些所需的X11-XCB库文件，例如libxcb-xineama0， 有关详细信息，请参阅<a href="%(xcb_url)s">文章</a>.

source: On servers, if you get an error about a missing libEGL, you might need to install some OpenGL packages such as libegl1 and libopengl0
nl: Als u op servers een foutmelding krijgt over een ontbrekende libEGL moet u misschien enkele OpenGL pakketten zoals libegl1 en libopengl0 installeren
ru: На серверах, если вы получаете сообщение об отсутствующем libEGL, вам может потребоваться установить некоторые пакеты OpenGL, такие как libegl1 и libopengl0.
sv: På servrar, om du får ett felmeddelande om en saknad libEGL, kan du behöva installera några OpenGL-paket som libegl1 och libopengl0

source: You can change the folder calibre is installed into from the default (/opt) like this:
nl: Zo kan u de map waarin calibre geïnstalleerd wordt veranderen van de standaard (/opt):
pt: Pode alterar a pasta no qual o Calibre está instalado, a partir do (/opt) predefinido, desta forma:
ru: Вы можете изменить папку, в которую установлен calibre, по умолчанию (/opt) следующим образом:
sv: Du kan ändra mappen calibre installeras i från standarden (/opt) så här:
zh_tw: 您可以修改默认安装路径（/opt），将 calibre 安装到的其他位置，如下所示：

source: Change /opt above to whatever folder you want calibre automatically installed to.
nl: Verander /opt boven naar eender welke map waarin u calibre automatisch wil installeren.
pt: Altere o /opt acima para uma pasta em que o Calibre seja instalado automaticamente.
ru: Измените/выберите выше любую папку, в которую вы хотите автоматически установить calibre.
sv: Ändra /opt ovan till vilken mapp du vill att calibre automatiskt installeras i.
zh_tw: 将上面的/opt更改为您希望Calibre自动安装到的任何文件夹。

source: You can also do an "isolated" install that only touches files inside the installation folder and does not need to be run as root, like this:
nl: U kan ook een "geïsoleerde" installatie doen die alleen bestanden in de installatiemap raakt en niet als root moet gedaan worden, zo:
pt: Também pode fazer uma instalação "isolada" que manipula apenas os ficheiros dentro da pasta de instalação, e que não necessita de ser executado como root, desta forma:
ru: Вы также можете выполнить «изолированную» установку, которая касается только файлов внутри папки установки и не требует запуска от имени пользователя root, например:
sv: Du kan också göra en "isolerad" installation som bara rör filer i installationsmappen och inte behöver köras som root, så här:
zh_tw: 您还可以执行 “独立” 安装，该安装只涉及安装文档内的文件，不需要以root用户身份运行，如下所示：

source: Reverting to a previous version
nl: Terugkeren naar een vorige versie
pt: Reverter para uma versão anterior
ru: Возврат к предыдущей версии
sv: Återgå till en tidigare version
zh_tw: 退回之前的版本

source: You can install a previous calibre release, like this:
nl: U kunt een eerdere calibre versie installeren, zo:
pt: Pode instalar uma versão anterior do Calibre, assim:
ru: Установить предыдущий выпуск calibre можно так:
sv: Du kan installera en tidigare calibre-utgåva, så här:
zh_tw: 你可以安裝之前的 calibre 的發行，像這樣：

source: Change 4.23.0 above to whatever version you want installed.
nl: Wijzig 4.23.0 boven in de versie die u wilt installeren.
pt: Mude da versão 4.23.0 ou superior para qualquer versão que queira instalar.
ru: Замените версию 4.23.0 выше на ту версию, которую вы хотите установить.
sv: Ändra 4.23.0 ovan till versionen du vill installera.
zh_tw: 把以上的 4.23.0 改成您要安装的版本

source: Manual binary install
nl: Handmatige binaire installatie
pt: Instalação binária manual
ru: Установка исполняемого файла вручную
sv: Manuell binär installation
zh_tw: 手動安裝二進位檔案

source: If you wish to revert to an earlier calibre release or download a calibre upgrade manually, download the tarball of that release from <a href="%(previous_releases)s">here</a> (choose the 32-bit or 64-bit version, as appropriate). Assuming you want calibre in /opt/calibre, run the following command, changing the path to <code>%(tarball)s</code> below as appropriate:
nl: Wilt u terug naar een eerdere versie van calibre of handmatig een calibre upgrade downloaden, download dan de tarball van die versie van <a href="%(previous_releases)s">hier</a> (kies de 32-bits of 64-bits versie, zoals nodig). Ervan uitgaande dat u calibre in /opt/calibre wilt, voer de volgende opdracht uit en wijzig het pad naar <code>%(tarball)s</code> hieronder, zoals nodig:
pt: Se deseja reverter para uma versão anterior do Calibre ou descarregar uma atualização do Calibre manualmente, descarregue uma Tarball dessa versão <a href="%(previous_releases)s">daqui</a> (escolha a versão 32-bit ou 64-bit, conforme adequado). Imaginando que queria o Calibre em /opt/calibre, execute o seguinte comando, alterando o caminho para o <code>%(tarball)s</code> abaixo, conforme adequado:
ru: Если вы хотите вернуться на раннюю версию calibre или вручную загрузить обновление, скачайте архив соответствующего выпуска <a href="%(previous_releases)s">отсюда</a> (если нужно, выберите 32- или 64-разрядную версию). Предположим, вы устанавливаете calibre в /opt/calibre, тогда выполните следующие команды, изменив по мере необходимости путь к <code>%(tarball)s</code> ниже:
sv: Om du vill återgå till en tidigare calibre-utgåva eller hämta en calibre-uppgradering manuellt, hämta tarballen i den utgåvan <a href="%(previous_releases)s">härifrån</a> (välj 32-bitars- eller 64-bitarsversionen, beroende på vad som är lämpligt). Förutsatt att du vill ha calibre i /opt/calibre, kör följande kommando, ändra sökvägen till <code>%(tarball)s</code> nedan så den är lämplig:
zh_tw: 如果您希望恢复到较早的Calibre版本或手动下载Calibre升级，请从 <a href="%(previous_releases)s"> 此处 </a> 下载该版本的安装包（根据需要选择32位或64位版本）。假设您需要在 /opt/calibre 安装calibre，请运行以下命令，并根据需要更改下面的 <code>%(tarball)s</code> 路径

source: Source install
nl: Broninstallatie
pt: Instalação da fonte
ru: Установка из исходников
sv: Installera från källkod
zh_tw: 原始碼安裝

source: WARNING: calibre is a highly complex piece of software with lots of very finicky dependencies. If you install from source, you are on your own. Please do not open bug reports or expect any form of support. You have been warned.
nl: WAARSCHUWING: calibre is zeer complexe software met veel nauw luisterende afhankelijkheden. Als u installeert vanaf de bron staat u er alleen voor. Open aub geen bugrapporten en verwacht geen ondersteuning. U bent gewaarschuwd.
pt: AVISO: o Calibre é um software altamente complexo com muitas dependências exigentes. Se deseja instalar a partir do código fonte, você está por conta própria. Por favor, não abra registo de anomalias esperando qualquer forma de suporte. Você foi avisado!
ru: ВНИМАНИЕ: calibre — это очень сложное программное обеспечение со множеством привередливых зависимостей. Вы можете установить его из исходников, но, тогда не жалуйтесь на ошибки и не рассчитывайте на какую-либо помощь. Вас предупреждали.
sv: Varning: calibre är en mycket komplex mjukvara med massor av mycket petiga beroenden. Om du installerar från källa får du klara dig själv. Öppna inte felanmälningar eller förvänta dig någon form av support. Du har blivit varnad.
zh_tw: 警告：Calibre是一个高度复杂的软件，有很多非常精细的依赖项。如果您从源代码安装，则只能靠您自己。请不要打开错误报告或期望获得任何形式的支持---已经警告过你的。

source: If you're still determined to install from source, read on:
nl: Als u nog steeds vanaf de bron wil installeren, lees dan verder:
pt: Se ainda está determinado a instalar a partir do código fonte, continue a ler:
ru: Если вы всё же решили установить из исходников, читайте дальше:
sv: Om du fortfarande är fast besluten att installera från källa, läs vidare:
zh_tw: 如果你還是決意要從原始碼安裝，請看下去:

source: Make sure your system has Python 3 installed.
nl: Zorg ervoor dat Python 3 op uw systeem geïnstalleerd is.
pt: Assegure-se de que o seu sistema tem o Python 3 instalado.
ru: Убедитесь, что в вашей системе установлен Python 3.
sv: Se till att ditt system har Python 3 installerat.
zh_tw: 確保您的系統已經安裝 Python 3

source: Install the various dependencies listed below
nl: Installeer de verschillende onderstaande afhankelijkheden
pt: Instale as diferentes dependências listadas abaixo
ru: Установите разные зависимости, перечисленные ниже.
sv: Installera de olika beroenden som anges nedan
zh_tw: 安裝好下列幾個相依性 (dependencies) 清單

source: Run the following commands in a terminal:
nl: Voer de volgende opdrachten uit in een terminal:
pt: Execute os seguintes comandos num terminal:
ru: Выполните следующие команды в терминале:
sv: Kör följande kommandon i en terminal:
zh_tw: 在終端機內執行下列命令:

source: Dependencies
nl: Afhankelijkheden
pt: Dependências
ru: Зависимости
sv: Beroenden
zh_tw: 相依性 (Dependencies)
