Repository: debian-calibre/calibre
Catalog: translations-git/website/*.po
Languages: nl, pt, ru, sv, zh_tw

source: As my e-book collection grew, I realized that managing it was quickly becoming unwieldy, so I decided to write a graphical interface to libprs500 to make it easier. This became calibre, in its present form, as a comprehensive e-book management tool. libprs500 was renamed to calibre in mid-2008. The name calibre was chosen by my wife, Krittika. The libre in calibre stands for freedom, indicating that calibre is a free and open source product, modifiable by all. Nonetheless, calibre should be pronounced as cali-ber, not ca-libre.
nl: Met het groeien van mijn e-boek collectie realiseerde ik me dat het beheer snel log werd en dus besloot ik een grafische interface te schrijven voor de libprs500 om het gemakkelijker te maken. Dit werd calibre, in z'n huidige vorm, als een veelomvattend e-boek beheersgereedschap. libprs500 werd hernoemd naar calibre midden 2008. De naam calibre werd gekozen door m'n vrouw, Krittika. De libre in calibre staat voor vrijheid, aangevend dat calibre een gratis en open source product is, aanpasbaar door iedereen. Desondanks zou calibre uitgesproken moeten worden als cali-ber, niet ca-libre.
pt: À medida que minha coleção de ebooks crescia, dei-me conta de que a sua gestão estava a tornar-se difícil, pelo que decidi criar uma interface gráfica para o libprs500. Isto tornou-se o Calibre, na sua forma atual, uma ferramenta abrangente de gestão de ebooks. O libprs500 foi renomeado para Calibre em meados de 2008. O nome Calibre foi escolhido pela minha esposa, Krittika. O libre em Calibre significa liberdade, indicando que o Calibre é um produto grátis e de código aberto, modificável por todos. Apesar disso, Calibre deve ser lido como cali-ber, e não como ca-libre.
ru: Моя коллекция электронных книг росла, и я заметил, что управление ею быстро становится громоздким, поэтому решил написать графический интерфейс для libprs500, чтобы упростить его. Так появилась calibre в её нынешнем виде, как комплексный инструмент управления электронными книгами. libprs500 была переименована в calibre в середине 2008. Название «calibre» выбрала моя жена Криттика. «Libre» в calibre означает свободу, показывая, что calibre — свободный продукт с открытым исходным кодом, который могут изменять все. Однако же calibre следует произносить как cali-ber, а не ca-libre.
sv: När min e-boksamling växte insåg jag att hanteringen av det snabbt blev otympligt, så jag bestämde mig för att skriva ett grafiskt gränssnitt till libprs500 för att underlätta det. Det här blev calibre, i sin nuvarande form, som ett omfattande e-bokhanteringsverktyg. libprs500 döptes om till calibre i mitten av 2008. Namnet calibre valdes av min fru, Krittika. Libre i calibre står för frihet, vilket indikerar att calibre är en fri produkt med öppen källkod, modifierbar av alla. Trots det bör calibre uttalas som cali-ber, inte ca-libre.
zh_tw: 随着收藏的电子书不断增多，我很快意识到对其进行管理会变得很不方便，因此我决定为 libprs500 编写图形界面以使其变得更易使用。 以目前来看，它已成为一种全面的电子书管理工具。 libprs500 在2008年改名为 calibre 。 calibre 这个名字是我的妻子 Krittika 取的。calibre 中的 libre 代表着自由，这表明 calibre 是一种自由开源的产品，所有人都可以修改。 尽管如此，calibre 应该发音为 cali-ber，而不是ca-libre。

source: Today calibre is a vibrant open-source community with half a dozen developers and many, many testers and bug reporters. It is used in over 200 countries and has been translated into a dozen different languages by volunteers. calibre has become a comprehensive tool for the management of digital texts, allowing you to do whatever you could possibly imagine with your e-book library. Reading is very important to me and one of my goals has always been to prevent either the fragmentation or the monopolization of the e-book market by entities that care solely for short-term goals. As the calibre community continues to grow, driven by book lovers, for book lovers, hopefully it will always present an alternative for people that love to read e-books and want to be in control of their own digital libraries.
nl: calibre is vandaag een geanimeerde gemeenschap met een half dozijn ontwikkelaars en massa's testers en foutenmelders. Het wordt gebruikt in 200 landen en is vertaald in een tiental talen door vrijwilligers. calibre is een veelomvattend gereedschap geworden voor het beheer van digitale tekst, u toelatend te doen wat u zich maar kan inbeelden met uw e-boekbibliotheek. Lezen is heel belangrijk voor mij en een van m'n doelen is altijd het voorkomen geweest van de fragmentatie of monopolisering van de e-boekmarkt door entiteiten die enkel om korte termijn doelen geven. Terwijl de calibre gemeenschap blijft groeien, gedreven door boekliefhebbers, voor boekliefhebbers, zal het hopelijk altijd een alternatief bieden aan mensen die houden van e-boeken lezen en die controle willen hebben over hun digitale bibliotheek.
pt: Hoje, o Calibre é uma vibrante comunidade de código aberto com meia dúzia de programadores e muitos, muitos testadores e relatores de erros. É usado em mais de 200 países e foi traduzido para dezenas de idiomas diferentes por voluntários. O Calibre tornou-se uma ferramenta abrangente para a gestão de textos digitais, permitindo que você faça tudo o que imaginar com a sua a biblioteca. A leitura é muito importante para mim e um dos meus objetivos sempre foi evitar a fragmentação e a monopolização do mercado de ebooks por entidades que visam apenas metas de curto prazo. À medida que a comunidade do Calibre continua a crescer, dirigida por amantes de livros e para amantes de livros, espera-se que ela se apresente sempre como uma alternativa para pessoas que amam ler ebooks e querem estar no controlo das suas próprias bibliotecas digitais.
ru: Сегодня calibre — живое открытое сообщество с полудюжиной разработчиков и огромным количеством тестеров и ловцов ошибок. Её используют в более чем 200 странах, а добровольцы перевели на десяток различных языков. calibre превратилась во всеобъемлющий инструмент управления цифровыми текстами, позволяющий вам делать с вашей библиотекой электронных книг всё, что только можно представить. Чтение очень важно для меня, и одна из моих целей всегда состояла в предотвращении фрагментации или монополизации рынка электронных книг субъектами, заботящимися исключительно о своей сиюминутной выгоде. Так как сообщество calibre продолжает расти, движимое книголюбами, надеюсь, оно навсегда останется альтернативой для людей, которые любят читать электронные книги и хотят сами контролировать свои цифровые библиотеки.
sv: Idag är calibre en levande öppen källkodsgemenskap med ett halvdussin utvecklare och många, många testare och felanmälare. Det används i över 200 länder och har översatts till ett dussin olika språk av volontärer. calibre har blivit ett omfattande verktyg för hantering av digitala texter, så att du kan göra vad du än kan tänka dig med ditt e-bokbibliotek. Läsning är mycket viktigt för mig och en av mina mål har alltid varit att förhindra antingen fragmentering eller monopolisering av e-bokmarknaden av enheter som enbart bryr sig om kortsiktiga mål. När calibre-gemenskapen fortsätter att växa, driven av bokälskare, för bokälskare, kommer det förhoppningsvis alltid att vara ett alternativ för personer som älskar att läsa e-böcker och vill ha kontroll över sina egna digitala bibliotek.
zh_tw: 如今，calibre 是一个充满活力的开源社区，拥有六个开发人员以及许许多多的测试人员和错误报告者。 它在200多个国家/地区使用，并已被志愿者翻译成十几种语言。 calibre 已成为管理数字文本的综合工具，使您可以使用电子书库做任何想像的事情。 阅读对我来说非常重要，我的目标之一就是防止仅关注短期目标的实体对电子书市场进行分散化或垄断化。 在图书爱好者的推动下，calibre 社区的不断发展，希望它能永远为为那些喜欢阅读电子书并希望自己掌控数字书库的人们提供多一个选择。

source: November 2009
pt: Novembro 2009
ru: Ноябрь 2009
zh_tw: 2009年11月

source: Asking for help
nl: Hulp vragen
pt: Pedidos de ajuda
ru: Где найти помощь
sv: Be om hjälp
zh_tw: 尋求支援

source: The best places to ask for help with calibre are the very active <a target="forum" href="%(forum)s">calibre forum</a> at mobileread.com, where there are a number of friendly and knowledgeable long time users/developers of calibre. In addition, there is the <a href="%(fb)s">calibre Facebook fan page</a> and <a target="twitter" href="%(tw)s">#calibreforum</a> on Twitter.
nl: De beste plaats om om hulp te vragen met calibre is het zeer actieve <a target="forum" href="%(forum)s">calibre forum</a> op mobileread.com, waar u een aantal sympathieke en goed ingelichte ervaren gebruikers/ontwikkelaars van calibre vindt. Bijkomend is er de <a href="%(fb)s">calibre Facebook fan pagina</a> en <a target="twitter" href="%(tw)s">#calibreforum</a> op Twitter.
pt: O melhor local para pedir ajuda sobre o Calibre é o muito ativo <a target="forum" href="%(forum)s">Fórum Calibre</a> no mobileread.com, onde existe um grande número de experientes e prestáveis utilizadores/programadores de longa data do Calibre. Além disso, existe a <a href="%(fb)s">página Facebook do Calibre</a> e o Twitter <a target="twitter" href="%(tw)s">#calibreforum</a>.
ru: Лучшее место попросить о помощи — очень активный <a target="forum" href="%(forum)s">форум</a> на mobileread.com с дружелюбными и знающими пользователями и разработчиками calibre. Кроме того, существует <a href="%(fb)s">страничка любителей calibre в Facebook</a> и <a target="twitter" href="%(tw)s">#calibreforum</a> в Twitter.
sv: Den bästa platsen att be om hjälp med calibre är det mycket aktiva <a target="forum" href="%(forum)s">calibre-forumet</a> på mobileread.com, där det finns ett antal vänliga och kunniga långtidsanvändare/utvecklare av calibre. Dessutom finns <a href="%(fb)s">Facebook-fansidan för calibre</a> och <a target="twitter" href="%(tw)s">#calibreforum</a> på Twitter.
zh_tw: 寻求有关 calibre 的帮助，最好地方是 Mobileread.com 上的 <a target="forum" href="%(forum)s">calibre 论坛</a> ，那里非常活跃，有许多友好且知识渊博的 calibre 长期用户/开发人员。此外，还有 <a href="%(fb)s">calibre Facebook 粉丝页面</a> 以及在 Twitter上 <a target="twitter" href="%(tw)s">#calibreforum</a>

source: Reporting issues and asking for new features
nl: Problemen melden en nieuwe functies aanvragen
pt: Indicar anomalias ou solicitar novas funcionalidades
ru: Сообщения об ошибках и просьбы о новых возможностях
sv: Rapportera problem och be om nya funktioner
zh_tw: 报告问题和提交新功能需求

source: If you discover a problem with calibre or would like to request a new feature, the best place to do it is via the calibre <a href="%(href)s">Bug tracker</a>. Be aware that calibre is developed by volunteers, which means that your bug report/feature request may or may not get attention, so if you are looking for help, the best place is the forum linked to above.
nl: Als u een probleem in calibre ontdekt of om een nieuwe functie wil verzoeken, is de beste plaats om dat te doen via de calibre <a href="%(href)s">Bug tracker</a>. Merk op dat calibre wordt ontwikkeld door vrijwilligers, dit betekent dat uw foutmelding/optieverzoek wel of niet aandacht kan krijgen, dus als u hulp zoekt, is de beste plaats het forum waar boven naar wordt gelinkt.
pt: Se descobrir um problema com o Calibre ou pretender solicitar uma nova funcionalidade, a melhor maneira de o fazer é através do <a href="%(href)s">Rastreador de anomalias</a> do Calibre. Lembre-se que o Calibre é desenvolvido por voluntários, o que significa que o seu relatório de erros/ pedido de funcionalidades pode não receber atenção logo no momento. Se procura ajuda imediata, o melhor lugar é o fórum descrito acima.
ru: Если вы нашли проблему в calibre или хотите предложить новую функцию, лучший способ это сделать — <a href="%(href)s">Баг-трекер</a> calibre. Учтите, что calibre разрабатывается добровольцами, и ваше сообщение об ошибке или новой функции могут как принять во внимание, так и не принять, поэтому если вам нужна помощь, то лучше посетить вышеупомянутый форум.
sv: Om du upptäcker ett problem med calibre eller vill begära en ny funktion är det bästa stället att gör det via <a href="%(href)s">felhanteringssystemet</a> för calibre. Var medveten om att calibre är utvecklad av volontärer, vilket innebär att din felanmälan/funktionsförfrågan kanske får uppmärksamhet eller inte, så om du letar efter hjälp är det bästa stället forumet länkat till ovan.
zh_tw: 如果发现 calibre 有故障或想要申请新功能，最好的地方是通过 calibre <a href="%(href)s">Bug追踪器</a> 。但请注意，calibre 是由志愿者开发的，这意味着您的错误报告/功能请求可能会也可能不会受到关注。因此，如果您正在寻求帮助，最好的地方是上面的论坛链接。

source: calibre is an open source application that uses a large number of other open source libraries and is developed on Linux, an open source platform, and as such, it has benefited from the work of large numbers of people, some of whom are listed below. I've tried to be as exhaustive as possible, but, if I have omitted your contribution, please let me know.
nl: calibre is een open source toepassing die een hoop andere open source libraries gebruikt en ontwikkeld werd op Linux, een open source platform, en zodoende profiteerde het van het werk van een hele hoop mensen, waarvan sommigen onder vermeld worden. Ik heb geprobeerd zo uitgebreid als mogelijk te zijn maar als ik uw bijdrage vergeten ben, laat het me alstubliet weten.
pt: O Calibre é um programa de código aberto que usa um grande número de outras bibliotecas de código aberto. É desenvolvido em Linux, uma plataforma de código aberto, e como tal, tem beneficiado do trabalho de uma grande quantidade de pessoas, algumas das quais estão listadas abaixo. Tentei ser o mais abrangente possível, mas, se omiti a sua colaboração, por favor, avise-me.
ru: calibre — приложение с открытым исходным кодом, которое использует множество других библиотек с открытым исходным кодом и разрабатывается в Linux, платформе с открытым исходным кодом, и поэтому извлекает пользу из труда огромного количества людей, часть которых перечислена ниже. Я старался быть максимально исчерпывающим, но если упустил ваш вклад, пожалуйста, дайте мне знать.
sv: calibre är ett program med öppen källkod som använder ett stort antal andra bibliotek med öppna källkoder och är utvecklat i Linux, en plattform för öppen källkod, och som sådan har gynnats av arbetet från ett stort antal personer, varav några listas nedan. Jag har försökt att vara så uttömmande som möjligt, men om jag har utelämnat ditt bidrag, meddela mig.
zh_tw: calibre 是一個開源應用程式，它大量使用了其他開源函式庫，並且是在開源平台 Linux 上開發的。我已嘗試盡可能詳盡地在下面列出參與貢獻者，但如有疏漏，請務必告知。

source: Contributors of code/bug fixes
nl: Bijdragers van code/bug fixes
pt: Colaboradores do código/correção de erros
ru: Вклад в код/исправление ошибок
sv: Bidragsgivare av kod/felrättningar
zh_tw: 加入開發、偵錯的行列的貢獻者

source: In no particular order:
nl: Niet in een specifieke volgorde:
pt: Sem uma ordem especial:
ru: Без определённого порядка:
sv: I ingen bestämd ordning:
zh_tw: 排列沒有特定的順序

source: Marshall Vandegrift: For epub2lrf, lit2oeb, oeb2mobi and various improvements in the html2lrf code, as well as the basic framework for the conversion pipeline in the 0.6.x series
nl: Marshall Vandegrift: Voor epub2lrf, lit2oeb, oeb2mobi en verschillende verbeteringen in de html2lrf code, alsook in het basis framewerk voor de conversie pipeline in de 0.6.x series
pt: Marshall Vandegrift: pelo epub2lrf, lit2oeb, oeb2mobi e várias melhorias no código do html2lrf, assim como a estrutura básica para o fluxo de conversão na série 0.6.x
ru: Marshall Vandegrift за epub2lrf, lit2oeb, oeb2mobi и различные улучшения в коде html2lrf, а также за простой фреймворк для системы преобразований в версиях 0.6.x
sv: Marshall Vandegrift: För epub2lrf, lit2oeb, oeb2mobi och olika förbättringar i html2lrf-koden, samt det grundläggande ramverket för konverteringsprocessen i 0.6.x-serien
zh_tw: Marshall Vandegrift: epub2lrf、lit2oeb、oeb2mobi 以及多項 html2lrf 程式碼的改善，還有在 0.6.x 系列時期轉檔管線的基礎框架上的貢獻。

source: John Schember: For the new calibre device driver framework, various GUI enhancements and several input and output format plugins and the "Get Books" feature
nl: John Schember: Voor het nieuwe calibre device driver framewerk, verschillende GUI verbeteringen, verscheidene input/output formaat plug-ins en de "Verkrijg Boeken" functie
pt: John Schember: Pela nova estrutura de drivers de dispositivos do Calibre, várias melhorias na interface gráfica e muitos plugins de formatos de entrada e saída, além da funcionalidade "Obter livros"
ru: John Schember за новый фреймворк calibre для драйверов устройств, различные улучшения графического интерфейса, несколько плагинов импорта-экспорта форматов, а также функцию «Приобрести книги»
sv: John Schember: För det nya calibre-drivrutinsramverket, olika förbättringar för användargränssnittet och flera insticksmoduler för in- och utmatningsformat och funktionen "Skaffa böcker"
zh_tw: John Schember: 实现新的Calibre设备驱动程序框架，各种GUI增强功能、几个输入和输出格式插件以及“获取图书”功能

source: Charles Haley: For custom columns, saved searches, restrictions, the wireless device driver, lots of other help/ideas
nl: Charles Haley: Voor aangepaste kolommen, opgeslagen zoekopdrachten, beperkingen, de draadloze toestel driver, massas andere hulp/ideeën
pt: Charles Haley: Pelas colunas personalizadas, pesquisas guardadas, restrições, pelo driver de dispositivos sem fio e várias outras ajudas/ideias
ru: Charles Haley за настраиваемые столбцы, сохранённые поиски, ограничения, драйвер беспроводного устройства, помощь во множестве других идей
sv: Charles Haley: För anpassade kolumner, sparade sökningar, begränsningar, drivrutinen för trådlös enhet, massor av annan hjälp/idéer
zh_tw: Charles Haley: 实现自定义列、保存的搜索、限制、无线设备驱动程序、许多其他帮助/想法

source: Gregory Riker: For MOBI indexing, catalogs, the iPad driver
nl: Gregory Riker: Voor MOBI indexing, catalogussen, de iPad driver
pt: Gregory Riker: Pela indexação para MOBI, os catálogos e o driver para iPad
ru: Gregory Riker за индексирование MOBI, каталоги, драйвер iPad
sv: Gregory Riker: För MOBI-indexering, kataloger, iPad-drivrutinen
zh_tw: Gregory Riker: 实现MOBI索引、目录、iPad驱动程序

source: Roger Critchlow: For the initial implementation of lrs2lrf
nl: Roger Critchlow: Voor de initiële implementatie van lrs2lrf
pt: Roger Critchlow: Pela implementação inicial do lrs2lrf
ru: Roger Critchlow за первоначальную реализацию lrs2lrf
sv: Roger Critchlow: För första implementeringen av lrs2lrf
zh_tw: Roger Critchlow: 实现 lrs2lrf 的初始实现

source: Anatoly Shipitsin: For fb2lrf and fb2-meta
nl: Anatoly Shipitsin: Voor fb2lrf en fb2-meta
pt: Anatoly Shipitsin: Pelo fb2lrf e fb2-meta
ru: Anatoly Shipitsin за fb2lrf и fb2-meta
sv: Anatoly Shipitsin: För fb2lrf och fb2-meta
zh_tw: Anatoly Shipitsin: 实现 fb2lrf 的 fb2 元数据

source: Ori Avtalion and WayneD: For various bug fixes
nl: Ori Avtalion en WayneD: Voor verschillende bug fixes
pt: Ori Avtalion e WayneD: pelas várias correções de erros
ru: Ori Avtalion и WayneD: за различные исправления ошибок
sv: Ori Avtalion och WayneD: För olika felrättningar
zh_tw: Ori Avtalion和WayneD：用于各种错误修复

source: Tijmen Ruizendaal: For the Be Book driver
nl: Tijmen Ruizendaal: Voor de Be Book-driver
pt: Tijmen Ruizendaal: pelo driver do Be Book
ru: Tijmen Ruizendaal: за драйвер Be Book
sv: Tijmen Ruizendaal: För drivrutinen för Be Book
zh_tw: Tijmen Ruizendaal：为Be Book 编写驱动程序

source: Igor Skochinsky: For various bits of reverse engineering without which calibre would never have gotten off the ground
nl: Igor Skochinsky: Voor verschillende stukken reverse engineering zonder dewelke calibre nooit van de grond was gekomen
pt: Igor Skochinsky: pelos vários segmentos de engenharia reversa sem os quais o Calibre nunca teria levantado voo
ru: Igor Skochinsky: (за обратную разработку отдельных моментов, без которых calibre никогда бы не взлетел)
sv: Igor Skochinsky: För olika bitar av omvänd teknik utan vilken calibre aldrig skulle ha kommit igång
zh_tw: Igor Skochinsky：进行各种逆向工程，如果没有这些，calibre 将永远无法实现。

source: Darko Miletic: For a large number of news recipes
nl: Darko Miletic: Voor een groot aantal nieuws recepten
pt: Darko Miletic: Pelo um grande número de receitas de notícias
ru: Darko Miletic за огромное количество рецептов новостей
sv: Darko Miletic: För ett stort antal nyhetsrecept
zh_tw: Darko Miletic: 获取大量的新闻来源

source: Grant Drake: For various plugins including Open with, Search the internet and Goodreads integration
nl: Grant Drake: Voor verschillende plug-ins waaronder Open met, Doorzoek het internet en Goodreads integratie
pt: Grant Drake: Por vários plugins, incluindo o Abrir com, Pesquisar na Internet e a integração com o Goodreads
ru: Grant Drake за различные плагины, включая «Открыть с помощью», поиск в интернете и интеграцию Goodreads
sv: Grant Drake: För olika insticksmoduler inklusive Öppen med, Sök på internet och Goodreads-integration
zh_tw: Grant Drake: 有关各种开源插件，互联网搜索 和 Goodreads 集成

source: Timothy Legge and David Forrester: For Kobo support in calibre
nl: Timothy Legge en David Forrester: Voor Kobo ondersteuning in calibre
pt: Timothy Legge e David Forrester: Pelo suporte ao Kobo no Calibre
ru: Timothy Legge и David Forrester за поддержку Kobo в calibre
sv: Timothy Legge och David Forrester: För Kobo stöd i calibre
zh_tw: Timothy Legge 和 David Forrester: calibre 对 Kobo 的支持

source: Eli Schwartz: For Linux packaging efforts
nl: Eli Schwartz: Voor Linux packaging inspanningen
pt: Eli Schwartz: pelos esforços no empacotamento Linux
ru: Eli Schwartz: за помощь с пакетами в Linux
sv: Eli Schwartz: För Linux-paketeringsinsatser
zh_tw: Eli Schwartz: 对于Linux版本编译做出的努力

source: Eli Schwartz and Flaviu Tamas: For Python 3 porting efforts
nl: Eli Schwartz en Flaviu Tamas: Voor Python 3 overdracht inspanningen
pt: Eli Schwartz e Flaviu Tamas: pelos esforços de adaptação do Python 3
ru: Eli Schwartz и Flaviu Tamas: за помощь в портировании на Python 3
sv: Eli Schwartz och Flaviu Tamas: För Python 3-uppgraderingsinsatser
zh_tw: Eli Schwartz和Flaviu Tamas：为Python3移植所做的努力

source: Mark W. Gabby-Li: For adding right-to-left and vertical text support to the E-book viewer
nl: Mark W. Gabby-Li: Voor toevoegen van rechts-naar-links en verticale tekst ondersteuning in de e-boek viewer
pt: Mark W. Gabby-Li: por adicionarem ao visualizador de ebooks o suporte à escrita da direita para a esquerda e ao texto vertical.
ru: Mark W. Gabby-Li: за добавление поддержки текста справа налево и вертикального в просмотрщик электронных книг
sv: Mark W. Gabby-Li: För att lägga till höger-till-vänster och vertikalt textstöd i e-bokvisaren
zh_tw: Mark W. Gabby-Li：为电子书阅读器添加了从右到左和垂直文本支持

source: Graphics and design
nl: Grafisch en design
pt: Imagem e design
ru: Графика и дизайн
sv: Grafik och design
zh_tw: 图形与设计

source: Nicholas Holland and the guys at <a target="new" href="%(cr)s">Centresource</a>: For the website design
nl: Nicholas Holland en de kerels van <a target="new" href="%(cr)s">Centresource</a>: Voor het webstek design
pt: Nicholas Holland e a equipa do <a target="new" href="%(cr)s">Centresource</a> pelo design do sítio web
ru: Nicholas Holland и ребятам из <a target="new" href="%(cr)s">Centresource</a>: за дизайн вебсайта
sv: Nicholas Holland och killarna på <a target="new" href="%(cr)s">Centresource</a>: För webbplatsdesignen
zh_tw: Nicholas Holland 和 <a target="new" href="%(cr)s">Centresource</a> 的伙计们设计了网站

source: diaboNL: For the reader icon
nl: diaboNL: Voor het reader icoon
pt: diaboNL: pelo ícone do leitor
ru: diaboNL: за значок читалки
sv: diaboNL: För läsenhetsikonen
zh_tw: diaboNL：贡献了阅读器图标

source: Caleb Avery and Kamil Tatara: For the calibre logo
nl: Caleb Avery en Kamil Tatara: Voor het calibre logo
pt: Caleb Avery e Kamil Tatara: pelo logótipo do Calibre
ru: Caleb Avery и Kamil Tatara: за логотип calibre
sv: Caleb Avery och Kamil Tatara: För calibre-logotypen
zh_tw: Caleb Avery 和 Kamil Tatara：设计了 calibre 的logo

source: Jonatan Nyberg: For lots of polishing of the UI
nl: Jonatan Nyberg: Voor massa's oppoetsen van de UI
pt: Jonatan Nyberg: pelos vários aperfeiçoamentos na interface de utilizador
ru: Jonatan Nyberg: за большую работу по наведению блеска в интерфейсе пользователя
sv: Jonatan Nyberg: För mycket polering av användargränssnittet
zh_tw: Jonatan Nyberg：对 UI 进行了大量美化
