Repository: debian-calibre/calibre
Catalog: translations-git/website/*.po
Languages: nl, pt, ru, sv, zh_tw

source: subtlepatterns.com: For various textures
nl: subtlepatterns.com: Voor verschillende texturen
pt: subtlepatterns.com: por várias texturas
ru: subtlepatterns.com: за разные текстуры
sv: subtlepatterns.com: För olika texturer
zh_tw: subtlepatterns.com：贡献了各种纹理

source: Recipe writers
nl: Recepten schrijvers
pt: Criadores de receitas
ru: Авторы обработчиков
sv: Receptskrivare
zh_tw: 订阅清单作者

source: Too many people have contributed recipes to list here, but their contributions are a big part of calibre.
nl: Teveel mensen om hier op te lijsten hebben recepten bijgedragen maar hun bijdragen zijn een belangrijk deel van calibre.
pt: Demasiadas pessoas contribuíram com receitas para as poder listar aqui, mas as suas colaborações são uma grande parte do Calibre.
ru: Огромное множество людей предоставило рецепты, и всех здесь не перечислить, но их вклад — значительная часть calibre.
sv: För många har bidragit med recept för att lista här, men deras bidrag är en stor del av calibre.
zh_tw: 太多的人贡献了订阅清单，没有在这里列出，但他们的贡献是能力的一大部分。

source: Translators
nl: Vertalers
pt: Tradutores
ru: Переводчики
sv: Översättare
zh_tw: 翻譯人員

source: The list of translators is available <a target="new" href="%(tr)s">here</a>
nl: De lijst met vertalers is <a target="new" href="%(tr)s">hier</a> beschikbaar
pt: A lista de tradutores está disponível <a target="new" href="%(tr)s">aqui</a>
ru: Список переводчиков доступен <a target="new" href="%(tr)s">здесь</a>
sv: Listan över översättare är tillgänglig <a target="new" href="%(tr)s">här</a>
zh_tw: 翻譯人員清單可以在<a target="new" href="%(tr)s">這裡</a>看到

source: Other projects whose code/libraries calibre uses/links against
nl: Andere projecten waarvan calibre code / bibliotheken / links gebruikt
pt: Outros projetos cujo código/bibliotecas são utilizados pelo Calibre
ru: Другие проекты, чей код/библиотеки использует calibre
sv: Andra projekt vars kod/bibliotek calibre använder/länkar mot
zh_tw: calibre 使用或链接的其他项目的代码/库

source: The Launchpad, Transifex, GitHub and FossHub services for providing bug, file, translation and code hosting for calibre.
nl: The Launchpad, Transifex, GitHub en FossHub diensten voor levering van bug, bestand, vertaal and code hosting voor calibre.
pt: Os serviços The Lauchpad, Transifex, GitHub e FossHub por disponibilizar alojamento dos serviços de monitorização de erros, ficheiros, traduções e código do Calibre.
ru: Сервисы Launchpad, Transifex, GitHub и FossHub за предоставление хостинга для ошибок, файлов, переводов и кода calibre.
sv: Launchpad, Transifex, GitHub och FossHub är tjänster för att tillhandahålla felanmälningar, bidrag, översättningar och kodhosting för calibre.
zh_tw: Launchpad，Transifex，GitHub 和 FossHub 为 calibre 提供漏洞，文件，翻译和代码托管服务。

source: Last, but not least I'd like to thank the folks at <a target="new" href="%(mr)s">mobileread.com</a> for creating a wonderful community for us e-book lovers to gather round.
nl: Als laatste maar niet de minste zou ik de mensen bij <a target="new" href="%(mr)s">mobileread.com</a> willen danken voor de creatie van een prachtige gemeenschap voor ons, e-boek liefhebbers, om samen te komen.
pt: Por último, mas não menos importante, gostaria de agradecer à equipa do <a target="new" href="%(mr)s">mobileread.com</a> por criar uma comunidade maravilhosa onde nós, amantes de livros, nos reunimos.
ru: И наконец, что не менее важно, я хочу поблагодарить людей из <a target="new" href="%(mr)s">mobileread.com</a> за создание для нас, любителей электронных книг, чудесного сообщества, чтобы собраться вместе.
sv: Sist, men inte minst vill jag tacka folket på <a target="new" href="%(mr)s">mobileread.com</a> för att de har skapat en underbar gemenskap för oss bokälskare att samlas runt.
zh_tw: 最后，但并非最不重要的一点，我要感谢 <a target="new" href="%(mr)s">mobileread.com</a> 上的人们为我们的电子书爱好者创建了一个美好的社区。

source: Awards
nl: Prijzen
pt: Prémios
ru: Награды
sv: Utmärkelser
zh_tw: 獎項

source: 4.3 stars
nl: 4.3 sterren
pt: 4.3 estrelas
ru: 4,3 звезды
sv: 4.3 stjärnor
zh_tw: 4.3 星

source: (August, 2022)
nl: (Augustus, 2022)
pt: (Agosto, 2022)
ru: (Август 2022 г.)
sv: (Augusti, 2022)

source: 5 stars
nl: 5 sterren
pt: 5 estrelas
ru: 5 звёзд
sv: 5 stjärnor
zh_tw: 5 顆星

source: (July, 2022)
nl: (Juli, 2022)
pt: (Julho, 2022)
ru: (Июль 2022 г.)
sv: (Juli, 2022)

source: 4.5 stars
nl: 4.5 sterren
pt: 4.5 estrelas
ru: 4,5 звезды
sv: 4.5 stjärnor
zh_tw: 4.5 顆星

source: (May, 2022)
nl: (Mei, 2022)
pt: (Maio, 2022)
ru: (Май, 2022)
sv: (Maj, 2022)

source: 4.7 stars
nl: 4.7 sterren
pt: 4.7 estrelas
ru: 4,7 звезды
sv: 4.7 stjärnor
zh_tw: 4.7 星

source: (Apr, 2021)
pt: (Abr. 2021)
ru: (апрель 2021)
zh_tw: （四月，2021）

source: 4 stars
nl: 4 sterren
pt: 4 estrelas
ru: 4 звезды
sv: 4 stjärnor
zh_tw: 4 星

source: (Apr, 2017)
pt: (Abr. 2017)
ru: (апрель 2017)
zh_tw: (2017, 四月)

source: (Mar, 2017)
ru: (март 2017)
zh_tw: (2017, 五月)

source: 100%% Safe (Jan, 2017)
nl: 100%% Veilig (Jan, 2017)
pt: 100%% seguro (Jan, 2017)
ru: 100%% безопасность (январь 2017)
zh_tw: 100%% 安全 (2017, 一月)

source: (Nov, 2009)
ru: (ноябрь 2009)
zh_tw: (2009, 11月)

source: Press mentions
nl: Pers vermeldingen
pt: Menções nos media
ru: Упоминания в прессе
sv: Uppmärksammanden av media
zh_tw: 新闻提及

source: You can see usage statistics for calibre <a target="usage" href="%(href)s">here</a>.
nl: Gebruiksstatistieken voor calibre kan u <a target="usage" href="%(href)s">hier zien</a>.
pt: Pode ver as estatísticas de utilização do Calibre <a target="usage" href="%(href)s">aqui</a>.
ru: Посмотреть статистику использования calibre можно <a target="usage" href="%(href)s">здесь</a>.
sv: Du kan se användarstatistik för calibre <a target="usage" href="%(href)s">här</a>.
zh_tw: 你可以在<a target="usage" href="%(href)s">這裡</a>檢視 calibre 使用率的統計。

source: You can see usage statistics for the various news sources in calibre <a target="usage" href="%(href)s">here</a>.
nl: Gebruiksstatistieken voor de verschillende nieuwsbronnen in calibre kan u <a target="usage" href="%(href)s">hier zien</a>.
pt: Pode ver as estatísticas de utilização das várias fontes de notícias no Calibre <a target="usage" href="%(href)s">aqui</a>.
ru: Статистика использования в calibre разных источников новостей <a target="usage" href="%(href)s">тут</a>.
sv: Du kan se användarstatistik för de olika nyhetskällorna i calibre <a target="usage" href="%(href)s">här</a>.
zh_tw: 你可以在<a target="usage" href="%(href)s">這裡</a>檢視各種 calibre 新聞來源使用率的統計。

source: What's new in calibre 6.0
nl: Wat is er nieuw in calibre 6.0
pt: Novidades no Calibre 6.0
ru: Что нового в calibre 6.0
sv: Vad är nytt i calibre 6.0

source: See what's new in calibre 6.0
nl: Bekijk wat nieuw is in calibre 6.0
pt: Veja as novidades do Calibre 6.0
ru: Посмотрите, что нового в calibre 6.0
sv: Se vad som är nytt i calibre 6.0

source: Changelog
pt: Registo de alterações
ru: Изменения
sv: Ändringslogg
zh_tw: 更新日誌

source: Major new features
nl: Belangrijke nieuwe functies
pt: Novidades principais
ru: Значительные изменения
sv: Mer omfattande nya funktioner
zh_tw: 主要的新功能

source: The full list of changes to calibre is available <a href="%(master)s">here</a>.
nl: De volledige lijst met veranderingen is <a href="%(master)s">hier</a> beschikbaar.
pt: A lista completa das alterações ao Calibre está disponível <a href="%(master)s">aqui</a>.
ru: Полный список изменений calibre доступен <a href="%(master)s">здесь</a>.
sv: Den fullständiga listan över ändringar av calibre finns <a href="%(master)s">här</a>.
zh_tw: 有关 calibre 更改的完整列表，请单击 <a href="%(master)s">此处</a>

source: Reporting bugs
nl: Bugs rapporteren
pt: Indicar anomalias
ru: Сообщить об ошибках
sv: Felanmälan
zh_tw: 回報錯誤

source: calibre is a very rapidly evolving piece of software, with weekly releases. As a results bugs are inevitable. We rely on calibre's users to report these bugs, so that they can be fixed as quickly as possible. To report bugs use the <a target="_blank" href="%(href)s">calibre bug tracker</a>. Note that you will have to register for a free account first.
nl: calibre is een snel evoluerend stuk software, met wekelijkse versies. Dit zorgt onvermijdelijk voor bugs. We rekenen op calibre gebruikers om deze bugs te melden zodat ze zo snel mogelijk opgelost kunnen worden. Om bugs te melden, gebruik de <a target="_blank" href="%(href)s">calibre bug tracker</a>. Merk op dat u eerst moet registreren voor een gratis account.
pt: O Calibre é um software que evolui muito rapidamente, com atualizações semanais. Consequentemente, erros são inevitáveis. Dependemos dos utilizadores do Calibre para reportar esses erros, de modo que possam ser corrigidos tão depressa quanto possível. Para reportar erros use o <a target="_blank" href="%(href)s">sistema de rastreamento de erros do Calibre</a>. Note que antes de tudo terá de efetuar o registo de utilizador nessa plataforma (conta grátis).
ru: Calibre - очень быстро развивающееся программное обеспечение с еженедельными выпусками. Вследствие этого возникновение ошибок неизбежно. Мы рассчитываем, что пользователи calibre сообщат об этих ошибках, чтобы их можно было исправить как можно быстрее. Для сообщения об ошибках используйте<a target="_blank" href="%(href)s"> трекер ошибок calibre</a>. Заметьте, что вам придётся сначала зарегистрировать бесплатный аккаунт.
sv: calibre är en mycket snabbt utveckland mjukvara med veckovisa utgåvor. Som ett resultat är fel oundvikliga. Vi förlitar oss på att användare av calibre rapporterar dessa fel så att de kan åtgärdas så snabbt som möjligt. För att anmäla fel, använd <a target="_blank" href="%(href)s">felhanteringssystemet för calibre</a>. Observera att du måste registrera dig för ett gratis konto först.
zh_tw: calibre 是一個每周發行、超高速變動的軟體，所以出現 Bug 是必然的。我們仰賴 calibre 的使用者回報錯誤， 所以才能夠盡快的修正錯誤。如果要回報錯誤，請使用<a target="_blank" href="%(href)s">calibre 錯誤追蹤器</a>來進行。 請注意，你必須註冊一個免費帳號先。

source: When reporting bugs please include <b>as much information as possible</b>, as that makes it easier for us to identify the source of the problem. Remember that calibre is developed by volunteers in their spare time, so by taking these steps, you are helping to ensure that as much of that time as possible is spent actually coding as opposed to doing administrative tasks like closing duplicate bug reports.
nl: Geef bij het melden van fouten a.u.b. <b>zoveel mogelijk informatie</b> mee, dat maakt het voor ons gemakkelijker om de bron van het probleem te identificeren. Onthoud dat calibre ontwikkeld wordt door vrijwilligers in hun vrije tijd, door het nemen van deze stappen zorgt u ervoor dat ze zoveel als mogelijk van die tijd programmeren in plaats van administratief werk te doen zoals het afsluiten van dubbele foutmeldingen.
pt: Ao reportar erros, por favor inclua o <b> máximo de informações possível</b>, na medida que isso torna mais fácil identificarmos a origem do problema. Lembre-se que o Calibre é desenvolvido por voluntários no seu tempo livre, pelo que, ao seguir estes passos, está a ajudar a garantir que o máximo desse tempo seja gasto realmente escrevendo código, em vez de tarefas administrativas, como encerrar relatórios duplicados de anomalias
ru: При сообщении об ошибках, пожалуйста, включите <b> как можно больше информации</b>, чтобы нам было легче идентифицировать источник проблемы. Помните, что calibre разрабатывают волонтёры в свободное время, поэтому, включённая вами информация поможет использовать время на программирование, а не на выполнение административных задач вроде закрытия дублирующих отчётов об ошибках.
sv: När du anmäler problem, inkludera <b>så mycket information som möjligt</b>, eftersom det gör det lättare för oss att identifiera källan till problemet. Kom ihåg att calibre är utvecklad av volontärer på fritiden, så genom att vidta dessa steg hjälper du till att säkerställa att så mycket av den tiden som möjligt spenderas till att faktiskt koda i stället för att göra administrativa uppgifter som att stänga dubbla felanmälningar.
zh_tw: 在回報錯誤時，請<b>盡可能的提供最多的資訊</b>，這可以幫助我們更容易識別出問題的來源。請記得，calibre 是由志願者在零碎時間所開發的，所以這麼做，你可以幫助開發者比起花費時間在關閉重複的錯誤回報之類的行政作業，更能確實的把時間花費在程式設計上。

source: If you are including some <strong>sensitive data</strong> in your bug report like a copyrighted book or a debug log, mark the bug as "private", then the data will not be visible to all. You can do this by finding the location where it says "This report contains <b>Public</b> information" in the top right area of the bug's page and clicking the yellow icon next to it.
nl: Als u <strong>gevoelige gegevens</strong> meegeeft in uw foutmelding zoals een auteursrechterlijk beschermd boek of een foutzoeklog, markeer de fout fout als "private", dan zijn de gegevens niet voor iedereen zichtbaar. U doet dit op de plaats waar staat "Dit rapport bevat <b>Publieke</b> informatie", in de rechterbovenhoek van de foutenpagina en klik op het gele icoon ernaast.
pt: Se estiver a incluir alguns <strong>dados confidenciais</strong> no seu relatório de anomalias, tal como um livro com direitos de autor ou um registo de depuração, marque o erro como "private". Desta forma os dados não serão visíveis para todos. Você pode fazer isso no local onde está escrito "Este relatório contém informações <b>públicas</b>" na área superior direita da página de erros e e então clicar no ícone amarelo ao lado.
ru: Если вы включаете некоторые <strong>конфиденциальные данные</strong> в свой отчет об ошибке, например защищенная авторским правом книга или журнал отладки, пометьте ошибку как «private», тогда данные не будут видны всем. Вы можете сделать это, найдя место, где в правом верхнем углу написано «This report contains <b>Public</b> information» страницы ошибки и нажав на жёлтый значок рядом с ним.
sv: Om du inkluderar några <strong>känsliga uppgifter</strong> i din felanmälan som en upphovsrättsskyddad bok eller en felsökningslogg markerar du felanmälningen som "private", då kommer uppgifterna inte att vara synliga för alla. Du kan göra detta genom att hitta platsen där det står "This report contains <b>Public</b> information" i det övre högra området av sidan för felanmälan och klicka på den gula ikonen bredvid den.
zh_tw: 如果你的錯誤回報中含有一些<strong>敏感資料</strong>，像是有版權的書本、 或是錯誤日誌，請把錯誤回報標註為「非公開」，然後資料就不會向所有人公開了。 要修改標註，請在 Bug 的頁面中，在右上方的區域寫著找到「This report contains <b>Public</b> information」文字的旁邊 點選黃色的圖示來修改。

source: You can also use the bug tracker to <b>request new features</b>. To mark a bug report as a request for a new feature just add [Enhancement] to the subject. Please remember that calibre is a highly complex piece of software with millions of users, as such, the priorities of calibre's developers may not match your own and your feature request may well be ignored. Since calibre is open source, one sure way to get your feature request more attention is to implement it yourself and attach the patch implementing it to the bug report.
nl: U kan de bug tracker ook gebruiken voor <b>verzoeken om nieuwe functies</b>. Om een foutrapport als verzoek voor een nieuwe functie te markeren, voeg [Enhancement] toe aan het onderwerp. Denk er a.u.b. aan dat calibre een zeer complex stuk software is met miljoenen gebruikers, de prioriteiten van calibre's ontwikkelaars komen misschien niet overeen met die van u en uw functieverzoek kan genegeerd worden. Daar calibre open source is, is een goede manier om uw functieverzoek meer aandacht te geven, het zelf implementeren en de patch die het implementeert aan het foutrapport toe te voegen.
pt: Também pode usar o rastreador de anomalias para <b>solicitar novas funcionalidades</b>. Para definir um relato de anomalia como sendo um pedido de funcionalidades, adicione [Enhancement] ao assunto. Por favor, lembre-se de que o Calibre é um software altamente complexo, com milhões de utilizadores, pelo que as prioridades dos programadores do Calibre podem não corresponder às suas e o seu pedido de funcionalidades ser ignorado. Sendo que o Calibre possui código aberto, uma maneira de obter maior atenção para o seu pedido de funcionalidades é implementá-lo você mesmo e anexar as alterações ao relatório de anomalias.
ru: Вы также можете использовать трекер ошибок для <b>запроса новых функций</b>. Чтобы пометить отчет об ошибке как запрос новой функции, просто добавьте [Enhancement] к теме. Пожалуйста, помните, что Calibre является очень сложным программным обеспечением с миллионами пользователей, поэтому приоритеты разработчиков calibre могут не совпадать с вашими, и ваш запрос функции может быть проигнорирован. Поскольку у Calibre открытый исходный код, есть один верный способ получить желаемую вами функцию. Напишите патч, реализующий эту функцию, и прикрепите его к своему запросу.
sv: Du kan också använda felhanteringssystemet för att <b>begära nya funktioner</b>. För att markera en felanmälan som en begäran om en ny funktion, lägg bara till [Enhancement] i ämnet. Kom ihåg att calibre är en mycket komplex mjukvara med miljontals användare, som sådan kanske prioriteringarna för calibres utvecklare inte matchar dina egna och din funktionsförfrågan kan mycket väl ignoreras. Eftersom calibre är en mjukvara med öppen källkod, är ett säkert sätt att ge din begäran mer uppmärksamhet, att du implementerar den själv genom att bifoga koden till felanmälan.
zh_tw: 你也可以使用錯誤追蹤器來<b>請求一個新功能</b>。要將錯誤回報標註為請求一個新功能，請在主旨中加上 [Enhancement] 就好了。 請記得 calibre 是個有著數百萬使用者且高度複雜的軟體，因此，calibre 的開發者最優先的事項可能與你的想法不相符，新功能的請求也可能會被忽視。 不過 calibre 是開放原始碼的，所以有個能確保你的功能要求更受到注意的方法，就是您自己實作，然後再把修補的實作附加至錯誤回報中。

source: New to calibre?
nl: Nieuw bij calibre?
pt: Novo no mundo Calibre?
ru: Новичок в calibre?
sv: Ny för calibre?
zh_tw: calibre 新手？

source: calibre is intuitive, but also very powerful. To quickly start using it, get the most out of it or get assistance and tips, you can check out:
nl: calibre is intuïtief, maar ook erg krachtig. Om het snel te gebruiken, er het meeste uit te halen of hulp en tips te krijgen, kijk hier:
pt: O Calibre é intuitivo, mas também muito poderoso. Para começar a usá-lo rapidamente, extrair o máximo dele ou conseguir ajuda e dicas, pode utilizar estes recursos:
ru: calibre интуитивно понятен, но в то же время высокоэффективен. Чтобы просто начать использование либо получить наибольшую отдачу, помощь или совет, вы можете посмотреть:
sv: calibre är intuitiv men också mycket kraftfull. För att snabbt börja använda det, få ut det mesta eller få hjälp och tips, kan du kontrollera:
zh_tw: calibre 很直观，但也非常强大。要快速开始使用它，充分利用它或获得帮助和提示，可以查看：

source: The <a href="%(href)s">Grand Tour</a> introductory <b>video</b> that will show you how to <b>set up calibre</b> and what its <b>main features</b> are.
nl: De <a href="%(href)s">Grand Tour</a> introductie <b>video</b> die u toont hoe <b>calibre in te stellen</b> en wat zijn <b>belangrijkste opties</b> zijn.
pt: <a href="%(href)s">Visita guiada</a>, <b>vídeo</b> introdutório que irá mostrar como <b>configurar o Calibre</b> e quais são as suas <b>principais funcionalidades</b>.
ru: <a href="%(href)s">Видеообзор calibre</a> — ознакомительное <b>видео</b>, которое покажет, как <b>настроить программу</b> и каковы её <b>основные возможности</b>.
sv: <a href="%(href)s">Rundturens</a> inledande <b>video</b> visar dig hur du <b>ställer in calibre</b> och vad dess <b>huvudfunktioner</b> är.
zh_tw: <a href="%(href)s">巡演</a> 介绍 <b>视频</b> 将展示如何 <b>设置calibre</b> 及其 <b>主要功能</b> 。

source: <a href="%(faq)s">Frequently Asked Questions</a> (FAQ) list that will help you <b>resolve common issues</b>.
nl: <a href="%(faq)s">Veelgestelde Vragen</a> (FAQ) lijst die u zal helpen <b>veel voorkomende problemen op te lossen</b>.
pt: Lista de <a href="%(faq)s">Perguntas Frequentes</a> (FAQ) que o ajudarão a <b>resolver problemas habituais</b>.
ru: Список <a href="%(faq)s">часто задаваемых вопросов</a> (ЧаВо), который поможет вам <b>решить типичные проблемы</b>.
sv: Lista över <a href="%(faq)s">vanliga frågor</a> (FAQ) som hjälper dig att <b>lösa vanliga problem</b>.
zh_tw: <a href="%(faq)s">常見問題</a> （FAQ）列表可以幫助您 <b>解決常見問題</b>。

source: The <a href="%(blog)s">Blog</a> that has some easy to follow walk-throughs from a layman’s perspective.
nl: De <a href="%(blog)s">Blog</a> die enkele gemakkelijke walk-throughs heeft vanuit een leek zijn gezichtspunt.
pt: <a href="%(blog)s">Blogue</a> que apresenta algumas dicas fáceis de seguir na perspetiva de um leigo.
ru: <a href="%(blog)s">Блог</a>, в котором помещены несколько простых пошаговых инструкций с точки зрения неспециалиста.
sv: <a href="%(blog)s">Bloggen</a> som har några enkla att följa genomgångar ur ett lekmans perspektiv.
zh_tw: 该 <a href="%(blog)s">博客</a> 具有一些易于外行理解的信息。

source: When you run calibre for the first time, a <em>Quick Start Guide</em> is automatically added to your calibre library
nl: Als u calibre voor de eerste keer draait wordt er automatisch een <em>Quick Start Guide</em> toegevoegd aan uw calibre bibliotheek
pt: Quando executar o Calibre pela primeira vez, um ebook de <em>Guia rápido</em> é adicionado automaticamente à sua biblioteca Calibre
ru: При первом запуске calibre в библиотеку автоматически добавляется <em>Quick Start Guide</em>( краткое руководство)
sv: När du kör calibre för första gången läggs en <em>snabbstartsguide</em> automatiskt till i ditt calibre-bibliotek
zh_tw: 当您第一次运行calibre时，一册<em>快速入门指南</em>将自动添加入您的书库。

source: The comprehensive <a href="%(manual_prefix)s">User Manual</a> that will show you how to do <b>almost anything</b> in calibre.
nl: De uitvoerige <a href="%(manual_prefix)s">User Manual</a> that will show you how to do <b>almost anything</b> in calibre.
pt: Um detalhado <a href="%(manual_prefix)s">Manual do utilizador</a> que lhe mostra como fazer <b>quase tudo</b> com o Calibre.
ru: Исчерпывающее <a href="%(manual_prefix)s">Руководство пользователя</a>, которое покажет вам, как делать <b>практически всё</b>, что угодно в calibre.
sv: Den omfattande <a href="%(manual_prefix)s">användarmanualen</a> visar dig hur du gör <b>nästan vad som helst</b> i calibre.
zh_tw: 完备的<a href="%(manual_prefix)s">用户手册</a>将向您展示如何在 calibre 做 <b>几乎任何事情</b> 。

source: And finally, a <a href="%(forum)s">forum</a> where you can <b>ask any question</b> you might have and get answers.
nl: En tenslotte, een <a href="%(forum)s">forum</a> waar u <b>elke vraag kan stellen</b> die u heeft en antwoorden krijgt.
pt: <a href="%(forum)s">Fórum</a> onde você pode <b>colocar qualquer pergunta</b> e obter respostas.
ru: И наконец, <a href="%(forum)s">форум</a>, где вы можете <b>задать любой возникший вопрос</b> и получить ответ.
sv: Och slutligen, ett <a href="%(forum)s">forum</a> där du kan <b>ställa alla frågor</b> du kan ha och få svar.
zh_tw: 最后是一个<a href="%(forum)s">论坛</a> ，在这里你可以 <b>问任何问题</b> ，并得到答案。

source: You can also check out calibre’s <a href="%(fb)s">Facebook</a> and <a href="%(tw)s">Twitter</a> pages to connect with other users.
nl: U kan ook calibre’s <a href="%(fb)s">Facebook</a> en <a href="%(tw)s">Twitter</a> paginas bekijken om met andere gebruikers te verbinden.
pt: Também pode dar uma olhadela às páginas <a href="%(fb)s">Facebook</a> e <a href="%(tw)s">Twitter</a> do Calibre para se ligar a outros utilizadores.
ru: Также можно связаться с другими пользователями, посетив странички calibre в <a href="%(fb)s">Facebook</a> и <a href="%(tw)s">Twitter</a>.
sv: Du kan också se calibres <a href="%(fb)s">Facebook</a>- och <a href="%(tw)s">Twitter</a>-sidor för att ansluta med andra användare.
zh_tw: 还可以查看 calibre 的 <a href="%(fb)s">Facebook</a> 和 <a href="%(tw)s">Twitter</a> 页面，与其他用户联系。

source: Tutorials
nl: Handleidingen
pt: Tutoriais
ru: Руководства
sv: Handledningar
zh_tw: 教學
