Repository: debian-calibre/calibre
Catalog: translations-git/website/*.po
Languages: nl, pt, ru, sv, zh_tw

source: calibre can also turn your personal documents to e-books or create them from scratch. It can also take all the mundane things that go with it off your plate. It has automatic style helpers and scripts generating the book’s structure. You focus on the content, calibre will take care of the rest.
nl: calibre kan ook uw persoonlijke documenten in e-boeken omzetten of ze van scratch creëren. Het kan ook alle basis taken die erbij horen van uw bord halen. Het heeft automatische stijlhelpers en scripts die de boekstructuur genereren. U kan zich concentreren op de inhoud, calibre zorgt voor de rest.
pt: O Calibre também pode converter os seus documentos pessoais em ebooks ou criá-los a partir do zero. Pode executar, por si, todas as etapas do processo de conversão ou criação. Possui assistentes automáticos de estilo e scripts que permitem criar a estrutura dos livros. Você fica focado no conteúdo e o Calibre toma conta do resto.
ru: calibre может превратить ваши личные документы в электронные книги или создать их с нуля. И избавит вас от лишних дел. В нём есть автоматические помощники по стилям и сценарии, генерирующие структуру книги. Вы фокусируетесь на содержании, calibre позаботится об остальном.
sv: calibre kan också omvandla dina personliga dokument till e-böcker eller skapa dem från grunden. Det kan också ta bort alla vardagliga saker som följer med det. Den har automatiska formathjälpmedel och skript som skapar bokens struktur. Du fokuserar på innehållet, calibre tar han om resten.
zh_tw: calibre 还可以将个人文档转换为电子书，或者从头开始创建电子书。它有自动样式助手和生成图书结构的脚本，能让你从琐碎事情中解脱：你只需专注于内容，calibre 就能处理好剩下的事情。

source: Comprehensive e-book viewer
nl: Uitgebreide e-boek viewer
pt: Visualizador completo de ebooks
ru: Полноценно читайте электронные книги
sv: Omfattande e-bokvisare
zh_tw: 全方位的電子書閱讀器

source: calibre has a built-in e-book viewer that can display <b>all the major e-book formats</b>. It has full support for Table of Contents, highlighting, bookmarks, CSS, read aloud, a reference mode, printing, searching, copying, multi-page view, embedded fonts, and on and on…
nl: calibre heeft een ingebouwde e-boek viewer die <b>alle belangrijkee-boek formaten</b> kan tonen. Het heeft volledige ondersteuning voor ToC, highlighting, bladwijzers, CSS, hardop lezen, een referentie modus, afdrukken, zoeken, kopiëren, multi-page view, ingebedde lettertypes, en meer en meer…
pt: O Calibre possui um visualizador de ebooks integrado que pode exibir <b>todos os principais formatos de ebooks</b>. Possui suporte completo para índice, realces, marcadores, CSS, modo de referência, impressão, pesquisa, cópia, visualização multi-página, fontes incorporadas, e muito mais…
ru: В calibre есть встроенный просмотрщик электронных книг, для <b>основных форматов электронных книг</b>. Он полностью поддерживает содержание, выделения, закладки, CSS, чтение вслух, справочный режим, печать, поиск, копирование, многостраничный просмотр, встроенные шрифты и так далее…
sv: calibre har en inbyggd e-bokvisare som kan visa <b>alla de större e-bokformaten</b>. Den har fullt stöd för innehållsförteckningar, markeringar, bokmärken, CSS, högläsning, ett referensläge, utskrift, sökning, kopiering, flersidig vy, inbäddade teckensnitt, och så vidare…
zh_tw: calibre 内置的电子书阅读器，支持显示 <b>所有主流的电子书格式</b>。 它完全支持目录、高亮、书签、CSS、大声朗读、参考模式、打印、搜索、复制、多页浏览、嵌入字体，等等.....

source: Download news/magazines from the web
nl: Download nieuws/magazines van het web
pt: Descarregue notícias/revistas da Web
ru: Загружайте новости и периодику из сети
sv: Hämta nyheter/tidskrifter från webben
zh_tw: 從網路上下載新聞、雜誌

source: calibre can make sure you know what’s happening and <b>automatically deliver stories</b> to your device from hundreds of news sources like The Economist, New York Times, New Yorker Magazine, The Guardian, BBC News, National Geographic, CNN, The Wall Street Journal, The Washington Post, The Atlantic, Scientific American, Wired Magazine, The Telegraph, Forbes, Ars Technica…
nl: calibre kan ervoor zorgen dat u weet wat er aan de hand is en <b>automaticsh verhalen afleveren</b> op uw toestel van honderden nieuwsbronnen zoals The Economist, New York Times, New Yorker Magazine, The Guardian, BBC News, National Geographic, CNN, The Wall Street Journal, The Washington Post, The Atlantic, Scientific American, Wired Magazine, The Telegraph, Forbes, Ars Technica…
pt: O Calibre pode garantir que você saiba o que está a acontecer e <b>entregar automaticamente histórias</b> no seu dispositivo a partir de centenas de fontes de notícias, como The Economist, New York Times, New Yorker, Magazine, The Guardian, BBC News, National Geographic, CNN, The Wall Street Journal, The Washington Post, The Atlantic, Scientific American, Wired Magazine, The Telegraph, Forbes, Ars Technica, etc…
ru: calibre может держать вас в курсе событий, и <b>автоматически загружать на устройство статьи</b> из сотен источников новостей, таких как The Economist, New York Times, New Yorker Magazine, The Guardian, BBC News, National Geographic, CNN, The Wall Street Journal, The Washington Post, The Atlantic, Scientific American, Wired Magazine, The Telegraph, Forbes, Ars Technica…
sv: calibre kan se till att du vet vad som händer och <b>automatiskt leverera artiklar</b> till din enhet från hundratals nyhetskällor som The Economist, New York Times, New Yorker Magazine, The Guardian, BBC News, National Geographic, CNN, The Wall Street Journal, The Washington Post, The Atlantic, Scientific American, Wired Magazine, The Telegraph, Forbes, Ars Technica…
zh_tw: calibre 可以确保你及时了解正在发生的事情，并能将各种新闻报道<b>自动推送</b>到你的设备上。比如: 经济学人、 纽约时报、 纽约客杂志、卫报、BBC新闻、国家地理、CNN、华尔街日报、华盛顿邮报、大西洋报、科学美国人、连线杂志、电讯报、福布斯、Ars技术.....

source: You can also teach calibre to deliver news from completely different sites or take advantage of any <b>RSS feed</b>. No searching, no waiting, no hassle.
nl: U kan calibre ook leren om nieuws te leveren van compleet andere sites of voordeel te doen van elke <b>RSS feed</b>. Geen gezoek, geen gewacht, geen probleem.
pt: Você também pode ensinar ao Calibre como lhe entregar notícias de sítios completamente diferentes ou tirar vantagem de qualquer <b>sinal RSS</b>. Sem pesquisar, sem esperar, sem confusões.
ru: Ещё вы можете научить calibre получать новости с совершенно разных сайтов или воспользоваться любой <b>RSS-лентой</b>. Ни поисков, ни ожидания, ни хлопот.
sv: Du kan också lära calibre att leverera nyheter från helt olika platser eller dra nytta av alla <b>RSS-flöden</b>. Ingen sökning, ingen väntan, inget krångel.
zh_tw: 你也可以让 calibre 从完全不同的网站获取信息，或者使用<b>RSS feed</b>的订阅。 而做这一切如此简单。

source: Share and backup your library easily
nl: Deel en back-up uw bibliotheek gemakkelijk
pt: Partilhe ou efetue de forma fácil uma cópia de segurança da sua biblioteca
ru: Делитесь своей библиотекой и создавайте резервные копии
sv: Dela och säkerhetskopiera ditt bibliotek enkelt
zh_tw: 輕易的分享、備份書庫

source: calibre comes with a <b>handy web server</b> to host your library. In just a few moments you can <b>safely share</b> all (or just some) of your e-books with anyone you choose or access them yourself from anywhere, using any device you like. With the server, you can read the books in your calibre library on any phone/tablet using just a browser. It even works offline.
nl: calibre komt met een <b>handige web server</b> om uw bibliotheek te hosten. In maar enkele momenten kan u al uw e-boeken (of maar enkele) <b>veilig delen</b> met iedereen die u kiest of ze zelf lezen van overal, met eender welk toestel dat u bevalt. Met de server kan u de boekenin uw calibre bibliotheek op elke telefoon/tablet met enkel een browser. Het werkt zelfs offline.
pt: O Calibre inclui um prático <b>servidor web</b> para alojar a sua biblioteca. Em apenas alguns instantes você pode <b>partilhar facilmente</b> todos (ou alguns) dos seus livros com qualquer pessoa ou acedê-los apenas você mesmo de qualquer lugar e usando qualquer dispositivo. Com o servidor, você pode ler os livros da sua biblioteca em qualquer telemóvel/tablet apenas utilizando um navegador. Funciona até mesmo offline.
ru: calibre поставляется с <b>удобным веб-сервером</b> для размещения вашей библиотеки. Всего за несколько минут вы можете <b>безопасно поделиться</b> всеми (или только некоторыми) своими электронными книгами с кем-либо по выбору или получить к ним доступ из любого места, используя любое понравившееся устройство. С помощью сервера вы можете читать книги в вашей библиотеке calibre на любом телефоне/планшете, используя только браузер. Он даже работает в автономном режиме.
sv: calibre kommer med en <b>praktisk webbserver</b> för att vara värd för ditt bibliotek. På bara några ögonblick kan du <b>säkert dela</b> alla (eller bara några) av dina e-böcker med någon du väljer eller få tillgång till dem från var som helst, med vilken enhet som helst. Med servern kan du läsa böckerna i ditt calibre-bibliotek på vilken telefon/surfplatta som helst med en webbläsare. Det fungerar även frånkopplat.
zh_tw: calibre自带了一个<b>方便的Web服务器</b>，用于托管你的书库。只需几分钟，就可以将所有（或部分）电子书与你选择的任何人<b>安全地分享</b>，或者使用自己喜欢的任何设备从任何地方访问它们。无论在手机上，还是平板电脑上，只需要通过浏览器，就可以访问该web服务器托管的书籍。它甚至可以离线工作。

source: calibre has also some useful backup and import/export features that will guarantee the safety and portability of your book collection with minimal fuss.
nl: calibre heeft ook enkele handige backup en import/export functies de veiligheid en overdraagbaarheid van uw boek collectie garanderen met minimale fuss.
pt: O Calibre também possui algumas funções úteis como cópia de segurança e importação/exportação que irão garantir a segurança e a portabilidade da sua coleção com o mínimo de trabalho.
ru: Также в calibre есть несколько полезных функций резервного копирования и импорта-экспорта, которые гарантируют безопасность и переносимость вашей коллекции книг без хлопот.
sv: calibre har också några användbara funktioner för säkerhetskopiering och import/export som garanterar säkerhet och bärbarhet för din boksamling med minsta krångel.
zh_tw: calibre 还有备份和导入/导出等一系列有用的功能，可以最大限度地保证您的收藏的书库的安全性和便携性。

source: Edit the books in your collection
nl: Bewerk de boeken in uw collectie
pt: Edite os livros da sua coleção
ru: Редактируйте книги в своей коллекции
sv: Redigera böckerna i din samling
zh_tw: 編輯在書集內的書本

source: For the e-book nerds amongst you, calibre has a built-in editor that allows you to <b>edit e-books</b> in the most popular e-book formats, EPUB and Kindle. The editor has many sophisticated features to make editing the innards of e-books as easy and efficient as possible.
nl: Voor de e-boek nerds onder jullie heeft calibre een ingebouwde editor die u toelaat <b>e-boeken te bewerken</b> in de populairste e-boek formaten, EPUB en Kindle. De editor heeft veel gesofisticeerde functies om het bewerken van het interne van e-boeken zo gemakkelijk en efficiënt te maken als mogelijk.
pt: Para os especialistas em ebooks entre vós, o Calibre possui um editor integrado que permite <b>editar ebooks</b> nos formatos mais populares, como EPUB e Kindle. O editor possui inúmeras funções sofisticadas para tornar a edição das entranhas dos ebooks tão fácil e eficiente quanto possível.
ru: Для фанатов электронных книг в calibre есть встроенный редактор, позволяющий <b>изменять книги</b> в самых популярных форматах, EPUB и Kindle. Редактор имеет множество навороченных функций, чтобы сделать редактирование содержимого электронных книг максимально простым и эффективным.
sv: För e-boknördarna bland er har calibre en inbyggd redigerare som låter er <b>redigera e-böcker</b> i de populäraste e-bokformaten, EPUB och Kindle. Redigeraren har många sofistikerade funktioner för att göra redigeringen av e-böckernas innehåll så enkel och effektiv som möjligt.
zh_tw: 对于你们这些书呆子来说，calibre 有一个内置的编辑器，允许你<b>编辑</b>EPUB 和 Kindle 这两种最流行的电子书格式 。 编辑器里有许多复杂的功能，能使编辑过程更简单、高效。

source: Satisfy every e-book need and get support
nl: Bevredig elke e-boek nood en krijg ondersteuning
pt: Satisfaça todas as suas necessidades de ebooks e obtenha ajuda
ru: Удовлетворите все «электроннокнижные» потребности и заручитесь поддержкой
sv: Tillfredsställ alla e-bokbehov och få support
zh_tw: 支持并满足每一个电子书需求

source: It’s unlikely, but if you find out there’s a feature you need but calibre lacks it, you can use the <b>built-in plugin explorer</b>. Many users develop plugins to enhance and expand calibre’s features. You can browse through <b>hundreds of plugins</b> directly from calibre and install them with just one click.
nl: Het is onwaarschijnlijk maar als u ontdekt dat een functie die u nodig heeft ontbreekt in calibre, kan u de <b>ingebouwde plug-in verkenner</b> gebruiken. Veel gebruikers ontwikkelen plug-ins om calibre’s functies uit te breiden en te verbeteren. U kan door <b>hondereden plugins</b> bladeren, direct in calibre en ze met één klik installeren.
pt: É pouco provável, mas se encontrar uma função de que necessite mas que falta ao Calibre, pode utilizar o <b>navegador integrado de plugins</b>. Muitos utilizadores desenvolvem plugins para melhorar e expandir as funções do Calibre. Você pode navegar pelas <b>centenas de plugins</b> diretamente no Calibre e instalá-los com apenas um clique.
ru: Это маловероятно, но если вдруг вам понадобится какая-то функция, отсутствующая в calibre, вы можете воспользоваться <b>встроенным обозревателем плагинов</b>. Многие пользователи разрабатывают плагины, чтобы улучшить или расширить возможности calibre. Вы можете просматривать <b>сотни плагинов</b> прямо из calibre и устанавливать их одним щелчком.
sv: Det är osannolikt, men om du upptäcker att det finns en funktion du behöver men calibre saknar den, kan du använda den <b>inbyggda insticksmodulsutforskaren</b>. Många användare utvecklar insticksmoduler för att förbättra och utöka calibres funktioner. Du kan bläddra bland <b>hundratals insticksmoduler</b> direkt från calibre och installera dem med bara ett klick.
zh_tw: 虽然不太可能，但如果你发现有一个需要功能 calibre没有提供，你可以使用<b>内置的插件</b>浏览器查找。您可以浏览<b>数百个</b>其他用户开发的可以增强和扩展 calibre 功能的插件，并根据自己的需求一键下载安装。

source: calibre has more than 3 million active installs and <b>lots of fans</b>! You will never have to wait to solve any issue you might encounter: you can use the <a href="%(help)s">extensive help resources</a>, or just ask members of the <a href="%(mr)s">calibre forum</a>.
nl: calibre heeft meer dan 3 miljoen actieve installaties en </b>massa's fans</b>! U zal nooit moeten wachten om een probleem op te lossen dat u zou kunnen tegen komen: u kan de <a href="%(help)s">uitgebreide helpbronnen</a> gebruiken, of het gewoon vragen aan leden van het <a href="%(mr)s">calibre forum</a>.
pt: O Calibre possui mais de 3 milhões de instalações ativas <b>inúmeros fãs</b>! Não terá que esperar muito para resolver qualquer problema que possa encontrar: pode utilizar os extensos <a href="%(help)s">recursos de ajuda</a>, ou apenas perguntar aos membros do <a href="%(mr)s">fórum Calibre</a>.
ru: У calibre более 3 миллионов активных установок и <b>множество поклонников</b>! Вам нет необходимости ждать решения какой-либо проблемы, с которой столкнулись: вы можете воспользоваться <a href="%(help)s">обширными справочными материалами</a> или просто спросить завсегдатаев <a href="%(mr)s">форума calibre</a>.
sv: calibre har över 3 miljoner aktiva installationer och <b>massor av fantaster</b>! Du behöver aldrig vänta med att lösa något problem du kan stöta på: du kan använda de <a href="%(help)s">omfattande hjälpresurserna</a> eller bara fråga medlemmarna i <a href="%(mr)s">calibre-forumet</a>.
zh_tw: calibre 已经有超过300万激活安装量，也有<b>很多粉丝</b>！当遇到问题时，不必坐等：您可以查看<a href="%(help)s">丰富的帮助资源</a>，或直接向<a href="%(mr)s">calibre论坛</a>的的会员咨询。

source: calibre is created by <b>book lovers</b>, for book lovers. Hundreds of motivated <b>volunteers develop</b> calibre and deliver updates on a regular basis. Most issues are <b>resolved in a week</b>. With every update, we fix bugs, add new features and make calibre more compatible, faster and easier.
nl: calibre werd gecreëerd door <b>boek liefhebbers</b>, voor boek liefhebbers. Honderden gemotiveerde <b>vrijwilligers ontwikkelen</b> calibre en leveren regelmatig updates af. Meeste problemen worden binnen <b>een week opgelost</b>. Met elke update herstellen we bugs, voegen functies toe end maken calibre meer compatible, sneller en gemakkelijker.
pt: O Calibre foi criado por <b>amantes dos livros</b> e para os amantes dos livros. Centenas de <b>voluntários motivados desenvolvem</b> o Calibre e disponibilizam atualizações de forma regular. A maioria dos problemas são <b>resolvidos numa semana</b>. A cada atualização corrigimos erros, adicionamos novos recursos e tornamos o Calibre mais compatível, rápido e fácil.
ru: calibre создана <b>книголюбами</b> для книголюбов. Сотни заинтересованных <b>добровольцев разрабатывают</b> calibre и регулярно выпускают обновления. Многие проблемы <b>решаются за неделю</b>. В каждом обновлении мы исправляем ошибки, добавляем новые функции и делаем calibre более совместимой, быстрее и проще.
sv: calibre är skapad av <b>bokälskare</b>, för bokälskare. Hundratals motiverade <b>volontärer utvecklar</b> calibre och levererar uppdateringar på en regelbunden basis. De flesta problem <b>löses på en vecka</b>. Med varje uppdatering, åtgärdar vi problem, lägger till nya funktioner och gör calibre kompatiblare, snabbare och enklare.
zh_tw: calibre由图书<b>爱好者</b>所创，为图书爱好者而生。数以百计志愿者们，积极主动的参与到了<b>开发</b>和定期更新当中。大多数问题， 都能在<b>一个星期内解决</b>。每次更新，我们都会修复BUG，增加新的功能，并使 calibre 兼容更好、运行更快、使用更容易。

source: Celebrate over fifteen years of excellence with us and <a href="%(href)s">download</a> calibre today!
nl: Vier meer dan 15 jaar uitmuntendheid met ons en <a href="%(href)s">download</a> calibre vandaag!
pt: Comemore connosco mais de 15 anos de excelência e <a href="%(href)s">descarregue hoje </a> o Calibre!
ru: Отметьте более пятнадцати лет совершенства вместе с нами и <a href="%(href)s">загрузите</a> calibre сегодня!
sv: Fira över femton år av utomordentlighet med oss och <a href="%(href)s">hämta</a> calibre idag!
zh_tw: 與我們一起慶祝 15 年多的卓越成就，今天就 <a href="%(href)s">下載</a> calibre 吧！

source: calibre started life on 31 October, 2006, soon after the release of the SONY PRS-500, the first e-ink based reader to be sold commercially in the US. At the time, I was a graduate student, with a lot of time on my hands. The PRS-500 did not work at all with Linux, my operating system of choice, so I decided to reverse engineer the USB protocol that it used, to get it working on Linux. This was accomplished with the help of the fine folks over at <a href="%(mr)s" target="new">mobileread.com</a> and calibre was born, albeit named <code>libprs500</code>.
nl: calibre werd geboren op 31 oktober 2006, kort na de release van de SONY PRS-500, de eerste e-inkt gebaseerde reader verkocht in de US. Ik was toen een graduaatsstudent met een hoop vrije tijd. De PRS-500 werkte totaal iet samen met Linux, mijn favoriete besturingssysteem, dus ik besloot het USB protocol dat gebruikt werd uiteen te halen om het te laten werken op Linux. Dit werd gedaan met de hulp van de toffe mensen van <a href="%(mr)s" target="new">mobileread.com</a> en calibre was geboren, hoewel genaamd <code>libprs500</code>.
pt: O Calibre ganhou vida a 31 de outubro de 2006, logo após o lançamento do SONY PRS-500, o primeiro leitor de tinta digital a ser vendido comercialmente nos Estados Unidos. Na ocasião eu era um estudante de graduação com muito tempo disponível. O PRS-500 não funcionava em Linux, o meu sistema operativo, pelo que resolvi fazer engenharia reversa ao protocolo USB que ele utilizava, para o fazer funcionar no Linux. Isso foi alcançado com a ajuda dos utilizadores do <a href="%(mr)s" target="new">mobileread.com</a> e o Calibre nasceu, embora chamado de <code>libprs500</code>.
ru: calibre появилась на свет 31 октября 2006 вскоре после выхода SONY PRS-500, первого продаваемого в США устройства чтения электронных книг на основе электронных чернил. Тогда я учился в аспирантуре, и у меня было много свободного времени. PRS-500 совсем не работало с Linux, моим выбором операционной системы, поэтому я решил провести обратный инжиниринг USB протокола, который в нём использовался, чтобы заставить его работать с Linux. Это было сделано с помощью замечательных людей из <a href="%(mr)s" target="new">mobileread.com</a>, вот так появился calibre, хотя и называвшийся <code>libprs500</code>.
sv: calibre började sitt liv den 31 oktober 2006, strax efter lanseringen av SONY PRS-500, den första e-bläckbaserade läsenheten som såldes kommersiellt i USA. På den tiden var jag en doktorand med mycket tid att avvara. PRS-500 fungerade inte alls med Linux, mitt val av operativsystem, så jag bestämde mig för att omvända USB-protokollet som den använde för att få det att fungera på Linux. Detta åstadkoms med hjälp av gott folk på <a href="%(mr)s" target="new">mobileread.com</a> och calibre föddes, fast med namnet <code>libprs500</code>.
zh_tw: calibre 于2006年10月31日，即第一款在美国销售的基于电子墨水屏的索尼PRS-500 阅读器发布后不久后问世。当时，我还是一名研究生，手头时间也很充足。由于 PRS-500 无法适配我的 Linux 操作系统，所以我决定对它使用的USB协议进行反向工程，使其能够在 Linux 上工作。后来在<a href="%(mr)s" target="new">mobileread.com</a> 上的精英们的帮助下 calibre 诞生了，不过它最初名字是 <code>libprs500</code>。

source: At the time there were no satisfactory tools to convert content into the <code>LRF</code> format, used by the SONY reader, so I decided to implement a converter to convert the most popular e-book formats to LRF. This converter proved to be wildly popular and far better than the (mostly non-existent) offerings from SONY. It was picked up and used by various publishing houses and content digitizers to produce the first generation of books in the LRF format.
nl: Er waren toen geen toereikende gereedschappen om naar het <code>LRF</code> formaat, gebruikt door de SONY reader, te converteren, dus ik besloot een converter toe te passen om de populairste e-boekformaten te converteren naar LRF. Deze converter bleek super populair en veel beter dan het (bijna onbestaande) aanbod van SONY. Het werd opgepikt en gebruikt bij verschillende uitgeverijen en inhoud digitaliseerders om de eerste generatie boeken in LRF formaat te maken.
pt: Na época não existiam ferramentas satisfatórias para converter conteúdo para o formato <code>LRF</code> que era o usado pelo leitor SONY. Então decidi implementar um conversor para converter os formatos mais populares de ebook para LRF. Este conversor provou-se altamente popular e bem melhor do que as (praticamente inexistentes) ofertas da SONY. Foi escolhido e utilizado por várias editoras e digitalizadores de conteúdos para produzir a primeira geração de livros no formato LRF.
ru: В то время не было нормальных инструментов для преобразования содержимого в формат <code>LRF</code>, использующийся в читалке SONY, поэтому я решил создать конвертер для преобразования самых популярных форматов электронных книг в LRF. Этот конвертер оказался дико популярен и намного лучше, чем (по большей части несуществующие) предложения от SONY. Он был подхвачен и использован разными издательствами и оцифровщиками содержимого в производстве первого поколения книг в формате LRF.
sv: Vid den tidpunkten fanns det inga tillfredsställande verktyg för att konvertera innehåll till formatet <code>LRF</code>, som användes av SONY-läsenheten, så jag bestämde mig för att implementera en konverterare för att konvertera de populäraste e-bokformaten till LRF. Den här konverteraren visade sig vara väldigt populär och mycket bättre än de (oftast obefintliga) erbjudandena från SONY. Den hämtades och användes av olika utgivare och innehållsdigitaliserare för att producera den första generationen böcker i formatet LRF.
zh_tw: 当时还没有令人满意的工具可以将文档转换为SONY阅读器专用的 <code>LRF</code> 格式，因此我决定开发一个转换工具：将最受欢迎的电子书格式转换为LRF。 事实证明，此转换器非常受欢迎，并且比SONY的（几乎不存在的）产品要好得多。它被各种出版社和数字化公司所采用，用来制作第一代 LRF格式的书籍。
