Repository: debian-calibre/calibre
Catalog: translations-git/website/*.po
Languages: nl, pt, ru, sv, zh_tw

source: E-book management
nl: E-boek beheer
pt: Gestão de ebooks
ru: Управление электронными книгами
sv: E-bokhantering
zh_tw: 電子書的管理學

source: calibre: The one stop solution for all your e-book needs. Comprehensive e-book software.
nl: calibre: e one-stop oplossing voor al uw e-boekbehoeften. Uitgebreide e-boek software.
pt: Calibre: a solução centralizada para todas as suas necessidades ligadas a livros digitais. Um software completo para ebooks.
ru: calibre: универсальное решение для электронных книг. Исчерпывающее программное обеспечение для этого.
sv: calibre: En samlad lösning för alla dina e-bokbehov. Omfattande e-bokprogramvara.
zh_tw: calibre：滿足您所有電子書需求的一站式解決方案。全面的電子書軟體。

source: The features and history of calibre
nl: De functies en geschiedenis van calibre
pt: Funcionalidades e história do Calibre
ru: Возможности и история calibre
sv: calibres funktioner och historia
zh_tw: calibre 的功能與歷史

source: About Calibre
nl: Over Calibre
pt: Sobre o Calibre
ru: О calibre
sv: Om Calibre
zh_tw: 關於 Calibre

source: See calibre in action
nl: Zie calibre in actie
pt: Veja o Calibre em ação
ru: Посмотрите calibre в действии
sv: Se calibre i aktion
zh_tw: 请参阅 calibre 实际操作

source: Demo
ru: Демо
zh_tw: 展示

source: Download calibre for your operating system
nl: Download calibre voor uw besturingssysteem
pt: Descarregar o Calibre adequado ao seu sistema operativo
ru: Скачайте calibre для вашей операционной системы
sv: Hämta calibre för ditt operativsystem
zh_tw: 為您的作業系統下載 calibre

source: Download
nl: Downloaden
pt: Descarregar
ru: Скачать
sv: Hämta
zh_tw: 下載

source: Get help on using calibre
nl: Krijg hulp bij het gebruik van calibre
pt: Obter ajuda na utilização do Calibre
ru: Помощь в использовании calibre
sv: Få hjälp med att använda calibre
zh_tw: 獲得一些 calibre 使用上的幫助

source: Help
nl: Hulp
pt: Ajuda
ru: Справка
sv: Hjälp
zh_tw: 說明

source: What's new in calibre world
nl: Wat is er nieuw in de calibre wereld
pt: Novidades no mundo Calibre
ru: Что новенького в мире calibre
sv: Vad är nytt i calibre-världen
zh_tw: 看看 calibre 世界裡多了些什麼

source: What's New
nl: Wat is er Nieuw
pt: Novidades
ru: Новости
sv: Vad Är Nytt
zh_tw: 新功能

source: Contribute to calibre
nl: Draag bij aan calibre
pt: Apoie o Calibre
ru: Внесите свой вклад в calibre
sv: Bidra till calibre
zh_tw: 加入 calibre 的行列

source: Get Involved
nl: Raak betrokken
pt: Colaborar
ru: Участие
sv: Bli Involverad
zh_tw: 加入我們

source: Report bugs / enhancement requests
nl: Rapporteer bugs / verbeteringsverzoeken
pt: Indicação de problemas / pedido de funcionalidades
ru: Сообщайте об ошибках или предлагайте улучшения
sv: Felanmälan / förbättringsförfrågningar
zh_tw: 回報臭蟲、或是加強功能的建議

source: Bugs
nl: Problemen
pt: Anomalias
ru: Ошибки
sv: Felanmälan
zh_tw: 回報錯誤

source: Change the language of this website
nl: Verander de taal van deze website
pt: Alterar o idioma deste sítio
ru: Изменить язык веб-сайта
sv: Ändra språket för den här webbplatsen
zh_tw: 檢視這個網站的其他語言

source: Language
nl: Taal
pt: Idioma
ru: Язык
sv: Språk
zh_tw: 語言

source: Support calibre development
nl: Ondersteun calibre ontwikkeling
pt: Apoie o desenvolvimento do Calibre
ru: Поддержите разработку calibre
sv: Stöd utvecklingen av calibre
zh_tw: 幫助 calibre 的開發

source: Contribute to support calibre development
nl: Draag bij om calibre ontwikkeling te ondersteunen
pt: Contribuir para apoiar o desenvolvimento do Calibre
ru: Внести вклад в поддержку развития calibre
sv: Bidra till att stöda utvecklingen av calibre
zh_tw: 贊助 calibre 的開發

source: Support Calibre
nl: Steun Calibre
pt: Apoiar o Calibre
ru: Поддержать calibre
sv: Stöd Calibre
zh_tw: 幫助 calibre

source: RSS feed of the calibre changelog
nl: RSS-feed van de calibre changelog
pt: Notícias sobre alterações ao Calibre
ru: RSS-лента истории изменений calibre
sv: RSS-flöde av calibre-ändringsloggen
zh_tw: calibre 更新日誌的 RSS 推送

source: Feed of new releases
nl: Feed van nieuwe versies
pt: RSS de novas versões
ru: Лента новых выпусков
sv: Flöde med nya utgåvor
zh_tw: 新的版本釋出時的RSS推送

source: Design by Centresource Interactive Agency
nl: Ontwerp door Centresource Interactive Agency
pt: Design: Centresource
ru: Сайт разработан Centresource Interactive Agency
sv: Design av Centresource Interactive Agency
zh_tw: 由 Centresource Interactive Agency 設計

source: Choose the language you want
nl: Kies de gewenste taal
pt: Escolha o idioma pretendido
ru: Выберите нужный язык
sv: Välj det språk du vill ha
zh_tw: 請選擇您所屬意的語言

source: Save as default language
nl: Als standaardtaal opslaan
pt: Guardar como idioma padrão
ru: Сохранить как язык по умолчанию
sv: Spara som standardspråk
zh_tw: 儲存為預設語言

source: Cancel
nl: Annuleren
pt: Cancelar
ru: Отменить
sv: Avbryt
zh_tw: 取消

source: Thank you!
nl: Dank u!
pt: Obrigado!
ru: Спасибо!
sv: Tack!
zh_tw: 非常感謝你！

source: Your support helps keep calibre development alive.
nl: Uw steun helpt de ontwikkeling van calibre levend te houden.
pt: O seu apoio ajuda a manter vivo o desenvolvimento do Calibre.
ru: Ваша поддержка помогает разработке calibre.
sv: Ditt stöd hjälper till att hålla utvecklingen av calibre levande.
zh_tw: 你的幫忙可以讓 calibre 的開發工作延續下去

source: Contribute
nl: Bijdragen
pt: Contribuir
ru: Внести
sv: Bidra
zh_tw: 贊助

source: Amount:
nl: Bedrag:
pt: Valor:
ru: Сумма:
sv: Belopp:
zh_tw: 金額

source: Contacting payment provider, please wait
nl: Betalingsprovider contacteren, even wachten aub
pt: A contactar o serviço de pagamento. Por favor, aguarde
ru: Связываемся с поставщиком платежей, пожалуйста, подождите
sv: Kontaktar betalningsleverantören, vänta
zh_tw: 正在和支付金流連線中，請稍後

source: Become a calibre patron
nl: Word een calibre beschermheer
pt: Torne-se um patrono do Calibre
ru: Стать патроном calibre
sv: Bli en beskyddare av calibre (Patreon)
zh_tw: 成為 calibre patron

source: Pay with credit card or PayPal
nl: Betaal met creditcard of PayPal
pt: Pague com cartão de crédito ou PayPal
ru: Оплатить кредиткой или через PayPal
sv: Betala med kreditkort eller PayPal
zh_tw: 使用信用卡或是 PayPal

source: PayPal unavailable!
nl: PayPal niet beschikbaar!
pt: PayPal não disponível
ru: PayPal недоступен!
sv: PayPal otillgängligt!
zh_tw: PayPal 無法使用！

source: Payment successful! Thank you for your support.
nl: Betaling gelukt! Bedankt voor uw ondersteuning.
pt: Pagamento realizado com sucesso! Muito obrigado pelo seu apoio.
ru: Успешная оплата! Спасибо за вашу поддержку.
sv: Betalad! Tack för ditt stöd.
zh_tw: 成功付款！感謝您的贊助

source: Payment failed!
nl: Betaling mislukt!
pt: Falha no pagamento!
ru: Оплата не прошла!
sv: Betalningen misslyckades!
zh_tw: 付款失敗！

source: calibre for iOS
nl: calibre voor iOS
pt: Calibre para iOS
ru: calibre для iOS
sv: calibre för iOS
zh_tw: iOS 版的 calibre

source: calibre itself does not run on the iPhone/iPad, but you can connect to calibre running on your Mac, read books and manage your library on the iDevice.
nl: calibre zelf draait niet op de iPhone/iPad, maar u kunt wel verbinding maken met calibre op uw Mac, boeken lezen en uw bibliotheek beheren po het iDevice.
pt: O Calibre não funciona diretamente em iPhone/iPad, mas você pode ligar-se ao Calibre em execução no seu Mac, ler livros e gerir a sua biblioteca no dispositivo móvel.
ru: Сам calibre не работает на iPhone/iPad, но вы можете подключить calibre на Mac, читать книги и управлять своей библиотекой на iDevice.
sv: calibre själv körs inte på iPhone/iPad, men du kan ansluta till calibre som körs på din Mac, läsa böcker och hantera ditt bibliotek på iEnheten.
zh_tw: calibre 本身不能运行在 iPhone/iPad 上，但可以通过多种方式连接到在 Mac上运行的 calibre 来阅读书籍和管理你的书库。

source: You can connect to calibre using just Safari on the iDevice, and manage your collection and even read books in the browser, using the calibre <i>Content server</i>. To learn how to do this, see <a href="%(ii)s">the User Manual</a>.
nl: U kan met calibre verbinden met enkel Safari op uw iDevice en uw collectie beheren en zelfs boeken lezen in de browser, met gebruik van de calibre <i>Content server</i>. Om te leren hoe, kijk in <a href="%(ii)s">de Handleiding</a>.
pt: Pode ligar-se ao Calibre usando apenas o Safari no dispositivo móvel. Poderá gerir a sua coleção, e até ler livros no navegador, se utilizar o <i>Servidor de conteúdos</i>do Calibre. Para saber como o fazer, veja o <a href="%(ii)s">Manual de utilizador</a>.
ru: Вы также можете подключиться к calibre, используя только Safari на телефоне, и управлять своей коллекцией и даже читать книги в браузере, используя calibre <i>Контент-сервер</i>. Чтобы узнать, как это сделать, см. <a href="%(ii)s">Руководство пользователя</a>.
sv: Du kan ansluta till calibre med bara Safari på iEnheten, och hantera din samling och till och med läsa böcker i webbläsaren med hjälp av calibre-<i>innehållsservern</i>. För att lära dig hur du gör detta, se <a href="%(ii)s">användarmanualen</a>.
zh_tw: 您只需要使用苹果设备上的Safari即可连接到Calibre， 在浏览器中使用Calibre<i>内容服务器</i>管理您的藏书，甚至阅读书籍。 要了解如何执行此操作，请参阅 <a href="%(ii)s">用户手册</a>。

source: Download for %(which)s
nl: Download voor %(which)s
pt: Descarregar para %(which)s
ru: Скачать для %(which)s
sv: Hämta för %(which)s
zh_tw: 下載%(which)s版

source: calibre works on Windows 10 and higher.
nl: calibre werkt in Windows 10 en hoger.
pt: Calibre funciona em Windows 10 ou superior.
ru: calibre работает в Windows 10 и выше.
sv: calibre fungerar på Windows 10 och senare.

source: Download calibre %(installer_suffix)s
pt: Descarregar Calibre %(installer_suffix)s
ru: Скачать calibre %(installer_suffix)s
sv: Hämta calibre %(installer_suffix)s
zh_tw: 下載 calibre %(installer_suffix)s

source: Version: %(version)s
nl: Versie: %(version)s
pt: Versão: %(version)s
ru: Версия: %(version)s
zh_tw: 版本: %(version)s

source: What's new
nl: Wat is er nieuw
pt: Novidades
ru: Что нового
sv: Vad är nytt
zh_tw: 新功能

source: Alternate download location #1
nl: Alternatieve downloadlocatie #1
pt: Local alternativo #1 para descarregar
ru: Зеркало загрузки № 1
sv: Alternativ hämtningsplats #1
zh_tw: 備援載點 #1

source: Alternate download location #2
nl: Alternatieve downloadlocatie #2
pt: Local alternativo #2 para descarregar
ru: Зеркало загрузки № 2
sv: Alternativ hämtningsplats #2
zh_tw: 備援載點 #2

source: While you wait for the download to complete, please consider contributing to support the development of calibre.
nl: Overweeg, terwijl u wacht tot de download is voltooid, een bijdrage te leveren om de ontwikkeling te ondersteunen van calibre.
pt: Enquanto espera pela conclusão da transferência, por favor, considere contribuir e apoiar o desenvolvimento do Calibre
ru: Пока ждёте завершения загрузки, пожалуйста, подумайте о возможности поддержать разработку calibre.
sv: Överväg att bidra till att stöda utvecklingen av calibre medan du väntar på att hämtningen slutförs.
zh_tw: 在您等待下載完成時候，您可以考慮看看是否要贊助 calibre 的開發工作。

source: Previous releases of calibre are available <a href="%(previous_releases)s">here</a>.
nl: Eerdere versies van calibre zijn <a href="%(previous_releases)s">hier</a> beschikbaar.
pt: As versões anteriores do Calibre estão disponíveis <a href="%(previous_releases)s">aqui</a>.
ru: Предыдущие выпуски calibre доступны <a href="%(previous_releases)s">здесь</a>.
sv: Tidigare utgåvor av calibre finns <a href="%(previous_releases)s">här</a>.
zh_tw: 過去的 calibre 發行版本可以在<a href="%(previous_releases)s">這裡</a>檢視。

source: Note
nl: Notitie
pt: Nota
ru: Примечания
sv: Observera
zh_tw: 注意

source: If you are using Windows 8, please use calibre 5.44, which works with all Windows 8 machines, <a href="%(previous_releases)s/5.44.0">from here</a>. Simply un-install calibre and install 5.44, doing so will not affect your books/settings.
nl: Als u Windows 8 gebruikt, gebruik dan aub calibre 5.44, wat werkt op alle Windows 8 machines, <a href="%(previous_releases)s/5.44.0">van hier</a>. Deïnstalleer gewoon calibre en installeer 5.44, dit zal uw boeken/instellingen niet beïnvloeden.
pt: Se está a utilizar o Windows 8, por favor deve usar o Calibre 5.44 pois funciona em todas as versões do Windows 8. Está <a href="%(previous_releases)s/3.48.0">disponível aqui</a>. Basta desinstalar o Calibre mais recente e instalar a versão 5.44. Isto não irá afetar os seus livros ou configurações existentes.
ru: Если у вас Windows 8, пожалуйста, используйте calibre 5.44, работающую на всех машинах с Windows 8, <a href="%(previous_releases)s/3.48.0">отсюда</a>. Просто удалите calibre и установите версию 5.44, это никак не повлияет на ваши книги/настройки.
sv: Om du använder Windows 8, använd calibre 5.44, som fungerar med alla Windows 8-maskiner, <a href="%(previous_releases)s/5.44.0">härifrån</a>. Avinstallera helt enkelt calibre och installera 5.44, det påverkar inte dina böcker/inställningar.

source: If you are using Windows 7 or Vista, please use calibre 3.48, which works with all Windows 7/Vista machines, <a href="%(previous_releases)s/3.48.0">from here</a>. Simply un-install calibre and install 3.48, doing so will not affect your books/settings.
nl: Als u Windows 7 of Vista gebruikt, gebruik dan aub calibre 3.48, wat werkt op alle Windows 7/Vista machines, <a href="%(previous_releases)s/3.48.0">van hier</a>. Deïnstalleer gewoon calibre en installeer 3.48, dit zal uw boeken/instellingen niet beïnvloeden.
pt: Se está a utilizar o Windows 7 ou Vista deve usar o Calibre 3.48 pois funciona em todas as versões do Windows 7/Vista. Está <a href="%(previous_releases)s/3.48.0">disponível aqui</a>. Basta desinstalar o Calibre mais recente e instalar a versão 3.48. Isso não irá afetar os seus livros ou configurações.
ru: Если у вас Windows 7 или Vista, пожалуйста, используйте calibre 3.48, работающую на всех машинах с Windows 7/Vista, <a href="%(previous_releases)s/3.48.0">отсюда</a>. Просто удалите calibre и установите версию 3.48, это никак не повлияет на ваши книги/настройки.
sv: Om du använder Windows 7 eller Vista, använd calibre 3.48, som fungerar med alla Windows 7/Vista-maskiner, <a href="%(previous_releases)s/3.48.0">härifrån</a>. Avinstallera helt enkelt calibre och installera 3.48, det påverkar inte dina böcker/inställningar.

source: The application cannot be run from within the dmg. You must drag it to a folder on your filesystem (The Desktop, Applications, wherever).
nl: De applicatie kan niet worden uitgevoerd in de dmg. U moet het naar een map op uw bestandssysteem slepen (het Bureaublad, Applicaties, waar dan ook).
pt: A aplicação não pode ser executada dentro do dmg. Deve arrastá-la para uma pasta no seu sistema de ficheiros (Ambiente de Trabalho, Programas, etc).
ru: Приложение нельзя просто запустить из dmg. Сначала следует перетащить его в папку вашей файловой системы (Desktop, Applications — куда угодно).
sv: Programmet kan inte köras från dmg-filen. Du måste dra den till en mapp på ditt filsystem (Skrivbordet, Program, var som helst).
zh_tw: 這個程式無法在 dmg 內執行。你必須將其拖曳至您的檔案系統中的資料夾( 桌面、應用程式、隨便一個地方 )。

source: In order to show calibre in a different language, open the preferences (by pressing ⌘+P) and select your language.
nl: Om kaliber in een andere taal te tonen, open de voorkeuren (door op ⌘+P te drukken) en selecteer uw taal.
pt: Para exibir o Calibre noutro idioma, abra as preferências (premindo ⌘+P) e selecione o seu idioma.
ru: Чтобы отобразить calibre на другом языке, откройте параметры (нажав ⌘+P) и выберите язык.
sv: För att använda calibre på ett annat språk, öppna inställningarna (genom att trycka ⌘+P) och välj ditt språk.
zh_tw: 想要讓 calibre 顯示不同的語言了話，請開啟偏好設定 ( 按下 ⌘+P ) 然後選擇你想要使用的語言。

source: If you are using macOS older than 10.15 (Catalina), the last version of calibre that will work on your machine is 5.44, available
nl: Als u macOS ouder dan 10.15 (Catalina) gebruikt, is de laatste versie van calibre die op uw machine werkt 5.44, beschikbaar
pt: Se está a utilizar um macOS anterior ao 10.15 (Catalina), a última versão do Calibre que irá funcionar na sua máquina é a 5.44, disponível
ru: Если ваша macOS старше 10.15 (Catalina), последняя версия calibre, которая будет работать на вашей машине, 5.44, доступная
sv: Om du använder macOS äldre än 10.15 (Catalina), är den senaste versionen av calibre som fungerar på din maskin 5.44, tillgänglig

source: If you are using macOS older than 10.14 (Mojave), the last version of calibre that will work on your machine is 3.48, available
nl: Als u macOS ouder dan 10.14 (Mojave) gebruikt, is de laatste versie van calibre die op uw machine werkt 3.48, beschikbaar
pt: Se está a utilizar um macOS anterior ao 10.14 (Mojave), a última versão do Calibre que irá funcionar na sua máquina é a 3.48, disponível
ru: Если ваша macOS старше 10.14 (Mojave), последняя версия calibre, которая будет работать на вашей машине, 3.48, доступна
sv: Om du använder macOS äldre än 10.14 (Mojave), är den senaste versionen av calibre som fungerar på din maskin 3.48, tillgänglig
zh_tw: 如果您正在使用 低於 10.14 (Mojave) 的 macOS 版本，最終的能夠執行的版本為 3.48，請點

source: If you are using macOS 10.8 (Mountain Lion), the last version of calibre that will work on your machine is 2.85.1, available
nl: Als u macOS 10.8 (Mountain Lion) gebruikt, is de laatste versie van calibre die op uw machine werkt 2.85.1, beschikbaar
pt: Se está a utilizar um macOS anterior ao 10.8 (Mountain Lion), a última versão do Calibre que irá funcionar na sua máquina é a 2.85.1, disponível
ru: Если у вас macOS 10.8 (Mountain Lion), последняя работающая на вашей машине версия calibre 2.85.1, доступна
sv: Om du använder macOS 10.8 (Mountain Lion), är den senaste versionen av calibre som fungerar på din maskin 2.85.1, tillgänglig
zh_tw: 如果您正在使用 低於 10.8 (Mountain Lion) 的 macOS 版本，最終的能夠執行的版本為 2.85.1，請點

source: Download calibre Portable
nl: Download calibre Draagbaar
pt: Descarregar Calibre portátil
ru: Скачать переносимую версию calibre
sv: Hämta calibre Portable
zh_tw: 下載可攜式版的 calibre

source: The calibre Portable build can be run on any Windows computer running at least Windows 10. It is self contained, your calibre libraries and settings are all kept together in one place.
nl: De calibre Draagbaar uitgave kan draaien op elke Windows computer met tenminste Windows 10. Het staat op zichzelf, uw calibre bibliotheken en instellingen worden op één plek bij elkaar gehouden.
pt: A versão portátil do Calibre pode ser executada em qualquer computador Windows com pelo menos o Windows 10. É uma aplicação auto-contida: as suas bibliotecas e configurações Calibre são colocadas juntas num único local.
ru: Переносимую версию calibre можно запустить на любом компьютере под управлением, как минимум, Windows 10. Она самодостаточна: все ваши библиотеки и настройки calibre хранятся вместе.
sv: calibre Portable-versionen kan köras på vilken Windows-dator som helst som kör minst Windows 10. Den är fristående, dina calibre-bibliotek och inställningar hålls samman på ett ställe.

source: To use, just run the portable installer and select the location where you would like the <em>Calibre Portable</em> folder. To launch calibre, double click the <em>"calibre-portable.exe"</em> program inside the <em>Calibre Portable folder.</em>
nl: Voer gewoon het draagbare installatieprogramma uit en selecteer de locatie waar u de map <em>Calibre Draagbaar</em> wilt hebben. Om calibre te starten, dubbelklik het programma <em> "calibre-portable.exe" </em> in de map <em>Calibre Draagbaar.</em>
pt: Para utilizar, apenas tem de executar o instalador portátil e selecionar a localização da pasta onde quer utilizar o <em>Calibre Portátil</em>. Para iniciar o Calibre, faça duplo clique no ficheiro <em>"calibre-portable.exe"</em> localizado dentro da pasta que definiu para o <em>Calibre Portátil.</em>
ru: Чтобы начать использование, просто запустите портативный установщик и укажите место для папки <em>Calibre Portable</em>. Для запуска calibre дважды щёлкните по программе <em>«calibre-portable.exe»</em> в папке <em>Calibre Portable</em>.
sv: För att använda, kör bara det bärbara installationsprogrammet och välj den plats där du vill ha mappen <em>Calibre Portable</em>. För att starta calibre, dubbelklicka på programmet <em>"calibre-portable.exe"</em> i <em>mappen Calibre Portable.</em>
zh_tw: 要開始使用，只要點選可攜式版的安裝檔並且選擇您希望<em>Calibre 可攜式版</em>要儲存的位置。 想要啟動 calibre 了話，請雙擊<em>Calibre 所在位置的資料夾</em>中的<em>「calibre-portable.exe」</em> 程式

source: Version: %(version)s
nl: Versie: %(version)s
pt: Versão: %(version)s
ru: Версия: %(version)s
zh_tw: 版本:%(version)s

source: Upgrading
nl: Upgraden
pt: Atualização
ru: Обновление
sv: Uppgraderar
zh_tw: 更新

source: If you want to upgrade a previous version of calibre Portable, download the latest version of the installer from here and run it, choosing the location of your previous calibre Portable install. The installer will automatically update calibre Portable.
nl: Als u een eerdere versie van calibre Draagbaar wilt upgraden, download dan de nieuwste versie van het installatieprogramma vanaf hier en voer het uit, waarbij u de locatie kiest van uw vorige calibre Draagbaar installatie. Het installatieprogramma zal calibre Draagbaar automatisch bijwerken.
pt: Se deseja atualizar o Calibre Portable que tem em uso, descarregue a última versão do instalador para o seu computador e execute-o. Ao executar o novo ficheiro indique a localização da atual pasta do Calibre Portable. O instalador irá automaticamente atualizar o seu Calibre Portable.
ru: Если вы хотите обновить предыдущую переносимую версию calibre, скачайте последнюю версию установщика отсюда и запустите его, выбрав место предыдущей установки переносимой calibre. Установщик обновит всё автоматически.
sv: Om du vill uppgradera en tidigare version av calibre Portable, hämta den senaste versionen av installationsprogrammet härifrån och kör den, välja platsen för din tidigare calibre Portable installation. Installationsprogrammet uppdaterar automatiskt calibre Portable.
zh_tw: 如果要升级以前版本的 Calibre Portable，请从此处下载最新版本的安装程序并运行，并选择以前Calibre便携安装的位置。安装程序将自动更新Calibre Portable。

source: Precaution
nl: Voorzorgsmaatregel
pt: Alerta
ru: Предостережение
sv: Försiktighetsåtgärd
zh_tw: 預警

source: Portable media can occasionally fail so you should make periodic backups of your calibre library. This can be done by making a copy of the "Calibre Library" folder and all its contents.
nl: Draagbare media kunnen soms stuk raken, maak dus best periodiek back-ups van uw calibre bibliotheek. Dit kan door een kopie te maken van de map "Calibre Bibliotheek" en alle inhoud.
pt: Ocasionalmente, os armazenamentos portáteis podem falhar. Assim deve realizar cópias de segurança periódicas das suas bibliotecas Calibre para outros discos. Isto pode ser feito através de uma cópia da pasta "BibliotecaCalibre" e todo o seu conteúdo.
ru: Переносимые накопители со временем ломаются, поэтому периодически необходимо создавать резервные копии библиотеки calibre. Для этого просто скопируйте папку «Calibre Library» со всем содержимым.
sv: Bärbara medier kan ibland misslyckas så du bör göra regelbundna säkerhetskopior av ditt calibre-bibliotek. Detta kan göras genom att göra en kopia av mappen "Calibre Library" och allt innehåll.
zh_tw: 便携式介质（如：U盘）偶尔会出现故障，因此您应该定期备份Calibre库。这可以通过复制 “Calibre Library” 文件夹及其所有内容来实现。

source: Automated install
nl: Gautomatiseerde installatie
pt: Instalação automática
ru: Автоустановка
sv: Automatisk installation
zh_tw: 自動化安裝
