Repository: debian-calibre/calibre
Catalog: translations-git/website/*.po
Languages: nl, pt, ru, sv, zh_tw

source: Now that we have the ability to edit books, it would be nice to also have the ability to compare them. Fortunately, calibre 2.0 also has a new "Compare books" tool that you can use to see all the differences between two books, highlighted, side-by-side. To use it, open the first book in the calibre e-book editor and click <code>File-&gt;Compare to another book</code>.
nl: Nu we de mogelijkheid hebben boeken te bewerken, zou het leuk zijn om ook de mogelijkheid te hebben om ze te vergelijken. Gelukkig heeft calibre 2.0 ook een nieuw "Vergelijk boeken" tool dat u kan gebruiken om alle verschillente zien tussen twee boeken, differences between two books, gemarkeerd, naast elkaar. Om het te gebruiken, open het eerste boek in de calibre e-boek editor en klik op <code>Bestand-&gt;Vergelijk met een ander boek</code>.
pt: Agora que temos a capacidade de editar livros, seria legal também ter a capacidade de compará-los. Felizmente, o calibre 2.0 também tem uma nova ferramenta "Comparar livros" que você pode usar para ver todas a diferenças entre dois livros, realçadas, lado-a-lado. Para usar, abra o primeiro livro no editor do calibre e clieque em <code>Arquivo-&gt;Comparar com outro livro</code>.
ru: Теперь, когда у нас есть возможность редактировать книги, было бы неплохо также есть возможность сравнить их. К счастью, в calibre 2.0 также есть новый инструмент «Сравнить книги», который вы можете использовать, чтобы увидеть все различия между двумя выбранными книгами бок о бок. Для использования откройте первую книгу в редакторе электронных книг calibre и нажмите <code>Файл-Сравнить с другой книгой</code>.
sv: Nu när vi har förmågan att redigera böcker skulle det vara trevligt att också kunna jämföra dem. Lyckligtvis har calibre 2.0 också ett nytt "Jämför böcker"-verktyg som du kan använda för att se alla jämförelser mellan två böcker, markerade sida vid sida. För att använda den, öppna den första boken i calibre e-bokredigeraren och klicka på <code>Arkiv-&gt;Jämför med en annan bok</code>.
zh_tw: 既然我们有了编辑书籍的能力，那么我们还可以比较它们。 幸运的是，calibre2.0也有一个新的“比较书籍”工具， 您可以使用它来查看两本书之间的所有差异， 突出显示，并排显示。要使用它，请在calibre 电子书编辑器中打开第一本书，然后单击 <code>文件—->与另一本书比较</code>。

source: The compare books tool: showing differences side-by-side
nl: De tool Boeken vergelijken: verschillen naast elkaar weergeven
pt: A ferramenta de comparação de livros: mostrar diferenças lado a lado
ru: Инструмент сравнения книг: одновременный показ отличий
sv: Jämför böcker verktyg: visar skillnader sida vid sida
zh_tw: 比较书籍工具：并排显示差异

source: How to launch the compare books tool from within the editor
nl: Hoe de boeken vergelijk tool te starten vanuit de editor
pt: Como iniciar a ferramenta de comparação de ebooks a partir do editor
ru: Как запускается инструмент сравнения книг из редактора
sv: Så här startar du verktyget jämför böcker inifrån redigeraren
zh_tw: 如何从编辑器中启动比较书籍工具

source: Support for Android phones and tablets on macOS
nl: Ondersteuning voor Android telefoons en tablets met macOS
pt: Suporte a telemóveis e tablets Android em macOS
ru: Поддержка Android устройств на macOS
sv: Stöd för Android-telefoner och surfplattor på macOS
zh_tw: 支持MacOS、Android手机和平板电脑

source: calibre has long supported connecting to Android phones and tablets on all operating systems, except macOS. This lacuna has now been remedied. You can just plugin any Android phone or tablet on macOS and calibre should automatically detect and connect to it, just as it already does on Windows and Linux.
nl: calibre ondersteunt reeds lang verbinden met Android telefoons en tablets op alle bestuurssystemen, macOS uitgezonderd. Deze lacune is nu verholpen. U kan gewoon elke Android telefoon of tablet op macOS inpluggen en calibre zou het automatisch moeten detecteren en ermee verbinden, zoals het reeds doet op Windows en Linux.
pt: Há muito tempo o calibre suporta conexões a telefones Android e tablets com todos os sistemas operacionais, exceto macOS. Esta lacuna agora foi resolvida. Você pode apenas conectar qualquer telefone Android ou tablet com macOS e o calibre irá detectar automaticamente e conectar, assim como já faz no Windows e no Linux.
ru: calibre уже давно поддерживает подключение к телефонам Android и планшеты на всех операционных системах, кроме macOS. Эта лакуна сейчас исправлена. Вы можете просто подключить любой Android-телефон или планшет на MacOS и calibre должен автоматически его обнаружить и подключиться к нему, так же, как это уже происходит в Windows и Linux.
sv: calibre har länge stött anslutning till Android-telefoner och surfplattor på alla operativsystem, utom macOS. Detta tomrum har nu åtgärdats. Du kan bara ansluta alla Android-telefoner eller surfplattor på macOS och calibre ska automatiskt upptäcka och ansluta till den, precis som det redan gör på Windows och Linux.
zh_tw: calibre长期以来支持在所有操作系统上连接Android手机和 平板电脑，macOS除外。这一缺陷现在已得到弥补。 你只需在macOS系统上插入任何Android手机或平板电脑， calibre就会自动检测并连接到它，就像在Windows 和Linux上一样。

source: Now uses Qt 5
nl: Gebruikt nu Qt5
pt: Agora usa Qt 5
ru: Переход на Qt 5
sv: Använder nu Qt 5
zh_tw: 现在使用 Qt 5

source: calibre uses the <a href="https://qt-project.org/">Qt</a> graphical toolkit. In version 2.0, calibre has migrated to Qt 5. This brings with it several important bug fixes for the rendering of text in the E-book viewer. Fallback fonts now work, embedded fonts whose names inside the font file do not match the names in the @font-face rule work, hyphenation is greatly improved and so on. Qt 5 also allows the calibre command line tools to be run on Linux without needing a running X server. This has led to significant memory usage and performance improvements when running some command line tools, such as the standalone content server and <code>ebook-convert</code>.
nl: calibre gebruikt de <a href="https://qt-project.org/">Qt</a> grafische toolkit. In versie 2.0 is calibre gemigreerd naar Qt 5. Dit zorgt voor verschillende belangrijke bug fixes voor de rendering van tekst in de e-boek viewer. Fallback fonts werken nu, ingebedde fonts wiens namen in het font bestand niet overeenkomen met de namen in de @font-face regel werken, afbreking is sterk verbeterd en zo voort. Qt 5 laat de calibre commandoregel ook werken op Linux zonder nood aan een draaiende X server. Dits heeft geleid tot aanzienlijke verbeteringen in geheugen gebruik en prestaties bij het draaien van sommige commandoregel tools, zoals de standalone content server en <code>e-boek converteren</code>.
pt: O calibre usa o kit de ferramentas gráficas <a href="https://qt-project.org/">Qt</a> . Na versão 2.0, o calibre migrou para o Qt 5. Isto leva à correção de vários erros de renderização do texto no Visualizador de e-books. Fontes reserva agora funcionam, fontes incorporadas cujos nomes dentro do arquivo não correspondem ao nomes na regra @font-face funcionam, hifenização muito melhorada e assim por diante. O Qt 5 também permite que as ferramentas de de linha de comando do calibre sejam executadas no Linux sem a a necessidade de rodar um servidor X. Isto levou a consideráveis melhorias de performance e uso de memória ao executar certas ferramentas de linha de comando, como o servidor de conteúdo individual e o <code>ebook-convert</code>.
ru: calibre использует <a href="https://qt-project.org/">Qt</a> графический инструментарий. В версии 2.0 калибр перешел на Qt 5. Это приносит с собой несколько важных исправлений ошибок для рендеринга текста в программе просмотра электронных книг. Резервные шрифты теперь работают, встроенные шрифты, имена которых внутри файла шрифта не совпадают с именами в работа правила @ font-face, переносы значительно улучшены и так далее. Qt 5 также позволяет запускать инструменты командной строки calibre на Linux без необходимости запуска X-сервера. Это привело к значительно меньшему использованию памяти и улучшению производительности при запуске некоторых инструментов командной строки, таких как автономный контент-сервер и <code>ebook-convert</code>.
sv: calibre använder <a href="https://qt-project.org/">Qts </a> grafiska verktygslåda. I version 2.0 har calibre migrerat till Qt 5. Detta medför flera viktiga felrättningar för återgivning av text i e-bokvisaren. Reservteckensnitt fungerar nu, inbäddade teckensnitt vars namn i teckensnittsfilen inte matchar namnen i @font-face rule work, avstavning förbättras avsevärt och så vidare. Qt 5 tillåter också calibre kommandoradsverktyg att köras på Linux utan att behöva en kör X-server. Detta har lett till betydande minnesanvändning och prestandaförbättringar när du kör vissa kommandoradsverktyg, till exempel den fristående innehållsservern och <code>ebook-convert</code>.
zh_tw: Calibre使用<a href="https://qt-project.org/">Qt</a> 图形工具包。在2.0版本中，Calibre已经迁移到Qt5。 这带来了几个重要的错误修复，用于在电子书阅读器 中呈现文本。备用字体现在起作用了，字体文件中的 名称与@font-face规则中的名称不匹配的嵌入字体 可以工作，连字功能得到了极大改进，等等。 Qt5还允许Calibre命令行工具在Linux上运行，而不 需要运行X服务器。在运行一些命令行工具，例如 独立内容服务器和<code>电子书转换</code>时，这会显 著提高内存使用率和性能。

source: The move to Qt 5 meant that many calibre plugins needed to be updated to work with Qt 5. Thanks to the efforts of calibre's enthusiastic community, most plugins have already been ported. For a detailed list is maintained at the <a href="%(porting)s">porting page</a>.
nl: De overstap naar Qt5 betekende dat veel calibre plug-ins moesten geüpdatet worden om met Qt 5 te werken. Dankzij de inspanningen van calibre's enthousiaste gemeenschap zijn de meeste plug-ins al overgezet. Een gedetailleerde lijst staat op de <a href="%(porting)s">overzet pagina</a>.
pt: A mudança para o Qt 5 fez com que vários plugins do calibre tivessem que ser atualizados para funcionar com o Qt 5. Graças ao esforço da entusiasmada comunidade do calibre, a maioria dos plugins já foi atualizada. Para uma lista detalhada, verificar em <a href="%(porting)s">página de atualização</a>.
ru: Переход на Qt 5 означает, что множество плагинов calibre должны быть обновлены для работы с Qt 5. Благодаря усилиям сообщества энтузиастов calibre, большинство плагинов уже портированы. Их подробный список расположен на <a href="%(porting)s">странице портирования</a>.
sv: Flytten till Qt 5 innebar att många insticksmoduler för calibre behövde uppdateras för att fungera med Qt 5. Tack vare ansträngningar från calibres entusiastiska gemenskap, har de flesta insticksmodulerna redan uppdaterats. För en detaljerad förteckning finns på <a href="%(porting)s">uppdateringssidan</a>.
zh_tw: 迁移到Qt5意味着许多Calibre插件需要更新才能与Qt5一起工作， 多亏了Calibre热情的社区的努力，大多数插件已经被移植。 因为在<a href="%(porting)s">移植页面</a>上维护了详细的列表。

source: Support for touchscreen Windows tablets
nl: Ondersteuning voor Windows tablets
pt: Suporte a tablets Windows de ecrã tátil
ru: Поддержка сенсорных планшетов Windows
sv: Stöd för pekskärm Windows-surfplattor
zh_tw: 支持 Windows 触摸屏平板电脑

source: The calibre E-book viewer now supports touch screen Windows 8 tablets, such as the Surface Pro. You can use finger gestures to turn pages and navigate around the book in the viewer, allowing the viewer to be used effectively on these tablets.
nl: De calibre e-boek viewer ondersteunt nu touch screen Windows 8 tablets, zoals de Surface Pro. U kan vinger gebaren gebruiken om bladzijden om te draaien en te navigeren in de viewer, zodat u de viewer effectief kan gebruiken op deze tablets tablets.
pt: O Visualizador de e-books do calibre agora suporta touchscreen em tablets com Windows 8, como o Surface Pro. Você pode usar gestos para virar páginas e navegar pelo livro no visualizador, permitindo que o visualizador possa ser utilizado eficientemente nestes tablets.
ru: Читалка электронных книг calibre теперь поддерживает сенсорные экраны планшетов с Windows 8, как Surface Pro. С помощью жестов пальцами можно перелистывать страницы и перемещаться по книге, что позволяет эффективнее пользоваться читалкой на таких планшетах.
sv: calibres e-bokvisare stöder nu Windows 8-surfplattor med pekskärmar, till exempel Surface Pro. Du kan använda fingergester för att bläddra i sidor och navigera runt i boken i visaren, så att visaren kan användas effektivt på dessa surfplattor.
zh_tw: Calibre电子书阅读器现在支持触摸屏Windows8平板电脑， 如Surface Pro。您可以使用手势在阅读器中翻页 和浏览图书，以便在这些平板电脑上有效地使用 阅读器。

source: Improvements to library organisation
nl: Verbeteringen in de bibliotheek organisatie
pt: Melhorias na organização de bibliotecas
ru: Улучшения структуры библиотеки
sv: Förbättringar av biblioteksorganisationen
zh_tw: 改善书库组织架构

source: You can now define simple rules to make emblems (little icons) appear next to book covers in the Cover grid. For example, a heart next to books you have rated highly or a tick mark next to books you have read and so on. To setup emblems, go to <code>Preferences-&gt;Look &amp; feel-&gt;Cover grid-&gt;Emblems</code>.
nl: U kan nu simpele regels definiëren om emblemen (kleine iconen) te laten verschijnen naast de boekomslagen in de Cover grid. Bijvoorbeeld, een hart naast boeken die u hoog aanslaat of een vinkje naast boeken die u gelezen hebt en zo verder. Om emblemen in te stellen, ga naar <code>Voorkeuren-&gt;Uitstraling &amp; gevoel-&gt;Omslag grid-&gt;Emblemen</code>.
pt: Você agora pode definir regras simples para mostrar emblemas (pequenos ícones) próximo às capas dos livros na Grade de capas. Por exemplo, um coração próximo ao livros que você avaliou bem ou uma marca próxima a livros que você já leu, etc. Para configurar os emblemas, vá em <code>Preferências-&gt;Aparência-&gt;Grade de capas-&gt;Emblemas</code>.
ru: Теперь вы можете определить простые правила для создания эмблем (маленькие значки) появляющихся рядом с обложками книг в сетке обложек. Например, сердце рядом с книгами, которые вы высоко оценили или отметка галочкой рядом с прочитанными книгами и так далее. Чтобы настроить эмблемы, перейдите к <code>Предпочтения-Внешний_вид-Сетка-Эмблемы</code>.
sv: Du kan nu definiera enkla regler för att få emblem (små ikoner) att visas bredvid bokomslag i omslagsrutnätet. Till exempel ett hjärta bredvid böcker du har gett högt betyg eller ett bockmarkering bredvid böcker du har läst och så vidare. För att ställa in emblem, gå till <code>Inställningar-&gt;Utseende &amp; känsla-&gt;Omslagsrutnät-&gt;Emblem</code>.
zh_tw: 现在，您可以定义简单的规则，使徽标(小图标)显示在 “封面网格”中图书封面的旁边。例如，在你评价 很高的书旁边有一颗心，或者在你读过的书旁 边有一个勾号，等等。要设置徽标，请转到 <code>“首选项->外观->封面网格->徽标”</code>。

source: There is a new tool <em>Mark books</em> that can be used to mark books temporarily. The mark appears as a little pushpin icon next to the book and all marks are automatically cleared by restarting calibre. Go to <code>Preferences-&gt;Toolbars and menus</code> and add the Mark books tool to your main toolbar to begin using it.
nl: Er is een nieuwe tool <em>Markeer boeken</em> dat gebruikt kan worden om boeken tijdelijk te markeren. De markering verschijnt als een klein pinicoontje naast het boek en alle markeringen verdwijnen vanzelf bij het herstarten van calibre. Ga naar <code>Voorkeuren-&gt;Werkbalken en menus</code> en voeg de Markeer boeken tool toe aan uw hoofdwerkbalk om het te beginnen gebruiken.
pt: Há uma nova ferramenta, <em>Marcar livros</em>, que pode ser usada para marcar livros temporariamente. A marca aparece como um pequeno ícone de alfinete próximo ao livro, e todas as marcas automaticamente limpas ao reiniciar o calibre. Vá em <code>Preferências-&gt;Barra de Ferramentas</code> e adicione a ferramenta Marcar livros para sua barra de ferramentas principal para começar a usá-la.
ru: Существует новый инструмент <em>Пометить книги</em>, который можно использовать для временной маркировки книг. Рядом с книгой значок отображается в виде небольшой метки, и все отметки автоматически очищаются путем перезапуска calibre. Перейдите в <code>Настройки-Панели инструментов</code> и добавьте инструмент Пометить книги на главную панель инструментов, чтобы начать его использовать.
sv: Det finns ett nytt verktyg <em>Markera böcker</em> som kan användas för att tillfälligt markera böcker. Markeringen visas som en liten pushpin-ikon bredvid boken och alla märken rensas automatiskt genom att starta om calibre. Gå till <code>Inställningar-&gt;Verktygsfält och menyer</code> och lägg till verktyget Markera böcker i ditt huvudverktygsfält för att börja använda det.
zh_tw: 有一个新的工具<em>“标记书籍”</em>，可以用来暂时 标记书籍。标记在书籍旁边显示为一个小图钉图标，所有标记都会通过重新启动Calibre自动清除。 转到<code>“首选项->工具栏”</code>，并将“标记图书” 工具添加到主工具栏并 开始使用它。

source: Cover grid emblems: you can adjust the icon size and position as well
nl: Cover grid emblemen: u kan ook de icoon grootte en positie aanpassen
pt: Emblemas na grelha de capas: é possível ajustar o tamanho e a posição do ícone
ru: Эмблемы сетки обложек: вы можете настроить размер и расположение значков
sv: Emblem i omslagsrutnätet: du kan också justera ikonstorlek och placering
zh_tw: 封面网格徽标：您还可以调整图标的大小和位置

source: The actions you can perform with marked books
nl: De acties die u kan doen met gemarkeerde boeken
pt: As ações que pode executar nos livros marcados
ru: Действия над помеченными книгами
sv: De åtgärder du kan utföra med markerade böcker
zh_tw: 可以对标记的书本执行的操作

source: Note that many of these features were actually introduced during the lifetime of the 1.x series. This document describes new features as compared to 1.0
nl: Merk op dat veel van deze eigenschappen eigenlijk tijdens het leven van de 1.x series waren geïntroduceerd. Dit document beschrijft nieuwe eigenschappen vergeleken met 1.0
pt: Note que muitas dessas funções foram de fato introduzidas durante o ciclo de vida da série 1.x. Este documento descreve novas funções comparadas à versão 1.0
ru: Обратите внимание, что многие из перечисленных функций фактически вводились в течение всего срока жизни серии 1.x. Этот документ описывает новые возможности по сравнению с версией 1.0.
sv: Observera att många av dessa funktioner faktiskt introducerades under livslängd av 1.x-serien. I det här dokumentet beskrivs nya funktioner jämfört med 1.0
zh_tw: 请注意，其中许多功能实际上是在 0.1.x 系列的生命周期中引入的。本文档介绍了与 0.1.0 相比的新功能。

source: New in calibre 0.8
nl: Nieuw in calibre 0.8
pt: Novo no Calibre 0.8
ru: Что нового в calibre 0.8
sv: Nytt i calibre 0.8
zh_tw: Calibre 0.8 中的新功能

source: Lots has changed in calibre-land in the last year. A great feature is "Get books" which allows you to search for a book by title and author and returns the list of web stores that sell it in e-book form, allowing you to easily find the lowest prices for popular books or search many different places for hard to find e-book editions.
nl: Er is veel veranderd in calibre land het laatste jaar. Een prachtige functie is "Verkrijg boeken" die u toelaat een boek op te zoeken bij naam en auteur en een lijst van webwinkels geeft die het in e-boek formaat verkopen zodat u gemakkelijk de laagste prijs vindt voor populaire boeken of op veel plaatsen zoekt achter moeilijk te vinden e-boek uitgaven.
pt: Muito mudou na calibrelândia no último ano. Uma grande função é "Obter livros", a qual permite que você busque livros pelo título e pelo autor e retornar a lista de lojas online onde são vendidos no forma de e-book, permitindo você facilmente encontrar o menor preço para livros populares ou buscar em muitos lugares para livros difíceis de encontrar em edição e-book.
ru: Многое изменилось в земле calibre в прошлом году. Отличная особенность «Получить книги», которая позволяет искать книгу по названию и автору и возвращает список интернет-магазинов, которые продают её в форме электронных книг, что позволяет легко найти самые низкие цены на популярные книги или искать во множестве разных мест для трудно находимых электронных книг.
sv: Massor har förändrats i calibre-land under det senaste året. En bra funktion är "Skaffa böcker" som låter dig söka efter en bok med titel och författare och returnerar en lista över webbutiker som säljer den i e-bokform, så att du enkelt kan hitta de lägsta priserna för populära böcker eller söka på många olika platser efter e-bokutgåvor som är svåra att hitta.
zh_tw: 在过去的一年里，calibre-land发生了很多变化。比如有一个很大的特点, "获取书籍功能"：您可以通过书名和作者搜索书籍，从返回的销售此电子书的网店列表中找到你想要的， 热门的且最低价的电子书; 当然，它也支持从其它许多数据源中搜索到电子书。

source: The last year has also seen the maturing of the calibre plugin infrastructure, which has led to a vibrant community of user developed plugins that extend calibre's functionality in many novel ways. See the <a href="%(mr)s">Index of plugins</a>.
nl: Het laatste jaar zag ook een rijping van de calibre plug-in infrastructuur, wat geleid heeft tot een levendige gemeenschap van gebruiker ontwikkelde plug-ins die calibres functionaliteit uitbreiden op veel vernieuwende manieren. Kijk in de <a href="%(mr)s">Index van plug-ins</a>.
pt: O último ano viu o amadurecimento da infraestrutura de plugins do Calibre, o que levou a uma comunidade vibrante de plugins desenvolvidos pelos utilizadores que aumentam as funcionalidades do Calibre de muitas e novas formas. Veja o <a href="%(mr)s">Índice de plugins</a>.
ru: В прошлом году также наблюдалось развитие инфраструктуры плагинов calibre, что привело к динамичному сообществу пользовательских плагинов, которые расширяют функциональность calibre многими новыми способами. Посмотреть <a href="%(mr)s">список плагинов</a>.
sv: Det senaste året har också sett mognaden av calibre-insticksmodulsinfrastrukturen, vilket har lett till en levande gemenskap av användarutvecklade insticksmoduler som utökar calibres funktionalitet på många nya sätt. Se <a href="%(mr)s">Index av insticksmoduler</a>.
zh_tw: 在过去的一年里，我们也见证了calibre插件基础架构的成熟，这让我们看到了一个充满活力的 用户开发的插件社区， 在插件社区里面，用户以多种新颖的方式扩展了calibre的功能。请看<a href="%(mr)s">插件索引</a>

source: calibre has an all new metadata download system that allows you much more control over the process. For example, you can now choose a cover from many different online sources.
nl: calibre heeft een volledig nieuw metadata download systeem dat u veel meer controle over het proces geeft. Bijvoorbeeld, u kan nu een cover kiezen van veel verschillende online bronnen.
pt: O Calibre tem um novo sistema de descarregamento de metadados que lhe permite ter muito mais controlo sobre o processo. Por exemplo, você pode agora escolher uma capa de uma das muitas fontes em linha.
ru: Calibre имеет совершенно новую систему загрузки метаданных, которая позволяет вам гораздо лучше контролировать процесс. Например, теперь вы можете выбрать обложку из множества разных интернет-источников.
sv: calibre har ett helt nytt metadatahämtningssystem som ger dig mycket mer kontroll över processen. Till exempel kan du nu välja ett omslag från många olika källor på nätet.
zh_tw: calibre 有一个全新的元数据下载系统，让你对这个过程有更多的控制。例如，现在可以从许多不同的在线来源中选择一个封面。

source: As always, calibre has gained support for dozens of new devices, conversion of a few new formats, notably, SNB and the Plucker formats. The performance of calibre has been greatly improved, especially with large libraries of tens of thousands of books.
nl: Zoals altijd heeft calibre meer ondersteuning voor tientallen nieuwe toestellen, conversie van een paar nieuwe formaten, opvallend, SNB en de Plucker formaten. De prestaties van calibre zijn fors verbeterd, speciaal met grote bibliotheken van tienduizenden boeken.
pt: Como sempre, o Calibre ganhou suporte para dezenas de novos dispositivos, conversão de alguns novos formatos, especialmente os formatos SNB e Plucker. A performance do Calibre aumentou drasticamente, especialmente com grandes bibliotecas de dezenas de milhares de livros.
ru: Как всегда, Calibre получил поддержку десятков новых устройств, преобразование нескольких новых форматов, в частности, форматы SNB и Plucker. Производительность calibre была значительно улучшена, особенно с большими библиотеками в десятки тысяч книг.
sv: Som alltid har calibre fått stöd för dussintals nya enheter, konvertering av några nya format, särskilt formaten SNB och Plucker. Prestandan hos calibre har förbättrats avsevärt, särskilt med stora bibliotek med tiotusentals böcker.
zh_tw: 与往常一样，calibre已经获得了对数十种新设备的支持，一些新格式的转换，特别是SNB和pucker格式。calibre的性能有了很大的提高，特别是拥有数万册图书的大型图书馆。
