Repository: debian-calibre/calibre
Catalog: translations-git/website/*.po
Languages: nl, pt, ru, sv, zh_tw

source: To use the new <i>Full text search</i> upgrade to calibre 6.0 and simply click the <code>FT</code> button to the left of the search bar in calibre. This will allow you to index the calibre library and once indexing is complete, search it.</p>
nl: Om de nieuwe <i>Volledige tekst doorzoeken</i> upgrade van calibre 6.0 te gebruiken, klik gewoon op de <code>FT</code> knop links van de zoekbalk in calibre. Dit laat u toe om de calibre bibliotheek te indexeren en als dat volledig is, te doorzoeken.</p>
ru: Чтобы использовать новый <i>полнотекстовый поиск</i>, обновите его до версии 6.0 и просто нажмите кнопку <code>FT</code> слева от поисковой строки в calibre. Запустится индексация бииблиотеки calibre, и после её завершения полнотекстовый поиск будет работать.</p>
sv: För att använda den nya <i>heltextsökningen</i>, uppgradera till calibre 6.0 och klicka helt enkelt på knappen <code>FT</code> till vänster om sökfältet i calibre. Detta gör att du kan indexera calibre-biblioteket och när indexeringen är klar, söka i den.</p>

source: Full text search
nl: Volledige tekst doorzoeken
pt: Resultados de texto integral
ru: Полнотекстовый поиск
sv: Heltextsökning

source: calibre can <i>optionally</i> index the full text of books in the library to allow for instant searching of words inside any book. To use this functionality click the <code>FT</code> button at the left edge of the search bar.
nl: calibre kan <i>optioneel</i> de volledige tekst van boeken in de bibliotheek indexeren zodat u instant kan zoeken naar woorden in elk boek. Om deze functie te gebruiken klik op de <code>FT</code> knop links van de zoekbalk.
ru: calibre может <i>опциональньно</i> индексировать полный текст книг в библиотеке, чтобы производить мгновенный поиск слов внутри любой книги. Чтобы использовать эту функцию нажмите кнопку <code>FT</code> у левого края строки поиска.
sv: calibre kan <i>valfritt</i> indexera hela texten i böcker i biblioteket för att möjliggöra omedelbar sökning av ord i vilken bok som helst. För att använda den här funktionen klicka på knappen <code>FT</code> i sökfältets vänstra kant.

source: Then, enable indexing for the current library. Once indexing is complete you can search all the text in the full library. When you add new books to the library, they will be automatically indexed in the background. This search allows you to quickly find all books that contain a word or combination of words. You can even search for words that occur near other words, as shown in the examples in the search popup window.
nl: Dan, activeer indexeren voor de huidige bibliotheek. Als het indexeren volledig is kan u alle tekst in de volledige bibliotheek doorzoeken. Als u nieuwe boeken toevoegt aan de bibliotheek worden deze automatisch geïndexeerd in de achtergrond. Deze zoekfunctie laat u snel alle boeken vinden die een woord of combinatie van woorden bevatten. U kan zelfs zoeken naar woorden die voorkomen in de buurt van andere woorden, zoals getoond in de voorbeelden in het zoek pop-up venster.
ru: Затем включите индексирование для текущей библиотеки. После завершения индексации вы можете искать весь текст во всей библиотеке. Когда вы добавляете новые книги в библиотеку, они будут автоматически проиндексированы в фоновом режиме. Этот поиск позволяет быстро найти все книги, содержащие слово или комбинацию слов. Вы даже можете искать слова, которые встречаются рядом с другими словами, как показано на примерах во всплывающем окне поиска.
sv: Aktivera sedan indexering för det aktuella biblioteket. När indexeringen är klar kan du söka i all text i hela biblioteket. När du lägger till nya böcker i biblioteket indexeras de automatiskt i bakgrunden. Den här sökningen gör att du snabbt kan hitta alla böcker som innehåller ett ord eller en kombination av ord. Du kan till och med söka efter ord som förekommer i närheten av andra ord, som visas i exemplen i sökpopupfönstret.

source: The Full text search window
nl: Het Volledig tekst doorzoeken venster
pt: Janela de pesquisa em texto integral
ru: Окно полнотекстового поиска
sv: Fönstret för heltextsökning

source: Full text search results
nl: Volledige tekst doorzoeken resultaten
pt: Resultados da pesquisa em texto integral
ru: Результаты Полнотекстового поиска
sv: Heltextsökning resultat

source: New CPU architectures
nl: Nieuwe processor architecturen
pt: Novas arquiteturas de CPU
ru: Новые процессорные архитектуры
sv: Nya CPU-arkitekturer

source: calibre has gained support for the Apple Silicon CPU architecture on macOS and the ARM CPU architecture on Linux. Additionally, it has dropped support for 32-bit CPUs because Qt (one of its dependencies) has dropped 32-bit CPUs. In particular, on Windows the calibre installer will now automatically un-install 32-bit calibre and replace it with 64-bit calibre. This might require file associations or desktop shortcuts to need to be updated manually.
nl: calibre ondersteunt nu de Apple Silicon processor architectuur op macOS en de ARM architectuur op Linux. Daarbovenop is ondersteuning voor 32-bit processoren gestopt omdat Qt (een van zijn afhankelijkheden) geen 32-bit processoren meer ondersteunt. Vooral in Windows zal de calibre installer nu automatisch 32-bit calibre deïnstalleren en vervangen door de 64-bit versie. Dit kan er de oorzaak van zijn dat u bestandsassociaties of bureaubladsnelkoppelingen handmatig moet updaten.
pt: O Calibre ganhou suporte para CPUs Apple Silicon no macOS e CPUs ARM no Linux. No entanto, abandonou o suporte a CPUs 32-bits devido ao Qt (uma das dependências). No Windows o instalador do Calibre remove automaticamente a antiga versão de 32-bits e a sua substituição pela versão de 64-bits. Isto poderá implicar uma atualização manual de associação de ficheiros e atalhos no ambiente de trabalho.
ru: calibre получил поддержку процессорной архитектуры Apple Silicon в macOS и архитектуре ЦП ARM в Linux. Кроме того, это прекратил поддержку 32-битных процессоров, потому что Qt (один из его зависимости) сбросил 32-битные процессоры. В частности, в Windows установщик calibre теперь автоматически удаляет 32-битную версию и заменяет на 64-битную. Может потребоваться реассоциирование файлов или обновление ярлыков на рабочем столе.
sv: calibre har fått stöd för Apple Silicon CPU-arkitekturen på macOS och ARM CPU-arkitekturen på Linux. Dessutom har det tagit bort stödet för 32-bitars processorer eftersom Qt (ett av dess beroenden) har tappat 32-bitars processorer. I synnerhet på Windows kommer calibre-installationsprogrammet nu automatiskt att avinstallera 32-bitars calibre och ersätta det med 64-bitars calibre. Detta kan kräva att filassociationer eller skrivbordsgenvägar måste uppdateras manuellt.

source: Read aloud in the E-book viewer
nl: Luidop lezen in de e-boek lezer
pt: Ler em voz alta no visualizador de ebooks
ru: Чтение вслух в читалке
sv: Högläsning i e-bokvisaren

source: Click the "Read aloud" button in the viewer controls to start reading the book text aloud from the current page. This works via the operating systems text-to-speech engines.
nl: Klik op de "Luidop lezen" knop in de lezerbediening om het boek luidop te beginnen voorlezen vanaf de huidige pagina. Dit werkt via de tekst-naar-spraak motor van het besturingssysteem.
ru: Нажмите кнопку «Читать вслух» в элементах управления просмотрщиком, чтобы начать чтение текста книги вслух с текущей страницы. Это работает через механизмы преобразования текста в речь операционных систем.
sv: Klicka på knappen "Högläsning" i visarens kontroller för att börja läsa boktexten högt från den aktuella sidan. Det här fungerar via operativsystemets text-till-tal-motorer.

source: The calibre:// URL scheme
nl: Het calibre:// URL schema
pt: O esquema de URL calibre://
ru: Схема URL-адресов calibre://
sv: calibre:// URL-schema

source: Clicking on <code>calibre://</code> URLs can be used to have calibre perform various actions. This can be used to create links to individual books and even locations inside books that can be accessed from other programs. For details, see: <a href="%(usl)s">the manual</a>.
nl: Via klikken op <code>calibre://</code> URLs kan u calibre verscheidene acties laten uitvoeren. Dit kan u gebruiken om links naar individuele boeken te creëren en zelfs plaatsen in boeken die toegankelijk zijn vanuit andere programma's. Voor details, bekijk: <a href="%(usl)s">de handleiding</a>.
ru: Нажатие на URL-адреса <code>calibre://</code> можно использовать, чтобы calibre выполнял различные действия. Это можно использовать для создания ссылок на отдельные книги и даже места внутри книг, к которым может быть доступ из других программ. Подробнее см.: <a href="%(usl)s">руководство</a>.
sv: Att klicka på <code>calibre://</code>-webbadresser kan användas för att få calibre att utföra olika åtgärder. Detta kan användas för att skapa länkar till enskilda böcker och till och med platser inuti böcker som kan nås från andra program. För detaljer, se: <a href="%(usl)s">manualen</a>.

source: There are a few minor backwards incompatibilities to be aware of in calibre 6
nl: Er zijn enkele kleinere onverenigbaarheden in calibre 6 waar u op moet letten
pt: Existem algumas pequenas retroincompatibilidades que devem ser tidas em conta no Calibre 6
ru: В calibre 6 есть несколько небольших обратных несовместимостей, о которых следует знать.
sv: Det finns några mindre bakåtinkompatibiliteter att vara medveten om i calibre 6

source: Because calibre has now moved to Qt 6, some third party plugins will no longer work, until they are also ported to Qt 6. Fortunately, plugin developers were given over half a year to port their plugins, so most have already been ported.
nl: Omdat calibre nu verhuisd is naar Qt 6 werken sommige derde partij plug-ins niet meer, totdat ze ook overgedragen zijn naar Qt 6. Gelukkig kregen plug-in ontwikkelaars meer dan een half jaar om dit te doen, de meeste zijn al overgedragen.
ru: Поскольку calibre теперь перешел на Qt 6, некоторые сторонние плагины больше не будут работать, пока их тоже не портируют на Qt 6. К счастью, разработчикам плагинов дали более полугода на портирование своих плагинов, поэтому большинство уже портированы.
sv: Eftersom calibre nu har flyttat till Qt 6 kommer vissa tredjeparts insticksmoduler inte längre att fungera, förrän de också porteras till Qt 6. Lyckligtvis fick insticksmodulsutvecklare över ett halvår på sig att portera sina insticksmoduler, så de flesta har redan porterats.

source: If you use both calibre 5 and calibre 6 on the same library, any books you add using calibre 5 will not be automatically indexed for full text search, so you will periodically have to rebuild the index.
nl: Als u zowel calibre 5 als calibre 6 op dezelfde bibliotheek gebruikt, worden boeken toegevoegd via calibre 5 niet automatisch geïndexeerd voor volledige tekst doorzoeken, u zult de index dus regelmatig moeten herbouwen.
ru: Если вы используете calibre 5 и calibre 6 в одной библиотеке, любые книги, которые вы добавляете с помощью calibre 5, не будут автоматически индексироваться для полнотекстового поиска, поэтому периодически придется перестраивать индекс.
sv: Om du använder både calibre 5 och calibre 6 på samma bibliotek, kommer alla böcker som du lägger till med calibre 5 inte automatiskt att indexeras för heltextsökning, så du måste med jämna mellanrum bygga om indexet.

source: Support for Windows 8 has been dropped as neither Qt 6 nor Microsoft support it.
nl: Ondersteuning voor Windows 8 is geschrapt daar noch Qt6, noch Microsoft het ondersteunen.
pt: Abandonámos o suporte a Windows 8, já que não é suportado pelo QT6 nem pela Microsoft.
ru: Поддержка Windows 8 была прекращена, так как данная версия не поддерживается ни Qt 6, ни Microsoft.
sv: Stöd för Windows 8 har tagits bort eftersom varken Qt 6 eller Microsoft stöder det.

source: Note that some of these features were actually introduced during the lifetime of the 5.x series. This document describes new features as compared to 5.0
nl: Merk op dat sommige van deze functies eigenlijk geïntroduceerd werden tijdens het leven van de 5.x serie. Dit document beschrijft nieuwe functies vergeleken met 5.0
pt: Note que algumas destas funcionalidades foram de facto introduzidas durante o ciclo de vida da série 5.x. Este documento descreve as novas funcionalidades quando comparadas com a versão 5.0.
ru: Обратите внимание, что некоторые из этих функций были фактически введены во время жизненного цикла серии 5.x. В этом документе описываются новые функции по сравнению с 5.0
sv: Observera att några av dessa funktioner faktiskt introducerades under 5.x-seriens livstid. Det här dokumentet beskriver nya funktioner jämfört med 5.0

source: New in calibre 0.9
nl: Nieuw in calibre 0.9
pt: Novo no Calibre 0.9
ru: Новое в calibre 0.9
sv: Nytt i calibre 0.9
zh_tw: Calibre 0.9 中的新功能

source: Lots has changed in calibre-land in the last year and a half. A beefed up e-book viewer. Support for Android phones and tablets. A new modern look for the calibre user interface. A portable version of calibre that you can carry around on a USB stick.
nl: Veel is veranderd in calibre land in het laatste anderhalf jaar. Een struisere e-boek viewer. Ondersteuning voor Android telefoons en tablets. Een nieuw, modern uitzicht voor de calibre gebruikers interface. Een draagbare versie van calibre die u op een USB-stick kan meenemen.
pt: Muito mudou na calibre-lândia no último ano e meio. Um visualizador de e-books mais parrudo. Suporte a telefones e tablets Android. Um novo visual moderno para a interface do usuário. Uma versão portátil do calibre que você pode carregar em um pendrive.
ru: За последние полтора года в мире calibre многое произошло: улучшение читалки, поддержка телефонов и планшетов с Android, новый современный вид графического интерфейса, переносимая версия calibre, которую вы можете носить с собой на флешке.
sv: Mycket har förändrats i calibre-land under det senaste och ett halvt året. En uppiffad e-bokvisare. Stöd för Android-telefoner och surfplattor. Ett nytt modernt utseende för calibres användargränssnitt. En bärbar version av calibre som du kan bära runt på ett USB-minne.
zh_tw: 在过去的一年半里，calibre程序内外发生了许多变化： 一个增强的电子书阅读器。支持Android手机和平板电脑。 一个新的现代风格的用户界面。一款便携版本的Calibre， 你可以用U盘随身携带。

source: These and many more new features are described in detail below.
nl: Deze en veel meer nieuwe eigenschappen zijn verder in detail beschreven.
pt: Esta e muitas outras novas funções são descritas em detalhe abaixo.
ru: Эти и многие другие новые функции подробно описаны ниже.
sv: Dessa och många fler nya funktioner beskrivs i detalj nedan.
zh_tw: 下面将详细描述这些功能以及更多新功能。

source: Enhanced E-book viewer
nl: Verbeterde e-boek viewer
pt: Visualizador de livros melhorado
ru: Улучшенная читалка электронных книг
sv: Förbättrad e-bokvisare
zh_tw: 增強的電子書檢視器

source: The E-book viewer has a new "paged" mode, where the text is split up into pages. This means that you can have more than one page on the screen at a time. It also fixes some long standing limitations of the viewer: The top and bottom margins now work and the last line of text is never partially cut off.
nl: De e-boek viewer heeft een nieuwe "paged" mode, waar de tekst wordt opgesplitst in bladzijden. Dit betekent dat u meer dan één bladzijde op het scherm kan hebben. Het regelt ook sommige oude beperkingen van de viewer: De boven- en onderkant marges werken nu en de laatste lijn van de tekst is nooit gedeeltelijk afgesneden.
pt: O Visualizador de e-books possui um novo modo "paginado", onde o texto é dividido em páginas. Isto significa que você pode ter mais de uma página na tela ao mesmo tempo. Isso também corrige algumas limitações existentes no visualizador: as margens de topo e rodapé agora funcionam e a última linha do texto nunca é parcialmente cortada.
ru: Промотрщик E-Book имеет новый режим «постраничный», где текст разделяется на страницы. Это означает, что вы можете иметь больше одной страницы на экране одновременно. Это также исправляет некоторые давние ограничения просмотра: теперь работают верхнее и нижнее поля и последняя строка текста никогда не обрезается частично.
sv: E-bokvisaren har ett nytt "siddelat"-läge, där texten är delad upp i sidor. Detta innebär att du kan ha mer än en sida per skärm i taget. Det åtgärdar också några långvariga begränsningar för visaren: De övre och nedre marginalerna fungerar nu och den sista textraden är aldrig delvis avskuren.
zh_tw: 电子书阅读器有一个新的“分页”模式，文本可以被分成几页。 这意味着您可以一次在屏幕上显示多个页面。 它还解决了查看器的一些长期存在的限制： 上边距和下边距现在可以正常工作，文本的最后一行永远不会被部分切断。

source: The viewer also has a new full screen mode that has no "chrome" (toolbars/menubars/etc.) to distract from the reading experience.
nl: De viewer heeft ook een nieuwe full-screen modus zonder "chrome" (werkbalken/menubalken/enz.) die afleiden van de lees- ervaring.
pt: O visualizador também tem um novo modo de ecrã total sem qualquer elemento "chrome" (barra de ferramentas, menus, etc.) para distrair da experiência de leitura.
ru: Также читалка получила новый полноэкранный режим без «хрома» (панелей инструментов, меню и т. д.), чтобы не отвлекать от процесса чтения.
sv: Visaren har också ett nytt helskärmsläge som inte har någon "chrome" (verktygsfält/menyrader/o.s.v.) att distrahera från läsnings- upplevelsen.
zh_tw: 阅读器还拥有一个新的全屏模式，该模式没有“chrome” （工具栏/菜单栏/等）来分散阅读 体验。

source: The viewer can now display mathematics in e-books input in either TeX or MathML. See <a href="%(math)s">this tutorial</a> for details.
nl: De viewer kan nu wiskunde tonen in e-boeks invoer in zowel TeX als MathML. Bekijk <a href="%(math)s">deze tutorial</a> voor details.
pt: O visualizador pode agora exibir símbolos matemáticos em ebooks tanto em TeX ou MathML. Veja <a href="%(math)s">este tutorial</a>para detalhes.
ru: Теперь читалка может отображать в электронных книгах математику, введённую в TeX или MathML. См. подробнее в <a href="%(math)s">этом руководстве</a>.
sv: Visaren kan nu visa matematik i inmatade e-böcker i antingen TeX eller MathML. Se <a href="%(math)s">denna handledning</a> för detaljer.
zh_tw: 阅读器现在可以在输入的电子书中以TeX或MathML显示数学。 有关详细信息，请参阅<a href="%(math)s">本教程</a>。

source: Finally, the viewer now supports "themes". You can save the current configuration as a "theme" and quickly switch back and forth between them. Useful if you use a "night" mode with dark background and light text, for example.
nl: Tenslotte, de viewer ondersteunt nu "thema's". U kan de huidige configuratie als een "thema" bewaren en er snel tussen heen en weer schakelen. Handig als u een "nacht" modus met donkere achtergrond en lichte tekst gebruikt, bijvoorbeeld.
pt: Finalmente, o visualizador agora suporta "temas". Você pode salvar a configuração atual como um "tema" e rapidamente trocar entre eles. Útil se você usa um modo "noturno" com um fundo escuro e texto claro, por exemplo.
ru: Наконец, промотрщик теперь поддерживает «темы». Вы можете сохранить текущую конфигурацию в качестве «темы» и быстро переключаться назад и вперёд между ними. Полезно, например, если вы используете «ночной» режим с тёмным фоном и светлым текстом.
sv: Slutligen stöder visaren "teman". Du kan spara aktuell konfiguration som ett "tema" och snabbt växla mellan dem. Användbart om du använder ett "natt"-läge med mörk bakgrund och ljus text, till exempel.
zh_tw: 最后，阅读器现在支持“主题”。 您可以将当前配置保存为“主题”，并在它们之间快速来回切换。 例如，如果您使用具有深色背景和浅色文本的“夜间”模式， 则非常有用。

source: You can setup the calibre E-book viewer to look like it does in the screenshots below by clicking the Preferences button in the viewer.
nl: U kan de calibre e-boek viewer instellen om eruit te zien zoals in de screenshots hieronder door op de Voorkeuren knop te klikken in de viewer.
pt: Você pode configurar o Visualizador de e-books do calibre para parecer como nas imagens abaixo clicando no botão de preferências no visualizador.
ru: Вы можете настроить читалку электронных книг calibre, чтобы она выглядела, как на снимках экрана ниже, нажав в ней «Параметры».
sv: Du kan ställa in calibres e-bokvisare att se ut som det gör i skärmdumpar nedan genom att klicka på knappen Inställningar i visaren.
zh_tw: 您可以通过单击calibre电子书阅读器中的“首选项”按钮， 将calibre阅读器设置为与下面屏幕截图中 相同的效果。

source: The new paged mode, showing top and bottom margins
nl: De nieuwe pagina modus, met boven- en onderkant marges
pt: O novo modo paginado, exibindo margens de topo e fundo
ru: Новый страничный режим, показывающий верхние и нижние поля
sv: Det nya sidindelade läget, som visar övre och nedre marginaler
zh_tw: 新的分页模式，显示上下页边距

source: Full screen mode with two pages on the screen
nl: Full screen modus met twee pagina's op het scherm
pt: Modo de ecrã total com duas páginas por ecrã
ru: Режим полноэкранного двухстраничного просмотра
sv: Helskärmsläge med två sidor på skärmen
zh_tw: 雙頁全螢幕模式

source: Night mode in the viewer
nl: Nacht modus in de viewer
pt: Modo noturno no visualizador
ru: Ночной режим в читалке
sv: Nattläge i visaren
zh_tw: 夜間模式的檢視器

source: Mathematics in the viewer
nl: Wiskunde in de viewer
pt: Matemática no visualizador
ru: Математика в читалке
sv: Matematik i visaren
zh_tw: 阅读器中的数学

source: Full support for connecting to Android phones/tablets
nl: Volledige ondersteuning voor verbinding met Android telefoons/tablets
pt: Suporte completo para ligações a telemóvel/tablets Android
ru: Полная поддержка подключённых телефонов/планшетов на Android
sv: Fullt stöd för anslutning till Android-telefoner/surfplattor
zh_tw: 完整的支援連線至 Android 手機、平板

source: calibre can now connect both wirelessly and over USB to Android devices. Modern Android devices often use a special "MTP" protocol when connecting by USB. calibre now supports this protocol in Windows (Vista and newer) and Linux.
nl: calibre kan nu zowel draadloos als via USB verbinden met Android toestellen. Moderne Android toestellen gebruiken vaak een speciaal "MTP" protocol bij het verbinden via USB. calibre ondersteunt dit protocol nu in Windows (Vista en nieuwer) en Linux.
pt: O calibre pode agora conectar tanto via wifi como via USB a dispositivos Android. Dispositivos Android modernos costumam usar um protocolo especial "MTP" ao conectar via USB. O calibre agora suporta este protocolo no Windows (Vista e mais novo) e Linux.
ru: Сейчас calibre может подключаться к устройствам Android по беспроводной связи и через USB. В современных устройствах для USB-подключений часто используется специальный протокол MTP. Теперь calibre поддерживает этот протокол в Windows (Vista и новее) и Linux.
sv: calibre kan nu ansluta både trådlöst och via USB till Android- enheter. Moderna Android-enheter använder ofta ett speciellt "MTP"-protokoll när du ansluter via USB. calibre stöder nu detta protokoll i Windows (Vista och nyare) och Linux.
zh_tw: Calibre现在既可以无线连接，也可以通过USB连接到Android设备。 现代Android设备在通过USB连接时，通常使用特殊的“MTP”协议。 Calibre现在在Windows(Vista和更新版本)和Linux中 支持此协议。
