Repository: debian-calibre/calibre
Catalog: translations-git/website/*.po
Languages: nl, pt, ru, sv, zh_tw

source: The download of news has been speeded up as well (as of 0.6.27) by making it truly multi-threaded.
nl: Nieuws downloaden is ook versneld (vanaf 0.6.27) door het echt multi-threaded te maken.
pt: O descarregamento de notícias também foi acelerado (a partir da versão 0.6.27) ao torná-lo verdadeiramente multitarefa.
ru: Также ускорена загрузка новостей (в 0.6.27): теперь она действительно многопоточная.
sv: Hämtningen av nyheter har också snabbats upp (från och med 0.6.27) genom att göra det verkligen flertrådiga.
zh_tw: 新闻的下载速度也得到了提高（从0.6.27开始），使之成为真正的多线程。

source: Improvements in the conversion and metadata engines
nl: Verbeteringen in conversie en metadata engines
pt: Melhorias nos motores de conversão e de metadados
ru: Улучшения движков преобразования и метаданных
sv: Förbättringar i konverterings- och metadatamotorerna
zh_tw: 对转换引擎和元数据引擎的改进

source: The conversion engine now supports unicode characters in RTF Input documents and auto-converts ligatures for PDF input documents.
nl: De omzettingsengine ondersteunt nu Unicode karakters in RTF invoer documenten en zet ligaturen voor PDF invoer documenten automatisch om.
pt: O mecanismo de conversão agora suporta caracteres unicode em documentos de entrada RTF e converte automaticamente ligaduras para documentos de entrada PDF.
ru: Движок преобразования теперь поддерживает символы юникода во входных RTF-документах и автоматически преобразовывает лигатуры во входных PDF-документах.
sv: Konverteringsmotorn stöder nu unicode-tecken i RTF-Ingångsdokument och konverterar automatiskt ligaturer för PDF-ingångsdokument.
zh_tw: 转换引擎现在支持RTF输入文档中的Unicode字符，并自动转换PDF输入文档的连字。

source: calibre can now set metadata in DRMed Topaz and MOBI files.
nl: calibre kan nu metadata instellen in DRMed Topaz and MOBI bestanden.
pt: O calibre agora pode definir metadados em arquivos Topaz e MOBI com DRM.
ru: Теперь calibre может настраивать метаданные в файлах Topaz и MOBI с DRM.
sv: calibre kan nu ställa in metadata i Topaz- och MOBI-filer med DRM.
zh_tw: Calibre现在可以在有数字版权限制（DRM）的TOPAZ和MOBI文件中设置元数据。

source: When generating EPUB files, calibre now creates SVG based covers, that automatically stretch to fill up the available screen real estate on the device used to read them.
nl: Bij genereren van EPUB bestanden maakt calibre nu SVG covers, die automatisch uitrekken om het beschikbare schermvastgoed op te vullen op het toestel gebruikt om ze te lezen.
pt: Ao gerar arquivos EPUB, o calibre agora cria capas baseadas em SVG, que automaticamente se esticam para preencher toda a tela disponível do dispositivo usado para ler.
ru: Теперь при создании файлов EPUB calibre делает обложки на основе SVG, чтобы автоматически заполнять доступное место на экранах реальных устройств, использующихся для чтения.
sv: När du skapar EPUB-filer skapar calibre nu SVG-baserade omslag, som automatiskt sträcker sig för att fylla upp hela den tillgängliga skärmen på enheten som används för att läsa dem.
zh_tw: 在生成EPUB文件时，calibre现在创建基于SVG的封面，这些封面会自动拉伸以填充用于 读取它们的设备上的可用屏幕空间。

source: calibre can now convert CHM files.
nl: calibre kan nu CHM bestanden omzetten.
pt: O Calibre consegue agora converter ficheiros CHM.
ru: Теперь calibre умеет преобразовывать файлы CHM.
sv: calibre kan nu konvertera CHM-filer.
zh_tw: Calibre现在可以转换 CHM 文件。

source: Creation of catalogs
nl: Catalogi creëren
pt: Criação de catálogos
ru: Создание каталогов
sv: Skapande av kataloger
zh_tw: 创建目录

source: You can now easily generate a catalog of all books in your calibre library by clicking the arrow next to the Convert button. The catalog can be in one of several formats: XML, CSV, EPUB and MOBI, with scope for future formats via plugins. If you generate the catalog in an e-book format, it will be automatically sent to your e-book reader the next time you connect it, allowing you to easily browse your collection on the reader itself.
nl: U kan nu gemakkelijk een catalogus genereren van alle boeken in uw calibre bibliotheek met een klik op de pijl naast de Omzetten knop. De catalogus kan in een van de formaten: XML, CSV, EPUB and MOBI zijn, met uitzicht op toekomstige formaten via plug-ins. Als u de catalogus in an e-boek formaat genereert, zal hij bij de volgende verbinding automatisch naar uw e-boek reader gestuurd worden, zo kan u gemakkelijk door uw collectie bladeren op de reader zelf.
pt: Você pode agora facilmente gerar um catálogo de todos os livros na sua biblioteca do calibre clicando na seta ao lado do botão Converter livros. O catálogo pode ser criado em vários formatos: XML, CSV, EPUB e MOBI, com escopo para futuros formatos via plugins. Se você gerar o catálogo em um formato de e-book, ele será automaticamente enviado para o seu leitor de livros na próxima vez que conectar, permitindo que você facilmente possa navegar sua coleção no próprio leitor.
ru: Теперь вы можете легко создать каталог всех книг в вашей библиотеке calibre, нажав на стрелку рядом с кнопкой «Конвертировать». Каталог может быть в одном из нескольких форматов: XML, CSV, EPUB и MOBI, с возможностью использования будущих форматов с помощью плагинов. Если вы создадите каталог в формате электронной книги, он будет автоматически отправлен вашей читалке в следующий раз, когда вы подключите её, позволяя вам легко просматривать вашу коллекцию на самой читалке.
sv: Du kan nu enkelt skapa en katalog över alla böcker i ditt calibre-bibliotek genom att klicka på pilen bredvid knappen Konvertera. Katalogen kan vara i ett av flera format: XML, CSV, EPUB och MOBI, med utrymme för framtida format via insticksmoduler. Om du skapar katalogen i ett e-bokformat skickas den automatiskt till din e-bokläsare nästa gång du ansluter den, så att du enkelt kan bläddra i din samling på läsenheten själv.
zh_tw: 现在，您可以通过单击“转换”按钮旁边的箭头轻松地生成Calibre书库中所有图书的目录。 目录可以是几种格式中的一种：XML、CSV、EPUB和MOBI，并且可以通过插件支持未来范围内的格式。 如果您以电子书格式生成目录，则在您下次连接它时，它将自动发送到您的电子书阅读器， 使您可以在阅读器上轻松浏览您的藏书。

source: E-book viewer improvements
nl: E-boek viewer verbeteringen
pt: Melhorias no visualizador de livros
ru: Улучшения читалки электронных книг
sv: Förbättringar av e-bokvisaren
zh_tw: 電子書檢視器的改進

source: The E-book viewer now has builtin dictionary lookup. Just select a word and right click to look it up using the dictionary servers at dict.org
nl: De e-boek viewer heeft nu woordenboek opzoeken ingebouwd. Selecteer gewoon een woord en klik rechts om het op te zoeken in de woordenboekservers op dict.org
pt: O Visualizador de e-books agora possui busca no dicionário integrada. Apenas selecione uma palavra e clique com o botão direito para procurá-la nos servidores do dict.org
ru: В читалку электронных книг теперь встроен поиск по словарю. Просто выделите слово и щёлкните по нему правой кнопкой, чтобы найти его значение с помощью серверов словарей на dict.org
sv: E-bokvisaren har nu en inbyggd funktion för uppslagning i ordbok. Välj bara ett ord och högerklicka för att slå det upp med hjälp av ordboksservrarna på dict.org
zh_tw: 电子书阅读器现在有内置的字典查找功能。只需选择一个单词，然后单击鼠标右键即可使用 dict.org.上的词典服务器进行查找

source: The viewer now supports SVG embedded in XHTML when viewing EPUB files.
nl: De viewer ondersteunt nu SVG ingebed in XHTML bij het bekijken van EPUB bestanden.
pt: O visualizador agora suporta SVG incorporado em XHTML ao visualizar arquivos EPUB.
ru: Теперь читалка поддерживает SVG, встроенный в XHTML, при просмотре файлов EPUB.
sv: Visaren stöder nu SVG inbäddat i XHTML när du tittar på EPUB-filer.
zh_tw: 在阅读EPUB文件时，阅读器现在支持XHTML中嵌入的SVG。

source: USB syncing with the iPad
nl: USB synchronisatie met de iPad
pt: Sincronização por USB com iPad
ru: USB синхронизация с iPad
sv: USB-synkronisering med iPad
zh_tw: 使用 ipad 進行USB 同步

source: calibre now has an experimental driver for the iPad. If you connect the iPad to your computer with calibre running, it should be detected and you can send books directly to iBooks on the iPad with calibre. The driver works by using iTunes in the background, so you also need to have iTunes installed and your iPad setup in it. This works on Windows and macOS 10.5 and higher. And of course, you can browse your calibre collection wirelessly on the iPad with the calibre Content server. For details see the <a href="%(ios)s">FAQ</a>.
nl: calibre heeft nu een experimentele driver voor de iPad. Als u de iPad verbindt met uw computer terwijl calibre draait, zou hij gedetecteerd moeten worden en kan u direct boeken sturen naar iBooks op de iPad met calibre. De driver werkt door in de achtergrond iTunes te gebruiken, dus u moet ook iTunes geïnstalleerd hebben en uw iPad erin ingesteld hebben. Dit werkt in Windows en macOS 10.5 en hoger. En natuurlijk kan u draadloos door uw calibre collectie browsen op de iPad met de calibre Content server. Voor details bekijk de <a href="%(ios)s">FAQ</a>.
pt: O calibre agora tem um driver experimental para o iPad. Se você conectar o iPad ao seu computador com o calibre rodando, ele deve ser detectado e você poderá enviar livros diretamente para o iBooks no iPad. O driver funciona usando o iTunes ao fundo, então você também precisa ter o iTunes instalado e o seu iPad configurado nele. Isto funciona no Windows e no macOS 10.5 e superior. E claro, você pode navegar sua coleção do calibre sem fio no iPad com servidor de conteúdo do calibre. Para detalhes veja o <a href="%(ios)s">FAQ</a>.
ru: calibre теперь имеет экспериментальный драйвер для iPad. Если вы подключите iPad к компьютеру с запущенным calibre, это должно быть обнаружено, и вы можете отправлять книги прямо в iBooks на iPad с calibre. Драйвер работает с помощью iTunes в фоновом режиме, поэтому вам также нужно установить iTunes и настроить iPad в нём. Это работает на Windows и MacOS 10.5 и выше. И, конечно же, вы можете просмотреть свой calibre без проводов на iPad через контент-сервер. Подробнее см. <a href="%(ios)s">ЧАСТО ЗАДАВАЕМЫЕ ВОПРОСЫ</a>.
sv: calibre har nu en experimentell drivrutin för iPad. Om du ansluter iPad till din dator med calibre igång, bör den upptäckas och du kan skicka böcker direkt till iBooks på iPad med calibre. Drivrutinen fungerar genom att använda iTunes i bakgrunden, så du måste också ha iTunes installerat och din iPad-installation i den. Detta fungerar på Windows och macOS 10.5 och senare. Och naturligtvis kan du bläddra i din calibre-samling trådlöst på iPad med calibre-innehållsservern. För mer information se <a href="%(ios)s">vanliga frågor</a>.
zh_tw: Calibre现在有了一个iPad的实验性驱动程序。如果你在Calibre运行的情况下 将iPad连接到你的电脑上，它应该会被检测到，你可以用Calibre将图书直接发送到iPad上的iBooks。 该驱动程序是通过在后台使用iTunes来工作的，所以你还需要安装iTunes，并在其中安装您的iPad。这适用于Windows和MacOS 10.5及更高版本。 当然，您还可以使用Calibre内容服务器在iPad上无线浏览您的Calibre藏书。 有关详细信息，请参阅 <a href="%(ios)s">常见问题解答</a>。

source: Incompatible changes
nl: Onverenigbare veranderingen
pt: Alterações incompatíveis
ru: Несовместимые изменения
sv: Inkompatibla ändringar
zh_tw: 不相容的改動

source: 0.7 drops support for the un-upgraded SONY PRS 500. In addition all the SONY drivers have been combined into a single driver, so if you previously customized a SONY driver, you will have to redo the customization. Also note that, calibre turns tags into collections, so it will create new collections for existing books on your reader, if they have tags but don't already have collections on the device. You can turn off this behavior by going to Preferences-&gt;Plugins-&gt;Device interface and customizing the SONY plugin.
nl: 0.7 ondersteunt de niet geüpgrade SONY PRS 500 niet meer. Daarbovenop zijn alle SONY drivers gecombineerd in één driver, dus als u vroeger een SONY driver aanpaste, zal u dat opnieuw moeten doen. Let er ook op dat calibre tags verandert in collecties, dus het zal nieuwe collecties creëren voor bestaande boeken op uw reader, als ze tags maar nog geen collecties hebben op het toestel. U kan dit gedrag uitzetten door naar Voorkeuren-&gt;Plugins-&gt;Toestel interface te gaan en de SONY plug-in aan te passen.
pt: A versão 0.7 deixa de suportar o não-atualizado SONY PRS 500. Além disso, todos os drivers SONY fora unificados em um único driver, então se você personalizou previamente um driver SONY, você terá que refazer a personalização. Note também que, o calibre transforma as etiquetas em coleções, então ele irá criar novas coleções para livros existentes no seu leitor, se eles possuem etiquetas mas já não estão em uma coleção no dispositivo. Você pode desabilitar este comportamento em Preferências-&gt;Plugins-&gt;Interface de dispositivo e personalizar o plugin SONY.
ru: 0.7 сбросил поддержку необновленной SONY PRS 500. Кроме того, все драйверы SONY были объединены в один драйвер, так что если вы предварительно настроили драйвер SONY, вам придется повторить настройку. Также обратите внимание, что calibre превращает теги в коллекции, поэтому он будет создавать новые коллекции для существующих книг в вашей читалке, если они имеют теги, но ещё не имеют коллекций на устройстве. Вы можете отключить это поведение зайдя в Preferences-Plugins-Device plugins интерфейса и настроив плагин SONY.
sv: 0.7 stöder inte längre icke-uppgraderade SONY PRS 500. Dessutom har alla SONY-drivrutiner kombinerats till en enda drivrutin, så om du tidigare har anpassat en SONY-drivrutin måste du göra om anpassningen. Observera också att calibre förvandlar taggar till samlingar, så det kommer att skapa nya samlingar för befintliga böcker på din läsare, om de har taggar men inte redan har samlingar på enheten. Du kan inaktivera detta beteende genom att gå till Inställningar-&gt;Insticksmoduler-&gt;Enhetsgränssnitt och anpassa SONY-insticksmodulen.
zh_tw: 0.7版本撤下了对未升级的索尼PRS 500的支持。此外，所有索尼驱动程序都已合并到一个驱动程序中， 因此，如果您以前自定义了索尼驱动程序，则必须重新进行自定义。 还要注意的是，Calibre将标签转换为集合，因此它将为您的阅读器上的现有图书创建新的集合，如果它们有标签，但设备上还没有集合的话。 您可以通过转到“首选项->插件->设备界面插件”并自定义Sony插件来关闭此行为。

source: The database schema of the calibre library has changed to support custom columns. While effort has been spent to try to ensure backwards-compatibility, you may have problems going back to an 0.6.x release after upgrading to 0.7, so avoid this, if possible.
nl: Het database schema van de calibre bibliotheek is veranderd om aangepaste kolommen te ondersteunen. Ondanks inspanningen voor backward-compatibility, kan u problemen hebben bij het terug gaan naar een 0.6.x versie na upgrading naar 0.7, dus vermijd dit indien mogelijk.
pt: O esquema da base de dados da biblioteca do calibre mudou para suporta colunas personalizadas. Apesar de ter sido feito um esforço para evitar problemas de compatibilidade, você pode ter problemas voltando para uma versão 0.6.x depois de atualizar para a 0.7, então evite isso, se possível.
ru: С добавлением поддержки пользовательских столбцов изменилась схема базы данных библиотеки calibre. Хотя на сохранение обратной совместимости и было потрачено множество усилий, всё же могут возникнуть проблемы с откатом на версию 0.6.x после обновления до 0.7, поэтому, постарайтесь по возможности этого избегать.
sv: Databasschemat för calibre-biblioteket har ändrats för att stöda anpassade kolumner. Medan ansträngningar har använts för att försöka säkerställa bakåtkompatibilitet kan du ha problem att gå tillbaka till en 0.6.x utgåva efter uppgradering till 0.7, så undvik detta om möjligt.
zh_tw: calibre书库的数据库架构已更改为支持自定义列。 虽然已经在努力确保向后兼容性，但是在升级到0.7版之后返回到0.6.x版本时可能会遇到问题，因此尽可能避免这种情况。

source: This is an appropriate time to trow out a big thank you to all the calibre developers who have contributed most of the major new features listed above. An incomplete list of contributors is available <a href="%(href)s" title="Contributors">here</a>.
nl: Dit is een geschikt moment voor een dikke dank u wel voor al de calibre developers die het meeste van de nieuwe eigenschappen hierboven hebben bijgedragen. Een onvolledige lijst van deelnemers is <a href="%(href)s" title="Contributors">hier</a> beschikbaar .
pt: Este é o momento apropriado para um grande agradecimento aos programadores em Calibre pela colaboração em muitas das grandes e novas funcionalidades acima listadas. Uma lista, incompleta, dos colaboradores está disponível <a href="%(href)s" title="Contributors">aqui</a>.
ru: Самое время сказать огромное спасибо всем разработчикам, благодаря участию которых появилось большинство перечисленных выше значительных нововведений. Неполный список участников доступен <a href="%(href)s" title="Contributors">здесь</a>.
sv: Det här är ett lämpligt tillfälle att framföra ett stort tack till alla calibre-utvecklare som har bidragit med de flesta av de omfattande nya funktionerna som anges ovan. En ofullständig lista över bidragsgivare finns <a href="%(href)s" title="Contributors">här</a>.
zh_tw: 在此，也要向贡献了上述大部分主要新功能的所有开发人员表示衷心的感谢。<a href="%(href)s" title="Contributors">这里</a>有一份不完整的贡献者名单。

source: Note that many of these features were actually introduced during the lifetime of the 0.6.x series. This document describes new features as compared to 0.6.0
nl: Merk op dat veel van deze functies eigenlijk tijdens het leven van de 0.6.x series waren geïntroduceerd. Dit document beschrijft nieuwe functies vergeleken met 0.6.0
pt: Note que muitas dessas funções foram de fato introduzidas durante o ciclo de vida da série 0.6.x. Este documento descreve novas funções comparadas à versão 0.6.0
ru: Обратите внимание, что многие из перечисленных функций фактически вводились в течение всего срока жизни серии 0.6.x. Этот документ описывает новые возможности по сравнению с версией 0.6.0.
sv: Observera att många av dessa funktioner faktiskt introducerades under livslängden på 0.6.x-serien. Detta dokument beskriver nya funktioner jämfört med 0.6.0
zh_tw: 请注意，其中许多功能实际上是在 0.6.x 系列的生命周期中引入的。本文档介绍了与 0.6.0 相比的新功能。

source: New in calibre 2.0
nl: Nieuw in calibre 2.0
pt: Novo no Calibre 2.0
ru: Новое в calibre 2.0
sv: Nytt i calibre 2.0
zh_tw: Calibre 2.0 中的新功能

source: It has been a year since calibre 1.0 and lots has changed in calibre-land. The biggest new feature is an e-book editor, capable of editing e-books in both the EPUB and AZW3 (Kindle) formats. Click on the items in the list below to learn more about each new feature.
nl: Het is nu een jaar sinds calibre 1.0 en er is veel veranderd in calibre land. Het grootste nieuwe eigenschap is een e-boek editor voor zowel het EPUB als AZW3 (Kindle) formaat. Klik op de items in de lijst onder om meer te leren over elk eigenschap.
pt: Já faz um ano desde o calibre 1.0 e muita coisa mudou na calibre-lândia. A grande nova função é um editor de e-book, capaz de editar e-books tanto no formato EPUB como AZW3 (Kindle). Clique nos items da lista abaixo para aprender mais sobre cada nova função.
ru: Прошёл год с выпуска 1.0, и многое изменилось в мире calibre. Важнейшая из новых функций — редактор электронных книг, способный изменять книги в форматах EPUB и AZW3 (Kindle). Нажимайте на записи в списке ниже, чтобы узнать больше о каждой из новых возможностей.
sv: Det har gått ett år sedan calibre 1.0 och partier har förändrats i calibre-världen. Den största nya funktionen är en e-bokredigerare som kan redigera e-böcker i båda formaten EPUB och AZW3 (Kindle). Klicka på artiklarna i listan nedan för att läsa mer om varje ny funktion.
zh_tw: 距离Calibre 1.0发布已经过去了一年，在Calibre内外上发生了很大的变化。 最大的新功能是电子书编辑器，可以编辑EPUB和AZW3(Kindle)格式的电子书。 单击下面列表中的项目，详细了解每项新功能。

source: Note that because of the move to Qt 5, calibre no longer supports either Windows XP or versions of macOS older than 10.7 (Lion). If you are using either of these operating systems, you should stay with calibre 1.48.
nl: Let erop dat vanwege de verhuis naar Qt5, calibre niet langer Windows XP of versies van het MacOS ouder dan 10.7 (Lion) ondersteunt. Als u een van beide gebruikt, blijft u best bij calibre 1.48.
pt: Note que devido a mudança para o Qt 5, o calibre não mais suporta o Windows XP ou versões do macOS mais antigas que a 10.7 (Lion). Se você está utilizando qualquer um destes sistemas operacionais, deve permanecer com o calibre 1.48.
ru: Обратите внимание, что из-за перехода на Qt 5 calibre больше не поддерживает ни Windows XP, ни версии macOS старше 10.7 (Lion). Если вы используете любую из этих операционных систем, вам придётся остаться на calibre 1.48.
sv: Observera att på grund av flytten till Qt 5, stöder calibre inte längre varken Windows XP eller versioner för macOS äldre än 10.7 (Lion). Om du använder något av dessa operativsystem kan du använda calibre 1.48.
zh_tw: 请注意，由于迁移到Qt 5，Calibre不再支持Windows XP或 早于10.7(Lion)的MacOS版本。如果您使用的是这两个操作 系统中的任何一个，您应该使用Calibre 1.48版本。

source: calibre now has an e-book editor capable of editing books in the EPUB and AZW3 (Kindle) formats, with many powerful tools and features, specially designed for making editing e-book easier.
nl: calibre heeft nu een e-boek editor die in staat is om boeken in the te bewerken EPUB- en AZW3-formaten (Kindle), met veel krachtige tools en functies, speciaal ontworpen om het bewerken van e-boeken eenvoudiger te maken.
pt: o calibre agora tem um editor de e-book capaz de editar livros nos formatos EPUB e AZW3 (Kindle), com muitas ferramentas poderosas e funções, especialmente criadas para tornar a edição mais fácil.
ru: Теперь в calibre есть редактор электронных книг, способный изменять книги в форматах EPUB и AZW3 (Kindle), со множеством эффективных инструментов и функций, специально разработанных для упрощения редактирования электронных книг.
sv: calibre har nu en e-bokredigerare som kan redigera böcker i EPUB och AZW3 (Kindle) format, med många kraftfulla verktyg och funktioner, speciellt utformad för att göra e-bokredigering lättare.
zh_tw: Calibre现在有一个电子书编辑器，可以编辑EPUB和AZW3(Kindle)格式 的书籍，拥有许多功能强大的工具和功能，专门为使编辑电子书 变得更容易而设计。

source: Watch the video below for a tour of the new e-book editor. You can also read about the various features of the editor in detail in the <a href="%(edit)s">User Manual</a>.
nl: Bekijk de video hieronder voor een tour door de nieuwe e-boek editor. U kan ook in detail over de verschillende eigenschappen van de editor lezen in de <a href="%(edit)s">Handleiding</a>.
pt: Assista o vídeo abaixo para um tour sobre o novo editor de e-book. Você também pode ler sobre as várias funções do editor em detalhes no <a href="%(edit)s">Manual do Usuário</a>.
ru: Посмотрите ниже видео с обзором нового редактора электронных книг. Ещё подробнее о различных возможностях редактора можно прочитать в <a href="%(edit)s">руководстве пользователя</a>.
sv: Titta på videon nedan för en rundtur i den nya e-bokredigeraren. Du kan också läsa om redigerarens olika funktioner i detalj i <a href="%(edit)s">användarmanualen</a>.
zh_tw: 观看下面的视频，了解新的电子书编辑器。您还可以在 <a href="%(edit)s">用户手册</a>中详细阅读编辑器的各种功能。

source: The new e-book editor
nl: De nieuwe e-boek editor
pt: Novo editor de livros
ru: Новый редактор электронных книг
sv: Den nya e-bokredigeraren
zh_tw: 新的电子书编辑器

source: Download video:
nl: Video downloaden:
pt: Descarregar vídeo:
ru: Загрузка видео:
sv: Hämta video:
zh_tw: 下載影片:

source: Comparing books
nl: Boeken vergelijken
pt: Comparação de livros
ru: Сравнение книг
sv: Jämföra böcker
zh_tw: 比對書本
