Repository: debian-calibre/calibre
Catalog: translations-git/website/*.po
Languages: nl, pt, ru, sv, zh_tw

source: When connecting to devices, calibre now caches the metadata it reads from the files on the device. This means that on subsequent connects calibre will build the list of books on the device very fast. If you like to keep large collections of books on your device, you will find this feature a godsend.
nl: Bij verbinden met toestellen cachet calibre nu de metadata die het leest uit de bestanden op het toestel. Dit betekent dat calibre bij volgende verbindingen zeer snel de lijst met boeken op het toestel zal opbouwen. Als u graag grote collecties boeken op uw toestel bewaart, zal u deze functie een meevaller vinden.
pt: Ao conectar a dispositivos, o calibre agora armazena em cache os metadados lidos dos arquivos no dispositivo. Isto significa que em conexões subsequente o calibre irá criar a lista de livros rapidamente. Se você gosta de manter grandes coleções no seu dispositivo, você irá achar essa funcionalidade o máximo.
ru: При подключении к устройствам теперь calibre кэширует метаданные, которые он читает из файлов. на устройстве. Это означает, что при последующих подключениях calibre будет строить список книг на устройстве очень быстро. Если вы хотите хранить большие коллекции книг на своём устройстве, эта функция будет полезной.
sv: När du ansluter till enheter cachar calibre nu metadata som den läser från filerna på enheten. Detta innebär att på efterföljande anslutningar kommer calibre att bygga listan över böcker på enheten mycket snabbt. Om du gillar att hålla stora samlingar av böcker på din enhet, kommer den här funktionen att vara en gudagåva.
zh_tw: 连接到设备时，Calibre现在会缓存从设备上的文件中读取的元数据。 这意味着在随后的连接中，Calibre将非常快速地在设备上建立图书列表。 如果你喜欢在你的设备上保存大量的书籍藏品， 你会发现这个功能简直是天赐之物。

source: The 0.7 User interface
nl: De 0.7 Gebruikersinterface
pt: A interface de utilizador v. 0.7
ru: Пользовательский интерфейс версии 0.7
sv: 0.7 användargränssnittet
zh_tw: 0.7 版的使用者介面

source: Some of these improvements are described in more detail below.
nl: Enkele van deze verbeteringen worden hieronder in meer detail beschreven.
pt: Alguns destes melhoramentos são descritos abaixo em detalhe.
ru: Некоторые из этих улучшений более подробно описаны ниже.
sv: Några av dessa förbättringar beskrivs mer detaljerat nedan.
zh_tw: 其中一些改进将在下面更详细地描述。

source: User interface improvements
nl: Verbeteringen in de gebruikersinterface
pt: Melhorias na interface de utilizador
ru: Улучшения пользовательского интерфейса
sv: Förbättringar av användargränssnittet
zh_tw: 使用者介面的改善

source: The best way to see the user interface improvement is watch the video linked to above. For those of you that cannot, here's a short description.
nl: De beste manier om de gebruikersinterface verbetering te zien, is de video te bekijken waarnaar hierboven wordt gelinkt. Voor degenen die dat niet kunnen, een korte beschrijving.
pt: A melhor maneira de ver a melhoria da interface do usuário é assistir o vídeo do link acima. Para aqueles de vocês que não podem, eis aqui uma breve descrição.
ru: Оптимальный способ ознакомиться с улучшением интерфейса — посмотреть помещённое выше видео. Если же для кого-нибудь это невозможно, вот краткое описание.
sv: Det bästa sättet att se användargränssnittet förbättring är titta på videon länkad ovan. För er. som inte kan, här är en kort beskrivning.
zh_tw: 查看用户界面改进的最佳方式是观看上面链接的视频。对于那些不能做到这一点的人， 这里有一个简短的描述。

source: You can now add your own columns to the book list, via Preferences-&gt;Interface (the plus button). You can add your own ratings, yes/no, tags, date, etc. columns and have them appear in the booklist. The contents of these columns can be edited just like a builtin column, by either double clicking on individual entries or using the Edit meta information button.
nl: U kunt nu uw eigen kolommen toevoegen aan de boekenlijst, via Voorkeuren-&gt;Interface (de plusknop) . U kan uw eigen beoordelingen, ja/nee, labels, datum, enz. kolommen toevoegen en in de boekenlijst laten verschijnen. De inhoud van deze kolommen kan bewerkt worden, net als een ingebouwde kolom, door te dubbelklikken op afzonderlijke items of met behulp van de knop Meta-informatie bewerken.
pt: Você pode agora adicionar suas próprias colunas para a lista de livros, via Preferências-&gt;Interface (o botão de mais). Você pode adicionar colunas com suas próprias avaliações, sim/não, etiquetas, data, etc e colocá-las na lista de livros. O conteúdo destas colunas pode ser editado como uma coluna normal, seja com um clique duplo em entradas individuais ou usando o botão de Edição de informação de metadados.
ru: Теперь вы можете добавить свои собственные столбцы в список книг через Preferences-Interface (кнопка «плюс»). Вы можете добавить свои собственные столбцы: оценки, да/нет, теги, дату и т. д. и они появятся в списке книг. Содержимое этих столбцов можно редактировать также как встроенный столбец, с помощью либо двойного щелчка по отдельным записям, либо кнопкой «Редактировать метаданные».
sv: Du kan nu lägga till dina egna kolumner i boklistan, via Inställningar-&gt;Gränssnitt (plus-knappen). Du kan lägga till dina egna kolumner med betyg, ja/nej, taggar, datum, m.m. och få dem att visas upp i boklistan. Innehållet i dessa kolumner kan redigeras precis som en inbyggd kolumn, genom att antingen dubbelklickar du på enskilda poster eller använder knappen Redigera metadatainformation.
zh_tw: 现在，您可以通过“首选项->界面（加号按钮）将自己的列添加到图书列表中。 您可以添加自己的评分、是/否、标记、日期等列， 并将它们显示在书目中。可以像编辑内置列一样编辑这些列的内容， 方法是双击单个条目或使用“编辑元信息”按钮。

source: You can freely resize the Tag browser and Book details pane and easily show/hide columns by right clicking on their headers. You can also re-arrange columns by dragging their headers.
nl: U kan vrij Tag browser en Boek details paneel hersizen en gemakkelijk kolommen tonen/verbergen door rechts te klikken op de koppen. U kan ook kolommen herschikken door hun koppen te verslepen.
pt: Você pode redimensionar o Navegador de Etiquetas e Painel de detalhe de livros e mostrar/ocultar colunas clicando com o botão direito nos seus cabeçalhos. Você também pode rearranjar as colunas arrastando seus cabeçalhos.
ru: Вы можете свободно изменять размеры браузера тегов и области сведений о книге и легко отображать/скрывать столбцы, щелчком правой кнопки мыши по их заголовкам. Вы также можете изменить порядок столбцов, перетаскивая их заголовки.
sv: Du kan fritt ändra storlek på taggbläddraren och bokdetaljerpanelen och enkelt visa/dölja kolumner genom att högerklicka på deras rubriker. Du kan också ordna om kolumner genom att dra deras rubriker.
zh_tw: 您可以自由调整“标记浏览器”和“图书详细信息”窗格的大小，并通过右键单击列标题轻松显示/隐藏列。 您还可以通过拖动列的标题来重新排列列。

source: You can show/hide categories in the Tag browser by right clicking on them and add your own categories for quick access, by clicking the Manage user categories button. You can also edit entries in the Tag browser by right clicking on them. This will change their value for all books. For example, if you change the name of an author, this change will appear in the metadata of all the books by that author.
nl: U kan categorieën tonen/verbergen in de Label browser door er rechts op te klikken en uw eigen categorieën toevoegen voor snelle toegang door te klikken op de Beheer gebruiker categorieën knop. U kan ook items bewerken in de Label browser door er rechts op te klikken. Dit zal hun waarde veranderen voor alle boeken. Bijvoorbeeld, als u de naam verandert van een auteur, zal dit gebeuren in de metadata van alle boeken van die auteur.
pt: Você pode mostrar/ocultar categorias no Navegador de Tags clicando nelas com o botão direito e adicionar suas próprias categorias para acesso rápido, clicando no botão Gerenciar categorias do usuário. Você pode editar entradas no Navegador de Etiquetas clicando com o botão direito nelas. Isto irá alterar seus valores para todos os livros. Por exemplo, se você alterar o nome de um autor, isto irá aparecer nos metadados de todos os livros desse autor..
ru: Вы можете показать/скрыть категории в браузере тегов, щёлкнув по ним правой кнопкой мыши и добавив свои собственные категории для быстрого доступа, нажав кнопку "Управление пользовательскими категориями". Вы также можете редактировать записи в браузере тегов, щёлкая по ним правой кнопкой мыши. Так изменится их значение для всех книг. Например, если изменить имя автора, это изменение появится в метаданных всех книг этого автора.
sv: Du kan visa/dölja kategorier i taggbläddraren genom att högerklicka på dem och lägga till dina egna kategorier för snabb åtkomst genom att klicka på knappen Hantera användarkategorier. Du kan också redigera poster i taggbläddraren genom att högerklicka på dem. Detta kommer att ändra deras värde för alla böcker. Om du till exempel ändrar namnet på en författare visas den här ändringen i metadata för alla böcker av den författaren.
zh_tw: 您可以通过右键单击“标记浏览器”中的类别来显示/隐藏类别，并通过单击“管理用户类别”按钮添加自己的类别以进行快速访问。 也可以通过右键单击“标记浏览器”中的条目来编辑条目。这将改变它们对所有书籍的值。 例如，如果更改作者的姓名，则此更改将出现在该作者的所有图书的元数据中。

source: You can save your frequently used searches and bring them up with a single click in the Tag browser. You can also use the saved searches to restrict what is shown in calibre. This will restrict the book list as well as the Tag browser. In effect, you have temporarily reduced your calibre collection to only the books matching the search.
nl: U kan uw veelgebruikte zoekacties bewaren en ze oproepen met 1 klik in de Tag browser. U kan de opgeslagen zoekacties ook gebruiken om te beperken wat getoond wordt in calibre. Dit zal zowel de boekenlijst als de Tag browser beperken. Als resultaat hebt u tijdelijk uw calibre collectie verkleind tot enkel de boeken die overeenkomen met de zoekactie.
pt: Você pode salvar suas pesquisas frequentes e usá-las com um simples clique no Navegador de Etiquetas. Você também pode usar as pequisas salvas para restringir o que é mostrado no calibre. Isto irá restringir a lista de livros bem como o Navegador de Etiquetas. De fato, você terá reduzido temporariamente sua coleção para apenas aqueles livros correspondentes à pesquisa.
ru: Вы можете сохранить часто используемые запросы и вызывать их одним щелчком в браузере тегов. Вы также можете использовать сохранённые поиски, чтобы ограничить показываемое в calibre. Так ограничится список книг, а также браузер тегов. По сути, вы временно ограничили свою коллекцию calibre только книгами, соответствующими условию поиска.
sv: Du kan spara dina ofta använda sökningar och ta upp dem med ett enda klick i taggbläddraren. Du kan också använda de sparade sökningarna för att begränsa vad som visas i calibre. Detta kommer att begränsa boklistan samt taggbläddraren. I själva verket har du tillfälligt minskat din calibre-samling till bara de böcker som matchar sökningen.
zh_tw: 您可以保存常用搜索，只需在Tag Browser中单击一下即可将其调出。 您还可以使用保存的搜索来限制在Calibre中显示的内容。这将限制图书列表和标记浏览器。 实际上，您已经暂时将您的calibre藏书减少到仅与搜索匹配的图书。

source: You can now merge book records and have calibre automatically merge the metadata and formats into a single entry for you. Accessed via the arrow next to the edit meta information button.
nl: U kan nu boekrecords samenvoegen en calibre automatisch de metadata en formaten in een enkel item laten samenvoegen voor u. Toegang via de pijl naast de bewerk meta informatie knop.
pt: Agora já pode fundir registos de livros e o Calibre fará automaticamente a fusão dos metadados e formatos numa única entrada. Aceda através da seta junto ao botão de edição de metadados.
ru: Теперь вы можете объединять записи книг, и calibre автоматически объединит метаданные и форматы в одну запись. Доступ через стрелку рядом с кнопкой "Редактировать метаданные".
sv: Du kan nu slå samman bokposter och låta calibre automatiskt slå samman metadata och format till en enda post åt dig. Nås via pilen bredvid knappen Redigera metainformation.
zh_tw: 现在您可以合并图书记录，并让calibre自动将元数据和格式合并到一个条目中。 通过编辑元信息按钮旁边的箭头访问。

source: You can now use regular expression when searching and also relational operators like <code>date:&gt;yesterday</code>.
nl: U kan nu reguliere expressies gebruiken bij het zoeken en ook relationele operatoren zoals <code>datum:&gt;gisteren</code>.
pt: Você agora pode usar expressões regulares ao pesquisar e também operadores relacionais como <code>data:&gt;yesterday</code>.
ru: Появилась возможность пользоваться регулярными выражениями и относительными операторами во время поиска, например, <code>date:&gt;yesterday</code>.
sv: Du kan nu använda reguljärt uttryck när du söker och även relationsoperatörer som <code>datum:&gt;igår</code>.
zh_tw: 现在，您可以在搜索时使用正则表达式，也可以使用关系运算符，如<code>date:&gt；yesterday</code>。

source: calibre can now optionally download tags/reviews/rating from Amazon.com
nl: calibre kan nu optioneel tags/reviews/ratings downloaden van Amazon.com
pt: O Calibre pode agora, opcionalmente, descarregar etiquetas, comentários e pontuações de Amazon.com
ru: Теперь calibre может опционально загружать теги/отзывы/оценки с Amazon.com
sv: calibre kan nu valfritt hämta taggar/recensioner/betyg från Amazon.com
zh_tw: calibre 现在可以选择从 Amazon.com 下载标签/评论/评分

source: Device driver improvements
nl: Device driver verbeteringen
pt: Melhorias no driver de dispositivos
ru: Улучшения драйверов устройств
sv: Enhetsdrivrutinsförbättringar
zh_tw: 裝置驅動程式的改進

source: calibre now shows a <code>"On device"</code> column in the main Library view when you connect a supported device. This column can be used to see at a glance what books in your library are also on the device. There is a complementary <code>"In library"</code> column in the device views that shows what books on the device are in your library. Since you can sort and search on these columns, it becomes very easy to quickly see what books are on the device. For example, the search <code>"not ondevice:main and not ondevice:card"</code> will show you all the books in your library that are not on the device. This feature works best with books you send to the device from calibre 0.7 onwards.
nl: calibre toont nu een <code>"Op toestel"</code> kolom in het hoofd Bibliotheek view als u een ondersteund toestel aansluit. Deze kolom kan u gebruiken om in één blik te zien welke in uw bibliotheek ook op het toestel staan. Er is een bijkomende <code>"In bibliotheek"</code> kolom in de views op het toestel die toont welke boeken op het toestel in uw bibliotheek staan. Aangezien u kan sorteren en zoeken in deze kolommen, wordt het heel gemakkelijk om vlug te zien welke boeken op he toestel staan. Bijvoorbeeld, zoeken op <code>"not ondevice:main and not ondevice:card"</code> zal u alle boeken tonen in uw bibliotheek die niet op het toestel staan. Deze eigenschap werkt het best met boeken die u op het toestel zette met calibre 0.7 of nieuwer.
pt: O calibre agora mostra uma coluna <code>"No dispositivo"</code> na tela principal da biblioteca quando conecta um dispositivo suportado. Esta coluna pode ser usada para ver quais livros na sua biblioteca também estão no dispositivo. Existe uma coluna complementar <code>"Na biblioteca"</code> nas visualizações de dispositivos que mostram quais livros do dispositivo estão na sua biblioteca. Uma vez que você pode organizar e buscar nestas colunas, se torna muito fácil ver quais livros estão no dispositivo. Por exemplo, a busca <code>"not ondevice:main and not ondevice:card"</code> mostrará todos os livros da sua biblioteca que não estão no dispositivo. Isto funciona melhor com livros enviados para o dispositivo com o calibre 0.7 em diante.
ru: calibre теперь показывает столбец <code>«На устройстве»</code> в главном представлении библиотеки при подключении поддерживаемого устройства. Этот столбец можно использовать для просмотра книг в вашей библиотеке, которые также находятся на устройстве. В представлениях устройства есть дополнительный столбец <code>«В библиотеке»</code>. Это показывает, какие книги на устройстве находятся в вашей библиотеке. Поскольку вы можете сортировать и искать по этим столбцам, становится очень легко быстро посмотреть, какие книги есть на устройстве. Например, поиск <code>"not ondevice:main and not ondevice:card"</code> покажет вам все книги в вашей библиотеке, которых нет на устройстве. Эта функция лучше всего работает с книгами, которые вы отправляете на устройство начиная с calibre 0.7 и выше.
sv: calibre visar nu kolumnen <code>"På enheten"</code> i huvudbiblioteksvyn när du ansluter en enhet som stöds. Denna kolumn kan användas för att se en överblick vilka böcker i ditt bibliotek som också finns på enheten. Det finns en kompletterande kolumn <code>"I biblioteket"</code> i enhetsvyerna som visar vilka böcker på enheten som finns i ditt bibliotek. Eftersom du kan sortera och söka i dessa kolumner blir det väldigt enkelt att snabbt se vilka böcker som finns på enheten. Till exempel visar sökningen <code>"not ondevice:main and not ondevice:card"</code> alla böcker i ditt bibliotek som inte finns på enheten. Den här funktionen fungerar bäst med böcker som du skickar till enheten från calibre 0.7 och framåt.
zh_tw: 现在，连接支持的设备时，Calibre会在“主书库视图”中显示<code>“在设备上”</code>列。 此栏可用于一目了然地查看您的书库中的哪些图书也在该设备上。在设备视图中有一个附加的“在书库”列，它显示设备上的哪些图书在您的书库中。 由于您可以对这些列进行排序和搜索，因此快速查看设备上有哪些图书变得非常容易。 例如，搜索“不在设备上:主书库 and 不在设备上:卡片”将显示书库中不在设备上的所有图书。 此功能与您从Calibre 0.7开始发送到设备的图书配合使用效果最好。

source: calibre caches the metadata of all books on the device. This means that when you re-connect the device creating the list of books on the device will be very fast. Especially if you have a number of large ODF files on your device, this will make a huge difference in the time that calibre takes to connect to the device and display the list of books.
nl: calibre cachet de metadata van alle boeken op het toestel. Dit betekent dat als u het toestel terug verbindt, het creëren van de boekenlijst op het toestel zeer snel zal gaan. Vooral als u een aantal grote ODF bestanden op uw toestel heeft, zal dit een enorm verschil maken in de tijd die calibre nodig heeft om met het toestel te verbinden en de boekenlijst te tonen.
pt: O calibre armazena em cache os metadados de todos os livros no dispositivo. Isto significa que quando você reconecta o dispositivo, a criação da lista de livros do dispositivo será bem rápida. Especialmente se você tem um número muito grande de arquivos PDF no seu dispositivo, isto irá fazer uma grande diferença no tempo que o calibre leva para conectar com o dispositivo e mostrar a lista de livros.
ru: calibre кэширует метаданные всех книг на устройстве. Это означает, что при повторном подключении устройства создание списка книг на устройстве будет очень быстрым. Если у вас есть несколько больших ODF-файлов на устройстве, будет огромная разница во времени, нужном calibre для подключения к устройству и отображения списка книг.
sv: calibre cachar metadata för alla böcker på enheten. Det betyder att när du återansluter enheten skapas listan över böcker på enheten mycket snabbt. Speciellt om du har ett antal stora ODF-filer på din enhet, kommer detta att göra en stor skillnad i den tid som calibre tar för att ansluta till enheten och visa listan över böcker.
zh_tw: calibre缓存设备上所有书籍的元数据。这意味着当您重新连接设备时，在设备上创建图书列表的速度将非常快。 尤其是如果你的设备上有很多大的ODF文件，这将大大减少 calibre连接到设备和显示图书列表所需的时间。

source: Users can now specify the folder structure and file name of files placed on the device when using the Send to Device action. This is useful for those devices that allow browsing of the on device folder structure. Customization is available via Preferences-&gt;Add/Save-&gt;Sending to device and can also be overridden on a per device basis from Preferences-&gt;Plugins-&gt;Device interface.
nl: Gebruikers kunnen nu mapstructuur en bestandsnaam bepalen van bestanden geplaatst op het toestel met de Stuur naar Toestel actie. Dit is handig voor die toestellen die bladeren door hun mapstructuur toelaten. Aanpassing is beschikbaar via Voorkeuren-&gt;Toevoegen/Opslaan-&gt;Stuur naar het toestel en kan genegeerd worden op een per toestel basis via Voorkeuren-&gt;Plug-ins-&gt;Toestel interface.
pt: Os usuários agora podem especificar a estrutura de pastas nomes dos arquivos colocados no dispositivo usando a ação Enviar para Dispositivo. Isto é útil para aqueles dispositivos que permitem navegar nas pastas do dispositivo. Personalização está disponível via Preferências-&gt;Adicionar/Salvar-&gt;Enviar para dispositivo e também pode ser substituída para cada dispositivo em Preferências-&gt;Plugins-&gt;Interface do Dispositivo.
ru: Теперь пользователи могут указывать структуру папок и имена файлов, размещаемых на устройстве, при использовании действия «Отправить на устройство». Это полезно для тех устройств, которые позволяют просматривать структуру папок на устройстве. Настройка доступна через Настройки-&gt;Добавить/Сохранить-&gt;Отправка на устройство, а также могут быть переопределены для каждого устройства через Настройки-&gt;Плагины-&gt;Плагины интерфейса устройства.
sv: Användare kan nu ange mappstruktur och filnamn för filer som placeras på enheten när de använder åtgärden Skicka till enhet. Detta är användbart för de enheter som tillåter surfning i mappstrukturen på enheten. Anpassning är tillgänglig via Inställningar-&gt;Lägg till/Spara-&gt;Skicka till enhet och kan också åsidosättas per enhet från Inställningar-&gt;Insticksmoduler-&gt;Enhetsgränssnitt.
zh_tw: 用户现在可以指定在使用“发送到设备”操作时放置在设备上的文件的文件夹结构和文件名。 这对于允许浏览设备上文件夹结构的设备非常有用。 可通过“首选项”->“添加/保存”->“发送到设备”进行自定义， 也可以根据每个设备从“首选项”->“插件”->“设备接口插件”重写。

source: Performance improvements
nl: Prestatie verbeteringen
pt: Melhorias de desempenho
ru: Улучшения производительности
sv: Prestandaförbättring
zh_tw: 性能改进

source: If you have a large library with thousand of books or more, you will notice significant performance gains in starting up calibre and doing common editing tasks like changing metadata, compared to 0.6.0. In addition, thanks to the device caching described above, connecting to devices should become much faster if you have large collections on your device.
nl: Hebt u een grote bibliotheek met duizenden boeken of meer dan zal u, vergeleken met 0.6.0, duidelijke prestatieverbeteringen zien bij calibre's start en het uitvoeren van gewone bewerkingstaken zoals metadata veranderen. Daarbovenop, dankzij de toestel caching boven beschreven, zou verbinden met toestellen veel sneller moeten zijn als u grote collecties op uw toestel hebt.
pt: Caso não possua uma biblioteca grande com milhares de livros ou mais, você notará significantes ganhos de performance na inicialização e em tarefas comuns de edição como alterar metadados, comparado com a versão 0.6.0. Além disso, graças ao cache de dispositivo descrito acima, a conexão a dispositivos deve se tornar muito mais rápida se você tiver uma grande coleção no seu dispositivo.
ru: Если у вас есть большая библиотека с тысячами книг или более, вы заметите значительное повышение производительности при запуске calibre и выполнении общих задач редактирования, таких как изменение метаданных, по сравнению с 0.6.0. Кроме того, благодаря описанному выше кешированию устройства, подключение к устройствам должно стать намного быстрее, если на вашем устройстве есть большие коллекции.
sv: Om du har ett stort bibliotek med tusentals böcker eller mer, kommer du att märka betydande prestationsvinster när du startar calibre och gör vanliga redigeringsuppgifter som att ändra metadata, jämfört med 0.6.0. Tack vare enhetscachen som beskrivs ovan bör anslutningen till enheter dessutom bli mycket snabbare om du har stora samlingar på din enhet.
zh_tw: 如果您有一个拥有数千册或更多图书的大型书库，与0.6.0版本相比，您会注意到 在启动Calibre和执行类似更改元数据的常见编辑任务方面的显著性能提升。 此外，多亏了上面描述的设备缓存，如果您的设备上有大量藏书，则连接到设备应该会变得更快。
