Repository: debian-calibre/calibre
Catalog: translations-git/website/*.po
Languages: nl, pt, ru, sv, zh_tw

source: If you didn’t find what you were looking for, you can also check out some of the calibre tutorials:
nl: Als u niet vond wat u zocht, kan u ook enkele calibre tutorials bekijken:
pt: Se não encontrou o que procurava, veja alguns dos tutoriais do Calibre:
ru: Если вы не нашли то, что искали, возможно, вам пригодятся какие-то из учебных пособий по calibre:
sv: Om du inte hittade det du letade efter kan du också se några av calibre-handledningarna:
zh_tw: 如果没有找到您要查找的内容，还可以查看一些 calibre 教程：

source: <a href="%(href)s">Basic video tutorials</a> that will show you how to use calibre’s e-book editor and tweak the interface.
nl: <a href="%(href)s">Basis video tutorials</a> die u tonen hoe calibre’s e-boek editor te gebruiken en de interface te tweaken.
pt: <a href="%(href)s">Tutoriais básicos de vídeo</a> que irão mostrar como utilizar o editor do Calibre e ajustar a interface.
ru: <a href="%(href)s">Два видеоурока</a>, которые покажут, как пользоваться редактором электронных книг и настраивать интерфейс calibre.
sv: <a href="%(href)s">Grundläggande videohandledningar</a> som visar dig hur du använder calibres e-bokredigerare och justerar gränssnittet.
zh_tw: <a href="%(href)s">基本操作视频教程</a> 将向您展示如何使用 calibre 的电子书编辑器以及如何调整界面。

source: <a href="%(abc)s" title="ABCs of e-book conversion">ABCs of e-book format conversion</a>, by John Schember.
nl: <a href="%(abc)s" title="ABCs of e-book conversion">ABCs van e-boek formaat conversie</a>, door John Schember.
pt: <a href="%(abc)s" title="ABCs of e-book conversion">ABC da conversão de ebooks</a>, por John Schember.
ru: <a href="%(abc)s" title="ABCs of e-book conversion">Азбука преобразования форматов электронных книг</a> Джона Шембера.
sv: <a href="%(abc)s" title="ABCs of e-book conversion">ABC för konvertering av e-bokformat</a> av John Schember.
zh_tw: John Schember 撰写的<a href="%(abc)s" title="ABCs of e-book conversion">电子书格式转换的基础知识</a>

source: A <a href="%(sbs)s" title="Step-by-step">step-by-step guide</a> on converting HTML and Microsoft Word formats using calibre.
nl: Een <a href="%(sbs)s" title="Step-by-step">stap-voor-stap gids</a> over converteren van HTML en Microsoft Word formaten met calibre.
pt: Um <a href="%(sbs)s" title="Step-by-step">guia passo a passo</a> sobre como converter formatos HTML e Microsoft Word usando o Calibre.
ru: <a href="%(sbs)s" title="Step-by-step">Пошаговое руководство</a> по преобразованию с помощью calibre форматов HTML и Microsoft Word.
sv: En <a href="%(sbs)s" title="Step-by-step">steg-för-steg-guide</a> om att konvertera HTML- och Microsoft Word-format med calibre.
zh_tw: 使用 calibre 转换HTML和Microsoft Word格式的 <a href="%(sbs)s" title="Step-by-step">分步操作指南</a> 。

source: How to <a href="%(sbs)s" title="Install calibre on the Synology NAS">Install calibre on Your Synology NAS</a>.
nl: Hoe <a href="%(sbs)s" title="Install calibre on the Synology NAS">calibre Installeren op Uw Synology NAS</a>.
pt: Como <a href="%(sbs)s" title="Install calibre on the Synology NAS">Instalar o calibre no seu NAS Synology</a>.
ru: Как <a href="%(sbs)s" title="Install calibre on the Synology NAS">установить calibre на Synology NAS</a>.
sv: Hur du <a href="%(sbs)s" title="Install calibre on the Synology NAS">installerar calibre på din Synology NAS</a>.

source: Another <a href="%(uol)s">step-by-step guide</a> on creating EPUB files starting from OpenOffice and Word, by the University of Leicester.
nl: Nog een <a href="%(uol)s">stap-voor-stap gids</a> over creatie van EPUB bestanen vanuit OpenOffice en Word, door de Universiteit van Leicester.
pt: Mais um <a href="%(uol)s">guia passo a passo</a> sobre a criação de ficheiros EPUB a partir do OpenOffice ou Word, pela Universidade de Leicester.
ru: Другое <a href="%(uol)s">пошаговое руководство</a> по созданию файлов EPUB, начиная с OpenOffice и Word, от Университета Лестера.
sv: En annan <a href="%(uol)s">steg-för-steg-guide</a> för att skapa EPUB-filer från OpenOffice och Word av universitetet i Leicester.
zh_tw: 另一个从 OpenOffice 和 Word 开始创建EPUB文件的 <a href="%(uol)s">分步操作指南</a> 由莱斯特大学（University of Leicester）提供。

source: Resources in languages other than English
nl: Bronnen in andere talen dan Engels
pt: Recursos em idiomas que não o inglês
ru: Неанглоязычные ресурсы
sv: Resurser på andra språk än engelska
zh_tw: 非英语资源

source: First, and most importantly, the <a href="%(manual_prefix)s">calibre User Manual</a> is available in many different languages. Just click the <i>Change language</i> link in the sidebar to view it in a different language.
nl: Eerst, en belangrijkst, de <a href="%(manual_prefix)s">calibre Handleiding</a> is beschikbaar in veel verschillende talen . Klik gewoon op de <i>Verander taal</i> link in de zijbalk om hem in een andere taal te zien.
pt: Primeiro que tudo, e o mais importante, o <a href="%(manual_prefix)s">Manual de Utilizador do Calibre</a> está disponível em vários idiomas. Basta clicar na ligação <i>Idiomas</i>, na barra lateral, para o visualizar num idioma diferente.
ru: Первое и самое главное — <a href="%(manual_prefix)s">Руководство пользователя calibre</a> доступно на множестве языков. Просто воспользуйтесь ссылкой <i>Изменить язык</i> на боковой панели, чтобы читать его на другом языке.
sv: För det första, och viktigast av allt, är <a href="%(manual_prefix)s">användarmanualen för calibre</a> tillgänglig på många olika språk. Klicka bara på länken <i>Ändra språk</i> i sidofältet för att visa den på ett annat språk.
zh_tw: 首先，也是最重要的，<a href="%(manual_prefix)s">calibre 用户手册</a>有多种不同的语言版本。只需单击侧栏中的 <i>切换语言</i>链接，即可用另一种语言查看。

source: <a href="%(de)s">A Beginner's Guide</a> in <b>German</b>
nl: <a href="%(de)s">A Beginner's Guide</a> in <b>Duits</b>
pt: Um <a href="%(de)s">Guia do principiante</a> em <b>Alemão</b>
ru: <a href="%(de)s">Руководство для новичков</a> на <b>немецком</b>
sv: <a href="%(de)s">En nybörjarhandledning</a> på <b>tyska</b>
zh_tw: <a href="%(de)s">新手教程</a> 注： <b>德语版</b>

source: Get calibre
nl: Bemachtig calibre
pt: Obter o Calibre
ru: Получить calibre
sv: Skaffa calibre
zh_tw: 取得 calibre

source: Choose the type of computer on which you plan to use calibre, below:
nl: Kies onder het type computer waarop u calibre plant te gebruiken:
pt: Escolha o tipo de sistema em que pretende usar o Calibre:
ru: Выберите ниже систему, в которой планируете использовать calibre:
sv: Välj vilken typ av dator som du planerar att använda calibre på nedan:
zh_tw: 請在下面選擇你打算使用 calibre 電腦的類型的方案:

source: Download calibre for Windows
nl: Download calibre voor Windows
pt: Descarregar Calibre para Windows
ru: Скачать calibre для Windows
sv: Hämta calibre för Windows
zh_tw: 下載 Windows 版的 calibre

source: Download calibre for macOS
nl: Download calibre voor macOS
pt: Descarregar Calibre para macOS
ru: Скачать calibre для macOS
sv: Hämta calibre för macOS
zh_tw: 下載 macOS版的 calibre

source: Download calibre for Linux
nl: Download calibre voor Linux
pt: Descarregar Calibre para Linux
ru: Скачать calibre для Linux
sv: Hämta calibre för Linux
zh_tw: 下載 Linux 版 calibre

source: Download Calibre Portable
nl: Download Calibre Draagbaar
pt: Descarregar Calibre portátil
ru: Скачать переносимую версию calibre
sv: Hämta Calibre Portable
zh_tw: 下載 可攜式版的 calibre

source: Portable
nl: Draagbaar
pt: Portátil
ru: Переносимая версия
sv: Portabel
zh_tw: 可攜式版

source: Learn how to work with calibre on a mobile phone/tablet
nl: Leer hoe te werken met calibre op een mobiele telefoon/tablet
pt: Saiba como trabalhar com o Calibre num telemóvel ou tablet
ru: Узнайте, как работать с calibre на мобильном телефоне/планшете
sv: Lär dig hur du arbetar med calibre på en mobiltelefon/surfplatta
zh_tw: 瞭解如何在手機及平板電腦上使用 calibre

source: calibre for Apple iOS
nl: calibre voor Apple iOS
pt: Calibre para Apple iOS
ru: calibre для Apple iOS
sv: calibre för Apple iOS
zh_tw: 苹果 iOS 版 calibre

source: Signatures for all the calibre installer files are <a target="_blank" href="%(href)s">here</a>
nl: Handtekeningen voor alle calibre installer bestanden zijn <a target="_blank" href="%(href)s">hier</a>
pt: As assinaturas para todos os pacotes de instalação do Calibre estão <a target="_blank" href="%(href)s">aqui</a>
ru: Цифровые подписи всех файлов установщиков calibre <a target="_blank" href="%(href)s">здесь</a>
sv: Signaturer för alla calibre-installationsfiler finns <a target="_blank" href="%(href)s">här</a>
zh_tw: 所有 calibre 安裝檔的簽章可以在<a target="_blank" href="%(href)s">這裡</a>檢視

source: Getting involved with calibre
nl: Wordt betrokken bij calibre
pt: Colabore com o Calibre
ru: Как поучаствовать в развитии calibre
sv: Bli involverad i calibre
zh_tw: 參與 calibre

source: The secret of calibre's success is its vibrant user community. Users have contributed code and become developers, translations to make calibre available in different languages, graphics to improve its look and feel and of course thousands of bug reports to help make it the robust piece of software it is today. An incomplete list of contributors to calibre is available <a href="%(href)s">here</a>.
nl: Het geheim van calibre's succes is z'n zinderende gebruikersgemeenschap. Gebruikers hebben code bijgedragen en zijn ontwikkelaars geworden, vertalingen om calibre in verschillende talen beschikbaar te maken, afbeeldingen om uitstraling en gevoel te verbeteren en natuurlijk duizenden foutrapporten om het de robuuste software te maken die het vandaag is. Een niet-complete lijst met bijdragers aan calibre is <a href="%(href)s">hier</a> beschikbaar.
pt: O segredo do sucesso do Calibre é a sua vibrante comunidade de utilizadores. Os utilizadores têm contribuído com código como programadores, com traduções para tornar o Calibre disponível em diferentes idiomas, ao nível do grafismo para melhorar a sua aparência e, claro, milhares de relatórios de anomalias para ajudar a torná-lo o software robusto que ele é hoje. Uma lista incompleta dos contribuidores do Calibre está disponível <a href="%(href)s">aqui</a>.
ru: Секрет успеха calibre — чудесное сообщество. Пользователи писали код, став разработчиками, переводили, чтобы сделать calibre доступным на разных языках, создавали графику, чтобы улучшить внешний вид и, наконец, прислали тысячи отчётов об ошибках, что помогло calibre стать одной из надёжнейших программ на сегодняшний день. Неполный список участников разработки calibre доступен <a href="%(href)s">здесь</a>.
sv: Hemligheten bakom framgången av calibre är dess livfulla användargemenskap. Användare har bidragit kod och blivit utvecklare, översättningar för att göra calibre tillgänglig på olika språk, grafik för att förbättra dess utseende och känsla och naturligtvis tusentals felanmälningar för att göra den till den robusta programvaran den är idag. En ofullständig lista över bidragsgivare till calibre finns <a href="%(href)s">här</a>.
zh_tw: calibre 成功的秘訣在於其充滿活力的使用者社群。使用者貢獻了程式碼，將 calibre 翻譯成不同的語言，改善了它的外觀和感覺，當然還有數以千計的錯誤報告，促使其成為強大的軟體。 <a href="%(href)s">此處</a>提供了對 calibre 有貢獻的不完整列表。

source: Joining the calibre community
nl: Verbind met de calibre gemeenschap
pt: Entre na comunidade Calibre
ru: Присоединиться к сообществу calibre
sv: Gå med i calibre-gemenskapen
zh_tw: 加入 calibre 社群

source: To talk with fellow calibre users and keep abreast of the latest developments in calibre-world, you can use several tools:
nl: Om te praten met mede calibre gebruikers en op de hoogte te blijven van de laatste ontwikkelingen in calibre land kan u verschillende tools gebruiken:
pt: Para conversar com outros utilizadores Calibre e ficar por dentro das últimas novidades do universo Calibre pode usar várias ferramentas:
ru: Чтобы общаться с другими пользователями и быть в курсе последних разработок мира calibre, у вас есть несколько возможностей:
sv: För att prata med andra calibre-användare och hålla dig uppdaterad om den senaste utvecklingen i calibre-världen kan du använda flera verktyg:
zh_tw: 如果要跟 calibre 的使用者同類交談以及持續吸收著世界上最新關於 calibre 世界的最新開發資訊，你可以使用下列幾個工具:

source: The calibre <a href="%(href)s">user forum</a>
nl: Het calibre <a href="%(href)s">gebruikersforum</a>
pt: O <a href="%(href)s">fórum de utilizadores</a> do Calibre
ru: <a href="%(href)s">Форум пользователей</a> calibre
sv: <a href="%(href)s">Användarforumet</a> för calibre
zh_tw: calibre <a href="%(href)s">使用者論壇</a>

source: <a href="%(href)s">#calibre</a> on Twitter
nl: <a href="%(href)s">#calibre</a> op Twitter
pt: No Twitter com <a href="%(href)s">#calibre</a>
ru: <a href="%(href)s">#calibre</a> в Twitter
sv: <a href="%(href)s">#calibre</a> på Twitter
zh_tw: <a href="%(href)s">#calibre</a> 的推特

source: The <a href="%(href)s">calibre Facebook page</a>
nl: De <a href="%(href)s">calibre Facebook pagina</a>
pt: A página <a href="%(href)s">Calibre no Facebook</a>
ru: <a href="%(href)s">Страница calibre в Facebook</a>
sv: <a href="%(href)s">Facebook-sidan för calibre</a>
zh_tw: <a href="%(href)s">calibre Facebook 專頁</a>

source: The calibre new releases <a href="%(href)s" type="application/rss+xml">RSS</a> feed
nl: De calibre nieuwe versies <a href="%(href)s" type="application/rss+xml">RSS</a> feed
pt: As novas versões Calibre por sinal <a href="%(href)s" type="application/rss+xml">RSS</a>
ru: <a href="%(href)s" type="application/rss+xml">RSS</a>-лента новых выпусков calibre
sv: <a href="%(href)s" type="application/rss+xml">RSS</a>-flödet för nya utgåvor av calibre
zh_tw: calibre 新版本釋出 <a href="%(href)s" type="application/rss+xml">RSS</a> 推送

source: Creating a calibre plugin
nl: Creëer een calibre plug-in
pt: Criar um plugin para Calibre
ru: Создавать расширения для calibre
sv: Skapa en calibre-insticksmodul
zh_tw: 建立 calibre 外掛

source: calibre has a comprehensive plugin interface, that allows the creation of plugins that can do just about anything. For many examples, see the <a href="%(plugins)s">calibre Plugins forum</a>. A tutorial on getting started with plugin development, <a href="%(pdocs)s">is available</a>.
nl: calibre heeft een uitvoerige plug-in interface, die de creatie toelaat van plug-ins die ongeveer alles kunnen. Voor veel voorbeelden, zie <a href="%(plugins)s">calibre Plug-ins forum</a>. Een tutorial over hoe met plug-in ontwikkeling te beginnen, <a href="%(pdocs)s">is beschikbaar</a>.
pt: O Calibre possui uma interface abrangente para plugins, que permite a criação de plugins que podem fazer praticamente tudo. Para exemplos, veja o <a href="%(plugins)s">Fórum de plugins do Calibre</a>. Um tutorial inicial sobre o desenvolvimento de plugins <a href="%(pdocs)s">está disponível aqui</a>.
ru: В calibre комплексный расширяемый интерфейс, позволяющий создавать плагины практически для всего. Множество примеров представлено в разделе <a href="%(plugins)s">«Plugins» на форуме calibre</a>. Основы разработки плагинов описаны <a href="%(pdocs)s">в руководстве</a>.
sv: calibre har en omfattande insticksmodulsgränssnitt som gör det möjligt att skapa insticksmoduler som kan göra nästan vad som helst. För många exempel, se <a href="%(plugins)s">calibre-forumet för insticksmoduler</a>. En handledning för att komma igång med insticksmodulsutveckling <a href="%(pdocs)s">finns tillgänglig</a>.
zh_tw: calibre 有一个全面的插件界面，可以创建几乎可以做任何事情的插件。有关更多示例，请参阅<a href="%(plugins)s">calibre Plugins 论坛</a>。论坛上有很多<a href="%(pdocs)s">有用</a>的关于插件开发的入门教程。

source: Contributing translations to calibre
nl: Vertalingen bijdragen aan calibre
pt: Colaborar na tradução do Calibre
ru: Содействовать переводу calibre
sv: Bidra med översättningar till calibre
zh_tw: 替 calibre 的翻譯出一份力

source: calibre has support for translating its user interface. You can see the list of languages for which translations exist <a target="new" href="%(tmain)s">here</a>. If the translations for your language are incomplete/missing, you can contribute the translations using a simple web-based interface. To do so first create an account in <a target="new" href="%(signup)s">Transifex</a>, then click on your language in <a target="new" href="%(project)s">this page</a>. Click on the <i>"Join Team"</i> button. Once you have been approved, simply click on the language you want to translate <a href="%(tmain)s">here</a> and use the <i>"Translate Now"</i> button to contribute your translations.
nl: calibre ondersteunt de vertaling van zijn gebruikersinterface. U kan de lijst met talen waar een vertaling voor bestaat <a target="new" href="%(tmain)s">hier</a> bekijken. Als de vertaling voor uw taal ontbreekt/onvolledig is, kan u bijdragen aan de vertaling via een simpele webinterface. Maak hiervoor eerst een account aan bij <a target="new" href="%(signup)s">Transifex</a>. klik dan op uw taal op <a target="new" href="%(project)s">deze pagina</a>. Klik op de <i>Lid worden van team</i> knop. Als u goedgekeurd bent, klik gewoon op de taal die u wilt vertalen <a href="%(tmain)s">hier</a> en gebruik de <i>Vertalen</i> knop om uw vertalingen bij te dragen.
pt: O Calibre permite traduzir a sua interface de utilizador. Pode ver a lista de idiomas para as quais existem traduções <a target="new" href="%(tmain)s">aqui</a>. Se as traduções para o seu idioma estão incompletas/ausentes, pode colaborar utilizando uma interface simples e baseada na web. Para isso, primeiro crie uma conta no <a target="new" href="%(signup)s">Transifex</a>, depois clique no seu idioma <a target="new" href="%(project)s">nesta página</a>. Clique então no botão <i>"Aderir à equipa"</i>. Após o seu pedido ser aprovado basta clicar no idioma que deseja traduzir <a href="%(tmain)s">aqui</a> e usar o botão <i>"Traduzir agora"</i> para contribuir com suas traduções.
ru: calibre поддерживает перевод пользовательского интерфейса. Посмотреть список языков, на которые доступны переводы, можно <a target="new" href="%(tmain)s">здесь</a>. Если перевод на ваш язык неполон/отсутствует, вы можете поучаствовать в переводе с помощью простого веб-интерфейса. Для этого сначала создайте аккаунт в <a target="new" href="%(signup)s">Transifex</a>, затем щёлкните по своему языку на <a target="new" href="%(project)s">этой странице</a>. Нажмите кнопку<i>«Присоединиться к команде»</i>. Как только вашу кандидатуру одобрят, просто щёлкните по языку, на который хотите переводить <a href="%(tmain)s">здесь</a>, а далее кнопку <i>«Перевести»</i> чтобы приступить к переводу.
sv: calibre har stöd för att översätta sitt användargränssnitt. Du kan se listan över språk för vilka översättningar finns <a target="new" href="%(tmain)s">här</a>. Om översättningarna för ditt språk är ofullständiga/saknas kan du bidra med översättningarna med ett enkelt webbaserat gränssnitt. För att göra det behöver du först skapa ett konto på <a target="new" href="%(signup)s">Transifex</a>, klicka sedan på ditt språk på <a target="new" href="%(project)s">den här sidan</a>. Klicka på knappen <i>"Join Team"</i>. När du har blivit godkänd, klicka helt enkelt på det språk du vill översätta <a href="%(tmain)s">här</a> och använd knappen <i>"Translate Now"</i> för att bidra med dina översättningar.
zh_tw: calibre 支持翻译其用户界面。您可以在<a target="new" href="%(tmain)s">此处</a>查看已存在的翻译语言列表。如果该列表中某项语言翻译不完整/缺失，可以简单的使用 Web 界面贡献翻译。要做到这一点，首先要在 <a target="new" href="%(signup)s">Transifex</a>中创建一个账户，然后在<a target="new" href="%(project)s">此页面</a>中单击需要语言。点击 <i>“加入团队”</i>按钮。一旦获得批准，只需在<a href="%(tmain)s">此处</a>单击您想要翻译的语言，然后使用<i>“立即翻译”</i>按钮进行翻译。

source: Alternatively you can download the PO file to do your translations offline by using the <i>"Download for translation"</i> link instead of the <i>"Translate Now"</i> button. You can edit the PO file using your favorite translation software and when you are done, upload the file by clicking the <i>"Upload file"</i> link (which is just below the <i>"Download for translation"</i> link).
nl: Als alternatief kan u het PO bestand downloaden om uw vertaling offline te doen via de <i>"Download voor vertaling"</i> link i.p.v. de <i>"Vertaal Nu"</i> knop. U kan het PO bestand bewerken met uw favoriete vertaalsoftware en als u klaar bent het bestand uploaden door op de <i>"Upload bestand"</i> knop te klikken (net onder de <i>"Download voor vertaling"</i> link).
pt: Alternativamente, mas nada recomendado, pode descarregar o ficheiro PO para fazer as suas traduções offline utilizando a ligação <i>Descarregar ficheiro para tradução</i> em vez do botão <i>"Traduzir"</i>. Você pode editar o ficheiro PO utilizando o seu software favorito de tradução, e quando finalizar, carregar o ficheiro clicando na ligação <i>"Carregar ficheiro"</i> (que está logo abaixo da ligação <i>"Descarregar ficheiro para tradução"</i>).
ru: Как вариант, вы можете скачать файл PO, чтобы переводить офлайн, воспользовавшись ссылкой <i>«Скачать файл для перевода»</i> вместо кнопки <i>«Перевести»</i>. Отредактировав файл PO в любимой программе перевода, загрузите его, нажав на ссылку <i>«Загрузить файл»</i> (немного ниже ссылки <i>«Скачать файл для перевода»</i>).
sv: Alternativt kan du hämta PO-filen för att göra dina översättningar frånkopplad genom att använda länken <i>"Download for translation"</i> i stället för knappen <i>"Translate Now"</i>. Du kan redigera PO-filen med hjälp av ditt favorit översättningsprogram och när du är klar, ladda upp filen genom att klicka på länken <i>"Upload file"</i> (som ligger strax under länken <i>"Download for translation"</i>).
zh_tw: 或者，也可以使用<i>“下载以进行翻译”</i>链接而不是<i>“立即翻译”</i>按钮来下载PO 文件以进行脱机翻译。可以根据自己的喜好使用翻译软件，PO 文件编辑完成后，单击 <i>“上传文件”</i>链接（位于<i>“下载以进行翻译”</i>链接的正下方）上传该文件。

source: Translations FAQ
nl: Vertalingen FAQ
pt: Perguntas frequentes sobre as traduções
ru: ЧаВо по переводу
sv: Vanliga frågor för översättningar
zh_tw: 翻譯 FAQ

source: What to do with the &amp; symbols?<br />The &amp; symbols denote a keyboard shortcut. So for example the string "&amp;Title" means that the corresponding GUI element can be accessed with the keyboard shortcut "Alt+T" (this only works on Windows/Linux). So in your translation leave the &amp; symbol before the same letter if possible, or some other suitable letter.
nl: Wat met de &amp; symbolen? <br />De &amp; symbolen duiden op een toetsenbord sneltoets. Bv. de string "&amp;Titel" betekent dat het overeenkomende GUI element toegankelijk is via de toetsenbord sneltoets "Alt+T" (dit werkt enkel in Windows/Linux). Laat in uw vertaling dus het &amp; symbool voor dezelfde letter indien mogelijk, of een andere passende letter.
pt: O que fazer com os símbolos &amp;? <br />O símbolo &amp; indica um atalho de teclado. Assim, por exemplo, a expressão "&amp;Título" significa que o elemento IGU correspondente pode ser acedido com o atalho de teclado "Alt+T" (isto funciona apenas no Windows/Linux). Assim, na sua tradução deixe o símbolo &amp; antes da mesma letra, se possível, ou alguma outra letra adequada.
ru: Что делать с символами «&amp;»?<br />Символы «&amp;» обозначают сочетание клавиш. Например, строка «&amp;Title» означает, что соответствующий элемент графического интерфейса доступен нажатием сочетания клавиш «Alt+T» (работает только в Windows/Linux). Поэтому при переводе оставляйте символ «&amp;», если возможно, перед той же буквой, если нет, перед любой подходящей буквой.
sv: Vad ska man göra med &amp;-symbolerna?<br />&amp;-symbolerna betecknar en tangentbordsgenväg. Så till exempel strängen "&amp;Titel" betyder att motsvarande grafiska gränssnittselement kan nås med tangentbordsgenvägen "Alt+T" (detta fungerar bara på Windows/Linux). Så lämna symbolen &amp; i din översättning före samma bokstav om möjligt, eller någon annan lämplig bokstav.
zh_tw: 如何处理 &amp; 符号？<br /> &amp; 符号表示键盘快捷键。例如，字符串“&amp;Title”表示这个 GUI 元素可用键盘快捷键 “Alt+T” 访问到（仅适用于 Windows/Linux）。因此翻译中应尽可能的保留字母前面的 &amp; 符号，或者改用其它合适的字母。
