Repository: debian-calibre/calibre
Catalog: translations-git/website/*.po
Languages: nl, pt, ru, sv, zh_tw

source: A new "Inspect" feature which allows you to right click on anything in an e-book and see the HTML+CSS code that is responsible for rendering it. A great way for e-book creators/tweakers to understand what goes on behind the scenes in an e-book.
nl: Een nieuwe "Inspecteren" functie die rechtsklikken toelaat op eender wat in een e-boek om de HTML + CSS code te zien die verantwoordelijk is voor de weergave. Een prachtige manier voor e-boek makers/tweakers om te begrijpen wat er gebeurt achter de schermen.
pt: Uma nova função de "Inspeção" que permite você clicar com o botão direito em qualquer coisa em um e-book ver o código HTML+CSS que é responsável por renderizá-lo. Uma excelente maneira para criadores/modificadores de e-books entenderem o que acontece atrás das cenas em um e-book.
ru: Новая функция «Проверка», которая позволяет щелкнуть правой кнопкой мыши что-либо в электронной книге и увидеть код HTML + CSS, который отвечает за её отображение. Отличный способ для создателей электронных книг/твикеров, чтобы понять, что происходит за кулисами в электронной книге.
sv: En ny "Inspektera"-funktion som låter dig högerklicka på något i en e-bok och se HTML+CSS-koden som är ansvarig för att återge den. Ett bra sätt för e-bokskapare/justerare att förstå vad som händer bakom kulisserna i en e-bok.
zh_tw: 一个新的“检查”功能，允许你右击电子书中的任何内容并查看负责呈现它的HTML+CSS代码。 这是一个让电子书创作者/修改者了解电子书背后发生的事情的一个好方法。

source: A new "page turn animation" when using the page scrolling mode in the E-book viewer. For those of you that don't like it, it can be turned off in the E-book viewer preferences.
nl: Een nieuwe ""blader animatie" bij gebruik van de pagina scroll modus in de e-boek viewer. Voor wie er niet van houdt, het kan afgezet worden in de e-boek viewer voorkeuren.
pt: Uma nova "animação de rolagem de página" ao usar o modo paginado no Visualizador de e-books. Para aqueles que não gostam, ela pode ser desativada nas preferência do Visualizador.
ru: Новая «анимация перелистывания страниц» при использовании режима прокрутки страниц в читалке электронных книг. Если она вам не нравится, то её можно отключить в параметрах читалки.
sv: En ny "sidvisningsanimering" när du använder sidflödesläget i e-bokvisaren. För er som inte gillar det kan det stängas av i e-bokvisarens inställningar.
zh_tw: 在电子书阅读器中使用页面滚动模式时，一个新的“翻页动画”会出现。对于那些不喜欢它的人，可以在电子书阅读器首选项中将其关闭。

source: calibre's conversion engine can now automatically convert straight quotes, hyphens, dots, etc. into their typographically snobbish equivalents. This option is called "Smarten punctuation" in the Look &amp; feel section of the conversion settings.
nl: calibres conversie engine kan nu automatisch rechte haakjes, streepjes, punten, enz. omzetten in hun typografisch snobistisch equivalent. Deze optie heet "Slimme interpunctie" in het Uitstraling &amp; gevoel menu van de conversie instellingen.
pt: O mecanismo de conversão do calibre pode agora automaticamente converter aspas retas, hifens, pontos, etc em seus equivalentes tipográficos elegantes. Esta opção é chamada "Pontuação inteligente" na seção Aparência das configurações de conversão.
ru: Механизм преобразования calibre теперь может автоматически конвертировать прямые кавычки, дефисы, точки и т. д. в их типографские снобистские эквиваленты. Эта опция называется «Умная пунктуация» в разделе «Внешний вид» настроек конвертации.
sv: calibres konverteringsmotor kan nu automatiskt konvertera raka citattecken, bindestreck, prickar o.s.v. till deras typografiskt snobbiga motsvarigheter. Det här alternativet kallas "Förbättra skiljeteckenhantering" i avsnittet Utseende &amp; känsla av konverteringsinställningarna.
zh_tw: Calibre的转换引擎现在可以自动将直引号、连字符、圆点等转换成排版上高雅的对等符号。 此选项在转换设置的外观部分称为“智能标点符号”。

source: A useful new feature in the main calibre interface is "Tweak EPUB", accessed by right clicking on any book. This shows you the internals of the EPUB, allowing you to easily make small corrections, without needing to fire up a full fledged e-book editing program.
nl: Een handige, nieuwe functie in de calibre hoofdinterface is "Tweak EPUB", toegankelijk door rechtsklikken op eender welk boek. Dit toont het inwendige van de EPUB, zodat u gemakkelijk kleine veranderingen kan doen, zonder starten van een echte e-boek editor.
pt: Uma nova função útil na interface principal do calibre é o "Ajustar EPUB", acessado clicando com o botão direito em qualquer livro. Isto mostra a parte interna do EPUB, permitindo fazer facilmente pequenas correções, sem a necessidade de um programa editor de e-books completo.
ru: Полезной новой функцией в основном интерфейсе calibre является «Tweak EPUB», доступ к которой можно получить, щелкнув правой кнопкой мыши на любой книге. Это покажет вам внутренности EPUB, позволяя легко вносить небольшие исправления, без необходимости запуска полноценной программы редактирования электронных книг.
sv: En användbar ny funktion i huvudgränssnittet av calibre är "Justera EPUB", nås genom att högerklicka på valfri bok. Detta visar dig de inre delarna av EPUB:n, så att du enkelt kan göra små korrigeringar utan att behöva avfyra ett fullfjädrat e-bokredigeringsprogram.
zh_tw: 在主界面中的一個有用的新功能是「微調EPUB」，可以透過右鍵點擊任何書籍來存取。這向您展示了EPUB的內部結構，允許您輕鬆地進行小修改，而不需要啟動功能齊全的電子書編輯程式。

source: calibre learned how to convert a couple of new formats: SNB and Plucker.
nl: calibre leerde een paar nieuwe formaten converteren: SNB en Plucker.
pt: O Calibre aprendeu a converter alguns novos formatos: SNB e Plucker
ru: calibre научился преобразовывать пару новых форматов: SNB и Plucker.
sv: calibre lärde sig att konvertera ett par nya format: SNB och Plucker.
zh_tw: Calibre學會了如何轉換幾種新的格式：SNB和Plucker。

source: 0.8 brings lots of goodies to make manage your ever growing e-book collection easier:
nl: 0.8 brengt massa's goodies om het beheer van uw steeds groeiende e-boekcollectie te vergemakkelijken:
pt: 0.8 traz uma porção de novidades para tornar mais fácil o gerenciamento da sua crescente coleção de e-books:
ru: 0.8 привнесла много вкусностей, чтобы сделать управление вашей постоянно растущей коллекцией электронных книг проще:
sv: 0.8 ger massor av godsaker för att hantera din ständigt växande e-boksamling lättare:
zh_tw: 0.8版本带来了很多好东西，让您更轻松地管理不断增长的电子书藏书：

source: Metadata search and replace: You can now perform search and replace operations on the book list in your calibre library via the Bulk metadata edit dialog.
nl: Metadata zoeken/vervangen: U kan nu zoek/vervang acties doen op de boekenlijst in uw calibre bibliotheek via de Bulk metadata bewerk dialoog.
pt: Buscar e substituir: Agora você pode fazer operações de busca e substituição na lista de livros na sua biblioteca do calibre via caixa de diálogo "Editar metadados em lote".
ru: Поиск и замена метаданных: теперь вы можете выполнять операции поиска и замены в списке книг в своей библиотеке calibre с помощью диалога редактирования метаданных.
sv: Sök och ersätt metadata: du kan nu utföra Sök och ersätt operationer på boklistan i ditt calibre-bibliotek via dialogrutan Redigera metadata i grupp.
zh_tw: 元数据搜索和替换：您现在可以通过批量元数据编辑对话框对Calibre书库中的图书列表执行搜索和替换操作。

source: Metadata plugboards: Have calibre automatically transform the metadata of files when sending to device. For example, you can ask calibre to append the series to the title, in case your device does not support series metadata. See Preferences-&gt;Metadata plugboards
nl: Metadata adapters: Laat calibre automatisch metadata van bestanden aanpassen bij sturen naar toestel. Bijvoorbeeld, u kan calibre vragen de serie aan de titel toe te voegen als uw toestel geen series metadata ondersteunt. Zie Voorkeuren-&gt;Metadata adapters
pt: Quadro de conexões de metadados: Faça com que o calibre transforme automaticamente os metadados dos arquivos quando enviá-los ao dispositivo. Por exemplo: você pode pedir ao calibre para incluir a série ao título, caso seu dispositivo não suporte metadados de série. Veja Preferências-&gt;Quadro de conexões de metadados
ru: Плагины метаданных: calibre автоматически преобразовывает метаданные файлов при отправке на устройство. Например, вы можете попросить calibre добавить серию в заголовок, если ваше устройство не поддерживает метаданные серии. Смотрите раздел «Настройки-Метаданныеplugboards »
sv: Metadatapluggbrädor: Låt calibre automatiskt omvandla metadata för filer när de skickas till enheten. Du kan till exempel be calibre att lägga till serien i titeln, om din enhet inte stöder seriens metadata. Se Inställningar-&gt;Metadata pluggbrädor
zh_tw: 元数据插板：让Calibre在发送到设备时自动转换文件的元数据。例如，如果您的设备不支持系列元数据，您可以要求Calibre将系列附加到标题中。请参阅“首选项->元数据插板”

source: A powerful new template language: You can use this to construct complex file names from book metadata when exporting books from the calibre library, or in the metadata plugboards above, or to create "virtual columns" that display combined or transformed metadata in the book list.
nl: Een krachtige nieuwe sjabloontaal: u kunt dit gebruiken om complexe bestandsnamen te construeren uit boek metadata bij het exporteren van boeken uit de calibrebibliotheek, of in de metadata pluginborden boven, of om "virtuele kolommen" te maken die gecombineerde of getransformeerde metadata in de boekenlijst weergeven .
pt: Uma poderosa nova linguagem de modelo: Você pode usar isto para construir nomes de arquivos complexos a partir dos metadados do livro ao exportar livros da biblioteca do calibre, ou nos quadro de conexões acima, ou criar "colunas virtuais" que mostram metadados combinados ou transformados na lista de livros.
ru: Мощный новый язык шаблонов: вы можете использовать его для создания сложных имен файлов из метаданных книг при экспорте книг из библиотеки calibre или в плагин метаданных выше, или для создания "виртуальных столбцов", которые отображают комбинированные или преобразованные метаданные в списке книг.
sv: Ett kraftfullt nytt mallspråk: du kan använda detta för att konstruera komplexa filnamn från bokens metadata när du exporterar böcker från calibre-biblioteket, eller i metadatapluggbrädorna ovan, eller för att skapa "virtuella kolumner" som visar kombinerade eller omvandlade metadata i boklistan.
zh_tw: 一种功能强大的新模板语言：在从Calibre书库或上面的元数据插板导出图书时，您可以使用它从图书元数据构造复杂的文件名，或者创建在图书列表中显示组合或转换的元数据的“虚拟列”。

source: Virtual columns: These are custom columns you can add to calibre that display metadata from other fields. For example an ISBN column or a column to show the formats the book has.
nl: Virtuele kolommen: Aangepaste kolommen die u aan calibre kan toevoegen die metadata tonen van andere velden. Bijvoorbeeld een ISBN kolom of een kolom die de formaten toont dat een boek heeft.
pt: Colunas virtuais: Essas são colunas personalizadas que você pode adicionar ao calibre para exibir metadados de outros campos. Por exemplo, uma coluna com o ISBN ou uma coluna para mostrar os formatos que o livro tem.
ru: Виртуальные столбцы. Это настраиваемые столбцы, которые можно добавлять в calibre и отображать метаданные из других полей. Например, столбец ISBN или столбец для отображения форматов книги.
sv: Virtuella kolumner: Det här är anpassade kolumner som du kan lägga till i calibre som visar metadata från andra fält. Till exempel en ISBN-kolumn eller en kolumn för att visa format som boken har.
zh_tw: 虚拟列：这些是可以添加到Calibre的自定义列，用于显示来自其他字段的元数据。例如，ISBN列或显示图书格式的列。

source: This is an appropriate time to throw out a big thank you to all the calibre developers who have contributed most of the major new features listed above. An incomplete list of contributors is available <a href="%(href)s" title="Contributors">here</a>.
nl: Dit is een geschikt moment voor een dikke dank u wel voor al de calibre developers die de meeste van de nieuwe kenmerken hierboven hebben bijgedragen. Een onvolledige lijst van deelnemers is <a href="%(href)s" title="Contributors">hier</a> beschikbaar .
pt: Este é o momento apropriado para um grande agradecimento aos programadores em Calibre pela colaboração em muitas das grandes e novas funcionalidades acima listadas. Uma lista, incompleta, dos colaboradores está disponível <a href="%(href)s" title="Contributors">aqui</a>.
ru: Теперь самое время сказать огромное спасибо всем разработчикам, благодаря которым появилось большинство вышеперечисленных новых и замечательных функций. Неполный список участников доступен <a href="%(href)s" title="Contributors">здесь</a>.
sv: Det här är ett lämpligt tillfälle att framföra ett stort tack till alla calibre-utvecklare som har bidragit med de flesta av de omfattande nya funktionerna som anges ovan. En ofullständig lista över bidragsgivare finns <a href="%(href)s" title="Contributors">här</a>.
zh_tw: 在此，也要向贡献了上述大部分主要新功能的所有开发人员表示衷心的感谢。<a href="%(href)s" title="Contributors">这里</a>有一份不完整的贡献者名单。

source: Note that many of these features were actually introduced during the lifetime of the 0.7.x series. This document describes new features as compared to 0.7.0
nl: Merk op dat veel van deze functies eigenlijk werden geïntroduceerd tijdens de levensduur van de 0.7.x-serie. Dit document beschrijft nieuwe functies in vergelijking met 0.7.0
pt: Note que muitas dessas funções foram de fato introduzidas durante o ciclo de vida da série 0.7.x. Este documento descreve novas funções comparadas à versão 0.7.0
ru: Обратите внимание, что многие из перечисленных функций фактически вводились в течение всего срока жизни серии 0.7.x. Этот документ описывает новые возможности по сравнению с версией 0.7.0.
sv: Observera att många av dessa funktioner faktiskt introducerades under livslängden på 0.7.x-serien. Detta dokument beskriver nya funktioner jämfört med 0.7.0
zh_tw: 请注意，其中许多功能实际上是在 0.7.x 系列的生命周期中引入的。本文档介绍了与 0.7.0 相比的新功能。

source: See what was new in previous major calibre releases:
nl: Bekijk wat er nieuw was in vorige grote calibre versies:
pt: Veja o que foi novidade nas versões anteriores do Calibre
ru: Посмотрите, чем примечательны предыдущие значительные выпуски calibre:
sv: Se vad som var nytt i tidigare stora utgåvor av calibre:
zh_tw: 查看 calibre 以前的主版本中的新功能：

source: New in calibre 4.0
nl: Nieuw in calibre 4.0
pt: Novo no Calibre 4.0
ru: Новое в calibre 4.0
sv: Nytt i calibre 4.0
zh_tw: calibre 4.0 中的新功能

source: Welcome back, calibre users. It has been two years since calibre 3.0. This time has been spent mostly in making the calibre Content server ever more capable as well as migrating calibre itself from <i>Qt WebKit</i> to <i>Qt WebEngine</i>, because the former is no longer maintained.
nl: Welkom terug, calibre gebruikers. Het is nu twee jaar sinds calibre 3.0. Deze tijd is voornamelijk besteed aan het steeds kundiger maken van de calibre Content server als aan het migreren van calibre zelf van <i>Qt WebKit</i> naar <i>Qt WebEngine</i>, omdat de eerste niet meer onderhouden wordt.
pt: Bem-vindos de volta, usuários do calibre. Já se foram dois anos desde o calibre 3.0. Este tempo foi gasto principalmente fazendo o Servidor de conteúdo do calibre cada vez mais completo, bem como migrando o próprio calibre do <i>Qt WebKit</i> para o <i>Qt WebEngine</i>, porque o primeiro não é mais atualizado.
ru: И снова здравствуйте, пользователи calibre. Прошло два года с выпуска calibre 3.0. Это время мы посвятили, в основном, усовершенствованию контент-сервера calibre, а также переносу самой calibre с <i>Qt WebKit</i> на <i>Qt WebEngine</i>, потому что первый более не поддерживается.
sv: Välkommen tillbaka calibre-användare. Det har gått två år sedan calibre 3.0. Den här tiden har spenderats mestadels till att göra innehållsservern för calibre ännu mer kapabel samt migrera calibre själv från<i>Qt WebKit</i> till <i>Qt WebEngine</i>, eftersom den förstnämnda inte längre upprätthålls.
zh_tw: 歡迎回來，calibre 的使用者們。在 calibre 3.0 出來之後已經兩年過去了。這次大部分的時間都花費在讓 calibre 內容伺服器的功能加強，以及將 calibre 從已經不再支援的 <i>Qt WebKit</i> 轉移到 <i>Qt WebEngine</i>上了。

source: The Content server has gained the ability to <i>Edit metadata</i>, <i>Add/remove books</i> and even <i>Convert books</i> to and from all the formats calibre itself supports. It is now a full fledged interface to your calibre libraries.
nl: De Content server heeft nu de mogelijkheid om <i>Metadata te bewerken</i>, <i>Boeken toe te voegen/verwijderen</i> en zelfs <i>Boeken converteren</i> naar en van alle formaten die calibre ondersteunt. Het is nu een volwaardige interface voor uw calibre bibliotheken.
pt: O Servidor de conteúdo ganhou a capacidade de <i>Editar metadados</i>, <i>Adicionar/remover livros</i> e até mesmo <i>Converter livros</i> entre quaisquer dos formatos suportados pelo calibre. Ele agora possui uma interface completa para suas bibliotecas do calibre.
ru: Контент-сервер обзавёлся возможностью <i>редактировать метаданные</i>, <i>добавлять/удалять</i> и даже <i>преобразовывать</i> книги всех форматов, которые поддерживает сама calibre. Теперь это полноценный интерфейс для ваших библиотек calibre.
sv: Innehållsservern har fått möjlighet att <i>redigera metadata</i>, <i>lägga till/ta bort böcker</i> och även <i>konvertera böcker</i> till och från alla format calibre själv stöder. Det är nu ett fullfjädrad gränssnitt för dina calibre-bibliotek.
zh_tw: 內容伺服器現在能夠<i>編輯詮釋資料</i>、<i>新增、移除書本</i>甚至是在 calibre 所支援的格式之間互相轉換的<i>書本轉檔</i>功能。 它現在是一個完全成熟能夠通往您的 calibre 書庫的介面了。

source: The change to use <i>Qt WebEngine</i> has entailed a complete rewrite of various parts of calibre, including the <i>E-book viewer</i>, <i>PDF Output</i>, <i>Book details</i> etc. Every attempt has been made to preserve features and functionality in a backwards compatible way, see below for a list of some known incompatibilities.
nl: De overstap naar <i>Qt WebEngine</i> bracht een volledig herschrijven van verschillende delen van calibre mee, onder andere de <i>E-boek viewer</i>, <i>PDF Output</i>, <i>Boek details</i> enz. Alle moeite is gedaan om functies en functionaliteit te bewaren voor een terugwerkende compatibiliteit, zie onder voor een lijst van sommige gekende incompatibiliteiten.
pt: A mudança para usar o <i>Qt WebEngine</i> nos obrigou a reescrever completamente várias partes do calibre, incluindo <i>Visualizador de e-books</i>, <i>Saída PDF</i>, <i>Detalhes do Livro</i>, etc. Todo o possível foi feito para preservar os recursos e funcionalidades de uma maneira retro-compatível. Veja abaixo uma lista de algumas incompatibilidades conhecidas.
ru: Переход к использованию <i>Qt WebEngine</i> повлёк за собой полное переписывание различных частей calibre, включая <i>читалку электронных книг</i>, <i>экспорт в PDF</i>, <i>описание книги</i> и т. д. Было предпринято всё возможное для сохранения особенностей, функциональности и обратной совместимости (список некоторых известных несовместимостей см. ниже).
sv: Ändringen att använda <i>Qt WebEngine</i> har inneburit en fullständig omskrivning av olika delar av calibre, inklusive <i>e-bokvisaren</i>, <i>PDF-utmatning</i>, <i>bokdetaljer</i> o.s.v. Varje försök har gjorts för att bevara funktioner och funktionalitet på ett bakåtkompatibelt sätt, se nedan för en lista över några kända inkompatibiliteter.
zh_tw: 改用 <i>Qt WebEngine</i> 需要对 calibre 的各个部分进行全面的重写，包括 <i>电子书阅读器</i>, <i>PDF 输出</i>、<i>图书详情</i> 等。我们已经做了一切尝试，以向后兼容的方式保留特性和功能，请看下面的一些已知的不兼容列表。

source: The new Content server capabilities
nl: De nieuwe Content server mogelijkheden
pt: Novas funcionalidades do servidor de conteúdos
ru: Новые возможности контент-сервера
sv: De nya innehållsserverfunktionerna
zh_tw: calibre 內容伺服器的全新能力

source: The server has gained all the major capabilities of the main calibre interface. You can now edit metadata, convert books, and add/remove books and formats just as is possible with calibre itself. To see a brief tutorial describing how to access these features via the server interface, <a href="%(server)s" target="_blank">click here</a>.
nl: De server heeft alle belangrijke mogelijkheden van de calibre hoofdinterface gekregen. U kan nu metadata bewerken, boeken converteren, en boeken en formaten toevoegen/verwijderen net zoals met calibre zelf mogelijk is. Voor een korte tutorial over toegang tot deze functies via de server interface, <a href="%(server)s" target="_blank">klick hier</a>.
pt: O servidor ganhou todas as principais capacidades da inteface principal do calibre. Você agora pode editar metadados, converter livros, e adicionar/remover livros e formatos exatamente como no próprio calibre. Para ver um breve tutorial descrevendo como acessar esses recursos via interface do servidor, <a href="%(server)s" target="_blank">clique aqui</a>.
ru: Сервер получил все основные возможности главного интерфейса calibre. Теперь вы можете редактировать метаданные, преобразовывать, добавлять и удалять книги и форматы так же, как и в самой программе. Чтобы посмотреть краткое руководство, описывающее, как получить доступ к этим функциям в интерфейсе сервера, <a href="%(server)s" target="_blank">нажмите сюда</a>.
sv: Servern har fått alla de viktigaste funktionerna av calibre- huvudgränssnittet. Du kan nu redigera metadata, konvertera böcker och lägga till/ta bort böcker och format precis som det är möjligt med calibre själv. För att se en kort handledning som beskriver hur man får tillgång till dessa funktioner via servergränssnittet, <a href="%(server)s" target="_blank">klicka här</a>.
zh_tw: 伺服器現在已經擁有了 calibre 主介面的所有主要功能。你現在可以編輯詮釋資料、轉換書本、新增、移除書本、轉檔，就跟 calibre 本身所能夠做到的事一樣了。關於如何透過伺服器介面使用這個功能的簡易教學，請參見<a href="%(server)s" target="_blank">這裡</a>。

source: Book details where you can convert, read, edit metadata, etc
nl: Boek details waar u kan converteren, lezen, metadata bewerken, enz
pt: Detalhes do livro onde pode converter, ler editar metadados, etc
ru: Описание книги, где вы можете преобразовывать, читать, редактировать метаданные и т. д.
sv: Bokdetaljer där du kan konvertera, läsa, redigera metadata o.s.v.
zh_tw: 書本詳細資訊，你可以在這邊轉檔、閱讀、編輯詮釋資料...等

source: Book list where you can sort, search and add books
nl: Boekenlijst waar u kan sorteren, zoeken en boeken toevoegen
pt: Lista de livros onde pode ordenar, pesquisar e adicionar livros
ru: Список книг, в котором можно сортировать, искать и добавлять книги
sv: Boklista där du kan sortera, söka och lägga till böcker
zh_tw: 書本清單，你可以在這邊排序、搜尋以及加入書本

source: Editing metadata
nl: Metadata bewerken
pt: Editar metadados
ru: Редактирование метаданных
sv: Redigera metadata
zh_tw: 編輯詮釋資料

source: All new e-book viewer
nl: Volledig nieuwe e-boek viewer
pt: Um novo visualizador de livros digitais
ru: Совершенно новая читалка электронных книг
sv: Helt ny e-bokvisare
zh_tw: 所有新的电子书阅读器
