Repository: debian-calibre/calibre
Catalog: translations-git/website/*.po
Languages: nl, pt, ru, sv, zh_tw

source: The home screen: continue reading or choose a library
nl: Het hoofdscherm: verder lezen of kies een bibliotheek
pt: O ecrã principal: continuar a ler ou escolher uma biblioteca
ru: Главная страница: продолжайте чтение или выберите библиотеку
sv: Startskärmen: fortsätt läsa eller välj ett bibliotek
zh_tw: 主界面：继续阅读或选择书库

source: The books in a calibre library
nl: De boeken in een calibre bibliotheek
pt: Livros numa biblioteca Clibre
ru: Книги в библиотеке calibre
sv: Böckerna i ett calibre-bibliotek
zh_tw: calibre 书库里的书

source: Another view of the books
nl: Een ander zicht op de boeken
pt: Outra vista dos livros
ru: Другой вид списка книг
sv: En annan vy av böckerna
zh_tw: 另一种展示书籍的视图

source: Reading a book in the browser
nl: Een boek in de browser lezen
pt: Ler um livro no browser
ru: Чтение книги в браузере
sv: Läsa en bok i webbläsaren
zh_tw: 在瀏覽器中閱讀書籍

source: Another page of the book
nl: Een andere pagina van het boek
pt: Outra página do livro
ru: Другая страница книги
sv: En annan sida i boken
zh_tw: 书的另一页

source: Fifth
nl: Vijfde
pt: Quinto
ru: Пятый
sv: Femte
zh_tw: 第五

source: Support for High Resolution (Retina) screens
nl: Ondersteuning voor Hoge Resolutie (Retina) schermen
pt: Suporte a ecrãs de alta resolução (Retina)
ru: Поддержка экранов высокого разрешения (Retina)
sv: Stöd för högupplösta skärmar (Retina)
zh_tw: 支援高解析度(Retina)螢幕

source: A much requested feature. As of calibre 3, calibre now natively supports high resolution (Retina) screens. It should auto-detect when it is started up on such a screen and adjust itself accordingly. It can be controlled via <code>Preferences → Look &amp; feel → Adjust for high resolution screens</code>.
nl: Een veel gevraagde functie. Vanaf calibre 3, ondersteunt calibre native hoge resolutie (Retina) schermen. Het zou zelf moeten detecteren of het gestart wordt op zo'n scherm en zichzelf daaraan aanpassen. Het kan gecontroleerd worden via <code>Voorkeuren → Uitstraling &amp; gevoel → Aanpassen voor schermen met hoge resolutie</code>.
pt: Uma função muito requisitada. O calibre 3 agora suporta nativamente telas de alta resolução (Retina). Ele detecta automaticamente ao ser iniciado em uma tela assim e se ajusta de acordo. Isso pode ser controlado via <code>Preferências → Aparência → Ajuste para telas de alta resolução</code>.
ru: Очень востребованная функция. Начиная с calibre 3, calibre теперь изначально поддерживает экраны высокого разрешения (Retina). Он должен автоматически определять, когда он запускается такой экран и настраивай сам соответственно. Это можно контролировать с помощью <code>Настройки - Внешний вид - Настройка для экранов с высоким разрешением</code>.
sv: En mycket efterfrågad funktion. Från och med calibre 3 stöder calibre nu högupplösta (Retina) skärmar. Den bör automatiskt upptäcka när den startas på en sådan skärm och justera sig själv i enlighet därmed. Det kan styras via <code>Inställningar → Utseende &amp; känsla → Justera för skärmar med hög upplösning</code>.
zh_tw: 一个很受欢迎的功能。从calibre3开始，calibre现在本身支持 高分辨率（Retina）屏幕。当它在这样的屏幕上启动时， 它应该自动检测并相应地调整自己。它可以通过 <code>“首选项”→“外观和感觉”→“针对高分辨率屏幕进行调整”</code>进行控制。

source: Support for icon themes and a new default icon set
nl: Ondersteuning voor icoon thema's en een nieuwe standaard iconenset
pt: Suporte para temas de ícones e um novo conjunto de ícones predefinidos
ru: Поддержка тем значков и новый стандартный набор значков
sv: Stöd för ikonteman och en ny standard ikonuppsättning
zh_tw: 支持图标主题和新的默认图标集

source: calibre now has support for installing different icon themes (<code>Preferences → Look &amp; feel → Icon theme</code>). There are many different icon themes to suit different tastes.
nl: calibre ondersteunt nu installeren van verschillende icoon themas (<code>Voorkeuren → Uitstraling &amp; gevoel → Icoon thema</code>). Er zijn veel verschillende icoon thema's om verschillende smaken te behagen.
pt: O calibre agora tem suporte para instalar diferentes temas de ícones (<code>Preferências → Aparência → Tema de ícone</code>). Existem muitos temas de ícone diferentes para diferentes gostos.
ru: Теперь calibre поддерживает установку различных наборов значков (<code>Параметры → Оформление → Набор значков</code>). Там есть много других наборов, чтобы удовлетворить самые разные вкусы.
sv: calibre har nu stöd för att installera olika ikonteman (<code>Inställningar → Utseende &amp; känsla → Ikontema</code>). Där finns många olika ikonteman för att passa olika smaker.
zh_tw: Calibre现在支持安装不同的图标主题 (<code>首选项→外观和感觉→图标主题</code>)。 有许多不同的图标主题，以适应不同的品味。

source: In addition, to celebrate calibre's tenth birthday, which was in October, 2016, the default calibre icons have been changed. Never, fear if you prefer the old icons they are also available, as an icon theme.
nl: Bovendien, om calibres tiende verjaardag te vieren, dat was in oktober 2016, zijn de standaard calibre iconen veranderd. Nooit, vrees als u de oude iconen prefereert, ze zijn ook beschikbaar, als een icoon thema.
pt: Além disso, para celebrar o décimo aniversário do calibre, que foi em Outubro de 2016, os ícones padrões foram alterados. Não tema, se você preferir os velhos ícones eles também estão disponíveis, como um tema de ícone.
ru: Кроме того, в честь празднования десятилетия calibre, прошедшего в октябре 2016 изменились стандартные значки программы. Но не бойтесь, если вы предпочитаете старые, они также доступны среди наборов значков.
sv: Dessutom, för att fira calibre tionde födelsedag, som var i Oktober, 2016, har standard calibre-ikonerna ändrats. Frukta aldrig om du föredrar de gamla ikonerna eftersom de är också tillgängliga, som ett ikontema.
zh_tw: 此外，为了庆祝calibre的十岁生日，即2016年10月， calibre的默认图标进行了更改。 千万不要担心，如果你更喜欢老图标，它们 作为一个图标主题也是可用的。

source: Some new icon themes ({})
nl: Enkele nieuwe iconenthema's ({})
pt: Alguns novos temas de ícones ({})
ru: Несколько новых тем значков ({})
sv: Några nya ikonteman ({})
zh_tw: 一些新的图标主题 ({})

source: Conversion to Microsoft Word (DOCX)
nl: Conversie naar Microsoft Word (DOCX)
pt: Conversão para Microsoft Word (DOCX)
ru: Преобразование в Microsoft Word (DOCX)
sv: Konvertering till Microsoft Word (DOCX)
zh_tw: 轉換成 Microsoft Word (DOCX)

source: calibre can now convert all the book formats it supports to Microsoft Word (DOCX) files. Alongside the support for conversion <i>from</i> Word, you can now go back and forth between Word documents and e-book formats to your hearts desire.
nl: calibre kan nu alle boekformaten die het ondersteunt, converteren naar Microsoft Word (DOCX) bestanden. Naast ondersteuning voor conversie <i>van</i> Word, kan u nu heen en weer gaan tussen Word documenten en e-boek formaten zoals uw hart begeert.
pt: O calibre agora pode converter todos formatos suportados em arquivos do Microsoft Word (DOCX). Além do suporte para conversão <i>a partir</i> do Word, você pode agora ir e vir entre documentos Word e formatos de e-book de acordo com seu desejo.
ru: В calibre появилась возможность преобразования любых поддерживаемых форматов в файлы Microsoft Word (DOCX). Если раньше была доступна только конвертация <i>из</i> Word, то теперь вы можете преобразовывать документы Word и форматы электронных книг в любом направлении на своё усмотрение.
sv: calibre kan nu konvertera alla bokformat den stöder till Microsoft Word (DOCX)-filer. Vid sidan av stödet för konvertering <i>från</i> Word, du kan nu gå fram och tillbaka mellan Word-dokument och e-bokformat till din hjärtan önskan.
zh_tw: Calibre现在可以将其支持的所有图书格式转换为 Microsoft Word(Docx)文件。除了支持从<i>到</i> Word的转换之外，您现在还可以根据自己的需要 在Word文档和电子书格式之间来回切换。

source: There are a few minor backwards incompatibilities to be aware of in calibre 3.
nl: Er zijn enkele kleine onverenigbaarheden met oudere versies in calibre 3.
pt: No Calibre 3 existem algumas pequenas incompatibilidades com versões anteriores.
ru: В calibre 3 есть несколько небольших обратных несовместимостей, о которых следует знать.
sv: Det finns några mindre bakåtinkompatibiliteter att vara medveten om i calibre 3.
zh_tw: 在 calibre3 中，有几个小的不兼容的地方需要注意。

source: The Content server was completely re-written. While we have tried hard to make sure the functionality used by third party programs that connect to calibre remains compatible, there is likely to be some breakage. Also, no changes you have made to any server options will be preserved. For example, if you changed the port from the default of 8080, it will be reset to 8080. You will have to redo the configuration.
nl: De Content server was volledig herschreven. Hoewel we hard hebben geprobeerd om ervoor te zorgen dat de functionaliteit gebruikt door derde partij programma's die met calibre verbinden compatibel blijft, zijn er waarschijnlijk een paar breuken. Ook veranderingen die u maakte in server opties zullen niet bewaard worden. Bijvoorbeeld, als u de standaard poort veranderde van 8080, zal het gereset worden naar 8080. U zal de configuratie opnieuw moeten doen.
pt: O Servidor de Conteúdo foi completamente reescrito. Apesar de nos esforçarmos para garantir que as funcionalidades usadas por programas de terceiros que se conectam ao calibre permaneçam compatíveis, é possível que haja algum dano. Além disso, nenhuma mudança que tenha feito nas opções do servidor será preservada. Por exemplo, se você alterou a porta do padrão 8080, ele será redefinido para 8080. Você terá que refazer a configuração.
ru: Контент-сервер был полностью переписан. Хотя мы очень старались чтобы убедиться в том, что функциональность сторонних программ, которые подключаются к calibre остаётся совместимой, вероятно, будут некоторые поломки. Кроме того, никакие изменения, внесённые вами в параметры сервера, не будут сохранены. Например, если вы изменили порт по умолчанию 8080, он будет сброшен до 8080. Вам придется повторить конфигурирование.
sv: Innehållsservern skrevs helt om. Även om vi har försökt hårt för att se till att funktionaliteten som används av tredjepartsprogram som ansluter till calibre förblir kompatibel, finns det troligtvis problem. Inga ändringar du har gjort i serveralternativ kommer att bevaras. Om du till exempel ändrade porten från standard 8080 återställs den till 8080. Du måste göra om konfigurationen.
zh_tw: “内容服务器”已完全重写。虽然我们已经尽力确保 连接到calibre的第三方程序所使用的功能保持 兼容，但可能会有一些损坏。此外，您对任何 服务器选项所做的任何更改都不会被保留。 例如，如果您将端口从默认值8080更改为8080， 它将重置为8080。你必须重新配置。

source: Because the Content server can now make changes to calibre libraries, you can no longer run any of <code>calibredb.exe, calibre-server.exe</code> or <code>calibre.exe</code> together, as they are all capable of modifying calibre data. Instead of running calibre.exe and calibre-server.exe, use the embedded server inside the main calibre program. calibredb.exe can now connect directly to a running calibre server (either calibre-server.exe or the server running inside calibre). See the <a href="%(man)s"> User Manual</a> for details on how to do that.
nl: Omdat de Content server nu calibre bibliotheken kan aanpassen, kan u niet langer <code>calibredb.exe, calibre-server.exe</code> of <code>calibre.exe</code> samen draaien, omdat ze allemaal calibre data kunnen aanpassen. In plaats van calibre.exe en calibre-server.exe te draaien, gebruik de ingebedde server in het calibre hoofdprogramma. calibredb.exe kan nu direct verbinden met een draaiende calibre server (ofwel calibre-server.exe ofwel de server die in calibre draait). Kijk in de <a href="%(man)s"> Handleiding</a> voor details over hoe dat te doen.
pt: Uma vez que o Servidor de Conteúdo agora pode fazer alterações nas bibliotecas do calibre, não é mais possível executar qualquer instância de <code>calibredb.exe, calibre-server.exe</code> ou <code>calibre.exe</code> juntos, já que todos eles são capazes de modificar os dados do calibre. Em vez de executar o calibre.exe e o calibre-server.exe, use o servidor incorporado dentro do programa principal. O calibredb.exe pode agora se conectar diretamente a um servidor em execução (tanto o calibre-server.exe ou o servidor rodando dentro do calibre). Veja o <a href="%(man)s"> Manual do Usuário</a> para detalhes sobre como fazer isso.
ru: Так как что контент-сервер теперь может вносить изменения в библиотеки calibre, Вы больше не можете запускать любой из <code>calibredb.exe, calibre-server.exe</code> или <code>calibre.exe</code> вместе, так как они все способны изменять данные calibre. Вместо запуска calibre.exe и calibre-server.exe используйте встроенный сервер внутри основной программы calibre. calibredb.exe теперь может подключиться напрямую как к работающему серверу calibre (или calibre-server.exe) так и к серверу, работающему внутри calibre). См. <a href="%(man)s">Руководство пользователя</a> для деталей о том, как это сделать.
sv: Eftersom innehållsservern nu kan göra ändringar i calibre-bibliotek, kan du inte längre köra någon av <code>calibredb.exe, calibre server.exe</code> eller <code>calibre.exe</code> tillsammans, eftersom de alla kan ändra calibre data. Istället för att köra calibre.exe och calibre server.exe, använd inbäddad server inuti huvud calibre-programmet. calibredb.exe kan nu ansluta direkt till en körande calibre-server (antingen calibre server.exe eller servern som körs inuti calibre). Se <a href="%(man)s"> användarmanualen</a> för mer information om hur man gör det.
zh_tw: 由于内容服务器现在可以对Calibre库进行更改，因此您不能 再同时运行<code>Calibredb.exe、Calibre-server.exe</code>或 <code>Calibre.exe</code>中的任何一个，因为它们都能够修改 Calibre数据。使用主Calibre程序中的嵌入式服务器，而不是 运行Calibre.exe和Calibre-server.exe。Calibredb.exe现在可以 直接连接到正在运行的Calibre服务器(Calibre-server.exe或在 Calibre内部运行的服务器)。有关如何操作的详细信息， 请参阅<a href="%(man)s">用户手册</a>。

source: On Linux calibre can no longer use the system Qt theme/style plugins as they cause hangs/crashes on some systems. This means calibre might look a little different from other applications on your system. You can force the use of the system theme by setting the environment variable <code>CALIBRE_USE_SYSTEM_THEME</code>, but do so at your own risk.
nl: Op Linux kan calibre de systeem Qt thema/stijl plug-ins niet meer gebruiken omdat ze sommige systemen laten hangen/crashen. calibre kan er dus een beetje anders uitzien dan andere programmas op uw systeem. U kan het gebruik van het systeem's thema afdwingen door de environment variable <code>CALIBRE_USE_SYSTEM_THEME</code> in te stellen maar dat is op eigen risico.
pt: No Linux, o calibre não pode mais usar os plugins de estilo / temas do Qt do sistema, já que causam travamentos em alguns sistemas. Isto significa que o calibre pode parecer um pouco diferente de outros programas no seus sistema. Você pode forçar o uso do tema do sistema definindo a variável de ambiente <code>CALIBRE_USE_SYSTEM_THEME</code>, por sua conta e risco.
ru: На Linux calibre больше не может использовать системные плагины темы/стиля Qt поскольку они вызывают зависания/сбои в некоторых системах. Это означает, что calibre может выглядеть немного иначе, чем другие приложения в вашей системе. Вы можете принудительно использовать системную тему, устанавливая переменную окружения <code>CALIBRE_USE_SYSTEM_THEME</code>, но делайте это на свой страх и риск.
sv: På Linux kan calibre inte längre använda systemets Qt-tema/formatinsticksmoduler eftersom de orsakar hängningar/kraschar på vissa system. Det betyder att calibre kan se lite annorlunda ut än andra program på ditt system. Du kan tvinga användningen av systemtemat genom att ställa in miljövariabeln <code>CALIBRE_USE_SYSTEM_THEME</code>, men gör det på din egen risk.
zh_tw: 在Linux上，Calibre不能再使用系统Qt主题/样式插件，因为它们 会导致某些系统挂起/崩溃。这意味着Calibre看起来可能 与系统上的其他应用程序略有不同。您可以通过设置 环境变量<code>CALIBRE_USE_SYSTEM_THEME</code>强制 使用系统主题，但这样做的风险自负。

source: calibre works on macOS 11.0 (Big Sur) and higher.
pt: Calibre funciona em macOS 11.0 (Big Sur) e superior.
sv: calibre fungerar på macOS 11.0 (Big Sur) och senare.

source: If you are using macOS older than 11.0 (Big Sur), the last version of calibre that will work on your machine is 6.11, available
pt: Se está a utilizar um macOS anterior ao 11.0 (Big Sur), a última versão do Calibre que irá funcionar na sua máquina é a 6.11, disponível
sv: Om du använder macOS äldre än 11.0 (Big Sur), är den senaste versionen av calibre som fungerar på din maskin 6.11, tillgänglig
