Repository: debian-calibre/calibre
Catalog: translations-git/website/*.po
Languages: nl, pt, ru, sv, zh_tw

source: What to do with the "%%A_Word" characters?<br />The %% character and a word to the right of it (no space between the percentage sign and the word), denotes a word that will be replaced by the code. So when encountering this symbol and a word right next to it (example: %%default), don't change it. Keep it as is in the translated sentence. Similarly for sequences like %%s or %%d, leave them as is. Finally, sequences like %%(some_word)s should also be left unchanged.
nl: Wat met de "%%A_Word" karakters? <br />Het %% karakter en een woord rechts daarvan (geen spatie tussen het percentage teken en het woord) duiden op een woord dat vervangen wordt door de code. Als u dus dit symbool tegen komt met een woord er vlak naast (bv. %%standaard), verander het niet. Houdt het zo in de vertaalde zin. Idem voor reeksen zoals %%s of %%d, laat ze zoals ze zijn. Tenslotte, reeksen zoals %%(some_word)s moeten onveranderd blijven.
pt: O que fazer com os caracteres "%%Uma_palavra" ? <br />O carácter %% e a palavra à sua direita (sem espaço entre o sinal de percentagem e a palavra) denota uma palavra que será substituída por código. Então, ao encontrar este símbolo e uma palavra logo à sua direita (exemplo: %%default), não a altere. Mantenha-a na frase traduzida tal como está. Do mesmo modo, para sequências como %%s ou %%d, deixe-as tal como estão. Finalmente, sequências como %%(algumas_palavra)s também devem ficar inalteradas.
ru: Как поступать с выражениями «%%A_Word»?<br />Символ «%%» и слово справа от него (без пробела между знаком процента и словом) обозначают слово, которое будет заменено кодом. Поэтому, когда столкнётесь с таким символом и прилипшим к нему словом (например: %%default), не изменяйте их. Сохраните их такими же, как в переводимом предложении. Аналогично для последовательностей %%s или %%d: оставьте их как есть. Наконец, выражения типа %%(some_word)s также следует оставить без изменений.
sv: Vad ska man göra med "%%Ett_ord"-tecknen?<br />%%-tecknet och ett ord till höger om det (inget blanksteg mellan procenttecknet och ordet) betecknar ett ord som kommer att ersättas av koden. Så när du stöter på den här symbolen och ett ord bredvid den (exempel: %%default), ändra inte det. Lämna det som det är i den översatta meningen. På samma sätt för sekvenser som %%s eller %%d, lämna dem som de är. Slutligen bör sekvenser som %%(något_ord)s också lämnas oförändrade.
zh_tw: 如何处理“%%A_WORD”字符？<br />对于 %% 字符及其右侧的单词（百分号和单词之间没有空格）表示将由代码替换的单词。因此，当遇到此符号及其旁边的单词（例如：%%default）时，不要更改，在翻译的句子中保持原样。同样，对于 %%s 或 %%d 之类的序列，请保留其原样。最后，像%%(SOME_WORD)s 这样的序列也应该保持不变。

source: What to do with <code>{word}</code> constructs?<br />These are placeholders and must not be translated. They will be replaced with actual content by the code.
nl: Wat met <code>{woord}</code> constructies? <br />Dit zijn tijdelijke aanduidingen en mogen niet vertaald worden. Ze worden door de code vervangen door werkelijke inhoud.
pt: O que fazer com expressões do tipo <code>{termo}</code>?<br /> Trata-se de marcadores de espaço e que não devem ser traduzidos. Serão substituídos por conteúdo real através do código.
ru: Что делать с конструкциями <code>{word}</code>?<br />Не переводите: это заменители. Вместо них код подставит фактическое содержимое.
sv: Vad ska man göra med <code>{ord}</code>-konstruktioner?<br />Dessa är platshållare och får inte översättas. De kommer att ersättas med faktiskt innehåll av koden.
zh_tw: 如何处理带有 <code>{word}</code> 构造的句子？<br />这些是占位符，不得翻译。代码将用实际内容替换它们。

source: What to do with date strings like dd MMM yyy?<br />These must be left untranslated.
nl: Wat te doen met datum strings zoals dd MMM yyy?<br />Deze moeten onvertaald blijven.
pt: O que fazer com strings de data como dd MMM yyyy? <br />Estas devem ficar por traduzir.
ru: Что делать со строками с датой, например dd MMM yyy?<br />Их не следует переводить.
sv: Vad ska man göra med datumsträngar som dd MMM yyy?<br />Dessa måste lämnas oöversatta.
zh_tw: 如何处理像dd MMM yyy这样的日期字符串？<br />这些字符串必须保留为未翻译。

source: What to do with the special markup when translating the User Manual?<br /> The User Manual is written in <a href="%(sphinx)s">reStructuredText</a>. You will see many constructs like <code>:guilabel:`Some text`</code>. Here the <code>:guilabel:``</code> part is markup, like HTML tags. You should only translate the text within the backticks. Particular care must be taken with links, of the following forms:
nl: Wat met de special markup bij vertalen van de Handleiding?<br /> De Handleiding is geschreven in <a href="%(sphinx)s">reStructuredText</a>. U zal veel constructies zien zoals <code>:guilabel:`Enige tekst`</code>. Hier is het <code>:guilabel:``</code> deel markup, zoals HTML tags. U mag enkel de tekst tussen de backticks vertalen. Bijzondere zorg graag voor links in de volgende vormen:
pt: O que fazer com as marcações especiais ao traduzir o Manual do utilizador?<br /> O Manual do utilizador é escrito em <a href="%(sphinx)s">ReSTructured Text</a>. Você verá muitas construções como <code>:guilabel:`Algum texto`</code>. Aqui a parte <code>:guilabel:``</code> é uma marcação, semelhante a etiquetas HTML. Deve traduzir apenas o texto dentro das aspas simples. Deve ter um cuidado especial com hiperligações nas seguintes formas:
ru: Что делать со специальной разметкой при переводе Руководства пользователя?<br /> Руководство пользователя написано на языке <a href="%(sphinx)s">reStructuredText</a>. Вы увидите много таких конструкций, как <code>:guilabel:`Some text`</code>. Здесь <code>:guilabel:``</code> Часть - это разметка, как HTML-теги. Вы должны только перевести текст с обратными кавычками. Особое внимание следует уделять ссылкам следующих форм:
sv: Vad ska man göra med den speciella markeringen när man översätter användarmanualen?<br /> Användarmanualen är skriven i <a href="%(sphinx)s">reStructuredText</a>. Du kommer att se många konstruktioner som <code>:guilabel:`Någon text`</code>. Här är <code>:guilabel:``</code>-delen markerad, som HTML-taggar. Du bör bara översätta texten mellan de grava accenterna. Särskild försiktighet måste vidtas med länkar av följande former:
zh_tw: 翻译用户手册时如何处理特殊标记？<br />用户手册采用 <a href="%(sphinx)s">reStructuredText</a>编写。 您将看到许多类似 <code>:guilabel:`Some text`</code>的结构。其中 <code>:guilabel:``</code> 这部分是标记语言，类似 HTML 标签，应该只翻译反引号内的文本。此外，必须特别注意以下形式的链接：

source: <code>:ref:`some text`</code> Here nothing must be translated.
nl: <code>:ref:`some text`</code> Hier moet niets vertaald worden.
pt: <code>:ref:`algum texto`</code> Aqui, nada deve ser traduzido.
ru: <code>:ref:`some text`</code> — здесь ничего переводить не надо.
sv: <code>:ref:`some text`</code> Här får ingenting översättas.
zh_tw: <code>:ref:`some text`</code> 这里的任何东西都不能翻译。

source: <code>:ref:`Some text &lt;link-location&gt;`</code> Here only "Some text" must be translated.
nl: <code>:ref:`Some text &lt;link-location&gt;`</code> Hier moet enkel "Some text" vertaald worden.
pt: <code>:ref:`Algum texto &lt;link-location&gt;`</code> Aqui apenas o "Algum texto" deve ser traduzido.
ru: <code>:ref:`Некий текст &lt;link-location&gt;`</code> — здесь нужно перевести только «Некий текст».
sv: <code>:ref:`Någon text &lt;länkplats&gt;`</code> Här ska endast "Någon text" översättas.
zh_tw: <code>:ref:`Some text &lt;link-location&gt;`</code> 这里只有“Some text”必须翻译

source: <code>``Some text``</code> This is a literal and nothing should be translated in it.
nl: <code>``Some text``</code> Dit is letterlijk en niets ervan moet vertaald worden.
pt: <code>``Some text``</code> É para ser interpretado literalmente e nada deve ser traduzido.
ru: <code>``Some text``</code> Это буквальный перевод, в нем ничего не следует переводить.
sv: <code>``Någon text``</code> Detta är en bokstavlig text och ingenting ska översättas i den.
zh_tw: <code>``Some text``</code> 这是段字面文本，双反引号内的东西不应该翻译，而是完全保留。

source: <code>:doc:`generated/en/something`</code> Should be replaced by :doc:`generated/your_language_code/something`. For example <code>:doc:`generated/en/cli-index`</code> becomes <code>:doc:`generated/de/cli-index`</code> in German.
nl: <code>:doc:`generated/en/iets`</code> Moet vervangen worden door :doc:`generated/uw_taal_code/iets`. Bv. <code>:doc:`generated/en/cli-index`</code> wordt <code>:doc:`generated/de/cli-index`</code> in Duits.
pt: <code>:doc:`generated/en/something`</code> Deve ser substituído por :doc:`generated/codigo_seu_idioma/something`. Por exemplo <code>2:doc:`generated/en/cli-index`</code> torna-se <code>:doc:`generated/pt_PT/cli-index`</code> em Português.
ru: <code>:doc:`generated/en/something`</code> нужно заменить на :doc:`generated/код_вашего_языка/something`. Например, <code>:doc:`generated/en/cli-index`</code> станет <code>:doc:`generated/de/cli-index`</code> для немецкого.
sv: <code>:doc:`generated/en/något`</code> Bör ersättas med :doc:`generated/din_språkkod/något`. Till exempel <code>:doc:`generated/en/cli-index`</code> blir <code>:doc:`generated/de/cli-index`</code> på tyska.
zh_tw: <code>:doc:`generated/en/something`</code> 应该换成 :doc:`generated/目标语言代码/something`。例如，在德语中，将 <code>:doc:`generated/en/cli-index`</code> 修改为 <code>:doc:`generated/de/cli-index`</code>

source: How do I test my translations?<br />First you need to download a .po file for your language from <a href="%(tloc)s" target="new">here</a>. You can test your .po file by setting the environment variable CALIBRE_TEST_TRANSLATION to the path of the downloaded .po file. Then run calibre as normal. Currently, it is not possible to test the User Manual translations.
nl: Hoe test ik mijn vertaling?<br />Eerst moet u een .po bestand voor uw taal downloaden van <a href="%(tloc)s" target="new">hier</a>. U kan uw .po bestand testen door de omgevingsvariabele CALIBRE_TEST_TRANSLATION in te stellen op het pad van het gedownloade .po bestand. Draai calibre zoals normaal. Momenteel is het testen van vertaalde Handleidingen niet mogelijk.
pt: Como posso testar as minhas traduções? <br />Primeiro deve descarregar o ficheiro .po do seu idioma <a href="%(tloc)s" target="new">daqui</a>. Pode testar o seu ficheiro .po criando a variável de ambiente CALIBRE_TEST_TRANSLATION com o valor correspondente ao caminho para o ficheiro .po descarregado. Depois execute o Calibre normalmente. Atualmente, não é possível testar as traduções do Manual do utilizador.
ru: Как мне протестировать свой перевод?<br />Сначала нужно скачать файл .po для вашего языка <a href="%(tloc)s" target="new">отсюда</a>. Проверить его можно, задав переменную окружения CALIBRE_TEST_TRANSLATION с путём к загруженному .po файлу. Затем запустите calibre как обычно. Перевод «Руководства пользователя» так, в настоящий момент, проверить нельзя.
sv: Hur testar jag mina översättningar?<br />Först måste du hämta en .po-fil för ditt språk <a href="%(tloc)s" target="new">härifrån</a>. Du kan testa din .po-fil genom att ställa in miljövariabeln CALIBRE_TEST_TRANSLATION till sökvägen för den hämtade .po-filen. Kör sedan calibre som normalt. För närvarande är det inte möjligt att testa översättningarna av användarmanualen.
zh_tw: 如何测试我的翻译？<br />首先，需要从<a href="%(tloc)s" target="new">此处</a>下载适用于您的语言的.po文件。可以通过将环境变量 CALIBRE_TEST_TRANSING 设置为下载的.po文件的路径来测试.po文件。然后像往常一样运行calibre。目前，无法测试用户手册的翻译。

source: Becoming a calibre developer
nl: Een calibre ontwikkelaar worden
pt: Tornar-se um programador Calibre
ru: Стать разработчиком calibre
sv: Bli en calibre-utvecklare
zh_tw: 成為 calibre 的開發者

source: Get the source:
nl: Verkrijg de bron:
pt: Obter o código fonte:
ru: Раздобудьте исходники:
sv: Få koden:
zh_tw: 取得原始碼:

source: Or if you don't want to wait for the full version history to download, you can get only the source code:
nl: Of als u niet wilt wachten op de volledige versie geschiedenis om te downloaden, kan u enkel de broncode halen:
pt: Ou se não quiser esperar para descarregar a versão completa pode obter apenas o código fonte:
ru: Если же вы не хотите ждать загрузки полной истории версий, то можете получить только исходный код:
sv: Eller om du inte vill vänta på att hela versionshistoriken ska hämtas kan du bara hämta källkoden:
zh_tw: 或者，如果您不想等待下载完整的历史版本代码，可以只获得源代码：

source: Instructions for getting calibre to run using your source checkout, as well as some info about how the calibre code is organized is in the <a target="usermanual" href="%(develop)s">User Manual</a>.
nl: Instructies om calibre aan het draaien te krijgen met uw afgehaalde bron, en enige info over hoe de calibre code georganiseerd is in de <a target="usermanual" href="%(develop)s">Gebruikershandleiding</a>.
pt: Instruções para executar o Calibre utilizando o seu verificador de código fonte, bem como alguma informação sobre como o código do Calibre está organizado, encontra-se no <a target="usermanual" href="%(develop)s">Manual do Utilizador</a>.
ru: Инструкции по запуску calibre с отладкой ваших исходников, как и некоторые сведения об организации кода calibre, находятся в <a target="usermanual" href="%(develop)s">руководстве пользователя</a>.
sv: Instruktioner för att få calibre att köra med din källkod, samt lite information om hur calibre-koden är organiserad finns i <a target="usermanual" href="%(develop)s">användarmanualen</a>.
zh_tw: 有关使用源代码签出运行 calibre 的说明，以及有关 calibre 代码的组织方式的一些信息，请参见<a target="usermanual" href="%(develop)s">用户手册</a>

source: If you come up with a cool idea and a patch for implementing it, let us know about it and more than likely it will be in the next weekly calibre release. A great place to ask for tips on calibre hacking is the <a target="_blank" href="%(forum)s">calibre Development forum</a> where lots of calibre developers hang out.
nl: Als u een tof idee hebt en een patch om het te implementeren, laat ons iets weten en waarschijnlijk zit het in de volgende wekelijkse calibre versie. Een goede plaats om te vragen achter tips voor calibre hacking is het <a target="_blank" href="%(forum)s">calibre Ontwikkelingsforum</a> waar veel calibre ontwikkelaars uithangen.
pt: Se tiver uma boa ideia e o código para a implementar, conte-nos sobre isso e muito provavelmente o código será incluído na próxima versão semanal. Um bom local para pedir dicas sobre como alterar o código Calibre é no <a target="_blank" href="%(forum)s">Fórum de desenvolvimento do Calibre</a> onde muitos dos programadores Calibre passam o tempo.
ru: Если у вас есть крутая идея и патч для её реализации, сообщите нам об этом, и, скорее всего, она появится в следующем еженедельном выпуске calibre. Лучше место, чтобы попросить совета по «хакингу» calibre, — <a target="_blank" href="%(forum)s">форум разработки</a>, где обретается большинство разработчиков calibre.
sv: Om du kommer upp med en häftig idé och kod för att implementera det, låt oss veta om det och mer än troligt kommer det att vara med i nästa veckas utgåva av calibre. Ett bra ställe att be om tips på hackning av calibre är <a target="_blank" href="%(forum)s">utvecklingsforumet för calibre</a> där många calibre-utvecklare håller till.
zh_tw: 如果你想出了一个很酷的想法和实现它的补丁，让立即让我们知道，它很可能会在下一周的版本中发布。一个询问 calibre 开发技巧的好地方是 <a target="_blank" href="%(forum)s">calibre 开发论坛</a>，很多 calibre 开发人员都在这里闲逛。

source: Watch it in action
nl: Bekijk het in actie
pt: Veja-o em ação
ru: Посмотреть в действии
sv: Se det i aktion
zh_tw: 來看看會動的 calibre

source: A video tour of calibre
nl: Een videotour in calibre
pt: Uma visita vídeo ao Calibre
ru: Видеообзор calibre
sv: En video-rundtur i calibre
zh_tw: calibre 的影片教學

source: Grand Tour Video
pt: Visita guiada em vídeo
ru: Видеообзор
sv: Videorundtur
zh_tw: 導覽影片

source: In-depth video tutorials
nl: Diepgaande video tutorials
pt: Tutoriais aprofundados em vídeo
ru: Продвинутые видеоуроки
sv: Fördjupade videohandledningar
zh_tw: 深入的影片教學

source: Video tutorials
pt: Tutoriais vídeo
ru: Видеоуроки
sv: Videohandledningar
zh_tw: 影片教學

source: Screenshots showing various calibre functions
nl: Schermafdrukken die verschillende calibre functies tonen
pt: Capturas de ecrã mostrando as várias funções do Calibre
ru: Скриншоты различных возможностей calibre
sv: Skärmdumpar som visar olika calibre-funktioner
zh_tw: 展示各種 calibre 功能的螢幕截圖

source: Screenshots
nl: Schermafdrukken
pt: Capturas de ecrã
ru: Снимки экрана
sv: Skärmdumpar
zh_tw: 螢幕截圖

source: Gives an overview of the major calibre features and how to get started using them. Click on it to start watching.
nl: Geeft een overzicht van de belangrijkste calibre functies en hoe ermee te beginnen. Klik erop om te beginnen kijken.
pt: Obtenha uma visão geral dos principais recursos do Calibre e de como começar a utilizá-los. Clique para iniciar visualização.
ru: Обзор основных возможностей calibre и советы по их использованию. Щёлкните по нему, чтобы начать просмотр.
sv: Du får en översikt över de viktigaste funktionerna i calibre och hur du kommer igång med dem. Klicka på den för att börja titta.
zh_tw: 概述了 calibre 的主要功能以及如何开始使用它们。点击以下内容开始观看。

source: Based on calibre version 0.8.0. Also available on <a href="%(yt)s" title="YouTube video of calibre">YouTube</a>.
nl: Gebaseerd op calibre versie 0.8.0. Ook beschikbaar op <a href="%(yt)s" title="YouTube video of calibre">YouTube</a>.
pt: Vídeo baseado na versão 0.8.0 do Calibre. Também disponível no <a href="%(yt)s" title="YouTube video of calibre">YouTube</a>.
ru: За основу взята версия calibre 0.8.0. Также доступен на <a href="%(yt)s" title="YouTube video of calibre">YouTube</a>.
sv: Baserat på calibre version 0.8.0. Finns även på <a href="%(yt)s" title="YouTube video of calibre">YouTube</a>.
zh_tw: 基于 calibre 0.8.0版。也可在<a href="%(yt)s" title="YouTube video of calibre">YouTube</a>上观看

source: Your browser doesn't support HTML5 video. Use the links below to download it instead.
nl: Uw browser ondersteunt HTML 5 video niet. Gebruik de links onder om te downloaden.
pt: Seu navegador não suporta vídeo HTML5. Em alternativa, use as hiperligações abaixo para o descarregar.
ru: Ваш браузер не поддерживает видео в формате HTML5. Вместо этого воспользуйтесь ссылками ниже, чтобы загрузить его.
sv: Din webbläsare stöder inte HTML5-video. Använd länkarna nedan för att hämta den istället.
zh_tw: 您的浏览器不支持直播HTML5视频。可使用以下的链接下载。

source: Download video: <a href="%(mp4)s">[MP4]</a>&nbsp;<a href="%(webm)s">[WEBM]</a>
pt: Descarregar vídeo: <a href="%(mp4)s">[MP4]</a>&nbsp;<a href="%(webm)s">[WEBM]</a>
ru: Скачать видео: <a href="%(mp4)s">[MP4]</a>&nbsp;<a href="%(webm)s">[WEBM]</a>
sv: Hämta video: <a href="%(mp4)s">[MP4]</a>&nbsp;<a href="%(webm)s">[WEBM]</a>
zh_tw: 下載影片: <a href="%(mp4)s">[MP4]</a>&nbsp;<a href="%(webm)s">[WEBM]</a>

source: The e-book editor
nl: De e-boek editor
pt: O editor de livros digitais
ru: Редактор электронных книг
sv: E-bokredigeraren
zh_tw: 電子書編輯器

source: A tour of the calibre e-book editor.
nl: Een tour door de calibre e-boek editor.
pt: Visita ao editor de livros digitais do Calibre.
ru: Обзор редактора электронных книг calibre.
sv: En rundtur i calibre e-bokredigeraren.
zh_tw: calibre 電子書編輯器的教學

source: Download video: <a href="%(mp4)s">[MP4]</a>&nbsp;<a href="%(webm)s">[WEBM]</a>
pt: Descarregar vídeo: <a href="%(mp4)s">[MP4]</a>&nbsp;<a href="%(webm)s">[WEBM]</a>
ru: Скачать видео: <a href="%(mp4)s">[MP4]</a>&nbsp;<a href="%(webm)s">[WEBM]</a>
sv: Hämta video: <a href="%(mp4)s">[MP4]</a>&nbsp;<a href="%(webm)s">[WEBM]</a>
zh_tw: 下載影片: <a href="%(mp4)s">[MP4]</a>&nbsp;<a href="%(webm)s">[WEBM]</a>

source: UI Power tips
pt: Dicas sobre a interface de utilizador
ru: Советы по настройке интерфейса
sv: Tips för gränssnittet
zh_tw: 用户界面提示

source: Power tips to optimize your usage of the calibre User Interface to manage your book collection. Available on <a href="%(yt)s">YouTube</a> as well.
nl: Power tips om uw gebruik van de calibre Gebruiker Interface te optimaliseren om uw boek collectie te beheren. Ook beschikbaar op <a href="%(yt)s">YouTube</a>.
pt: Dicas poderosas para otimizar o uso da Interface de utilizador do Calibre na gestão da sua coleção de livros. Disponível também no <a href="%(yt)s">YouTube</a>.
ru: Советы по оптимизации пользовательского интерфейса calibre для управления вашей коллекцией книг. Также доступно на <a href="%(yt)s">YouTube</a>.
sv: Potentialtips för att optimera din användning av calibre-användargränssnittet för att hantera din boksamling. Finns också på <a href="%(yt)s">YouTube</a>.
zh_tw: 使用calibre用户界面来优化管理图书收藏的功能提示。<a href="%(yt)s">YouTube</a> 上也有

source: The main calibre interface, showing books in your library.
nl: De calibre hoofdinterface, boeken in uw bibliotheek tonend.
pt: A interface principal do Calibre, mostrando os livros na sua biblioteca.
ru: Ваша библиотека в основном интерфейсе calibre.
sv: Det huvudsakliga calibre-gränssnittet, som visar böcker i ditt bibliotek.
zh_tw: calibre主界面，显示书库中的书籍。

source: The builtin e-book viewer. Supports all major formats.
nl: De ingebouwde e-boek viewer. Ondersteunt alle belangrijke formaten.
pt: O visualizador integrado de ebooks. Suporta todos os principais formatos.
ru: Встроенная читалка электронных книг. Поддерживаются все основные форматы.
sv: Den inbyggda e-bokvisaren. Stöder alla större format.
zh_tw: 内置的电子书阅读器。支持所有的主流格式。

source: The builtin e-book editor. Edits EPUB and Kindle books.
nl: De ingebouwde e-boek editor. Bewerkt EPUB en Kindle boeken.
pt: O editor integrado de ebooks. Edita livros EPUB e Kindle.
ru: Встроенный редактор электронных книг. Редактирует EPUB и Kindle книги.
sv: Den inbyggda e-bokredigeraren. Redigeringar EPUB- och Kindle-böcker.
zh_tw: 内置的电子书编辑器。编辑EPUB和Kindle图书。

source: Browse your books on the internet, using the calibre Content server
nl: Browse door uw boeken op het internet, met de calibre Content server
pt: Navegue nos seus livros na Internet usando o servidor de conteúdos do Calibre
ru: Читайте свои книги через интернет, используя контент-сервер calibre
sv: Bläddra bland dina böcker på internet med hjälp av Innehållsservern för calibre
zh_tw: 使用 calibre 内容服务器在互联网上浏览您的图书

source: Read, download or convert your books on the internet
nl: Lees, download of converteer uw boeken op internet
pt: Ler, descarregar ou converter os seus livros na Internet
ru: Читайте, загружайте или преобразовывайте свои книги в интернете
sv: Läs, hämta eller konvertera dina böcker på internet
zh_tw: 在互联网上阅读、下载或转换您的图书

source: calibre in dark mode
nl: calibre in donkere modus
pt: Calibre em modo escuro
ru: calibre в тёмном режиме
sv: calibre i mörkt läge
zh_tw: calibre 夜间模式

source: New in calibre 5.0
nl: Nieuw in calibre 5.0
pt: Novidades no Calibre 5.0
ru: Новое в calibre 5.0
sv: Nytt i calibre 5.0
zh_tw: Calibre 5.0中的新功能

source: Welcome back, calibre users. It has been a year since calibre 4.0. The two headline features are <i>Highlighting</i> support in the calibre E-book viewer and that calibre has now moved to <i>Python 3</i>.
nl: Welkom terug, calibre gebruikers. Een jaar verlopen sinds calibre 4.0. De twee belangrijkste functies zijn <i>Highlighting</i> ondersteuning in de calibre e-boek viewer en dat calibre nu naar <i>Python 3</i> verhuisd is.
pt: Sejam bem-vindos, utilizadores do Calibre. Já se passou um ano desde o lançamento do calibre 4.0. As principais novidades são o suporte a <i>Realces</i> no visualizador de ebooks e a migração do Calibre para <i>Python 3</i>.
ru: И снова здравствуйте, пользователи calibre. Прошёл год с выпуска calibre 4.0. Два главных изменения — поддержка <i>выделений</i> в читалке электронных книг calibre и переход calibre на <i>Python 3</i>.
sv: Välkommen tillbaka calibre-användare. Det har gått ett år sedan calibre 4.0. De två rubriksättarfunktionerna är stöd för <i>markeringar</i> i calibre e-bokvisaren och att calibre har uppgraderats till <i>Python 3</i>.
zh_tw: 欢迎回来，calibre用户们。从calibre 4.0发布开始已经有一年了。 两个主要功能是<i>高亮显示</i>在calibre电子书阅读器中的支持和 calibre现在已经转移到<i>Python 3</i>。
