Repository: debian-calibre/calibre
Catalog: translations-git/website/*.po
Languages: nl, pt, ru, sv, zh_tw

source: Many new metadata sources have been added, particularly for finding book covers. For example, calibre can now do a Google Image search to find covers. You can enable the new sources by going to <i>Preferences-&gt;Metadata download</i>. Other new sources include Edelweiss, a website maintained by book publishers and Big Book Search which collates cover images from Amazon. The new cover sources can return multiple covers for a single book, allowing you to pick and choose to select the image you like best.
nl: Veel nieuwe metadata bronnen zijn toegevoegd, vooral voor het vinden van boekomslagen. Bv. calibre kan nu een Google Afbeeldingen zoek doen om omslagen te vinden. U kan dit inschakelen door naar <i>Voorkeurenrences-&gt;Metadata download</i> te gaan. Andere nieuwe bronnen zijn Edelweiss, een website door boekuitgevers en Big Book Search die omslagafbeeldingen van Amazon heeft. De nieuwe omslagbronnen kunnen meerdere omslagen voor één boek geven, u de keuze latend de omslag te kiezen die u best bevalt.
pt: Muitas novas fontes de metadados foram adicionadas, particularmente para encontrar capas de livros. Por exemplo, o calibre agora pode fazer uma busca por imagens no Google para buscar capas. Você pode habilitar as novas fontes em <i>Preferências-&gt;Download de Metadados</i>. Outras novas fontes incluem Edelweiss, site mantido por editoras, e Big Book Search, o qual coleta imagens de capa da Amazon. As novas fontes de capa podem retornar múltiplas capas para um único livro, permitindo que você escolha a imagem que mais te agrade.
ru: Было добавлено много новых источников метаданных, особенно для найти обложки книг. Например, calibre теперь может сделать Google Image search чтобы найти обложки. Вы можете включить новые источники в <i>Preferences-Metadata download</i>. Другое новое источники включают Edelweiss, веб-сайт, поддерживаемый издателями книг и Big Book Search, который сопоставляет изображения обложки с Amazon. Новые источники обложек могут возвращать несколько обложек для одной книги, позволяя выбирать изображение, которое вам больше нравится.
sv: Många nya metadatakällor har lagts till, särskilt för att hitta bokomslag. Till exempel kan calibre nu göra en Google-bildsökning för att hitta omslag. Du kan aktivera de nya källorna genom att gå till <i>Inställningar-&gt;Metadatahämtning</i>. Andra nya källor inkluderar Edelweiss, en webbplats som underhålls av bokutgivare och Big Book Search som samlar omslagsbilder från Amazon. De nya omslagskällorna kan ge flera omslag för en enda bok, så att du kan välja och välja den bild du gillar bäst.
zh_tw: 添加了许多新的元数据源，特别是用于查找书籍封面的元数据源。例如，calibre 现在可以通过谷歌图片搜索来查找封面。可以通过转到 <i>首选项-&gt;元数据下载</i>来启用新源。其他新源包括由图书出版商维护的Edelweiss网站和整理亚马逊封面图片的Big Book Search。新的封面来源可以为一本书返回多个封面，允许用户选择最喜欢的图像。

source: The new cover download sources in action
nl: De nieuwe omslag download bronnen in actie
pt: O novo sistema de fontes para descarregamento de capas em ação
ru: Новые источники загрузки обложек в действии
sv: Den nya omslagetshämtningskällorna i handling
zh_tw: 新的封面下载源正在运行

source: The Metadata download configuration dialog
nl: De Metadata download configuratie dialoog
pt: O diálogo de configuração do descarregamento de metadados
ru: Окно настройки загрузки метаданных
sv: Dialogrutan konfiguration av metadatahämtning
zh_tw: 元数据下载配置对话框

source: Full support for font embedding
nl: Volle ondersteuning voor lettertype inbedden
pt: Suporte integral a tipos de letra embebidos
ru: Полная поддержка встраивания шрифтов
sv: Fullt stöd för teckensnitts inbäddning
zh_tw: 全面支持字体嵌入

source: calibre's conversion engine now has full support for font embedding. It can scan your computer for all TrueType and OpenType fonts referenced in the document being converted and automatically embed them (provided the output format supports embedded fonts, of course). This can be turned on via the <i>Look &amp; feel</i> section of the conversion dialog.
nl: calibre's conversie engine heeft nu volledige ondersteuning voor insluiten van lettertypes. Hij kan uw computer scannen voor alle TrueType en OpenType lettertypes in het document in conversie en deze automatisch insluiten (indien het output formaat fonts insluiten ondersteunt natuurlijk). Dit kan u aanzetten via de <i>Uitstralin &amp; gevoel</i> sectie van de conversie dialoog.
pt: O mecanismo de conversão do calibre agora possui suporte completo para incorporação de fontes. Ele pode escanear seu computador buscando todas as fontes TrueType e OpenType referenciadas no documento sendo convertido e automaticamente incorporá-las (desde que o formato de saída suporte fontes incorporadas, claro). Isto pode ser ativado através da seção <i>Aparência</i> do diálogo de conversão.
ru: Механизм преобразования calibre теперь имеет полную поддержку встраивания шрифтов. Он может сканировать ваш компьютер чтобы найти TrueType и OpenType шрифты, на которые есть ссылки в конвертируемом документе, и автоматически встраивать их (при условии, что выходной формат поддерживает встроенные шрифты) Это можно включить через раздел <i>Look &amp; feel</i> диалога конвертирования.
sv: calibres konverteringsmotor har nu fullt stöd för inbäddning av teckensnitt. Den kan skanna din dator efter alla TrueType- och OpenType-teckensnitt som refereras till i dokumentet som konverteras och automatiskt bädda in dem (förutsatt att utmatningsformatet stöder inbäddade teckensnitt, naturligtvis). Detta kan aktiveras via avsnittet <i>Utseende & känsla</i> i konverteringsdialogrutan.
zh_tw: calibre的转换引擎现在完全支持字体嵌入。 它可以扫描您的计算机，查找文档中引用的所有TrueType和OpenType字体，并自动嵌入它们（当然，前提是输出格式支持嵌入式字体）。 可以通过“转换”对话框的<i>“外观”</i>部分打开此功能。

source: The conversion engine can also subset fonts, that is, reduce them to contain only the glyphs for characters actually present in the document being converted. This can greatly reduce the size of the font files.
nl: De conversie engine kan ook lettertype subsets maken, dat is, ze verkleinen zodat ze enkel de tekens bevatten effectief aanwezig zijn in het document in conversie. Dit kan de grootte van lettertype bestanden wezenlijk verkleinen.
pt: O mecanismo de conversão também pode criar subconjuntos de fontes, ou seja, reduz-as para conter apenas os glifos para os caracteres presentes no documento sendo convertido. Isto pode reduzir muito o tamanho dos arquivos de fonte.
ru: Механизм конвертации также может усекать шрифты, то есть уменьшить так, что они будут содержать только глифы для символов, фактически присутствующих в конвертируемом документе. Это может значительно уменьшить размер файлов шрифтов.
sv: Konverteringsmotorn kan också undergruppera teckensnitt, det vill säga minska dem till att endast innehålla glyfer för tecken som faktiskt finns i dokumentet som konverteras. Detta kan kraftigt minska storleken på teckensnittsfilerna.
zh_tw: 转换引擎还可以子集字体，即减少字体以仅包含要转换的文档中实际存在的字符的字形。 这可以大大减小字体文件的大小。

source: An easy to use tool to edit the Table of Contents in e-books
nl: Een gemakkelijk te gebruiken tool om de Inhoudstafel in e-boeken te bewerken
pt: Uma ferramenta fácil de utilizar para editar o índice nos livros
ru: Простой инструмент редактирования оглавления электронных книг
sv: Ett lättanvänt verktyg för att redigera innehållsförteckningen i e-böcker
zh_tw: 一个易于使用的工具来编辑电子书中的目录

source: Using the new <i>Edit ToC</i> tool, you can easily re-arrange the entries in an existing Table of Contents, change their text and even change the location they point to by simply clicking the new location in the book. To use this tool, go to <i>Preferences-&gt;Toolbars and menus</i> and add the Edit ToC tool to the main toolbar. Then simply select the books you want to be polished and click the <i>Edit ToC</i> button.
nl: Met het nieuwe <i>ToC Bewerken</i> gereedschap kan u gemakkelijk items herschikken in een bestaande ToC, hun tekst aanpassen en zelfs de locatie war ze naar wijzen aanpassen door enkel op de nieuwe locatie in het boek te klikken. Om dit gereedschap te gebruiken, ga naar <i>Voorkeuren-&gt;Werkbalken en menu's</i> en voeg het ToC Bewerken gereedschap toe aan de hoofdwerkbalk. Kies dan gewoon de boeken die u wil poetsen en klik op de <i>ToC Bewerken</i> knop.
pt: Usando a nova ferramenta <i>Editar Índice</i>, você pode facilmente rearranjar as entradas em um Índice existente, mudar seu texto ou mesmo alterar o destino para o qual apontam simplesmente clicando no novo destino no livro. Para usar esta ferramenta, vá em <i>Preferências-&gt;Barras de Ferramentas & menus</i> e adicione a ferramenta à barra de ferramentas principal. Então selecione os livros que você deseja polir e clique no botão <i>Editar Índice</i>.
ru: Используя новый инструмент <i>Edit ToC</i>, вы можете легко изменить порядок записей в существующем оглавлении, изменить их текст и даже изменить место, на которое они указывают, просто щелкнув на новом месте в книге. Чтобы использовать этот инструмент, перейдите в <i>Preferences-&gt;Toolbar</i> и добавьте инструмент Редактировать ToC на главную панель инструментов. Затем просто выберите книги, которые вы хотите отполировать и нажмите кнопку <i>Edit ToC</i>.
sv: Med det nya verktyget <i>Redigera innehållsförteckning</i> kan du enkelt ordna om posterna i en befintlig innehållsförteckning, ändra deras text och till och med ändra platsen de hänvisar till genom att helt enkelt klicka på den nya platsen i boken. För att använda det här verktyget, gå till <i>Inställningar-&gt;Verktygsfält och menyer</i> och lägg till verktyget Redigera innehållsförteckning i huvudverktygsfältet. Välj sedan de böcker du vill polera och klicka på knappen <i>Redigera innehållsförteckning</i>.
zh_tw: 使用新的<i>“编辑目录”</i>工具，您可以轻松地重新排列现有目录中的条目，更改其文本，甚至只需单击图书中的新位置即可更改它们所指向的位置。 要使用此工具，请转到<i>“首选项->工具栏和菜单"</i>，并将“编辑目录”工具添加到主工具栏中。 然后，只需选择要美化的图书，然后单击<i>“编辑目录”</i>按钮即可。

source: The Edit ToC tool
nl: Het Bewerk ToC gereedschap
pt: A ferramenta de edição do índice
ru: Инструмент редактирования оглавления
sv: Verktyget Redigera innehållsförteckning
zh_tw: 目录编辑工具

source: Editing individual entries
nl: Individuele items bewerken
pt: Editar entradas individuais
ru: Редактирование отдельных записей
sv: Redigera enskilda poster
zh_tw: 编辑单个条目

source: Choosing a location inside the book
nl: Een plek in het boek vinden
pt: Escolher uma localização dentro do livro
ru: Выбор места внутри книги
sv: Välja en plats i boken
zh_tw: 选择书内的位置

source: Rewritten PDF Output engine
nl: Herschreven PDF Output engine
pt: Mecanismo de saída PDF reescrito
ru: Переписан движок вывода PDF
sv: Omskriven PDF-utgångsmotor
zh_tw: 重写的PDF输出引擎

source: The PDF Output engine in calibre was completely re-written. The new engine supports proper pagination, inserting headers and footers with templates, auto-generation of a printable Table of Contents and many other features. See <a href="%(pdf)s">Converting to PDF</a> for details.
nl: De PDF Output engine in calibre is volledig herschreven. De nieuwe engine ondersteunt echte paginering, headers en footers invoegen met sjablonen, auto-generatie van een afdrukbare Table of Contents en veel andere functies. Kijk op <a href="%(pdf)s">Converteren naar PDF</a> voor details.
pt: O mecanismo de saída PDF do calibre foi completamente reescrito. O novo mecanismo suporta paginação apropriada, inserção de cabeçalhos e rodapés com modelos, geração automatica do Índice imprimível e muitas outras funções. Veja <a href="%(pdf)s">Convertendo para PDF</a> para detalhes.
ru: Механизм вывода PDF в calibre был полностью переписан. Новый движок поддерживает правильную нумерацию страниц, вставку заголовков и нижние колонтитулы с шаблонами, автоматическую генерацию оглавления для печати и многие другие функции. См. <a href="%(pdf)s">Преобразование в PDF</a> для деталей.
sv: PDF-utmatningsmotorn i calibre skrevs om helt och hållet. Den nya motorn stöder rätt sidnumrering, infoga sidhuvuden och sidfötter med mallar, automatisk skapande av en utskrivbar innehållsförteckning och många andra funktioner. Se <a href="%(pdf)s">Konvertera till PDF</a> för detaljer.
zh_tw: Calibre中的“PDF输出引擎”被完全重写。 新的引擎支持正确的分页、使用模板插入页眉和页脚、自动生成可打印的目录以及许多其他功能。 有关详细信息，请参阅<a href="%(pdf)s">转换为PDF</a>。

source: New tool: "Polish books" that allows you to perform various automated cleanup actions on e-books
nl: Nieuw gereedschap: "Boeken poetsen" dat u toelaat verschillende schoonmaakacties uit te voeren op e-boeken
pt: Nova ferramenta: "Polir livros" que permite que você realize várias ações de limpeza automatizada em e-books
ru: Новый инструмент «Полировка книг», позволяющий выполнять различные действия по автоматической очистке электронных книг
sv: Nytt verktyg: "Polera böcker" som låter dig utföra olika automatiserade saneringsåtgärder på e-böcker
zh_tw: 新工具：“美化图书”，允许您对电子书执行各种自动清理操作

source: Polishing books is all about putting the shine of perfection on your e-book files. You can use it to embed referenced fonts, subset embedded fonts, smarten punctuation, update the metadata in the book files from the metadata in the calibre library, manipulate the book jacket, etc. To use this tool, go to <i>Preferences-&gt;Toolbars and menus</i> and add the Polish books tool to the main toolbar. Then simply select the books you want to be polished and click the Polish books button. Polishing, unlike conversion, does not change the internal structure/markup of your book, it performs only the minimal set of actions needed to achieve its goals. Note that book polishing only works in e-books in the EPUB and AZW3 formats.
nl: Boeken poetsen gaat helemaal over uw e-boek bestanden de glans van perfectie geven. U kan het gebruiken om naar verwezen lettertypes in te sluiten, subsets maken van ingesloten lettertypes, interpunctie opleuken, metadata updaten in de boek bestanden vanuit de metadata in de calibre bibliotheek, het boek omslag manipuleren, enz. Om dit gereedschap te gebruiken, ga naar <i>Voorkeuren-&gt;Werkbalken en menu's</i> en voeg het Poets boeken gereedschap toe aan de hoofdwerkbalk. Selecteer dan de boeken die u gepoetst wilt hebben en klik op de Poets boeken knop. Poetsen, in tegenstelling tot conversie, verandert de interne structuur/markup van uw boek niet, het voert enkel de minimale set acties uit, nodig om z'n doel te bereiken. Merk op dat poetsen enkel werkt op boeken in de EPUB en AZW3 formaten.
pt: Polir livros é sobre colocar o brilho da perfeição nos seus e-books. Você pode usá-lo para incorporar fontes referenciadas, criar subconjuntos de fontes, pontuação inteligente, atualizar metadados nos arquivos de livros a partir dos metadados na biblioteca do calibre, manipular a capa do livro, etc. Para usar esta ferramenta, vá em <i>Preferências-&gt;Barra de Ferramentas e menus</i> e adicione a ferramenta Polir Livros à barra de ferramentas principal. Então selecione os livros que você deseja polir e clique no botão Polir Livros. Polir, diferente de converter, não altera a estrutura/marcação interna do seu livro, apenas realiza o menor conjunto de ações necessárias para atingir seus objetivos. Note que o polimento de livros somente funciona com e-books nos formatos EPUB e AZW3.
ru: Полировка книг - всё то, что придаёт блеск совершенству ваших файлов электронных книг. Вы можете использовать его для встраивания ссылочных шрифтов, подмножества встроенных шрифтов, умной пунктуации, обновления метаданных в файлах книг из метаданных в библиотеке calibre, манипулирования обложками и т. д. Чтобы использовать этот инструмент, перейдите в <i>Настройки-Панель инструментов</i> и добавьте инструмент Полировка книг в Основную панель инструментов. Затем просто выберите книги, которые вы хотите отполировать и нажмите кнопку Отполировать книги. Полировка в отличие от конвертации, не меняет внутреннюю структуру/разметку вашей книги, она выполняет только минимальный набор действий, необходимых для достижения цели. Обратите внимание, что Полировка книг работает только в электронных книгах EPUB и AZW3.
sv: Polering av böcker handlar om att sätta glansen av perfektion på dina e-bokfiler. Du kan använda den för att bädda in refererade teckensnitt, delmängd inbäddade teckensnitt, smarta skiljetecken, uppdatera metadata i bokfilerna från metadata i calibre-biblioteket, manipulera bokomslaget o.s.v. För att använda detta verktyg går du till <i>Inställningar-&gt;Verktygsfält & menyer</i> och lägger till verktyget Polera böcker till huvudverktygsfältet. Välj sedan helt enkelt de böcker du vill polera och klicka på knappen Polera böcker. Polering, till skillnad från konvertering, ändrar inte den interna strukturen/markeringen av din bok, den utför endast den minimala uppsättning åtgärder som behövs för att uppnå sina mål. Observera att polering av böcker endast fungerar i e-böcker av formaten EPUB- och AZW3.
zh_tw: “美化书籍”就是让你的电子书文件焕发出完美的光芒。 您可以使用它嵌入引用的字体、嵌入字体的子集、智能标点符号、从Calibre书库中的元数据更新图书文件中的元数据、操作图书封套等。 要使用此工具，请转到<i>“首选项->工具栏和菜单”</i>并将“美化图书”工具添加到主工具栏中。 然后，只需选择要美化的图书，然后单击“美化图书”按钮即可。 与转换不同，美化不会更改图书的内部结构/标记，它只执行达到其目标所需的最小操作集。 请注意，图书美化仅适用于 EPUB 和 AZW3 格式的电子书。

source: Note that many of these features were actually introduced during the lifetime of the 0.9.x series. This document describes new features as compared to 0.9.0
nl: Merk op dat veel van deze eigenschappen eigenlijk geïntroduceerd waren tijdens het leven van de 0.9.x series. Dit document beschrijft nieuwe eigenschappen vergeleken met 0.9.0
pt: Note que muitas dessa funções foram de fato introduzidas durante o ciclo de vida da série 0.9.x. Este documento descreve novas funções comparadas à versão 0.9.0
ru: Обратите внимание, что многие из перечисленных функций фактически вводились в течение всего срока жизни серии 0.9.x. Этот документ описывает новые возможности по сравнению с версией 0.9.0.
sv: Observera att många av dessa funktioner faktiskt introducerades under 0.9.x-serien. I det här dokumentet beskrivs nya funktioner jämfört med 0.9.0
zh_tw: 请注意，其中许多功能实际上是在 0.9.x 系列的生命周期中引入的。本文档介绍了与 0.9.0 相比的新功能。

source: New in calibre 3.0
nl: Nieuw in calibre 3.0
pt: Novo no Calibre 3.0
ru: Новое в calibre 3.0
sv: Nytt i calibre 3.0
zh_tw: Calibre 3.0 中的新功能

source: Welcome back, calibre users. It has been almost three years since calibre 2.0. In that time lots has happened. The biggest new feature, which was in development for almost that entire period, is a completely re-written calibre <i>Content server</i>.
nl: Welkom terug, calibre gebruikers. Het is bijna drie jaar sinds calibre 2.0. Er is veel gebeurd in die tijd. Het belangrijkste nieuwe eigenschap, in ontwikkeling voor bijna de gehele periode, is een volledig herschreven calibre <i>Content server</i>.
pt: Bem-vindos de volta, usuários do calibre. Foram quase três anos desde o calibre 2.0. Nesse período muita coisa aconteceu. A maior novidade, a qual esteve em desenvolvimento durante quase todo esse período, é um <i>Servidor de Conteúdo</i> completamente reescrito.
ru: И снова здравствуйте, пользователи calibre. Прошло почти три года с выхода версии 2.0. За это время многое произошло. Самое большое нововведение, занявшее практически всё упомянутое время, — полностью переписанный <i>контент-сервер</i> calibre.
sv: Välkommen tillbaka calibre-användare. Det har varit nästan tre år sedan calibre 2.0. Under den tiden har mycket hänt. Den största nya funktionen, som var i utveckling för nästan hela perioden, är en helt omskriven calibre- <i>innehållsserver</i>.
zh_tw: 欢迎回来，calibre的用户。 自2.0版本calibre发布以来已经快三年了。 在那段时间里发生了很多事情。在 几乎整个过程中始终开发的最大新功能， 是完全重写的<i>calibre内容服务器</i>。

source: The Content server allows you to wirelessly browse your calibre books on any modern phone/tablet and even read the books right in your phone browser. The books are stored in off-line storage on the phone so you do not have to keep calibre running or have an always on internet connection to read the books.
nl: De Content server laat u draadloos door uw calibre boeken bladeren op elke moderne telefoon/tablet en zelfs boeken lezen rechtstreeks in uw telefoon browser. De boeken zijn off-line opgeslagen op uw telefoon zodat u calibre niet steeds moet gebruiken of altijd on-line moet zijn om de boeken te lezen.
pt: O Servidor de Conteúdo permite que você navegue sem fios a sua biblioteca do calibre em qualquer telefone/tablet moderno e até mesmo ler os livros diretamente no navegador. Os livros são armazenados de forma off-line no telefone, de forma que você não precise manter o calibre rodando ou ter uma conexão sempre on-line para ler os livros.
ru: Контент-сервер позволяет вам без проводов просматривать книги calibre на любом современном телефоне/планшете и даже читать книги прямо в браузере телефона. Книги хранятся в автономном хранилище на телефоне, поэтому вам не нужно держать calibre запущенным или всегда подключаться к Интернету, чтобы читать книги.
sv: Innehållsservern låter dig trådlöst bläddra bland dina calibre-böcker på vilken modern telefon/surfplatta som helst och till och med läsa böckerna direkt i telefonens webbläsare. Böckerna lagras i frånkopplad lagring på telefonen så att du inte behöver hålla calibre igång eller ha en internetanslutning för att läsa böckerna.
zh_tw: “内容服务器”允许您在任何现代手机/平板电脑上无线浏览 您calibre的图书，甚至可以直接在您的手机浏览器中 阅读图书。这些书离线存储在手机上，因此您不必保持 Calibre运行或始终在线互联网连接就可以阅读这些书。

source: The new Content server
nl: De nieuwe Content server
pt: Novo servidor de conteúdos
ru: Новый контент-сервер
sv: Den nya innehållsservern
zh_tw: 新的内容服务器

source: You can start the Content server by clicking the Connect/share button in calibre. Then just open up a browser and type <code>http://localhost:8080</code> in the address bar. You will see a list of calibre libraries. Click on one and browse the books. Click on a book and you will have the option to read or download it. To learn more about using the server to read on your devices, see the <a href="%(server)s">User Manual</a>.
nl: U kan de Content server starten door te klikken op de Verbind/deel knop in calibre. Open dan gewoon een browser en type <code>http://localhost:8080</code> in de adresbalk. U zal een lijst zien met calibre bibliotheken. Klik op een en blader door de boeken. Klik op een boek en u heeft de optie om het te lezen of te downloaden. Om meer te weten te komen over het gebruik van de server om op uw toestel, te lezen, bekijk de <a href="%(server)s">Handleiding</a>.
pt: Você pode iniciar o Servidor de Conteúdo clicando no botão Conectar/compartilhar no calibre. Então apenas abra um navegador e digite <code>http://localhost:8080</code> na barra de endereços. Você verá uma lista de bibliotecas do calibre. Clique em uma e navegue pelos livros. Clique em um livro e você terá a opção de ler ou baixá-lo. Para aprender mais sobre a utilização do servidor para ler no seus dispositivos, veja o <a href="%(server)s">Manual do Usuário</a>.
ru: Вы можете запустить контент-сервер, нажав кнопку Подключиться/поделиться в calibre. Затем просто откройте браузер и введите <code>http://localhost:8080</code> в адресной строке. Вы увидите список библиотек calibre. Нажмите на одну и просмотрите книги. Нажмите на книгу, и у вас будет возможность прочитать или скачать её. Чтобы узнать больше об использовании сервера для чтения на ваших устройствах, см. <a href="%(server)s">Руководство пользователя</a>.
sv: Du kan starta innehållsservern genom att klicka på knappen Anslut/dela i calibre. Sedan är det bara att öppna en webbläsare och skriv<code>http://localhost:8080</code> i adressfältet. Du får se en lista över calibre-bibliotek. Klicka på en och bläddra i böckerna. Klicka på en bok och du får möjlighet att läsa eller hämta den Läs mer om hur du använder servern för att läsa på dina enheter, se <a href="%(server)s">användarmanualen</a>.
zh_tw: 您可以通过单击Calibre中的“链接/分享”按钮启动“内容服务器”。 然后只需打开浏览器，在地址栏中键入 <code>http://localhost:8080</code>即可。 您将看到Calibre书库的列表。单击其中一个并浏览图书。 点击一本书，您可以选择阅读或下载它。 要了解有关使用服务器在设备上 进行读取的更多信息，请参阅<a href="%(server)s">用户手册</a>。
