Repository: debian-calibre/calibre
Catalog: translations-git/website/*.po
Languages: nl, pt, ru, sv, zh_tw

source: calibre also has a new "Wireless device driver" that allows connecting to your Android device wirelessly, in exactly the same was as if it was plugged in via USB. To use it with an Android device, you need the <a href="%(cc)s" alt="%(cn)s">%(cn)s</a> Android app.
nl: calibre heeft ook een nieuwe "Draadloos toestel driver" die toelaat om draadloos met uw Android toestel te verbinden, op juist dezelfde manier alsof het was ingeplugd via USB. Om het te gebruiken met een Android toestel, hebt u de <a href="%(cc)s" alt="%(cn)s">%(cn)s</a> Android app nodig.
pt: O Calibre tem ainda um novo "Driver de dispositivo sem fios" que permite ligar, sem fios, ao seu dispositivo Android tal como se estivesse ligado pro USB. Para o usar com um dispositivo Android terá de instalar esta aplicação Android:<a href="%(cc)s" alt="%(cn)s">%(cn)s</a>.
ru: У calibre также имеется новый «Драйвер беспроводного устройства», который позволяет подключение к вашему устройству Android по беспроводной сети, точно так же как будто оно было подключено через USB. Чтобы использовать его с Android устройством, вам нужно <a href="%(cc)s" alt="%(cn)s">%(cn)s</a> Android-приложение.
sv: calibre har också en ny "Trådlös enhetsdrivrutin" som tillåter anslutning till din Android-enhet trådlöst, på exakt samma vis som om den var ansluten via USB. Att använda den med en Android- enhet, behöver du <a href="%(cc)s" alt="%(cn)s">%(cn)s</a> Android-appen.
zh_tw: Calibre还有一个新的“无线设备驱动程序”， 可以无线连接到你的 Android 设备，就像 通过 USB 插头连接一样。要在 Android 设备上 使用它，您需要<a href="%(cc)s" alt="%(cn)s">%(cn)s</a> Android 应用程序。

source: For details see <a href="%(man)s">here</a>.
nl: Voor details kijk <a href="%(man)s">hier</a>.
pt: Para detalhes, ver <a href="%(man)s">aqui</a>.
ru: Подробнее <a href="%(man)s">здесь</a>.
sv: För detaljer se <a href="%(man)s">här</a>.
zh_tw: 詳細資訊請點這裡<a href="%(man)s">這裡</a>，

source: calibre connected to a Nexus 7 tablet over USB
nl: calibre verbonden met een Nexus 7 tablet over USB
pt: Calibre ligado por USB a um tablet Nexus 7
ru: calibre подключена к Nexus 7 по USB
sv: calibre ansluten till en Nexus 7-surfplatta över USB
zh_tw: calibre 已使用 USB 連線至 Nexus 7

source: The Calibre Companion application running on an Android Phone
nl: De Calibre Companion app die op een Android telefoon loopt
pt: A aplicação Calibre Companion em execução num telemóvel Android
ru: Приложение «Calibre Companion» работает на телефоне с Android
sv: Programmet Calibre Companion körs på en Android-telefon
zh_tw: 在Android手机上运行的 Calibre Companion 应用程序

source: New "modern" look
nl: Nieuwe "moderne" look
pt: Visual moderno
ru: Новый «современный» вид
sv: Nytt "modernt" utseende
zh_tw: 新「現代」外觀

source: The calibre user interface has a new "modern" look. This change gives a more 'modern' feel to the interface with focus highlighting, gradients, rounded corners, etc.
nl: De calibre gebruikersinterface heeft een nieuwe "moderne" look. Deze verandering geeft een meer 'modern'gevoel aan de interface met focus highlighting, gradients, afgeronde hoeken corners, enz.
pt: A interface do usuário do calibre tem um novo visual "moderno". Esta alteração dá uma aparência mais 'moderna' para a interface com destaque de foco, gradientes, cantos arredondados, etc.
ru: Пользовательский интерфейс calibre получил новый «современный» вид. Это изменение придаёт интерфейсу более «модный» вид с акцентом на подсветку, градиенты, скруглённые углы и т. п.
sv: Användargränssnittet för calibre har ett nytt "modernt" utseende. Denna förändring ger gränssnittet en mer "modern" känsla med fokus på markering, lutningar, rundade hörn o.s.v.
zh_tw: calibre 用户界面拥有全新的“现代”外观。这一变化给人一种更“现代”的感觉，例如：有焦点的界面。突出显示、渐变、圆角等。

source: The main calibre window with the new look
nl: Het calibre hoofdvenster met de nieuwe look
pt: A janela principal do Calibre com o novo visual
ru: Новый вид главного окна calibre
sv: Huvudfönstret för calibre med det nya utseendet
zh_tw: 具有新外观的主窗口

source: The Edit metadata dialog with the new look
nl: De Bewerk metadata dialoog met de nieuwe look
pt: A janela de edição de metadados com o novo visual
ru: Новый вид диалога «Редактирование метаданных»
sv: Dialogrutan Redigera metadata med det nya utseendet
zh_tw: 具有新外观的“编辑元数据”对话框

source: calibre Portable
nl: calibre Draagbaar
pt: Calibre Portátil
ru: Переносимая версия calibre
zh_tw: calibre 可攜式版

source: calibre Portable is a new type of calibre install that keeps the calibre library and settings together with the calibre program. This means that you can put the entire thing on a USB stick and carry it around with you. Or give the USB stick as a gift to someone special. Just plug the USB stick into any Windows computer and you have a fully functional calibre, with all your books and settings in place. See the <a href="%(portable)s">Download portable</a> page for details.
nl: calibre Draagbaar is een nieuw type calibre installatie die de calibre bibliotheek en instellingen samen houdt met het programma. Dit betekent dat u alles op een USB stick kan zetten en het meenemen. Of de USB stick als een cadeau aan die speciale persoon kan geven. Steek gewoon de USB stick in eerder welke Windows computer en u hebt een volledig functionele calibre, met al uw boeken en instellingen. Kijk op de <a href="%(portable)s">Download draagbaar</a> pagina voor details.
pt: O Calibre Portátil é um novo tipo de instalação de Calibre que mantém a biblioteca Calibre e as configurações juntas com o programa. Isto significa que você pode colocar tudo uma Pen e transportá-la consigo ou dar uma Pen USB de presente a alguém especial. Basta ligar a Pen em qualquer computador com Windows e terá um Calibre totalmente funcional, com todos os seus livros e configurações ativas. Para detalhes veja a página <a href="%(portable)s">Descarregar Calibre Portátil</a>.
ru: Переносимая версия — новый тип установки calibre, которая сохраняет библиотеку и настройки вместе с программой. Т. е. вы можете поместить всё это на флешку и повсюду брать с собой. Или подарить кому-нибудь особенному. Просто подсоедините USB-накопитель к любому компьютеру с Windows, и получите полнофункциональную calibre со всеми вашими книгами и настройками. Подробнее на странице <a href="%(portable)s">загрузки переносимой версии</a>.
sv: calibre Portable är en ny typ av calibre-installation som håller calibre-biblioteket och inställningarna tillsammans med calibre-programmet. Det betyder att du kan lägga hela saken på ett USB-minne och bära det med dig. Eller ge USB-minnet som en gåva till någon speciell. Anslut bara USB-minnet till vilken Windows-dator som helst och du har en fullt fungerande calibre med alla dina böcker och inställningar på plats. Se sidan <a href="%(portable)s">Hämta portable</a> för detaljer.
zh_tw: calibre便携版是一种新类型的calibre安装， 它将calibre书库和设置与calibre程序一起保存。 这意味着你可以把整个东西放在U盘上随身携带。 或者把U盘作为礼物送给特别的人。 只要把U盘插入任何一台Windows电脑， 你就拥有了一个功能齐全的calibre， 所有的图书和设置都准备好了。有关详细信息， 请参见<a href="%(portable)s">下载便携版</a>页面。

source: Conversion engine improvements
nl: Omzettingsengine verbeteringen
pt: Melhorias no mecanismo de conversão
ru: Улучшения движка преобразования
sv: Konverteringsmotorförbättringar
zh_tw: 转换引擎改进

source: calibre's conversion engine now has full support for Amazon's new KF8 format. It can convert KF8 books to other formats and convert other formats to KF8. To convert to KF8 set the output format in the calibre conversion dialog to AZW3.
nl: calibre's conversie-engine biedt nu volle ondersteuning voor het nieuwe KF8-formaat van Amazon. Het kan KF8-boeken naar andere formaten converteren en andere formaten naar KF8. Om te converteren naar KF8 stel het uitvoerformaat in het calibre conversiedialoogvenster in op AZW3.
pt: O mecanismo de conversão do calibre agora tem suporte completo para o novo formato KF8 da Amazon. Ele pode converter livros KF8 para outros formatos e converter outros formatos para KF8. Para converter para KF8, escolha o formato de saída no diálogo de conversão para AZW3.
ru: Теперь движок преобразования calibre полностью поддерживает новый формат Amazon — KF8. Он может преобразовывать KF8 книги в другие форматы и наоборот. Чтобы преобразовать в KF8 установите выходной формат AZW3 в диалоговом окне преобразования в calibre.
sv: calibres konverteringsmotor har nu fullt stöd för Amazons nya KF8-format. Det kan konvertera KF8 böcker till andra format och konvertera andra format till KF8. För att konvertera till KF8 ställ in utmatningsformatet i calibre-konverteringsdialogrutan till AZW3.
zh_tw: Calibre的转换引擎现在完全支持亚马逊的新KF8格式。 它可以将KF8格式图书转换为其他格式，也可以将其他格式转换为KF8。 要转换为KF8，请将Calibre转换对话框中的 输出格式设置为AZW3。

source: The PDF output produced by calibre has been greatly improved. There are no more cut off lines of text/images at the bottom of the page. Top and bottom margins are set correctly. The metadata Table of Contents is converted to PDF bookmarks in the output file.
nl: De door calibre geproduceerde PDF output is geweldig verbeterd. Er zijn geen afgekapte tekst/afbeelding regels meer op het einde van de pagina. Boven- en onderkant marges zijn juist. The metadata Inhoud Tabel is omgezet naar PDF bladwijzers in het output bestand.
pt: A saída PDF criada pelo calibre foi bastante aprimorada. Não há mais corte de linhas de texto/imagens na parte inferior da página. Margens superiores e inferiores são definidas corretamente. O Índice de metadados é convertido para marcadores PDF no arquivo de saída.
ru: Вывод PDF, производимый calibre, был значительно улучшен. Больше нет обрезанных строк текста/изображений внизу страницы. Верхнее и нижнее поля установливаются правильно. Метаданные оглавления преобразуются в закладки PDF в выходном файле.
sv: PDF-utmatning som producerats av calibre har förbättrats kraftigt. Det finns inte fler avskurna rader med text/bilder längst ner på sidan. Övre och undre marginaler är korrekt inställda. Metadatainnehållsförteckningen konverteras till PDF-bokmärken i utmatningsfilen.
zh_tw: 由Calibre生成的PDF输出有了很大的提高。 页面底部不再有截断的文本/图像行。 上边距和下边距设置正确。元数据目录 将转换为输出文件中的PDF书签。

source: Library management improvements
nl: Bibliotheekbeheer verbeteringen
pt: Melhorias na gestão da biblioteca
ru: Улучшения управления библиотекой
sv: Förbättringar av bibliotekshantering
zh_tw: 书库管理的改进

source: 0.9 brings lots of goodies to make managing your ever growing e-book collection easier:
nl: Massa's leuke dingen in 0.9 maken het gemakkelijker om uw steeds groeiende e-boekcollectie te beheren:
pt: A versão 0.9 inclui muitas melhorias para ajudar a gerir de forma mais fácil a sua cada vez maior biblioteca de ebooks:
ru: Версия 0.9 привнесла много вкусностей, упрощающих управление вашей постоянно растущей коллекцией электронных книг:
sv: 0.9 ger massor av godsaker för att hantera din ständigt växande e-boksamling lättare:
zh_tw: 0.9版本带来了许多好处，使管理不断增长的电子书藏书变得更加容易：

source: Automatic adding of books from a specified folder: calibre can now monitor a specified folder on your computer and automatically add any files it finds in that folder. Set it up via Preferences-&gt;Adding books-&gt;Automatic adding
nl: Automatisch toevoegen van boeken van een bepaalde map: calibre kan nu een specifieke map op uw pc in het oog houden en automatisch in die map gevonden bestanden toevoegen. Stel het in via Voorkeuren-&gt;Boeken toevoegen-&gt;Automatisch toevoegen
pt: Adição automática de livros de uma pasta específica: o calibre pode agora monitorar uma pasta específica no seu computador e automaticamente adicionar qualquer arquivo encontrado nesta pasta. Configure via Preferências-&gt;Adicionar livros-&gt;Adicionar automaticamente
ru: Автоматическое добавление книг из указанной папки: calibre теперь может отслеживать указанную папку на вашем компьютере и автоматически добавлять любые файлы, которые он находит в этой папке. Настройте это через Настройки-Добавление книг-Автоматическое добавление
sv: Automatisk tilläggning av böcker från en viss mapp: calibre kan nu övervaka en specifik mapp på din dator och automatiskt lägga till alla filer som den hittar i den mappen. Ställ in det via Inställningar-&gt;Lägga till böcker-&gt;Automatisk tilläggning
zh_tw: 自动添加指定文件夹中的书籍：Calibre 现在可以监控您计算机上的指定文件夹， 并自动添加在该文件夹中找到的任何文件。 通过在“首选项->添加图书->自动添加”进行设置

source: Allow the coloring of columns in the book list based on the book's metadata. See Preferences-&gt;Look &amp; feel-&gt;Column coloring
nl: Laat kolommen kleuren in de boekenlijst gebaseerd op de metadata van het boek. Kijk bij Voorkeuren-&gt;Uitstraling &amp; gevoel-&gt; Kolommen kleuren
pt: Permite a colorização de colunas na lista de livros baseada nos metadados do livro. Veja Preferências-&gt;Aparência-&gt;Colorização de colunas
ru: Разрешено окрашивание столбцов в списке книг на основе метаданных книги. См. «Параметры-&gt;Оформление-&gt;Расцветка столбцов»
sv: Tillåt färgläggning av kolumner i boklistan baserat på bokens metadata. Se Inställningar-&gt;Utseende &amp; känsla-&gt;Kolumnfärg
zh_tw: 允许基于图书元数据对图书列表中的列进行着色。 请参见“首选项->界面外观->列颜色”

source: When searching, allow use of un-accented characters to match accented characters. The rules for matching un-accented characters are done in a language dependent way. So if your calibre interface language is set to English, n will match both n and ñ, but if it is set to Spanish, it will match only n, as in Spanish ñ are separate letters.
nl: Bij zoeken, sta het gebruik van tekens zonder accenten toe om tekens met accenten te matchen. De regels voor het matchen van tekens zonder accent worden op een taalafhankelijke manier gedaan. Dus als uw calibre interfacetaal is ingesteld op Engels, komt n zowel overeen met n als ñ, maar als het is ingesteld op Spaans, komt het alleen overeen met n, omdat in het Spaans ñ een afzonderlijk karakter is.
pt: Ao pesquisar, permite o uso de caracteres não acentuados para corresponderem a caracteres acentuados. As regras para correspondência de caracteres não acentuados são feitas de uma forma dependente do idioma. Assim, se o idioma de sua interface do Calibre estiver em inglês, n irá corresponder tanto a n como ñ, mas se estiver em espanhol, irá corresponder apenas a n, uma vez que em espanhol o ñ é uma letra distinta no alfabeto.
ru: При поиске разрешите использование символов без диакритических знаков для совпадения с диакритическими символами. Правила сопоставления безакцентных символов зависят от установленного языка. Если язык интерфейса calibre - английский, n будет соответствовать и n и ñ, но если он - испанский, то соответствовать будет только n, так как в испанском это - отдельные буквы.
sv: När du söker, tillåt användningen av tecken utan accent att matcha accenttecken. Reglerna för matchning av tecken utan accent görs på ett språkberoende sätt. Så om ditt calibre- gränssnittsspråk är inställt på engelska kommer n att matcha båda n och ñ, men om det är inställd på spanska kommer det bara att matcha n, eftersom spanska ñ är en separat bokstav.
zh_tw: 搜索时，可以使用非重音字符来匹配重音字符。 匹配无重音字符的具体规则取决于语言。 因此，如果您把 calibre 界面语言设置为英语， n 将同时匹配 n 和 ñ，但若设置为西班牙语， 则只与 n 匹配，因为西班牙语中 ñ 是单独的一个字母。

source: A new "Languages" column to keep track of the book's language
nl: Een nieuwe "Talen" kolom om de taal van het boek bij te houden
pt: Uma nova coluna "Idiomas" para registar os idiomas dos livros
ru: Новый столбец «Языки» для учёта языка книг
sv: En ny "språk"-kolumn för att hålla reda på bokens språk
zh_tw: 一个新的“语言”栏目来跟踪这本书的语言

source: Speed improvements for large libraries.
nl: Snelheidsverbeteringen voor grote bibliotheken.
pt: Melhoria de velocidade para bibliotecas grandes.
ru: Улучшения быстродействия на больших библиотеках
sv: Hastighetsförbättringar för stora bibliotek.
zh_tw: 提高大型库的速度。

source: Coloring of the test in the book list
nl: Kleuren van de tekst in de boekenlijst
pt: Coloração do teste na lista de livros
ru: Тестирование расцветки в списке книг
sv: Färgning av testet i boklistan
zh_tw: 书目列表中测试的颜色

source: This is an appropriate time to throw out a big thank you to all the calibre developers who have contributed many of the major new features listed above. An incomplete list of contributors is available <a href="%(href)s" title="Contributors">here</a>.
nl: Dit is een geschikt moment voor een dikke dank u wel voor al de calibre developers die de meeste van de nieuwe eigenschappen hierboven hebben bijgedragen. Een onvolledige lijst van deelnemers is <a href="%(href)s" title="Contributors">hier</a> beschikbaar .
pt: Este é o momento apropriado para um grande agradecimento aos programadores em Calibre pela colaboração em muitas das grandes e novas funcionalidades acima listadas. Uma lista, incompleta, dos colaboradores está disponível <a href="%(href)s" title="Contributors">aqui</a>.
ru: Сейчас подходящее время сказать большое спасибо всем разработчикам calibre, которые внесли вклад во многие важные нововведения, перечисленные выше. Неполный список участников доступен <a href="%(href)s" title="Contributors">здесь</a>.
sv: Det här är ett lämpligt tillfälle att framföra ett stort tack till alla calibre-utvecklare som har bidragit med många av de omfattande nya funktionerna som anges ovan. En ofullständig lista över bidragsgivare finns <a href="%(href)s" title="Contributors">här</a>.
zh_tw: 在此，也要向贡献了上述大部分主要新功能的所有开发人员表示衷心的感谢。 <a href="%(href)s" title="Contributors">这里</a>有一份不完整的贡献者名单。

source: Note that many of these features were actually introduced during the lifetime of the 0.8.x series. This document describes new features as compared to 0.8.0
nl: Merk op dat veel van deze eigenschappen eigenlijk tijdens het leven van de 0.8.x series waren geïntroduceerd. Dit document beschrijft nieuwe eigenschappen vergeleken met 0.8.0
pt: Note que muitas dessa funções foram de fato introduzidas durante o ciclo de vida da série 0.8.x. Este documento descreve novas funções comparadas à versão 0.8.0
ru: Обратите внимание, что многие из перечисленных функций фактически вводились в течение всего срока жизни серии 0.8.x. Этот документ описывает новые возможности по сравнению с версией 0.8.0.
sv: Observera att många av dessa funktioner faktiskt introducerades under livslängd av 0.8.x-serien. I det här dokumentet beskrivs nya funktioner jämfört med 0.8.0
zh_tw: 请注意，其中许多功能实际上是在 0.8.x 系列的生命周期中引入的。本文档介绍了与 0.8.0 相比的新功能。

source: New in calibre 0.7
nl: Nieuw in calibre 0.7
pt: Novo no Calibre 0.7
ru: Новое в calibre 0.7
sv: Nytt i calibre 0.7
zh_tw: calibre 0.7 裡面的新東西

source: It has been nearly a year since calibre 0.6.0 was released and calibre has come a long way since then. calibre has always been amazingly flexible. 0.6 was all about bringing that flexibility to the conversion engine and device support. Today calibre supports conversion from/to dozens of formats and can connect to scores of devices. The focus of 0.7 is bringing that same flexibility to the calibre User interface.
nl: Het is bijna een jaar geleden dat caliber 0.6.0 werd uitgebracht en caliber heeft sindsdien een lange weg afgelegd. calibre is altijd verbazingwekkend flexibel geweest. 0.6 ging helemaal over het brengen van die flexibiliteit naar de conversie engine en toestelondersteuning. Tegenwoordig ondersteunt calibre conversie van/naar tientallen formaten en kan verbinding maken met tal van apparaten. De focus van 0.7 is om diezelfde flexibiliteit naar de calibre User interface te brengen.
pt: Faz quase um ano desde o lançamento da versão 0.6.0 e o calibre mudou bastante nesse período. O calibre sempre foi extremamente flexível. A versão 0.6 focou em trazer essa flexibilidade para o mecanismo de conversão e suporte a dispositivos. Hoje o calibre consegue converter de/para dúzias de formatos e pode se conectar a vários dispositivos. O foco da versão 0.7 é trazer essa mesma flexibilidade para a Interface do Usuário do calibre.
ru: Прошел почти год с момента выпуска calibre 0.6.0 и calibre прошел долгий путь с тех пор. calibre всегда был удивительно гибким. В версии 0.6 речь шла об обеспечении этой гибкости для движка конвертации и поддержки устройств. Сегодня calibre поддерживает преобразование из/в десятки форматов и может подключаться к десяткам устройств. Фокус 0.7 - на привнесении той же гибкости в Пользовательский интерфейс.
sv: Det har varit nästan ett år sedan calibre 0.6.0 släpptes och calibre har kommit långt sedan dess. calibre har alltid varit otroligt flexibel. 0.6 handlade om att få den flexibiliteten till omvandlingsmotorn och enhetens stöd. Idag calibre stöder konvertering från/till dussintals format och kan ansluta till massor av enheter. Fokus på 0.7 är att ge samma flexibilitet till calibres användargränssnitt.
zh_tw: 从Calibre 0.6.0发布到现在已经将近一年了， 从那时起Calibre已经走过了很长一段路。Calibre的灵活性一直令人惊叹。 0.6版本完全是为了给转换引擎和设备支持带来灵活性。 时至今日，Calibre支持从/到数十种格式的转换，并可以连接数十种设备。 0.7版本的重点是为Calibre用户界面带来同样的灵活性。

source: To that end, users now have the ability to freely resize all the major user interface elements, add their own custom metadata to the book list, and add their own categories to the Tag browser.
nl: Daartoe hebben gebruikers nu de mogelijkheid om alle belangrijke elementen van de gebruikersinterface vrij te resizen, eigen aangepaste metadata toe te voegen aan de boekenlijst en hun eigen categorieën aan de Tag-browser.
pt: Para isso os utilizadores têm agora a possibilidade de redimensionar livremente todos os principais elementos da interface de utilizador, adicionar os seus próprios metadados à lista de livros e adicionar as suas categorias personalizadas ao navegador de etiquetas.
ru: Теперь пользователи имеют возможность свободно изменять размеры всех основных элементов пользовательских интерфейсов, добавлять свои собственные метаданные в список книг и добавлять свои собственные категории в Браузере тегов.
sv: För detta ändamål, användare har nu möjlighet att fritt ändra storlek på alla de största elementen i användargränssnittet, lägga till egna metadata i boklistan och lägga till egna kategorier i taggbläddraren.
zh_tw: 为此，用户现在可以自由调整所有主要用户界面元素的大小， 将他们自己的自定义元数据添加到图书列表，并将他们自己的类别 添加到“标记浏览器”。

source: Another major area of improvement is performance. Various parts of calibre have seen optimization and caching improvements. Startup times and large library performance have been dramatically improved. With a library of ten thousand books, you will see an improvement of between 10 and a 100 times in the speed of startup and common operations like editing metadata.
nl: Een andere belangrijke vooruitgang zijn de prestaties. Diverse onderdelen van calibre hebben betere optimalisatie en caching. De opstarttijden en prestaties van grote bibliotheken zijn drastisch verbeterd. Met een bibliotheek van tienduizend boeken zal u een verbetering van 10 tot 100 keer zien in de snelheid van opstarten en gewone bewerkingen zoals metadata bewerken .
pt: Outra área com grande melhoria foi a performance. Várias partes do calibre passaram por otimização e melhorias no cache. Tempos de inicialização e performance de grandes bibliotecas foram dramaticamente melhorados. Com uma biblioteca de dezenas de milhares de livros, você verá uma melhoria de 10 a 100 vezes na velocidade de inicialização e operações comuns como edição de metadados.
ru: Ещё одной важной областью улучшения является производительность. Различные части calibre видели оптимизацию и улучшение кеширования. Значительно улучшились время запуска и производительность библиотеки. С библиотекой из десяти тысяч книг вы увидите улучшение от 10 до 100 раз в скорости запуска и общих операций, например редактирование метаданных.
sv: Ett annat viktigt förbättringsområde är prestanda. Olika delar av calibre har sett optimering och förbättringar i cacheminnet. Starttider och prestanda för stora bibliotek har förbättrats dramatiskt. Med ett bibliotek på tio tusen böcker ser du en förbättring på mellan 10 och 100 gånger i starthastigheten och vanliga operationer som redigering av metadata.
zh_tw: 另一个主要的改进领域是性能。calibre的各个部分都看到了优化和缓存的改进。 启动时间和大型书库的性能都得到了显著的改进。 在拥有一万本书的书库中，您将看到启动速度和编辑元数据 等常见操作的速度提高了10到100倍。
