Repository: debian-calibre/calibre
Catalog: translations-git/website/*.po
Languages: nl, pt, ru, sv, zh_tw

source: There has been a lot of work on the calibre E-book viewer. It now supports <i>Highlighting</i>. The highlights can be colors, underlines, strikethrough, etc. and have added notes. All highlights can be both stored in EPUB files for easy sharing and centrally in the calibre library for easy browsing. Additionally, the E-book viewer now supports both vertical and right-to-left text.
nl: Er is een hoop gebeurd aan de calibre e-boek viewer. Hij ondersteunt nu <i>Highlighting</i>. De highlights kunnen kleuren, onderlijning, doorstreping, enz. zijn en hebben toegevoegde nota's. Alle highlights kunnen zowel in EPUB bestanden opgeslagen worden voor gemakkelijk delen als in de centrale calibre bibliotheek voor vlot bladeren. Bijkomend ondersteunt de e-boek viewer nu zowel verticale als rechts naar links tekst.
pt: Muito trabalho tem sido feito em relação ao Visualizador de ebooks. Ele agora suporta <i>Realces</i>. Os realces podem ser cores, sublinhados, riscados, etc. e podem ter notas. Todos os realces podem ser armazenados tanto nos ficheiros EPUB, para facilitar a partilha, como centralmente na biblioteca do Calibre, para facilitar a navegação. Adicionalmente, o Visualizador de ebooks agora suporta tanto escrita vertical como texto na direção direita-para-esquerda.
ru: Было проделано много работы над просмотрщиком электронных книг calibre. Теперь поддерживается <i>Выделение</i>. Типы выделения - цвет, подчеркивание, зачеркивание и т. д. и к ним м.б. добавлены примечания. Все выделения можно сохранить в файлы EPUB для удобного обмена и централизованно в библиотеке calibre для удобного просмотра. Кроме того, просмотрщик электронных книг теперь поддерживает вертикальный текст и текст с письмом справа налево.
sv: Det har gjorts en hel del arbete på calibres e-bokvisare. Den stöder nu <i>markeringar</i>. Markeringarna kan vara färger, understrykningar, genomstrykningar o.s.v. och det har lagts till anteckningar. Alla markeringar kan både lagras i EPUB-filer för enkel delning och centralt i calibre-biblioteket för enkel bläddring. Dessutom stöder e-bokvisaren nu både vertikal och höger-till-vänster-text.
zh_tw: 对于calibre电子书阅读器的工作已经进行了很多。它现在支持<i>高亮显示</i>。 突出显示可以是颜色、下划线、删除线等，并且已添加了注释。 所有亮点都可以存储在EPUB文件中以便于共享， 也可以集中存储在Calibre书库中以便于浏览。此外， 电子书阅读器现在既支持竖排文本，也支持从右向左的文本。

source: calibre has moved to using Python 3. This is because Python 2 was end-of-lifed this year. This should be completely transparent to calibre users, the only caveat being that some third party calibre plugins have not yet been ported to Python 3 and therefore will not work in calibre 5. For status on the various plugin ports, <a href="%(pp)s">see here</a>. This effort involved porting half-a-million lines of Python code and tens-of-thousands of lines of extension code to Python 3. This would not have been possible without the help of Eli Schwartz and Flaviu Tamas.
nl: calibre is verhuisd naar Python 3 omdat Python 2 dit jaar end-of-life is. Dit zou probleemloos moeten zijn voor calibre gebruikers met als enige caveat dat sommige derde partij plug-ins nog niet overgedragen zijn naar Python 3 en dus niet zullen werken in calibre 5. Voor een status van de verschillende plug-in overdrachten, <a href="%(pp)s">kijk hier</a>. Deze krachtsinspanning hield in: een half miljoen regels Python code en tienduizenden regels extensiecode overzetten naar Python 3. Dit zou niet mogelijk geweest zijn zonder de hulp van Eli Schwartz en Flaviu Tamas.
pt: O calibre migrou para utilização do Python 3. Isto ocorreu porque o Python 2 termina seu suporte no final deste ano. Isto deve ser completamente imperceptível para os usuários do calibre, sendo o único revés que alguns plugins de terceiros possam ainda não ter sido portados para o Python 3, e portanto não irão funcionar no calibre 5. Para um status dos vários plugins portados, <a href="%(pp)s">veja aqui</a>. Este esforço envolveu a modificação de meio milhão de linhas de código em Python, e dezenas de milhares de linhas extras de código para o Python 3. Isto não teria sido possível sem a ajuda de Eli Schwartz e Flaviu Tamas.
ru: calibre перешел на использование Python 3. Так как у Python 2 в этом году истёк срок службы. Это должно быть полностью прозрачно для пользователей calibre, единственное предостережение в том, что некоторые плагины сторонних производителей ещё не портированы на Python 3 и, следовательно, не будут работать в calibre 5. Статус портирования различных плагинов, <a href="%(pp)s">см. здесь</a>. Эти усилия включали перенос полумиллиона строк кода Python и десятков тысяч строк кода расширений на Python 3. Это было бы невозможно без помощи Эли Шварца и Флавиу Тамаса.
sv: calibre har uppdaterats till att använda Python 3. Detta beror på att Python 2 inte längre underhålls efter detta år. Detta borde vara helt transparent för calibre-användare, det enda förbehållet är att några tredjeparts calibre-insticksmoduler ännu inte har uppgraderats till Python 3 och därför inte fungerar i calibre 5. För status på de olika insticksmodulsuppdateringarna, <a href="%(pp)s">se här</a>. Denna ansträngning involverade att ändra en halv miljon rader Python-kod och tiotusentals rader tilläggskod till Python 3. Detta skulle inte ha varit möjligt utan hjälp av Eli Schwartz and Flaviu Tamas.
zh_tw: calibre已经转向使用python3。这是因为Python 2官方已于今年终止支持。 这对calibre用户应该是完全透明的，唯一需要注意的是 一些第三方calibre插件还没有移植到python3，因此在calibre5中无法工作。 有关各种插件端口的状态，<a href="%(pp)s">请参见此处</a>。 这项工作涉及将50万行Python代码和数万行扩展代码移植到Python3。 如果没有伊莱·施瓦茨(Eli Schwartz)和弗拉维乌·塔马斯(Flaviu Tamas) 的帮助，这是不可能的。

source: Highlighting in the E-book viewer
nl: Highlighting in de E-boek viewer
pt: Realces no visualizador de ebooks
ru: Выделения в читалке электронных книг
sv: Markera i e-bokvisaren
zh_tw: 在电子书阅读器中突出显示

source: You can now highlight text in the E-book viewer. Highlights can be created in many styles, with associated notes. By default, when highlighting EPUB books, the highlights are stored in the book file itself for easy sharing. They are also stored centrally in the calibre library and can be browsed using the <i>Browse annotations</i> tool that you can access by right clicking the <i>View</i> button.
nl: U kan nu tekst highlighten in de E-boek viewer. Highlights can be gecreëerd worden in vele stijlen, met bijgaande nota's. Standaard, bij highlightingen in EPUB boeken, worden de highlights opgeslagen in het boekbestand voor gemakkelijk delen. Ze worden ook centraa in de calibre bibliotheek opgeslagen en kunnen doorbladerd worden met het <i>Browse annotaties</i> gereedschap, toegankelijk via rechtsklikken op de <i>Tonen</i> knop.
pt: Você agora pode destacar texto no Visualizador de e-books. Destaques podem ser criados em muitos estilos, com notas associadas. Por padrão, ao destacar livros EPUB, os destaques são armazenados no arquivo do próprio livro, para facilitar o compartilhamento. Eles também são armazenados centralmente na biblioteca do calibre e podem ser explorados usando a ferramenta <i>Explorar anotações</i> que você pode acessar clicando com o botão direito no botão <i>Visualizar</i>.
ru: Теперь вы можете сохранять выделенный текст в читалке электронных книг. Выделения можно создавать в разных стилях, со связанными заметками. По умолчанию, созданные в EPUB-книгах выделения сохраняются в файле книги для облегчения обмена. Также они централизованно хранятся в библиотеке calibre, и их можно посмотреть с помощью инструмента <i>Просмотреть заметки</i>, доступного по правому щелчку на кнопке <i>Просмотр</i>.
sv: Du kan nu markera text i e-bokvisaren. Markeringarna kan skapas i många format, med tillhörande noteringar. Som standard, när du markerar EPUB-böcker, sparas markeringarna i själva bokfilen för enkel delning. De lagras också centralt i calibre-biblioteket och kan bläddras med verktyget <i>Bläddra bland noteringar</i> som du kan komma åt genom att högerklicka på knappen <i>Visa</i>.
zh_tw: 现在，您可以在电子书阅读器中突出显示文本。可以创建 多种样式的高亮显示以及关联的注释。默认情况下， 高亮显示EPUB书本时，高亮显示会存储在书本文件本身中， 以便于共享。它们还集中存储在calibre书库中，可以使用 浏览注释<i>工具进行浏览</i>，您可以通过右键单击 <i>查看</i>按钮来有权限访问该工具。

source: Highlights can be created by simply selecting text and clicking the <i>Highlight selection</i> button.
nl: Highlights kunnen gecreëerd worden door simpel selecteren van tekst en klikken op de <i>Highlight selectie</i> knop.
pt: Anotações podem ser criadas simplesmente selecionando o texto e clicando no botão </i>Realçar seleção</i>.
ru: Выделение можно создать, просто выделив текст и щелкнув <i>Выделить выбранное</i>кнопку.
sv: Markeringarna kan skapas genom att helt enkelt välja text och klicka på knappen <i>Markera vald text</i>
zh_tw: 只需选择文本并单击<i>高亮选择</i>按钮即 可创建高亮显示。

source: Highlighting even works using the in-browser viewer that is part of the calibre Content server. You can choose to have highlights created there sync automatically with highlights created in the calibre E-book viewer via a setting in the <i>Miscellaneous</i> section of the E-book viewer preferences.
nl: Highlighten werkt zelfs met de in-browser viewer, deel van de calibre Content server. U kan ervoor kiezen om daar gecreëerde highlights te auto-syncen met highlights gecreëerd in de calibre E-boek viewer via de instelling in de <i>Diversen</i> sectie van de e-boek viewer voorkeuren.
pt: Os destaques funcionam até mesmo no visualizador do navegador que é parte do Servidor de Conteúdo do calibre. Você pode escolher ativar a sincronização automática dos destaques criados lá com os destaques criados no Visualizador de e-books do calibre, via opção na seção <i>Extras</i> das preferências do Visualizador de e-books.
ru: Выделение работает даже при использовании просмотра в браузере, которое является частью calibre Content server. Вы можете выбрать автосинхронизацию выделений созданных там с выделениями, созданными в просмотрщике электронных книг через секцию настроек в <i>Разное</i> в просмотрщике электронных книг.
sv: Markeringar fungerar till och med med hjälp av visaren i webbläsaren som ingår i calibre-innehållsservern. Du kan välja att markeringar skapade där synkroniseras automatiskt med markeringar som skapats i e-bokvisaren via en inställning i avsnittet <i>Diverse</i> i e-bokvisarens inställningar.
zh_tw: "高亮显示"甚至可以使用作为Calibre内容服务器 一部分的浏览器内查看器来工作。您可以通过电子书 阅读器首选项的<i>其他杂项</i>部分中的设置， 选择使在那里创建的高亮显示与在Calibre电子书 阅读器中创建的高亮显示自动同步。

source: Selecting text to create a highlight
nl: Selecteer tekst om een highlight te creëren
pt: Selecionar texto para criar realce
ru: Указание текста для создания выделения
sv: Markera text för att skapa en markering
zh_tw: 选择文本以创建高亮显示

source: First
nl: Eerste
pt: Primeiro
ru: Первый
sv: Första
zh_tw: 第一

source: Creating a highlight
nl: Creëer een highlight
pt: A criar um realce
ru: Создание выделения
sv: Skapa en markering
zh_tw: 创建一个高亮显示

source: Second
nl: Tweede
pt: Segundo
ru: Второй
sv: Andra
zh_tw: 第二

source: Browsing highlights in a book
nl: Door highlights browsen in een boek
pt: A navegar em realces de um livro
ru: Просмотр выделенного в книге
sv: Bläddrar bland markeringar i en bok
zh_tw: 浏览一本图书中的突出显示

source: Third
nl: Derde
pt: Terceiro
ru: Третий
sv: Tredje
zh_tw: 第三

source: Browsing all annotations in an entire calibre library
nl: Door alle annotaties in een hele calibre bibliotheek browsen
pt: A navegar todas as anotações de uma biblioteca Calibre
ru: Просмотр заметок со всей библиотеки calibre
sv: Bläddrar bland alla noteringar i ett helt calibre-bibliotek
zh_tw: 浏览整个calibre书库中的所有批注

source: Fourth
nl: Vierde
pt: Quarto
ru: Четвёртый
sv: Fjärde
zh_tw: 第四

source: Dark mode support
nl: Donkere modus ondersteuning
pt: Suporte a modo escuro
ru: Поддержка тёмного режима
sv: Stöd för mörkt läge
zh_tw: 夜间模式支持

source: calibre now fully supports dark mode throughout, in the main interface, the E-book viewer, the E-book editor and even the Content server. On Windows and macOS dark mode is activated automatically based on operating system settings. On Linux you have to set the <code>CALIBRE_USE_DARK_PALETTE=1</code> environment variable.
nl: calibre ondersteunt nu volledig de donkere modus, in de hoofd interface, de e-boek viewer, de e-boek editor en zelfs de Content server. In Windows en macOS is donkere modus automatisch geactiveerd gebaseerd op OS instellingen. In Linux moet u de <code>CALIBRE_USE_DARK_PALETTE=1</code> omgevingsvariabele instellen.
pt: O Calibre suporta plenamente o modo escuro no interface principal, no visualizador de ebooks, no editor de ebooks e até mesmo no servidor de conteúdos. No Windows e no macOS o modo escuro é ativado automaticamente com base nas configurações do sistema operativo. No Linux terá de definir a variável de ambiente <code>CALIBRE_USE_DARK_PALETTE=1</code>
ru: calibre теперь полностью поддерживает тёмный режим повсюду, в основном интерфейсе, просмотрщике электронных книг, редакторе электронных книг и даже контент-сервере. В Windows и macOS активирован темный режим автоматически в зависимости от настроек операционной системы. В Linux у вас есть переменная среды <code>CALIBRE_USE_DARK_PALETTE = 1</code>
sv: stöder nu helt mörkt läge överallt, i huvudgränssnittet, e-bokvisaren, e-bokredigeraren och till och med innehållsservern. I Windows och macOS aktiveras mörkt läge automatiskt baserat på operativsystemets inställningar. På Linux måste du ställa in miljövariabeln <code>CALIBRE_USE_DARK_PALETTE=1</code>.
zh_tw: calibre 现在完全支持夜间模式：主界面、电子书阅读器、电子书编辑器， 甚至内容服务器。 在 Windows 和 macOS 上，夜间模式会根据操作系统 设置自动激活。在 Linux 上，您必须设置 <code>CALIBRE_USE_DARK_PALETTE=1</code> 环境变量。

source: The main interface in dark mode
nl: De hoofdinterface in donkere modus
pt: A interface principal em modo escuro
ru: Основной интерфейс в тёмном режиме
sv: Huvudgränssnittet i mörkt läge
zh_tw: 夜间模式的主界面

source: The E-book viewer in dark mode
nl: De e-boek viewer in donkere modus
pt: O visualizador de ebooks no modo escuro
ru: Читалка электронных книг в тёмном режиме
sv: E-bokvisaren i mörkt läge
zh_tw: 夜间模式的电子书阅读器

source: The E-book editor in dark mode
nl: De e-boek editor in donkere modus
pt: O editor de ebooks em modo escuro
ru: Редактор электронных книг в тёмном режиме
sv: E-bokredigeraren i mörkt läge
zh_tw: 夜间模式的电子书编辑器

source: The Content server in dark mode
nl: De Content server in donkere modus
pt: O servidor de conteúdos em modo escuro
ru: Контент-сервер в темном режиме
sv: Innehållsservern i mörkt läge
zh_tw: 内容服务器处于夜间模式

source: Enhanced search in the E-book viewer
nl: Verbeterd zoeken in de e-boek viewer
pt: Pesquisa aprimorada no visualizador de ebooks
ru: Улучшенный поиск в читалке электронных книг
sv: Förbättrad sökning i e-bokvisaren
zh_tw: 电子书阅读器中的增强型的搜索

source: The E-book viewer now supports enhanced searches with whole word, regular expressions, etc. Search results are displayed grouped by chapter. There is a button that takes you back to where in the book you were after you are done searching.
nl: De e-boek viewer ondersteunt nu verbeterd zoeken met volledig woord, reguliere expressies, enz. Zoekresultaten worden getoond gegroepeerd per hoofdstuk. Er is een knop die u terug brengt naar waar u was in het boek als u klaar bent met zoeken.
pt: O Visualizador de e-books agora suporta buscas aprimoradas com palavras completas, expressões regulares, etc. O resultados das buscas são mostrados agrupados por capítulo. Existe um botão que o leva de volta para onde estava no livro, após terminar com a pesquisa.
ru: Просмотрщик электронных книг теперь поддерживает расширенный поиск по целому слову, регулярным выражениям и т. д. Результаты поиска отображаются сгруппированными по главам. Есть кнопка, которая возвращает вас назад туда, где в книге вы были после того, как закончили поиск.
sv: E-bokvisaren stöder nu förbättrade sökningar med helord, reguljära uttryck o.s.v. Sökresultaten visas grupperade efter kapitel. Det finns en knapp som tar dig tillbaka till var i boken du var efter att du har sökt.
zh_tw: 电子书阅读器现在支持增强的全字搜索、正则表达式搜索等。 搜索结果按章节分组显示。在你完成搜索后，有一个按钮 可以带你回到书中的位置。

source: Search results in the E-book viewer
nl: Zoekresultaten in de e-boek viewer
pt: Resultado das pesquisas no visualizador de ebooks
ru: Результаты поиска в читалке электронных книг
sv: Sökresultat i e-bokvisaren
zh_tw: 电子书阅读器中的搜索结果

source: Backwards incompatibilities
nl: Onverenigbaarheden met oudere versies
pt: Incompatibilidades com versões anteriores
ru: Потеря обратной совместимости
sv: Bakåtinkompatibiliteter
zh_tw: 向后不兼容

source: There are a few minor backwards incompatibilities to be aware of in calibre 5
nl: Er zijn enkele kleine onverenigbaarheden met oudere versies in calibre 5
pt: Existem algumas pequenas retroincompatibilidades que devem ser tidas em conta no Calibre 5
ru: В calibre 5 есть несколько небольших обратных несовместимостей, о которых следует знать
sv: Det finns några mindre bakåtinkompatibiliteter att vara medveten om i calibre 5
zh_tw: 在 calibre 5中，有几个小的不兼容的地方需要注意。

source: Because calibre has now moved to Python 3, some third party plugins will no longer work, until they are also ported to Python 3. For status on the plugin porting effort, <a href="%(pp)s">see here</a>.
nl: Omdat calibre nu verhuisd is naar Python 3, zullen sommige derde partij plug-ins niet langer werken totdat ze ook naar Python 3 zijn overgebracht. Voor de status van het plug-in overbrengen, <a href="%(pp)s">kijk hier</a>.
pt: Como o Calibre migrou para o Python 3 alguns plugins de terceiros não irão funcionar até que eles sejam também convertidos para o Python 3. Para saber o estado da conversão de plugins, <a href="%(pp)s">veja aqui</a>.
ru: Вследствие перехода calibre на Python 3, некоторые сторонние плагины перестанут работать, пока также не будут портированы на Python 3. Состояние портирования плагинов, <a href="%(pp)s">см. здесь</a>.
sv: Eftersom calibre nu har uppgraderats till Python 3 kommer vissa tredje parts insticksmoduler inte längre att fungera förrän de också uppgraderats till Python 3. För status på insticksmodulsuppgraderingar, <a href="%(pp)s">se här</a>.
zh_tw: 因为Calibre现在已经迁移到Python3，一些第三方插件 将不再工作，直到它们也被移植到Python3。 有关插件移植工作的状态，<a href="%(pp)s">请参见此处</a>。

source: Because of the support for library wide annotations, the database format was slightly changed. While calibre 4.23 is able to open and operate with calibre 5 databases, older versions of calibre may have trouble.
nl: Vanwege de ondersteuning voor bibliotheekwijde annotaties werd het database formaat licht veranderd. Terwijl calibre 4.23 calibre 5 databases kan openen en ermee werken, kunnen oudere calibre versies er problemen mee hebben.
pt: Por conta do suporte a anotações em toda a biblioteca, o formato da base de dados foi minimamente alterado. Ainda que o calibre 4.23 seja capaz de abrir e operar a base de dados do calibre calibre 5, versões mais antigas podem ter problemas.
ru: Для поддержки в библиотеке расширенных заметок был немного изменён формат базы данных. В то время как calibre 4.23 спокойно открывает и работает с базами данных calibre 5, в более старых версиях calibre могут возникнуть проблемы.
sv: På grund av stödet för biblioteksomfattande noteringar, ändrades databasformatet något. Medan calibre 4.23 kan öppna och fungera med calibre 5-databaser kan äldre versioner av calibre ha problem.
zh_tw: 由于支持库范围的注释，数据库格式略有更改。 虽然Calibre 4.23能够打开并操作Calibre 5数据库， 但较旧版本的Calibre可能会遇到问题。

source: This is an appropriate time to throw out a big thank you to the calibre community who have contributed selflessly of their energy and enthusiasm — without which many of the features above would never have seen the light of day.
nl: Dit is een geschikt moment voor een dikke dank u wel voor de calibre gemeenschap die onbaatzuchtig hun energie en enthousiasme hebben bijgedragen— zonder hen zouden veel van de eigenschappen hierboven nooit het licht gezien hebben.
pt: Este é o momento apropriado para agradecer à comunidade Calibre pela colaboração desinteressada com a sua energia e entusiasmo e sem a qual muitos das funcionalidades acima indicadas não teriam visto a luz do dia.
ru: А сейчас хотелось бы выразить сердечную благодарность сообществу calibre, самоотверженно вкладывавшему в разработку свои энергию и энтузиазм, без которых многие из вышеупомянутых функций никогда бы не появились на свет.
sv: Det här är ett lämpligt tillfälle att framföra ett stort tack till calibre-gemenskapen som har bidragit osjälviskt av sin energi och entusiasm — utan vilka många av funktionerna ovan aldrig skulle ha sett dagens ljus.
zh_tw: 在此，我们要向无私奉献了精力和热情的 calibre 社区表示衷心的感谢 — 如果没有他们，上面的许多功能就永远不会出现。

source: Note that some of these features were actually introduced during the lifetime of the 4.x series. This document describes new features as compared to 4.0
nl: Merk op dat sommige van deze functies eigenlijk geïntroduceerd werden tijdens het leven van de 4.x serie. Dit document beschrijft nieuwe functies vergeleken met 4.0
pt: Note que algumas dessas funcionalidades foram de facto introduzidas durante o ciclo de vida da série 4.x. Este documento descreve as novas funcionalidades quando comparadas com a versão 4.0.
ru: Обратите внимание, что некоторые из перечисленных функций фактически вводились в течение всего срока жизни серии 4.x. Этот документ описывает новые возможности по сравнению с версией 4.0
sv: Observera att några av dessa funktioner faktiskt introducerades under livslängd av 4.x-serien. I det här dokumentet beskrivs nya funktioner jämfört med 4.0
zh_tw: 请注意，其中许多功能实际上是在 4.0.系列的生命周期中引入的。本文档介绍了与 4.0 相比的新功能。

source: See what was new in previous major calibre releases:
nl: Bekijk wat er nieuw was in vorige grote calibre versies:
pt: Veja o que foi novidade nas versões anteriores do Calibre:
ru: Посмотрите, чем примечательны предыдущие значительные выпуски calibre:
sv: Se vad som var nytt i tidigare stora utgåvor av calibre:
zh_tw: 查看 calibre 以前的主版本中的新功能：

source: New in calibre 6.0
nl: Nieuw in calibre 6.0
pt: Novidades no Calibre 6.0
ru: Новое в calibre 6.0
sv: Nytt i calibre 6.0

source: Welcome back, calibre users. It has been a year and a half since calibre 5.0. The headline feature is <i>Full text search</i>, calibre can now <i>optionally</i> index all the books in your library so you can search your entire library for a word or phrase.
nl: Welkom terug, calibre gebruikers. Anderhalf jaar sinds calibre 5.0. De hoofdfunctie is <i>Volledige tekst doorzoeken</i>, calibre kan nu <i>optioneel</i> alle boeken in uw bibliotheek indexeren zodat u uw volledige bibliotheek kan doorzoeken naar een woord of zin.
ru: С возвращением, пользователи calibre. Прошло полтора года после calibre 5.0. Главная фича —<i> полнотекстовый поиск</i>, calibre теперь может <i>опционально</i> индексировать все книги в вашей библиотеке, чтобы можно было найти во всей библиотеке слово или фразу.
sv: Välkommen tillbaka, calibre-användare. Det har gått ett och ett halvt år sedan calibre 5.0. Rubrikfunktionen är <i>heltextsökning</i>, calibre kan nu <i>valfritt</i> indexera alla böcker i ditt bibliotek så att du kan söka i hela ditt bibliotek efter ett ord eller en fras.
